Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: Create virtual networks for the networking option that you chose in :ref:`networking`. If you chose option 1, create only the public virtual network. If you chose option 2, create the public and private virtual networks.
cs: Vytvořte virtuální sítě pro volbu, kterou jste si zvolili v :ref:`networking`. Pokud jste si zvolili volbu 1, vytvořte pouze jednu veřejnou virtuální síť. Pokud chcete mít volbu 2, vytvořte veřejnou a soukromou virtuální síť.

source: Creating the scripts
cs: Vytváření skriptů
ru: Создание скриптов

source: Customize your dashboard. See section `Customize the dashboard <http://docs.openstack.org/admin-guide-cloud/common/dashboard_customizing.html>`__.
cs: Přizpůsobit si vaší nástěnku. Viz část `Přizpůsobení nástěnky <http://docs.openstack.org/admin-guide-cloud/common/dashboard_customizing.html>`__.

source: Database password (no variable used)
bn_in: ডাটাবেস পাসওয়ার্ড (কোনও ভেরিয়েবল ব্যবহার করা হয়নি)
cs: Heslo databáze (není použita žádná proměnná)
ru: Пароль базы данных(не используются переменные)

source: Database password for Compute service
bn_in: কম্পিউট সার্ভিস এর জন্য ডেটাবেস পাসওয়ার্ড
cs: Heslo databáze pro službu výpočtu
ru: Пароль базы данных для сервиса Вычислительных ресурсов

source: Database password for Image service
bn_in: ইমেজ সার্ভিস এর জন্য ডেটাবেস পাসওয়ার্ড
cs: Heslo databáze pro službu obrazů
ru: Пароль базы данных сервиса управления образами

source: Database password for the Block Storage service
bn_in: ব্লক স্টোরেজ সার্ভিস এর জন্য ডেটাবেস পাসওয়ার্ড দেখুন ।
cs: Heslo databáze pro službu blokového úložiště
ru: Пароль базы данных сервиса блочных хранилищ

source: Database password for the Networking service
bn_in: নেটওয়ার্কিং সার্ভিস এর জন্য ডাটাবেস পাসওয়ার্ড করুন ।
cs: Heslo databáze pro službu sítí
ru: Пароль базы данных для сервиса управления сетью

source: Database password for the Orchestration service
cs: Heslo databáze pro službu orchestrace

source: Database password for the Telemetry service
cs: Heslo databáze pro službu telemetrie

source: Database password for the dashboard
cs: Heslo pro databázi nástěnky
ru: Пароль базы данных панели управления

source: Database password of Identity service
bn_in: ইমেজ সার্ভিস এর জন্য ডেটাবেস পাসওয়ার্ড
cs: Heslo databáze pro službu identit
ru: Пароль базы данных сервиса Идентификации

source: Default gateway: 10.0.0.1
bn_in: ডিফল্ট গেটওয়েঃ 10.0.0.1
cs: Výchozí brána: 10.0.0.1
ru: Маршрут по умолчанию: 10.0.0.1

source: Default gateway: ``10.0.0.1``
bn_in: ডিফল্ট গেইটওয়েঃ "10.0.0.1"
cs: Výchozí brána: ``10.0.0.1``
ru: Маршрут по умолчанию: ``10.0.0.1``

source: Delete the stack.
cs: Smažte zásobník.

source: Description
bn_in: বিবরণ
cs: Popis
ru: Описание

source: Determine available networks.
cs: Vypište dostupné sítě.

source: Determine instance options
bn_in: ইনস্টেস অপশনগুলি নির্ধারণ করুন
cs: Zjištění možností instance
ru: Задайте настройки инстанса

source: Disable or remove any automatic update services because they can impact your OpenStack environment.
bn_in: যে কোনও স্বয়ংক্রিয় আপডেট সার্ভিসগুলি অক্ষম করুন বা সরান কারণ তারা আপনার ওপেনস্ট্যাক এনভারমেন্ট প্রভাবিত করতে পারে।
cs: Zakažte nebo odstraňte veškeré služby zajišťující automatické aktualizace, protože mohou zle ovlivnit vaše prostředí OpenStack.
ru: Отключите или удалите все службы автоматического обновления, поскольку они могут повлиять на вашу среду OpenStack.

source: Disable the keystone service from starting automatically after installation:
cs: Po instalaci zakažte automatické spuštění služby Keystone:

source: Distributions release OpenStack packages as part of the distribution or using other methods because of differing release schedules. Perform these procedures on all nodes.
bn_in: ডিস্ট্রিবিউশনগুলি প্রকাশের অংশ হিসাবে ওপেনস্ট্যাক প্যাকেজগুলি রিলিজের সময়সূচির ভিন্নতার কারণে বা অন্যান্য পদ্ধতি ব্যবহার করে প্রকাশ করে। সমস্ত নোডে এই পদ্ধতিগুলি পরিবর্তন করুন।
cs: Distribuce vydávají balíčky OpenStack jako její součást, nebo pomocí jiné metody kvůli odlišným plánům na vydávání. Tyto kroky proveďte na všech uzlech.
ru: Дистрибутивы выпускают пакеты OpenStack как часть дистрибутива или используя другие методы из-за различных графиков выпуска. Выполните эти действия на всех узлах.

source: Do not change the ``HWADDR`` and ``UUID`` keys.
bn_in: "HWADDR" এবং "UUID" এর অংশটুকু পরিবর্তন করবেননা।
cs: Neupravujte klíče ``HWADDR`` a ``UUID``
ru: Не изменяйте ключи ``HWADDR`` и ``UUID``.

source: Do not repeat this step when creating additional users for this project.
cs: Tento krok neopakujte pro vytvoření dalších uživatelů v tomto projektu.

source: Download the CirrOS image from the Image service:
cs: Stáhněte obraz CirrOS ze služby obrazů:

source: Download the source image:
cs: Stáhněte zdrojový obraz:
ru: Скачайте начальный образ

source: During the final stage of the package installation, it is possible to automatically create an ``admin`` and ``service`` project, and an ``admin`` user. This can later be used for other OpenStack services to contact the Identity service. This is the equivalent of running the below commands:
cs: Během konečné fáze instalace balíčku je možné automaticky vytvořit projekty ``admin`` a ``service`` a uživatele ``admin``. Toto pak může být později použito u ostatních služeb OpenStack, které pak mohou kontaktovat službu identit. Toto je stejné jako provedení níže uvedených příkazů:

source: Each item in the filter array begins with ``a`` for **accept** or ``r`` for **reject** and includes a regular expression for the device name. The array must end with ``r/.*/`` to reject any remaining devices. You can use the :command:`vgs -vvvv` command to test filters.
cs: Každá položka v poli filtru začíná ``a`` pro **přijetí** a ``r`` pro **odmítnutí* následovaná regulárním výrazem pro název zařízení. Pole musí být ukončeno ``r/.*/`` pro odmítnutí všech zbývajících zařízení. Pro vyzkoušení filtrů můžete použít příkaz :command:`vgs -vvvv`.
ru: Каждый элемент в массиве фильтров начинается с ``a`` для **accept** (принять) или с ``r`` для **reject** (отклонить) и включает регулярное выражение для имени устройства. Массив должен заканчиваться ``r/.*/``, чтобы отклонить все остальные устройства. Вы можете использовать :command:`vgs -vvvv`для проверки фильтров.

source: Each plug-in that Networking uses has its own concepts. While not vital to operating the VNI and OpenStack environment, understanding these concepts can help you set up Networking. All Networking installations use a core plug-in and a security group plug-in (or just the No-Op security group plug-in). Additionally, Firewall-as-a-Service (FWaaS) and Load-Balancer-as-a-Service (LBaaS) plug-ins are available.
cs: Každý zásuvný modul, který služba používá, má vlastní pojmy. Pro práci s VNI a prostředím OpenStack je není třeba znát, ale mohou vám posloužit při vytváření sítí. Všechny instalace využívají hlavní zásuvný modul a modul pro bezpečnost (nebo jen zásuvný modul bezpečnostní skupiny No-Op). Dále jsou dostupné moduly pro bránu firewall jako služba (FWaaS) a vyvažovač zátěže jako služba (LBaaS).

source: Each service that you add to your OpenStack environment requires one or more service entities and three API endpoint variants in the Identity service.
cs: Každá služba, přidaná do vašeho prostředí OpenStack, vyžaduje jeden nebo více objektů služby a tři druhy koncových bodů API ve službě identit.

source: Edit the ``/etc/apache2/apache2.conf`` file and configure the ``ServerName`` option to reference the controller node:
cs: Upravte soubor ``/etc/apache2/apache2.conf`` a nastavte volbu ``ServerName`` aby odkazovala na uzel kontroléru:
ru: Измените файл ``/etc/apache2/apache2.conf`` и настройте опцию ``ServerName`` для ссылки на узел контроллера:

source: Edit the ``/etc/ceilometer/ceilometer.conf`` file and complete the following actions:
cs: Upravte soubor ``/etc/ceilometer/ceilometer.conf``a proveďte následující úkony:

source: Edit the ``/etc/chrony.conf`` file and add, change, or remove the following keys as necessary for your environment:
cs: Upravte soubor ``/etc/chrony.conf`` a přidejte, odstraňte, změňte, nebo odeberte následující klíče podle vašeho prostředí:

source: Edit the ``/etc/chrony.conf`` file and comment out or remove all but one ``server`` key. Change it to reference the controller node:
cs: Upravte soubor ``/etc/chrony.conf`` a okomentujte nebo odstraňte všechny klíče, až na jeden klíč ``server``. Změňte ho tak, aby odkazoval na uzel kontroléru:
ru: Отредактируйте файл ``/etc/chrony.conf`` и раскомментирйуте или удалите все ключи ``server`` кроме одного. Измените его таким образом, чтобы он ссылался на узел контроллера:

source: Edit the ``/etc/chrony/chrony.conf`` file and add, change, or remove the following keys as necessary for your environment:
cs: Upravte soubor ``/etc/chrony/chrony.conf`` a přidejte, odstraňte, změňte, nebo odeberte následující klíče podle vašeho prostředí:

source: Edit the ``/etc/chrony/chrony.conf`` file and comment out or remove all but one ``server`` key. Change it to reference the controller node:
cs: Upravte soubor ``/etc/chrony/chrony.conf`` a okomentujte nebo odstraňte všechny klíče, až na jeden klíč ``server``. Změňte ho tak, aby odkazoval na uzel kontroléru:

source: Edit the ``/etc/cinder/cinder.conf`` file and complete the following actions:
cs: Upravte soubor ``/etc/cinder/cinder.conf`` a proveďte následující úkony:
ru: Отредактируйте файл ``/etc/cinder/cinder.conf`` и выполните следующие действия:

source: Edit the ``/etc/glance/glance-api.conf`` and ``/etc/glance/glance-registry.conf`` files and complete the following actions:
cs: Upravte soubory ``/etc/glance/glance-api.conf`` a ``/etc/glance/glance-registry.conf``a proveďte následující úkony:

source: Edit the ``/etc/glance/glance-api.conf`` file and complete the following actions:
cs: Upravte soubor ``/etc/glance/glance-api.conf`` a proveďte následující úkony:
ru: Отредактируйте ``/etc/glance/glance-api.conf`` файл и выполните следующие действия:

source: Edit the ``/etc/glance/glance-registry.conf`` file and complete the following actions:
cs: Upravte soubor ``/etc/glance/glance-registry.conf`` a proveďte následující úkony:
ru: Отредактируйте ``/etc/glance/glance-registry.conf`` файл и выполните следующие действия:

source: Edit the ``/etc/heat/heat.conf`` file and complete the following actions:
cs: Upravte soubor ``/etc/heat/heat.conf`` a proveďte následující úkony:

source: Edit the ``/etc/httpd/conf/httpd.conf`` file and configure the ``ServerName`` option to reference the controller node:
cs: Upravte soubor ``/etc/httpd/conf/httpd.conf`` a nastavte volbu ``ServerName`` aby odkazovala na uzel kontroléru:
ru: Отредактируйте файл ``/etc/httpd/conf/httpd.conf`` и настройте опцию ``ServerName`` для ссылки на узел контроллера:

source: Edit the ``/etc/keystone/keystone-paste.ini`` file and remove ``admin_token_auth`` from the ``[pipeline:public_api]``, ``[pipeline:admin_api]``, and ``[pipeline:api_v3]`` sections.
cs: Upravte soubor ``/etc/keystone/keystone-paste.ini`` a odstraňte ``admin_token_auth`` z částí ``[pipeline:public_api]``, ``[pipeline:admin_api]`` a ``[pipeline:api_v3]``.
ru: Отредактируйте файл ``/etc/keystone/keystone-paste.ini`` и удалите ``admin_token_auth`` из секций ``[pipeline:public_api]``, ``[pipeline:admin_api]`` и ``[pipeline:api_v3]``.

source: Edit the ``/etc/keystone/keystone.conf`` file and complete the following actions:
cs: Upravte soubor ``/etc/keystone/keystone.conf`` a proveďte následující úkony:
ru: Отредактируйте файл ``/etc/keystone/keystone.conf`` и выполните следующие действия:

source: Edit the ``/etc/mongod.conf`` file and complete the following actions:
cs: Upravte soubor ``/etc/mongod.conf`` a proveďte následující úkony:

source: Edit the ``/etc/mongodb.conf`` file and complete the following actions:
cs: Upravte soubor ``/etc/mongodb.conf`` a proveďte následující úkony:

source: Edit the ``/etc/network/interfaces`` file to contain the following:
bn_in: নিচের মত করে "/etc/network/interfaces" ফাইলটি সম্পাদন করুনঃ
cs: Upravte soubor ``/etc/network/interfaces`` a přidejte do něj následující řádky:
ru: Отредактируйте файл ``/etc/network/interfaces``, чтобы он содержал следующее:

source: Edit the ``/etc/neutron/dhcp_agent.ini`` file and complete the following actions:
cs: Upravte soubor ``/etc/neutron/dhcp_agent.ini`` a proveďte následující úkony:
ru: Отредактируйте файл ``/etc/neutron/dhcp_agent.ini`` и выполните следующие действия:

source: Edit the ``/etc/neutron/l3_agent.ini`` file and complete the following actions:
cs: Upravte soubor ``/etc/neutron/l3_agent.ini`` a proveďte následující úkony:
ru: Отредактируйте файл ``/etc/neutron/l3_agent.ini`` и выполните следующие действия:

source: Edit the ``/etc/neutron/neutron.conf`` file and complete the following actions:
cs: Upravte soubor ``/etc/neutron/neutron.conf`` a proveďte následující úkony:
ru: Отредактируйте файл ``/etc/neutron/neutron.conf`` и выполните следующие действия:

source: Edit the ``/etc/neutron/plugins/ml2/linuxbridge_agent.ini`` file and complete the following actions:
cs: Upravte soubor ``/etc/neutron/plugins/ml2/linuxbridge_agent.ini`` a proveďte následující úkony:
ru: Отредактируйте файл ``/etc/neutron/plugins/ml2/linuxbridge_agent.ini`` и выполните следующие действия:

source: Edit the ``/etc/neutron/plugins/ml2/ml2_conf.ini`` file and complete the following actions:
cs: Upravte soubor ``/etc/neutron/plugins/ml2/ml2_conf.ini`` a proveďte následující úkony:
ru: Отредактируйте файл ``/etc/neutron/plugins/ml2/ml2_conf.ini`` и выполните следующие действия:

source: Edit the ``/etc/nova/nova.conf`` file and add the following to it:
cs: Upravte soubor ``/etc/nova/nova.conf`` a přidejte do něj následující řádky:
ru: Отредактируйте файл ``/etc/nova/nova.conf``и добавьте в него следующие данные:

source: Edit the ``/etc/nova/nova.conf`` file and complete the following actions:
cs: Upravte soubor ``/etc/nova/nova.conf`` a proveďte následující úkony:
ru: Отредактируйте файл ``/etc/nova/nova.conf`` и выполните следующие действия:

source: Edit the ``/etc/nova/nova.conf`` file and configure notifications in the ``[DEFAULT]`` section:
cs: Upravte soubor ``/etc/nova/nova.conf`` a nastavte upozornění v části ``[DEFAULT]``:

source: Edit the ``/etc/openstack-dashboard/local_settings.py`` file and complete the following actions:
cs: Upravte soubor ``/etc/openstack-dashboard/local_settings.py`` a proveďte následující úkony:
ru: Отредактируйте файл ``/etc/openstack-dashboard/local_settings.py`` и выполните следующие действия:

source: Edit the ``/etc/openstack-dashboard/local_settings`` file and complete the following actions:
cs: Upravte soubor ``/etc/openstack-dashboard/local_settings`` a proveďte následující úkony:
ru: Отредактируйте файл ``/etc/openstack-dashboard/local_settings`` и выполните следующие действия:

source: Edit the ``/etc/swift/proxy-server.conf`` file and complete the following actions:
cs: Upravte soubor ``/etc/swift/proxy-server.conf`` a proveďte následující úkony:

source: Edit the ``/etc/sysconfig/apache2`` file and configure the ``APACHE_SERVERNAME`` option to reference the controller node:
cs: Upravte soubor ``/etc/sysconfig/apache2`` a nastavte volbu ``APACHE_SERVERNAME`` aby odkazovala na uzel kontroléru:
ru: Отредактируйте файл ``/etc/sysconfig/apache2`` и настройте опцию ``APACHE_SERVERNAME`` для ссылки на узел контроллера:

source: Edit the ``/etc/sysconfig/network-scripts/ifcfg-INTERFACE_NAME`` file to contain the following:
bn_in: নিচের মত করে "/etc/sysconfig/network-scripts/ifcfg-INTERFACE_NAME" ফাইলটি সম্পাদন করুনঃ
cs: Upravte soubor ``/etc/sysconfig/network-scripts/ifcfg-INTERFACE_NAME`` a přidejte do něj následující řádky:
ru: Отредактируйте файл ``/etc/sysconfig/network-scripts/ifcfg-INTERFACE_NAME``, чтобы он содержал следующее:

source: Edit the ``/etc/sysconfig/network/ifcfg-INTERFACE_NAME`` file to contain the following:
bn_in: নিচের মত করে "/etc/sysconfig/network/ifcfg-INTERFACE_NAME" ফাইলটি সম্পাদন করুনঃ
cs: Upravte soubor ``/etc/sysconfig/network/ifcfg-INTERFACE_NAME`` a přidejte do něj následující řádky:
ru: Отредактируйте файл ``/etc/sysconfig/network/ifcfg-INTERFACE_NAME``, чтобы он содержал следующее:

source: Edit the ``/etc/systemd/system/epmd.socket`` file to contain the following:
cs: Upravte soubor ``/etc/systemd/system/epmd.socket`` a přidejte do něj následující:

source: Edit the ``/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py`` file and complete the following actions:
cs: Upravte soubor ``/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py`` a proveďte následující úkony:

source: Edit the ``/usr/share/keystone/keystone-dist-paste.ini`` file and remove ``admin_token_auth`` from the ``[pipeline:public_api]``, ``[pipeline:admin_api]``, and ``[pipeline:api_v3]`` sections.
cs: Upravte soubor ``/usr/share/keystone/keystone-dist-paste.ini`` a odstraňte ``admin_token_auth`` z částí ``[pipeline:public_api]``, ``[pipeline:admin_api]`` a ``[pipeline:api_v3]``.

source: Edit the ``admin-openrc.sh`` file and add the following content:
cs: Upravte soubor ``admin-openrc.sh`` a přidejte do něj následující řádky:

source: Edit the ``demo-openrc.sh`` file and add the following content:
cs: Upravte soubor ``demo-openrc.sh`` a přidejte do něj následující řádky:

source: Enable Block Storage meters
cs: Povolení měřidel blokového úložiště

source: Enable Compute service meters
cs: Povolení měřidel výpočtové služby

source: Enable Image service meters
cs: Povolení měřidel služby obrazů

source: Enable Object Storage meters
cs: Povolení měřidel úložiště objektů

source: Enable the Identity service virtual hosts:
cs: Povolte virtuální hostitele služby identit:

source: Enable the Open Build Service repositories based on your openSUSE or SLES version:
cs: Povolte repozitáře Open Build Service v závislosti na vaší verzi openSUSE nebo SLES:
ru: Подключите репозитории Open Build Service в соответствии с вашей версией openSUSE или SLES:

source: Enable the Open Build Service repositories for MongoDB based on your openSUSE or SLES version:
cs: Povolte repozitáře Open Build Service pro MongoDb v závislosti na vaší verzi openSUSE nebo SLES:

source: Enable the OpenStack repository
bn_in: ওপেনস্ট্যাক রিপোজিটরি গুলো চালু করুন ।
cs: Povolení repozitáře OpenStack
ru: Разрешите доступ к репозиторию OpenStack

source: Enable the `EPEL <https://fedoraproject.org/wiki/EPEL>`_ repository:
cs: Povolte repozitář `EPEL <https://fedoraproject.org/wiki/EPEL>`_:

source: Enable the backports repository
cs: Povolení repozitáře backports
ru: Активируйте репозиторий обратной совместимости

source: Environment
bn_in: এনভারমেন্ট
cs: Prostředí
ru: Окружение

source: Exit the database access client.
cs: Ukončete klienta s přístup k databázi.
ru: Закройте клиент баз данных.

source: Explanations of configuration options and sample configuration files are included.
cs: Vysvětlení možností nastavení a soubory se vzorovým nastavením jsou součástí průvodce.
ru: Включены пояснения к конфигурационным параметрам и примеры конфигурационных файлов.

source: Finalize installation
bn_in: ইনস্টলেশন চূড়ান্ত করুন
cs: Dokončení instalace
ru: Завершите установку

source: Finalize the installation
bn_in: ইনস্টলেশন চূড়ান্ত করুন
cs: Dokončení instalace
ru: Завершите установку

source: First node
cs: První uzel

source: For OpenStack services, this guide uses ``SERVICE_PASS`` to reference service account passwords and ``SERVICE_DBPASS`` to reference database passwords.
bn_in: ওপেনস্ট্যাক সার্ভিস এর জন্য, এই গাইডটি সার্ভিস অ্যাকাউন্টের পাসওয়ার্ডগুলি উল্লেখ করতে ``SERVICE_PASS`` এবং ডাটাবেস পাসওয়ার্ডের রেফারেন্সে``SERVICE_PASS`` ব্যবহার করে থাকে ।
cs: U služeb OpenStack tento průvodce využívá ``SERVICE_PASS`` pro označení hesla k účtům služeb a ``SERVICE_DBPASS`` označuje hesla databáze.
ru: Для сервисов OpenStack данная инструкция использует ``SERVICE_PASS`` для ссылки на пароли аккаунтов и ``SERVICE_DBPASS`` для ссылки на пароли баз данных.

source: For details about browsers that support noVNC, see `README <https://github.com/kanaka/noVNC/blob/master/README.md>`__ and `browser support <https://github.com/kanaka/noVNC/wiki/Browser-support>`__.
cs: Pro informace o prohlížečích podporující noVNC si přečtěte `README <https://github.com/kanaka/noVNC/blob/master/README.md>`__ a `podporu prohlížečů <https://github.com/kanaka/noVNC/wiki/Browser-support>`__.

source: For every package that must connect to a Messaging Server, the Debian package enables you to configure the IP address for that server and the user name and password that is used to connect. The following example shows configuration with the ``ceilometer-common`` package:
cs: Pro každý balíček, který se musí připojit k poštovnímu serveru, Vám Debian umožní nastavit IP adresu tohoto serveru, uživatelské jméno a heslo potřebné k připojení. Následující příklad ukazuje nastavení balíčku ``ceilometer-common``:

source: For first-time installation and testing purposes, many users elect to build each host as a :term:`virtual machine (VM)`. The primary benefits of VMs include the following:
cs: Pro první instalace a zkušební účely si mnoho uživatelů sestavuje každého hostitele jako :term:`Virtuální stroj<virtual machine (VM)>`. Hlavní výhody virtuálních strojů spočívají v:

source: For information about disk and container formats for images, see `Disk and container formats for images <http://docs.openstack.org/image-guide/image-formats.html>`__ in the ``OpenStack Virtual Machine Image Guide``.
cs: Pro informace o formátech disku a kontejneru si přečtěte `Formáty disku a kontejneru obrazů <http://docs.openstack.org/image-guide/image-formats.html>`__ v ``Průvodci obrazem virtuálního stroje OpenStack``.

source: For information about the :command:`glance image-create` parameters, see `Image service command-line client <http://docs.openstack.org/cli-reference/content/ glanceclient_commands.html#glanceclient_subcommand_image-create_v2>`__ in the ``OpenStack Command-Line Interface Reference``.
cs: Informace o parametrech příkazu :command:`glance image-create` získáte v dokumentu `klient příkazového řádku služby obrazů <http://docs.openstack.org/cli-reference/content/ glanceclient_commands.html#glanceclient_subcommand_image-create_v2>`__ v části ``Příručka rozhraní příkazového řádku OpenStack``.

source: For information on requirements for other back ends, see `Configuration Reference <http://docs.openstack.org/liberty/ config-reference/content/ ch_configuring-openstack-image-service.html>`__.
cs: Informace o požadavcích ostatních podpůrných vrstev si prohlédněte `Příručku nastavení <http://docs.openstack.org/liberty/ config-reference/content/ ch_configuring-openstack-image-service.html>`__.

source: For more information about how to download and build images, see `OpenStack Virtual Machine Image Guide <http://docs.openstack.org/image-guide/>`__. For information about how to manage images, see the `OpenStack User Guide <http://docs.openstack.org/user-guide/common/cli_manage_images.html>`__.
cs: Pro další informace o stažení a sestavení obrazů si přečtěte `Průvodce obrazem virtuálního stroje OPenStack <http://docs.openstack.org/image-guide/>`__. Informace o správě obrazů získáte v `uživatelské příručce OpenStack <http://docs.openstack.org/user-guide/common/cli_manage_images.html>`__.

source: For more information about how to manage volumes, see the `OpenStack User Guide <http://docs.openstack.org/user-guide/index.html>`__.
cs: Pro další informace o správě svazků si přečtěte `Uživatelská příručka OpenStack <http://docs.openstack.org/user-guide/index.html>`__.
