Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: Create and edit the ``/etc/my.cnf.d/openstack.cnf`` file and complete the following actions:
bn_in: ``/etc/my.cnf.d/openstack.cnf`` ফাইলটি তৈরি এবং পরিবর্তন করুন এবং নিম্নলিখিত ধাপগুলি অনুসরন করুন:
ru: Создайте и отредактируйте файл ``/etc/my.cnf.d/openstack.cnf`` и выполните следующие действия:

source: Create and edit the ``/etc/mysql/conf.d/openstack.cnf`` file and complete the following actions:
ru: Создайте и отредактируйте файл ``/etc/mysql/conf.d/openstack.cnf`` и выполните следующие действия:

source: Create and edit the ``/etc/mysql/mariadb.conf.d/99-openstack.cnf`` file and complete the following actions:
bn_in: ``/etc/mysql/mariadb.conf.d/99-openstack.cnf``ফাইলটি তৈরি এবং পরিবর্তন করুন এবং নিম্নলিখিত ধাপগুলি অনুসরন করুন:
ru: Создайте и отредактируйте файл ``/etc/mysql/mariadb.conf.d/99-openstack.cnf`` и выполните следующие действия:

source: Create m1.nano flavor
bn_in: M1.nano ফ্লেভর তৈরি করুন
ru: Создайте тип инстанса m1.nano

source: Create the Compute service API endpoints:
ru: Создайте конечные точки API для Вычислительного сервиса:

source: Create the Networking service API endpoints:
ru: Создайте конечные точки API для сервиса Сетей:

source: Create the ``/etc/tgt/conf.d/cinder.conf`` file with the following data:
ru: Создайте файл ``/etc/tgt/conf.d/cinder.conf`` со следующими данными:

source: Create the ``neutron`` database:
ru: Создайте базу данных ``neutron``:

source: Create the ``neutron`` service entity:
ru: Создайте запись о сервисе ``neutron``:

source: Create the ``neutron`` user:
ru: Создайте пользователя ``neutron``:

source: Create the ``nova_api`` and ``nova`` databases:
ru: Создайте ``nova_api`` и ``nova`` базы данных:

source: Create the ``nova`` service entity:
ru: Создайте запись о сервисе ``nova``:

source: Create the ``nova`` user:
ru: Создайте пользователя ``nova``:

source: Create the provider network
bn_in: প্রােভাইডার নেটওয়ার্ক তৈরি করুন
ru: Создайте сеть провайдера

source: Create the self-service network
bn_in: সেল্ফ-সার্ভিস নেটওয়ার্ক তৈরি করুন
ru: Создайте собственную сеть

source: Create virtual networks for the networking option that you chose in :ref:`networking`. If you chose option 1, create only the provider network. If you chose option 2, create the provider and self-service networks.
ru: Создайте виртуальные сети для сетевых настроек выбранных в :ref:`networking`. Если вы выбрали настройку 1, создайте только сеть провайдера. Если вы выбрали настройку 2, создайте провайдерскую и собственную сеть.

source: Dashboard
ru: Панель управления

source: Database population occurs later for Networking because the script requires complete server and plug-in configuration files.
ru: Заполнение базы данных происходит позже для службы Сети, поскольку скрипт требует заполненных файлов настроек сервера и плагинов.

source: Database service (trove)
ru: Служба базы данных (trove)

source: Default configuration files vary by distribution. You might need to add these sections and options rather than modifying existing sections and options. Also, an ellipsis (``...``) in the configuration snippets indicates potential default configuration options that you should retain.
ru: Набор конфигурационных файлов по умолчанию может варьироваться между дистрибуциями. Вам может потребоваться добавить данные разделы и опции вместо того, чтобы изменять существующие. Также, эллипсис (``...``) в конфигурационных сниппетах означают потенциальные опции конфигурации, которые вам необходимо сохранить без изменений.

source: Determine whether your compute node supports hardware acceleration for virtual machines:
ru: Определите, поддерживает ли ваш вычислительный узел аппаратное ускорение для виртуальных машин:

source: Due to a packaging bug, remove the ``log-dir`` option from the ``[DEFAULT]`` section.
ru: Из-за ошибки в упаковке, удалите ``log-dir`` опцию из раздела ``[DEFAULT]``.

source: Edit the ``/etc/hosts`` file to contain the following:
ru: Отредактируйте файл `/etc/hosts``, чтобы он содержал следующее:

source: Edit the ``/etc/neutron/metadata_agent.ini`` file and complete the following actions:
ru: Отредактируйте файл ``/etc/neutron/metadata_agent.ini`` и выполните следующие действия:

source: Edit the ``/etc/nova/nova.conf`` file and perform the following actions:
ru: Отредактируйте файл ``/etc/nova/nova.conf`` и выполните следующие действия:

source: Edit the ``[libvirt]`` section in the ``/etc/nova/nova-compute.conf`` file as follows:
ru: Отредактируйте ``[libvirt]`` раздел в файле ``/etc/nova/nova-compute.conf`` следующим образом:

source: Edit the ``[libvirt]`` section in the ``/etc/nova/nova.conf`` file as follows:
ru: Отредактируйте ``[libvirt]`` раздел в файле ``/etc/nova/nova.conf`` следующим образом:

source: Edit the ``admin-openrc`` file and add the following content:
ru: Отредактируйте ' 'admin-openrc' ' файл и добавьте следующую информацию:

source: Efficiently polls metering data related to OpenStack services.
ru: Эффективно запрашивает данные измерений, относящиеся к службам OpenStack.

source: Enable required repositories:
ru: Подключите необходимые репозитории:

source: Ensure the kernel module ``nbd`` is loaded.
ru: Убедитесь, что модуль ядра ``nbd`` загружен.

source: Ensure the module loads on every boot by adding ``nbd`` to the ``/etc/modules-load.d/nbd.conf`` file.
ru: Убедитесь, что модуль загружается при каждой загрузке системы, добавив `nbd`` в файл ``/etc/modules-load.d/nbd.conf``.

source: Example architecture
ru: Пример архитектуры

source: Find entitlement pools containing the channels for your RHEL system:
ru: Найдите пулы прав, содержащие каналы для вашей RHEL системы:

source: For both networking options:
ru: Для обеих сетевых опций:

source: For first-time installation and testing purposes, many users select to build each host as a :term:`virtual machine (VM)`. The primary benefits of VMs include the following:
bn_in: প্রথমবারের ইনস্টলেশন এবং পরীক্ষার উদ্দেশ্যে, অনেক ব্যবহারকারী প্রতিটি হোস্টকে এই শব্দটি: :term: `virtual machine (VM)` হিসাবে তৈরি করতে নির্বাচন করেন VMs এর পাইমারি সুবিধার মধ্যে রয়েছে:
ru: Для первичной установки и в целях тестирования большинство пользователей решают использовать при создании каждого из хостов :term:`virtual machine (VM)`. Основные преимущества виртуальных машин включают в себя следующее:

source: For more information about how to download and build images, see `OpenStack Virtual Machine Image Guide <http://docs.openstack.org/image-guide/>`__. For information about how to manage images, see the `OpenStack End User Guide <http://docs.openstack.org/user-guide/common/cli-manage-images.html>`__.
ru: Для получения большей информации о том как скачивать и создавать образы, смотрите `OpenStack Virtual Machine Image Guide <http://docs.openstack.org/image-guide/>`__. Для получения информации об управлении образами смотрите `OpenStack End User Guide <http://docs.openstack.org/user-guide/common/cli-manage-images.html>`__.

source: For more information about how to manage volumes, see the `Manage volumes <http://docs.openstack.org/user-guide/common/cli-manage-volumes.html>`__ in OpenStack End User Guide.
ru: Для получения дополнительной информации об управлении томами, обратитесь к разделу `Управление томами <http://docs.openstack.org/user-guide/common/cli-manage-volumes.html>`__ в Руководстве пользователя OpenStack.

source: For more information, see the `Configuration Reference <http://docs.openstack.org/newton/config-reference/block-storage/volume-drivers.html>`_.
ru: Для получения дополнительной информации, смотрите `Руководство по настройке <http://docs.openstack.org/newton/config-reference/block-storage/volume-drivers.html>`_.

source: For more information, see the `Shared File Systems installation guide <http://docs.openstack.org/project-install-guide/shared-file-systems/newton>`_.
ru: Больше информации можно найти в `Мастер Общих файловых систем <http://docs.openstack.org/project-install-guide/shared-file-systems/newton>`_.

source: For simplicity, service traffic between compute nodes and this node uses the management network. Production environments should implement a separate storage network to increase performance and security.
ru: Для простоты, служебный трафик между вычислительными узлами и этим узлом использует служебную сеть. Производственное окружение должно быть реализовано в отдельной сети хранилищ, для увеличения производительности и безопасности.

source: Glossary
ru: Глоссарий

source: Grant proper access to the databases:
ru: Предоставьте необходимый доступ к базам данных:

source: Identity service
ru: Служба идентификации

source: If the ``nova-compute`` service fails to start, check ``/var/log/nova/nova-compute.log``. The error message ``AMQP server on controller:5672 is unreachable`` likely indicates that the firewall on the controller node is preventing access to port 5672.
ru: Если служба ``nova-compute`` не может запуститься, проверьте ``/var/log/nova/nova-compute.log``. Сообщение об ошибке ``AMQP server on controller:5672 is unreachable`` вероятно указывает на то, что брандмауэр на управляющем узле предотвращает доступ к порту 5672.

source: If this command returns a value of ``one or greater``, your compute node supports hardware acceleration which typically requires no additional configuration.
ru: Если эта команда возвращает значение ``один или больше``, ваш вычислительный узел поддерживает аппаратное ускорение, для которого обычно дополнительная настройка не требуется.

source: If this command returns a value of ``zero``, your compute node does not support hardware acceleration and you must configure ``libvirt`` to use QEMU instead of KVM.
ru: Если эта команда возвращает значение ``ноль``, ваш вычислительный узел не поддерживает аппаратное ускорение, и вы должны настроить ``libvirt`` на использование QEMU вместо KVM.

source: If you choose to install on VMs, make sure your hypervisor provides a way to disable MAC address filtering on the provider network interface.
bn_in: আপনি যদি VMs ইনস্টল করতে চান, তবে নিশ্চিত করুন যে আপনার হাইপারভাইজার সরবরাহকারী নেটওয়ার্ক ইন্টারফেসে ম্যাক অ্যাড্রেস ফিল্টারিং ডিজেবল করার একটি উপায় সরবরাহ করে।
ru: Если вы выбираете установку на виртуальные машины, убедитесь, что ваш гипервизор предоставляет возможность отключения фильтрации MAC-адресов на сетевом интерфейсе поставщика.

source: If you chose networking option 1, disable support for layer-3 networking services:
ru: Если вы выберете сетевую настройку 1, отключите поддержку сетевых сервисов 3-его уровня

source: If you chose networking option 2, you can also create a self-service (private) network that connects to the physical network infrastructure via NAT. This network includes a DHCP server that provides IP addresses to instances. An instance on this network can automatically access external networks such as the Internet. However, access to an instance on this network from external networks such as the Internet requires a :term:`floating IP address`.
bn_in: আপনি যদি নেটওয়ার্কিং অপশন 2 বেছে নিয়ে থাকেন তবে আপনি একটি সেল্প-সার্ভিস (private) নেটওয়ার্কও তৈরি করতে পারেন যা NAT এর মাধ্যমে পিজিক্যাল নেটওয়ার্কের অবকাঠামোর সাথে সংযোগ স্থাপন করে। এই নেটওয়ার্কে একটি DHCP সার্ভার অন্তর্ভুক্ত রয়েছে যা ঘটনাগুলিতে আইপি এড্রেস ব্যবহার করে। এই নেটওয়ার্কের একটি উদাহরণ স্বয়ংক্রিয়ভাবে ইন্টারনেটের মতো বাহ্যিক নেটওয়ার্কগুলিতে অ্যাক্সেস করতে পারে। তবে, ইন্টারনেটের মতো আপাতত নেটওয়ার্কগুলি থেকে এই নেটওয়ার্কে একটি দৃষ্টান্ত অ্যাক্সেসের জন্য একটি শব্দ:: `floating IP address` প্রয়োজন ।
ru: Если вы выбрали сетевую настройку 2, вы так же можете создать собственную (частную) сеть, которая соединяется с инфраструктурой физической сети по NAT. Эта сеть включает в себя DHCP сервер, который предоставляет IP адреса инстансам. Инстанс в этой сети автоматически имеет доступ к внешней сети, такой как Интернет. Однако, доступ к инстансу в этой сети из внешней сети, такой как Интернет, требует наличия :term:`назначаемого адреса`.

source: If you prefer to use debconf, refer to the debconf install-guide for Debian.
ru: Если вы предпочитаете использовать debconf, обратитесь к руководству по установке debconf для Debian.

source: If your environment includes the Shared File Systems service, you can create a share and mount it in an instance.
bn_in: যদি আপনার ইনভারমেন্টে ভাগ করা ফাইল সিস্টেম সার্ভিস অন্তর্ভুক্ত থাকে তবে আপনি একটি শেয়ার্ড তৈরি করতে পারেন এবং এটি একটি ইভেন্টে মাউন্ট করতে পারেন।
ru: Если ваша среда включает службу Общих файловых систем, вы можете создать диск и подключить его к инстансу.

source: Ignore any deprecation messages in this output.
ru: Проигнорируйте устаревшие сообщения в выходных данных.

source: Implement a deployment tool such as Ansible, Chef, Puppet, or Salt to automate deployment and management of the production environment.
ru: Создайте инструмент развертывания, такой как Ansible, Chef, Puppet, или Salt, чтобы автоматизировать развертывание производственной среды.

source: In the ``[DEFAULT]`` section, configure ``RabbitMQ`` message queue access:
ru: В разделе ``[DEFAULT]`` настройте доступ к ``RabbitMQ`` очереди сообщений:

source: In the ``[DEFAULT]`` section, configure backup options:
ru: В разделе ``[DEFAULT]`` задайте опции резервного копирования:

source: In the ``[DEFAULT]`` section, configure the location of the Image service API:
ru: Настройте расположение для API сервиса управления образами в разделе ``[DEFAULT]``:

source: In the ``[api_database]`` and ``[database]`` sections, configure database access:
ru: Сконфигурируйте доступ к базе данных в разделах ``[api_database]`` и ``[database]``:

source: In the ``[glance]`` section, configure the location of the Image service API:
ru: В разделе ``[glance]`` настройте расположение для API сервиса управления образами:

source: In the ``[linux_bridge]`` section, map the provider virtual network to the provider physical network interface:
ru: В разделе ``[linux_bridge]`` соотнесите виртуальную сеть провайдера и физический сетевой интерфейс провайдера:

source: In the ``[ml2]`` section, disable self-service networks:
ru: Запретите собственные сети в разделе ``[ml2]``:

source: In the ``[ml2_type_flat]`` section, configure the provider virtual network as a flat network:
ru: Настройте провайдер виртуальной сети как одноуровневую сеть в разделе ``[ml2_type_flat]``:

source: In the ``[token]`` section, configure the Fernet token provider:
ru: В секции ``[token]`` настройте службу токенов Fernet:

source: Initialize Fernet key repositories:
ru: Инициализируйте репозитории Fernet:

source: Install ``wget`` if your distribution does not include it.
ru: Установите``wget`` если он не включён в ваш дистрибутив

source: Install and configure a compute node
ru: Установка и настройка вычислительного узла

source: Install and configure the backup service
ru: Установка и настройка службы резервного копирования

source: Installation and configuration is documented in the `Bare Metal installation guide <http://docs.openstack.org/project-install-guide/baremetal/draft/>`_.
ru: Установка и конфигурация описаны в `Руководство по установке Bare Metal <http://docs.openstack.org/project-install-guide/baremetal/draft/>`_.

source: Installation and configuration is documented in the `Container Infrastructure Management installation guide <http://docs.openstack.org/project-install-guide/container-infrastructure-management/draft/>`_.
ru: Установка и конфигурация описаны в `Руководство по установке службы управления инфраструктурой контейнеров <http://docs.openstack.org/project-install-guide/container-infrastructure-management/draft/>`_.

source: Installation and configuration is documented in the `Database installation guide <http://docs.openstack.org/project-install-guide/database/draft/>`_.
ru: Установка и конфигурация описаны в `Руководство по установке службы базы данных <http://docs.openstack.org/project-install-guide/database/draft/>`_.

source: Installation and configuration is documented in the `Key Manager installation guide <http://docs.openstack.org/project-install-guide/key-manager/draft/>`_.
ru: Установка и конфигурация описаны в `Руководство по установке службы управления ключами <http://docs.openstack.org/project-install-guide/key-manager/draft/>`_.

source: Installation and configuration is documented in the `Messaging installation guide <http://docs.openstack.org/project-install-guide/messaging/draft/>`_.
ru: Установка и конфигурация описаны в `Руководство по установке службы сообщений <http://docs.openstack.org/project-install-guide/messaging/draft/>`_.

source: Installation and configuration is documented in the `Object Storage installation guide <http://docs.openstack.org/project-install-guide/object-storage/draft/>`_.
ru: Установка и конфигурация описаны в `Руководство по установке объектного хранилища <http://docs.openstack.org/project-install-guide/object-storage/draft/>`_.

source: Installation and configuration is documented in the `Orchestration installation guide <http://docs.openstack.org/project-install-guide/orchestration/draft/>`_.
ru: Установка и конфигурация описаны в `Руководство по установке оркестрации <http://docs.openstack.org/project-install-guide/orchestration/draft/>`_.

source: Installation and configuration is documented in the `Shared File Systems installation guide <http://docs.openstack.org/project-install-guide/shared-file-systems/draft/>`_.
ru: Установка и конфигурация описаны в `Руководство по установке общих файловых систем <http://docs.openstack.org/project-install-guide/shared-file-systems/draft/>`_.

source: Installation and configuration is documented in the `Telemetry Alarming installation guide <http://docs.openstack.org/project-install-guide/telemetry-alarming/draft/>`_.
ru: Установка и конфигурация описаны в `Руководство по установке оповещений телеметрии <http://docs.openstack.org/project-install-guide/telemetry-alarming/draft/>`_.

source: Installation and configuration is documented in the `Telemetry Data Collection installation guide <http://docs.openstack.org/project-install-guide/telemetry/draft/>`_.
ru: Установка и конфигурация описаны в `Руководство по установке сбора данных телеметрии <http://docs.openstack.org/project-install-guide/telemetry/draft/>`_.

source: Installation and configuration of additional OpenStack services is documented in separate, project-specific installation guides.
ru: Установка и конфигурация дополнительных служб OpenStack описаны в отдельных, специфичных для проекта руководствах по установке.

source: Key Manager service (barbican)
ru: Служба управления ключами (barbican)

source: Launch an instance on the provider network
bn_in: সরবরাহকারী নেটওয়ার্কে একটি উদাহরণ চালু করুন
ru: Запустите инстанс в сети провайдера

source: Launch an instance on the self-service network
bn_in: সেল্ফ-সার্ভিস নেটওয়ার্কে একটি ইনস্টেস চালু করুন
ru: Запустите инстанс в собственной сети

source: List agents to verify successful launch of the neutron agents:
ru: Получите список агентов для подтверждения успешного запуска агентов neutron:

source: Messaging service (zaqar)
ru: Служба сообщений (zaqar)

source: Networking agents reside on the controller node instead of one or more dedicated network nodes.
ru: Сетевые агенты находятся на управляющем узле вместо одного или нескольких выделенных сетевых узлов.

source: Networking service
ru: Служба Сети

source: Non-privileged users typically cannot supply additional parameters to this command. The service automatically chooses parameters using information from the following files:
bn_in: নন-সুবিধাভোগী ইউজার সাধারণত এই আদেশটিতে অতিরিক্ত প্যারামিটার সরবরাহ করতে পারবেন না। সার্ভিসটি স্বয়ংক্রিয়ভাবে নিম্নলিখিত ফাইলগুলি থেকে তথ্য ব্যবহার করে প্যারামিটারগুলি বাছাই করেঃ
ru: Не обладающие правами пользователи обычно не могут передавать дополнительные параметры этой команде. Служба автоматически выбирает параметры используя информацию из следующих файлов:

source: Object Storage
ru: Хранилище объектов

source: Object Storage services (swift)
ru: Службы объектного хранилища (swift)

source: On CentOS, the ``extras`` repository provides the RPM that enables the OpenStack repository. CentOS includes the ``extras`` repository by default, so you can simply install the package to enable the OpenStack repository.
ru: На CentOS репозиторий ``extras``предоставляет RPM, который активирует OpenStack репозиторий. CentOS включает репозиторий ``extras`` по умолчанию, таким образом вы можете просто установить пакет для активации OpenStack репозитория.

source: On RHEL, register your system with Red Hat Subscription Management, using your Customer Portal user name and password:
ru: В RHEL, зарегистрируйте вашу систему в Red Hat Subscription Manager, используя имя пользователя и пароль от вашего Пользовательского Портала:

source: Only instances can access Block Storage volumes. However, the underlying operating system manages the devices associated with the volumes. By default, the LVM volume scanning tool scans the ``/dev`` directory for block storage devices that contain volumes. If projects use LVM on their volumes, the scanning tool detects these volumes and attempts to cache them which can cause a variety of problems with both the underlying operating system and project volumes. You must reconfigure LVM to scan only the devices that contain the ``cinder-volumes`` volume group. Edit the ``/etc/lvm/lvm.conf`` file and complete the following actions:
ru: Только инстансы могут иметь доступ к дискам блочного хранилища. Однако, нижележащая операционная система управляет устройствами, ассоциированными с дисками. По умолчанию, утилита LVM по сканированию дисков сканирует директорию ``/dev`` на наличие устройств блочных хранилищ, содержащих диски. Если проекты используют LVM на собственных дисках, то сканирующая утилита обнаружит данные диски и попытается прокэшировать их, что может привести к ряду проблем как со стороны нижележащей операционной системы, так и со стороны дисков проектов. Вы должны переконфигурировать LVM под сканирование только устройств, содержащих ``cinder-volumes`` группу дисков. Отредактируйте файл ``/etc/lvm/lvm.conf``и выполните следующие действия:

source: OpenStack Installation Tutorial for Debian
ru: Учебное пособие по установке OpenStack для Debian

source: OpenStack Installation Tutorial for Red Hat Enterprise Linux and CentOS
ru: Учебное пособие по установке OpenStack для Red Hat Enterprise Linux и CentOS

source: OpenStack Installation Tutorial for Ubuntu
ru: Учебное пособие по установке OpenStack для Ubuntu

source: OpenStack Installation Tutorial for openSUSE and SUSE Linux Enterprise
ru: Учебное пособие по установке OpenStack для openSUSE и SUSE Linux Enterprise

source: OpenStack Networking (neutron) manages all networking facets for the Virtual Networking Infrastructure (VNI) and the access layer aspects of the Physical Networking Infrastructure (PNI) in your OpenStack environment. OpenStack Networking enables projects to create advanced virtual network topologies which may include services such as a :term:`firewall`, a :term:`load balancer`, and a :term:`virtual private network (VPN)`.
ru: Сетевой сервис neutron управляет всеми сетевыми аспектами виртуальной сетевой инфраструктуры (VNI) и аспектами уровня доступа к физической сетевой инфраструктуре в вашем окружении OpenStack. Служба управления сетью OpenStack дает возможность проектам создавать продвинутые топологии виртуальных сетей которые могут включать в себя такие службы как :term:`firewall`, :term:`load balancer`, и :term:`virtual private network (VPN)`.
