Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: In the ``[ec2authtoken]`` section, configure Identity service access:
cs: V části ``[ec2authtoken]`` nastavte přístup ke službě identit:

source: In the ``[filter:ceilometer]`` section, configure notifications:
cs: V části ``[filter:ceilometer]`` nastavte upozornění:

source: In the ``[filter:keystoneauth]`` section, add the ``ResellerAdmin`` role:
cs: V části ``[filter:keystoneauth]`` přidejte roli ``ResellerAdmin``:

source: In the ``[glance_store]`` section, configure the local file system store and location of image files:
cs: V části ``[glance_store]`` nastavte úložiště na místním systému souborů a umístění souborů obrazu:
ru: В разделе ``[glance_store]`` настройте локальное файловое хранилище и расположение образов:

source: In the ``[keystone_authtoken]`` and ``[paste_deploy]`` sections, configure Identity service access:
cs: V částech ``[keystone_authtoken]`` a ``[paste_deploy]`` nastavte přístup ke službě identit:
ru: В ``[keystone_authtoken]`` и ``[paste_deploy]`` разделах настройте доступ к идентификатору:

source: In the ``[keystone_authtoken]``, ``[trustee]``, ``[clients_keystone]``, and ``[ec2authtoken]`` sections, configure Identity service access:
cs: V částech ``[keystone_authtoken]``, ``[trustee]``, ``[clients_keystone]`` a ``[ec2authtoken]`` nastavte přístup ke službě identit:

source: In the ``[linux_bridge]`` section, map the public virtual network to the public physical network interface:
cs: V části ``[linux_bridge]`` namapujte veřejnou virtuální síť do rozhraní veřejné fyzické sítě:

source: In the ``[lvm]`` section, configure the LVM back end with the LVM driver, ``cinder-volumes`` volume group, iSCSI protocol, and appropriate iSCSI service:
cs: V části ``[lvm]`` nastavte podpůrnou vrstvu LVM používající ovladač LVM, skupinou svazku ``cinder-volumes``, protokolem iSCSI a odpovídající službou iSCSI:

source: In the ``[memcache]`` section, configure the Memcache service:
cs: V části ``[memcache]` nastavte službu Memcached:

source: In the ``[ml2]`` section, disable project (private) networks:
cs: V části ``[ml2]`` zakažte sítě projektu (soukromé):

source: In the ``[ml2]`` section, enable VXLAN project (private) networks:
cs: V části ``[ml2]`` povolte VXLAN sítě projektu (soukromé):

source: In the ``[ml2]`` section, enable flat and VLAN networks:
cs: V části ``[ml2]`` povolte ploché sítě a VLAN:
ru: Включите одноуровневые и VLAN сети в разделе ``[ml2]``:

source: In the ``[ml2]`` section, enable flat, VLAN, and VXLAN networks:
cs: V části ``[ml2]`` povolte ploché sítě, VLAN a VXLAN:
ru: Включите одноуровневые, VLAN и VXLAN сети в разделе ``[ml2]``:

source: In the ``[ml2]`` section, enable the Linux bridge and layer-2 population mechanisms:
cs: V části ``[ml2]`` povolte mechanismus přemostění Linux a zaplnění layer-2:

source: In the ``[ml2]`` section, enable the Linux bridge mechanism:
cs: V části ``[ml2]`` povolte mechanismus přemostění Linux:
ru: Включите Linux bridge механизм в разделе ``[ml2]``:

source: In the ``[ml2]`` section, enable the port security extension driver:
cs: V části ``[ml2]`` povolte ovladač rozšiřující zabezpečení portů:

source: In the ``[ml2_type_flat]`` section, configure the public flat provider network:
cs: V části ``[ml2_type_flat]``nastavte veřejnou plochou síť poskytovatele:

source: In the ``[ml2_type_vxlan]`` section, configure the VXLAN network identifier range for private networks:
cs: V části ``[ml2_type_vxlan]`` nastavte rozsah identifikátoru sítě VXLAN pro soukromé sítě:

source: In the ``[mysqld]`` section, set the ``bind-address`` key to the management IP address of the controller node to enable access by other nodes via the management network:
cs: V části ``[mysqld]`` nastavte klíč ``bind-address`` na IP adresu pro správu uzlu kontroléru k povolení přístupu ostatních uzlů přes síť pro správu:

source: In the ``[mysqld]`` section, set the following keys to enable useful options and the UTF-8 character set:
cs: V části ``[mysqld]`` nastavte následující klíče pro povolení užitečných možností a znakové sady UTF-8:

source: In the ``[neutron]`` section, configure access parameters:
cs: V části ``[neutron]``nastavte parametry přístupu:
ru: Настройте параметры доступа в разделе ``[neutron]``

source: In the ``[oslo_concurrency]`` section, configure the lock path:
cs: V části ``[oslo_concurrencyservice_credentials]`` nastavte cestu pro zámky:
ru: Настройте путь до файлов локов в разделе ``[oslo_concurrency]``:

source: In the ``[pipeline:main]`` section, add ``ceilometer``:
cs: V části ``[pipeline:main]`` přidejte ``ceilometer``:

source: In the ``[revoke]`` section, configure the SQL revocation driver:
cs: V části ``[revoke]``nastavte ovladač rušení příznaků v SQL:

source: In the ``[securitygroup]`` section, enable :term:`ipset` to increase efficiency of security group rules:
cs: V části ``[securitygroup]`` povolte :term:`ipset` pro zvýšení účinnosti pravidel bezpečnostní skupiny:
ru: Включите :term:`ipset` для увеличения эффективности правил группы безопасности в разделе ``[securitygroup]``:

source: In the ``[securitygroup]`` section, enable security groups and configure the Linux bridge :term:`iptables` firewall driver:
cs: V části ``[securitygroup]`` povolte bezpečnostní skupiny a nastavte ovladač brány firewall :term:`iptables`pro přemostění Linux:
ru: В разделе ``[securitygroup]`` включите группы безопасности и настройте драйвер брандмауэра Linux bridge :term:`iptables`:

source: In the ``[service_credentials]`` section, configure service credentials:
cs: V části ``[service_credentials]``nastavte přihlašovací údaje služby:

source: In the ``[token]`` section, configure the UUID token provider and Memcached driver:
cs: V části ``[token]``nastavte UUID poskytovatele příznaků a ovladač Memcached:

source: In the ``[vxlan]`` section, disable VXLAN overlay networks:
cs: V části ``[vxlan]`` zakažte překryvné sítě VXLAN:
ru: В разделе ``[vxlan]`` выключите VXLAN оверлейные сети:

source: In the ``[vxlan]`` section, enable VXLAN overlay networks, configure the IP address of the physical network interface that handles overlay networks, and enable layer-2 population:
cs: V části ``[vxlan]`` povoltete překryvné sítě VXLAN, nastavte IP adresy rozhraní fyzické sítě, které spravují překryvné sítě a povolte zaplnění layer-2:

source: In the ``devices`` section, add a filter that accepts the ``/dev/sdb`` device and rejects all other devices:
cs: V části ``devices`` přidejte filtr, který odfiltruje všechna zařízení mimo ``/dev/sdb``:
ru: В разделе ``devices`` добавьте фильтр, который принимает устройство ``/dev/sdb``и отклоняет все прочие:

source: Install and configure
cs: Instalace a nastavení
ru: Установка и настройка

source: Install and configure a storage node
cs: Instalace a nastavení uzlu úložiště
ru: Установка и настройка узла хранилища

source: Install and configure components
bn_in: উপাদানগুলো ইনস্টল করুন এবং কনফিগার করুন
cs: Instalace a nastavení součástí
ru: Установите и сконфигурируйте компоненты

source: Install and configure compute node
cs: Instalace a nastavení uzlu pro výpočtu
ru: Установка и настройка Вычислительного узла

source: Install and configure controller node
cs: Instalace a nastavení uzlu kontroléru
ru: Установка и настройка Управляющего узла

source: Install and configure the Networking components
cs: Instalace a nastavení součástí sítě

source: Install and configure the Networking components on the *controller* node.
cs: Nainstalujte a nastavte součásti sítě na uzlu *kontroléru*.
ru: Установите и настройте сетевые компоненты на управляющем узле.

source: Install and configure the components
cs: Instalace a nastavení součástí

source: Install components
cs: Instalace součástí

source: Install the LVM packages:
cs: Nainstalujte balíčky LVM:
ru: Установите пакеты LVM:

source: Install the MongoDB package:
cs: Nainstalujte balíček MongoDB:

source: Install the MongoDB packages:
cs: Nainstalujte balíčky MongoDB:

source: Install the OpenStack client:
bn_in: ওপেনস্ট্যাক(OpenStack) ক্লায়েন্ট ইনস্টল করুন:
cs: Nainstalujte klienta OpenStack:
ru: Установите клиент OpenStack

source: Install the components
cs: Instalace součástí
ru: Установите компоненты

source: Install the package:
bn_in: প্যাকেজগুলো ইনস্টল করুনঃ
cs: Nainstalujte balíčky:
ru: Установите пакет:

source: Install the packages:
bn_in: প্যাকেজগুলো ইনস্টল করুনঃ
cs: Nainstalujte balíčky:
ru: Установите пакеты:

source: Install the supporting utility packages:
cs: Nainstalujte balíčky s podpůrnými nástroji:
ru: Установите пакеты служебной утилиты:

source: Later on, the package will configure the below directive with the value you entered:
cs: Později balíček nastaví níže uvedený příkaz pomocí vámi zadané hodnoty:

source: Later you can use the following command to install a package:
cs: Později můžete použít tento příkaz pro instalaci balíčku:
ru: Позже вы можете использовать следующие команды для установки пакетов:

source: Launch an instance
bn_in: একটি ইনস্টেস চালু করুন
cs: Spuštění instance
ru: Запуск инстанса

source: Launch an instance on the private network
cs: Spuštění instance v soukromé síti

source: Launch an instance on the public network
cs: Spuštění instance ve veřejné síti

source: Launch the instance
bn_in: ইনস্টেসটি চালু করুন
cs: Spuštění instance
ru: Запустить инстанс

source: Launch the instance:
bn_in: ইনস্টেসটি চালু করুন
cs: Spusťte instanci:
ru: Запустите инстанс:

source: List available flavors:
bn_in: সহজলভ্য ফ্লেভর তালিকা দেখুনঃ
cs: Vypište dostupné konfigurace:
ru: Получите список доступных схем:

source: List available images:
bn_in: সহজলভ্য ইমেজ তালিকা দেখুনঃ
cs: Vypište dostupné obrazy:
ru: Получите список доступных образов:

source: List available meters again to validate detection of the image download:
cs: Znovu vytvořte výpis dostupných měřidel, abyste vyzkoušeli, zda služba zjistila stažení obrazu:

source: List available meters:
cs: Vytvořte výpis dostupných měřidel:

source: List available networks:
bn_in: সহজলভ্য নেটওয়ার্কগুলির তালিকা করুন:
cs: Vypište dostupné sítě:
ru: Получите список доступных сетей:

source: List available security groups:
bn_in: সহজলভ্য সুরক্ষা গোষ্ঠীগুলির তালিকা করুনঃ
cs: Vypište dostupné bezpečnostní skupiny:
ru: Получите список групп безопасности:

source: List network namespaces. You should see one ``qrouter`` namespace and two ``qdhcp`` namespaces.
bn_in: নেটওয়ার্ক নেমস্পেসগুলি তালিকাবদ্ধ করুন। আপনার একটি``qrouter`` নেমস্পেস এবং দুটি ``qdhcp`` নেমস্পেসগুলি দেখতে হবে।
cs: Vypište jmenné prostory sítě. Měli by se Vám zobrazit jeden prostor ``qrouter`` a dva ``qdhcp``.
ru: Список сетевого пространства имен. Вы увидите одно пространство имен ``qrouter`` и два пространства имен ``qdhcp``.

source: List ports on the router to determine the gateway IP address on the public provider network:
cs: Vypište porty na směrovači pro zjištění IP adresy brány na veřejné síti poskytovatele:

source: List service components to verify successful launch and registration of each process:
cs: Vypište součásti služby pro ověření úspěšného spuštění a registrace každého procesu:
ru: Получите список компонент службы для подтверждения успешного запуска и регистрации каждого процесса:

source: List service components to verify successful launch of each process:
cs: Vypište součásti služby pro ověření úspěšného spuštění každého procesu:
ru: Получите список компонент службы для подтверждения успешного запуска каждого процесса:

source: List volumes:
bn_in: ভলিউম এর তালিকা
cs: Vypište svazky:
ru: Получите список дисков:

source: Load the ``admin-openrc.sh`` file to populate environment variables with the location of the Identity service and the ``admin`` project and user credentials:
cs: Načtěte soubor ``admin-openrc.sh`` pro vyplnění proměnných prostředí označující umístění služby identit a obsahující přihlašovací údaje uživatele a projektu ``admin``:

source: Management on 10.0.0.0/24 with gateway 10.0.0.1
bn_in: ম্যানেজমেন্ট নেটওয়ার্ক 10.0.0.0/24 এবং গেইটওয়ে 10.0.0.1
cs: Správa na 10.0.0.0/24 s bránou 10.0.0.1
ru: Управляющая сеть на 10.0.0.0/24 со шлюзом 10.0.0.1

source: Many of the OpenStack services need to be configured to access a database. These are configured through a DSN (Database Source Name) directive as follows:
cs: Mnoho služeb OpenStack potřebuje mít nastaven přístup k databázi. Tyto jsou nastavovány pomocí příkazu DSN (Názvu zdroje databáze) takto:

source: Message queue
cs: Fronta zpráv
ru: Очередь сообщений

source: Most OpenStack services use an SQL database to store information. The database typically runs on the controller node. The procedures in this guide use MariaDB or MySQL depending on the distribution. OpenStack services also support other SQL databases including `PostgreSQL <http://www.postgresql.org/>`__.
cs: Většina služeb OpenStack využívá SQL databázi k ukládání informací. Databáze je standardně provozována na uzlu kontroléru. Instrukce v tomto průvodci používají MariaDB nebo MySQL v závislosti na distribuci. Služby také podporují ostatní SQL databáze včetně `PostgreSQL <http://www.postgresql.org/>`__.
ru: Большинство сервисов OpenStack используют базу данных SQL для хранения информации. База данных обычно располагается на управляющем узле. Операции в этом руководстве используют MariaDB или MySQL в зависимости от дистрибутива. Сервисы OpenStack также поддерживают другие SQL базы данных включая `PostgreSQL <http://www.postgresql.org/>`__.

source: Most cloud images support :term:`public key authentication` rather than conventional password authentication. Before launching an instance, you must add a public key to the Compute service.
bn_in: বেশিরভাগ ক্লাউড ইমেজ সাপোট করে:term:`public key authentication`প্রচলিত পাসওয়ার্ড প্রমাণীকরণ চেয়ে। কোনও ইনস্ট্যান্স চালু করার আগে আপনাকে অবশ্যই কম্পিউট সার্ভিস একটি সর্বজনীন কী যুক্ত করতে হবে।
cs: Většina obrazů cloudu podporuje :term:`Ověření veřejným klíčem<public key authentication>`, místo standardního ověření heslem. Před spuštěním instance je třeba do výpočetní služby přidat veřejný klíč.
ru: Большинство образов поддерживают :term:`аутентификацию по публичному ключу`, а не привычную аутентификацию по паролю. Перед запуском инстанса, вы должны добавить публичный ключ в вычислительную службу.

source: Network Time Protocol (NTP)
bn_in: এটি একটি নেটওয়ার্ক টাইম প্রোটোকল (NTP)
cs: Protokol síťového času (NTP)
ru: Протокол сетевого времени (NTP)

source: Network interface names vary by distribution. Traditionally, interfaces use "eth" followed by a sequential number. To cover all variations, this guide simply refers to the first interface as the interface with the lowest number and the second interface as the interface with the highest number.
cs: Názvy síťových rozhraní se liší podle distribuce. Standardně jsou používána "eth" následovaná vzestupnými čísly. Pro pokrytí všech případů bude tento průvodce nazývat první rozhraní to s nejnižším číslem a druhé rozhraní to s nejvyšším.
ru: Имена сетевых интерфейсов различаются в зависимости от дистрибутива. Традиционно, интерфейсы используют "eth" и порядковый номер. Чтобы учесть все варианты, в этом руководстве первый интерфейс обозначает интерфейс с наименьшим номером и второй обозначает интерфейс с наибольшим номером.

source: Network mask: 255.255.255.0 (or /24)
bn_in: নেটওয়ার্ক মাস্কঃ 255.255.255.0 (or /24)
cs: Síťová maska: 255.255.255.0 (nebo /24)
ru: Маска сети: 255.255.255.0 (или /24)

source: Network mask: ``255.255.255.0`` (or ``/24``)
bn_in: নেটওয়ার্ক মাস্কঃ "255.255.255.0" (or "/24")
cs: Síťová maska: ``255.255.255.0`` (nebo ``/24``)
ru: Маска сети: ``255.255.255.0`` (или ``/24``)

source: Networking
bn_in: নেটওয়ার্কিং
cs: Sítě
ru: Сеть

source: Networking (neutron) concepts
cs: Pojetí služby sítí (Neutron)
ru: Концепции сетевой подсистемы (neutron)

source: Networking Option 1: Provider networks
cs: Volba sítě 1: Sítě poskytovatele
ru: Вариант сети 2: Провайдерские Сети

source: Networking Option 2: Self-service networks
cs: Volba sítě 2: Samoobslužné sítě
ru: Вариант сети 2: Сети самообслуживания

source: Networking also supports *security groups*. Security groups enable administrators to define firewall rules in groups. A VM can belong to one or more security groups, and Networking applies the rules in those security groups to block or unblock ports, port ranges, or traffic types for that VM.
cs: Služba také podporuje "bezpečnostní skupiny". Tyto skupiny umožňují správcům řadit pravidla brány firewall do skupin. Virtuální stroj může patřit k jedné nebo více skupinám a služba tyto pravidla používá v těchto skupinách k zablokování nebo odblokování portů, rozsahu portů, nebo typů přenosu pro virtuální stroj.

source: Networking provides networks, subnets, and routers as object abstractions. Each abstraction has functionality that mimics its physical counterpart: networks contain subnets, and routers route traffic between different subnets and networks.
cs: Služba poskytuje sítě, podsítě a směrovače jako abstrakce těchto objektů. Každá abstrakce má funkce napodobující jejich skutečný protějšek: sítě mají podsítě a směrovače směrují přenos mezi různými podsítěmi a sítěmi.
ru: Сетевая подсистема предоставляет абстрактные сети, подсети и маршрутизаторы. Каждая из них по функциональности имитирует физические аналоги: сети содержат подсети, маршрутизаторы маршрутизируют траффик между разными подсетями и сетями.

source: Next steps
cs: Další kroky
ru: Следующие шаги

source: NoSQL database
cs: NoSQL databáze

source: Non-privileged users typically cannot supply additional parameters to this command. The service automatically chooses paramters using information from the following files:
cs: Uživatelé bez správcovských oprávnění obyčejně nemohou zadat dodatečné parametry k tomuto příkazu. Služba automaticky zvolí parametry pomocí údajů z následujících souborů:

source: Object storage nodes (Optional)
cs: Uzly úložiště objektů (Nepovinné)

source: Obtain a :term:`Virtual Network Computing (VNC)` session URL for your instance and access it from a web browser:
bn_in: একটি শব্দটি পান: আপনার উদাহরণের জন্য ভার্চুয়াল নেটওয়ার্ক কম্পিউটিং (VNC) `সেশন URL এবং এটি একটি ওয়েব ব্রাউজার থেকে অ্যাক্সেস করুন:
cs: Získejte URL sezení :term:`Virtual Network Computing (VNC)` pro vaší instanci a použijte ji ve vašem prohlížeči:

source: On CentOS, the *extras* repository provides the RPM that enables the OpenStack repository. CentOS includes the *extras* repository by default, so you can simply install the package to enable the OpenStack repository.
cs: V CentOS repozitář *extras* poskytuje RPM, které umožňují přístup k repozitáři OpenStack. Repozitář *extras* je v CentOS standardně povolen, proto stačí jednoduše nainstalovat balíček pro povolení repozitáře OpenStack.

source: On RHEL, download and install the RDO repository RPM to enable the OpenStack repository.
bn_in: On RHEL, ওপেনস্ট্যাক রিপোজটরি চালু করতে RDO রিপোজটরি RPM ডাউনলোড এবং ইনস্টল করুন।
cs: V RHEL stáhnete a nainstalujte RDO repozitář RPM pro povolení repozitáře OpenStack.
ru: На RHEL скачайте и установите RDO репозиторий RPM для активации OpenStack репозитория.

source: On RHEL, enable additional repositories using the subscription manager:
cs: Na RHEL povolte dodatečné repozitáře pomocí správce odběrů:

source: On SLES:
cs: Na SLES:

source: On all nodes, adding the Debian 8 (Jessie) backport repository to the source list:
cs: Ve všech uzlech přidejte repozitář Debian 8 (Jessie) backport do seznamu zdrojů:
ru: На всех узлах добавление репозитория обратной совместимости Debian 8 (Jessie) в список 'source list' выглядит следующим образом:

source: On openSUSE:
cs: Na openSUSE:

source: On the controller node, source the ``admin`` credentials to gain access to admin-only CLI commands:
bn_in: কন্ট্রোলার নোডে, কেবল অ্যাডমিন সিএলআই কমান্ড অ্যাক্সেস পেতে গেইন ``admin`` পাওয়া যায়কিনা যাচাই করুন।
cs: V uzlu kontroléru použijte příkaz source pro přihlašovací údaje pro ``admin`` pro získání přístupu k příkazům příkazového řádku pro správce:
ru: На управляющем узле, подставьте учетную запись ``admin`` для получения доступа к инструкциям командной строки, доступным только администраторам:

source: On the controller node, source the ``demo`` credentials to gain access to user-only CLI commands:
bn_in: কন্ট্রোলার নোডে কেবল ব্যবহারকারী-কেবল CLI কমান্ডগুলিতে অ্যাক্সেস পেতে ``demo``শংসাপত্রগুলি চালু করুন:
cs: V uzlu kontroléru použijte příkaz source pro přihlašovací údaje pro ``demo`` pro získání přístupu k příkazům příkazového řádku pro uživatele:
ru: На управляющем узле укажите учетную запись ``demo`` для получения доступа к инструкциям командной строки, доступным только пользователям:

source: One physical server can support multiple nodes, each with almost any number of network interfaces.
bn_in: একটি পিজিক্যাল সার্ভার একাধিক নোডকে সাপোট করতে পারে, যার মধ্যে প্রায় প্রতিটি সংখ্যক নেটওয়ার্ক ইন্টারফেস রয়েছে।
cs: Jeden fyzický server může podporovat mnoho uzlů, kde každý z nich může mít nespočet síťových rozhraní.
ru: Один физический сервер может поддерживать множество узлов, каждый с практически любым числом сетевых интерфейсов.

source: Only instances can access Block Storage volumes. However, the underlying operating system manages the devices associated with the volumes. By default, the LVM volume scanning tool scans the ``/dev`` directory for block storage devices that contain volumes. If projects use LVM on their volumes, the scanning tool detects these volumes and attempts to cache them which can cause a variety of problems with both the underlying operating system and project volumes. You must reconfigure LVM to scan only the devices that contain the ``cinder-volume`` volume group. Edit the ``/etc/lvm/lvm.conf`` file and complete the following actions:
cs: Pouze instance mají přístup ke svazkům blokového úložiště, ovšem základní operační systém spravuje zařízení přidružená ke svazkům. Standardně nástroj zjišťující svazky LVM hledá zařízení blokového úložiště obsahující svazky ve složce ``/dev``. Pokud projekty používají LVM v jejich svazcích, nástroj tyto svazky najde a pokusí se je uložit do mezipaměti, což může způsobit různé problémy jak v operačním systému, tak ve svazcích projektu. Musíte nastavit LVM aby prohledával pouze zařízení které jsou ve skupině svazku ``cinder-volume``. Upravte soubor ``/etc/lvm/lvm.conf`` a proveďte následující kroky:

source: OpenStack Installation Guide for Debian
cs: Průvodce instalací OpenStack pro Debian

source: OpenStack Installation Guide for Red Hat Enterprise Linux and CentOS
cs: Průvodce instalací OpenStack pro Red Hat Enterprise Linux a CentOS

source: OpenStack Installation Guide for Ubuntu
cs: Průvodce instalací OpenStack pro Ubuntu

source: OpenStack Installation Guide for openSUSE and SUSE Linux Enterprise
cs: Průvodce instalací OpenStack pro openSUSE a SUSE Linux Enterprise

source: OpenStack Networking (neutron) manages all networking facets for the Virtual Networking Infrastructure (VNI) and the access layer aspects of the Physical Networking Infrastructure (PNI) in your OpenStack environment. OpenStack Networking enables tenants to create advanced virtual network topologies which may include services such as a :term:`firewall`, a :term:`load balancer`, and a :term:`virtual private network (VPN)`.
cs: Služba sítí OpenStack (Neutron) spravuje vše ohledně infrastruktury virtuálních sítí (VNI) a vlastnosti vrstev přístupu k infrastruktuře fyzických sítí (PNI) ve vašem prostředí OpenStack. Služba umožňuje nájemníkům vytvořit pokročilé topologie virtuálních sítí, které mohou zahrnout služby jako term:`firewall`, :term:`vyvažovač zátěže<load balancer>` a :term:`virtuální soukromou síť<virtual private network (VPN)>`.
