Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: Attach the ``09e3743e-192a-4ada-b8ee-d35352fa65c4`` volume to the ``public-instance`` instance:
cs: Připojte svazek ``09e3743e-192a-4ada-b8ee-d35352fa65c4`` k instanci ``public-instance``:

source: Attach the volume to an instance
bn_in: একটি ইনস্টেস এর সাথে ভলিউম সংযুক্ত করুন ।
cs: Připojení svazku k instanci
ru: Подключите диск к инстансу

source: Authenticate using ``admin`` or ``demo`` user credentials.
cs: Přihlaste se pomocí údajů uživatelů ``admin`` nebo ``demo``.

source: Back-end names are arbitrary. As an example, this guide uses the name of the driver as the name of the back end.
cs: Název podpůrné vrstvy může být libovolný. Například v tomto průvodci je využit název ovladače také v podpůrné vrstvě.
ru: Имена бэкендов являются произвольными. К примеру, данный мануал использует имя драйвера в качестве имени бэкенда.

source: Because most OpenStack services must access the Identity service, you must configure the IP address of the ``keystone`` server to be able to access it. You must also configure the ``admin_tenant_name``, ``admin_user``, and ``admin_password`` options for each service to work.
cs: Protože většina služeb OpenStack musí mít přístup ke službě Identit, musíte nastavit IP adresu serveru ``keystone``, aby k ní mohli mít přístup. Musíte také nastavit volby ``admin_tenant_name``, ``admin_user`` a ``admin_password``, aby každá služby mohla fungovat.

source: Because this configuration uses an SQL database server, you can remove the SQLite database file:
cs: Protože toto nastavení využívá databázový server SQL, můžete soubor databáze SQLite bez problémů odstranit:

source: Before launching an instance, you must create the necessary virtual network infrastructure. For networking option 1, an instance uses a public provider virtual network that connects to the physical network infrastructure via layer-2 (bridging/switching). This network includes a DHCP server that provides IP addresses to instances.
cs: Před spuštěním instance musíte vytvořit potřebnou infrastrukturu virtuální sítě. Při rozvržení sítě 1 instance využívá virtuální síť veřejného poskytovatele, která se připojuje k infrastruktuře fyzické sítě přes layer-2 (přemostění/rozbočování). Tato síť obsahuje server DHCP poskytující IP adresy instancím.

source: Before you configure the OpenStack Identity service, you must create a database and an administration token.
cs: Před nastavením OpenStack služby identit, je třeba vytvořit databázi a příznak správce.
ru: Прежде чем настроить службу Идентификации OpenStack, вам необходимо создать базу данных и административный токен.

source: Before you install and configure Orchestration, you must create a database, service credentials, API endpoints. Orchestration also requires additional information in the Identity service.
cs: Před instalací a nastavením služby orchestrace, je třeba vytvořit databázi, přihlašovací údaje služby a koncové body API. Je také třeba zadat dodatečné informace ve službě identit.

source: Before you install and configure the Block Storage service on the storage node, you must prepare the storage device.
cs: Před instalací a nastavením služby blokového úložiště na uzlu úložiště je třeba připravit úložné zařízení.
ru: Перед установкой и конфигурацией сервиса блочных хранилищ на узлы хранилища вы должны подготовить устройство хранения.

source: Before you install and configure the Block Storage service, you must create a database, service credentials, and API endpoints.
cs: Před instalací a nastavením služby blokového úložiště, je třeba vytvořit databázi, přihlašovací údaje služby a koncové body API.
ru: Перед установкой и конфигурацией службы блочных хранилищ вы должны создать базу данных, учетные записи сервиса и конечные точки API.

source: Before you install and configure the Image service, you must create a database, service credentials, and API endpoints.
cs: Před instalací a nastavením služby obrazů, je třeba vytvořit databázi, přihlašovací údaje služby a koncové body API.
ru: Перед установкой и конфигурацией сервиса управления образами вы должны создать базу данных, учетные записи сервиса и конечные точки API.

source: Before you install and configure the Telemetry service, you must create a database, service credentials, and API endpoints. However, unlike other services, the Telemetry service uses a NoSQL database. See :ref:`environment-nosql-database` to install and configure MongoDB before proceeding further.
cs: Před instalací a nastavením služby telemetrie, je třeba vytvořit databázi, přihlašovací údaje služby a koncové body API. Avšak, na rozdíl od odstatních služeb, telemetrie využívá data bázi NoSQL. Než budete pokračovat, přečtěte si ref:`environment-nosql-database`pro instalaci a nastavení MongoDB.

source: Before you proceed, ensure that the controller node has at least several gigabytes of space available in this directory.
cs: Před pokračováním se ujistěte, že uzel kontroléru má v tomto adresáři dostupné volné místo o velikosti několika gigabajtů.

source: Block Storage
bn_in: ব্লক স্টোরেজ
cs: Blokové úložiště
ru: Блочное Хранилище

source: Block storage node (Optional)
bn_in: ব্লক স্টোরেজ নোড (ঐচ্ছিক)
cs: Uzel blokového úložiště (nepovinné)
ru: Узел блочного хранилища (опционально)

source: By default in Debian, you can access the MySQL server from either localhost through the socket file or 127.0.0.1. To access it over the network, you must edit the :file:`/etc/mysql/my.cnf` file, and the ``mysql.user`` table. To do so, Debian provides a helper script in the ``openstack-deploy`` package. To use it, install the package:
cs: V Debian je přístup k serveru MySQL standardně umožněn přes místního hostitele pomocí souboru soketu nebo adresy 127.0.0.1. Pro přístup přes síť musíte upravit souboru :file:`/etc/mysql/my.cnf` a tabulku ``mysql.user``. Pro usnadnění Debian poskytuje pomocný skript v balíčku ``openstack-deploy``. Pro použití nainstalujte balíček:

source: By default, MongoDB creates several 1 GB journal files in the ``/var/lib/mongodb/journal`` directory. If you want to reduce the size of each journal file to 128 MB and limit total journal space consumption to 512 MB, assert the ``smallfiles`` key:
cs: Standardně MongoDB vytváří několik žurnálových souborů s velikostí 1 GB v adresáři ``/var/lib/mongodb/journal``. Pokud chcete snížit velikost každého souboru na 128 MB a omezit celkovou spotřebu žurnálového prostoru na 512 MB, použijte klíč ``smallfiles``:

source: By default, ``dbconfig-common`` does not provide access to database servers over a network. If you want the ``dbconfig-common`` package to prompt for remote database servers that are accessed over a network and not through a UNIX socket file, reconfigure it, as follows:
cs: Standardně balíček ``dbconfig-common`` neposkytuje přístup k databázovým serverům přes síť. Pokud chcete aby se Vás balíček dotázal na vzdálené servery dostupné přes síť a ne pomocí souboru socketu UNIX, nastavte ho takto:

source: By default, the Identity service database contains no information to support conventional authentication and catalog services. You must use a temporary authentication token that you created in the section called :doc:`keystone-install` to initialize the service entity and API endpoint for the Identity service.
cs: Ve výchozím stavu databáze služby identit neobsahuje žádné údaje pro podporu standardního ověření a katalogových služeb. Musíte použít dočasný příznak ověření, který jste vytvořili v části :doc:`keystone-install` k zavedení objektu služby Identit a jejího a koncového bodu.

source: By default, the Ubuntu packages create an SQLite database.
cs: Balíčky Ubuntu standardně vytvoří databázi SQLite.

source: By default, the Ubuntu packages create an SQLite database. Because this configuration uses an SQL database server, remove the SQLite database file:
cs: Balíčky Ubuntu standardně vytvoří databázi SQLite. Protože toto nastavení využívá databázový server SQL, můžete soubor databáze SQLite bez problémů odstranit:

source: By default, the ``dbconfig-common`` package configures the OpenStack services to use SQLite. So if you use debconf in non-interactive mode and without pre-seeding, the OpenStack services that you install will use SQLite.
cs: Standardně balíček ``dbconfig-common`` nastaví služby OpenStack pro použití SQLite. Pokud tedy používáte debconf v režimu bez zásahu uživatele a předvyplnění, budou nainstalované služby OepnStack používat SQLite.

source: By default, the ``default`` security group applies to all instances and includes firewall rules that deny remote access to instances. For Linux images such as CirrOS, we recommend allowing at least ICMP (ping) and secure shell (SSH).
bn_in: ডিফল্টরূপে, ``default`` সিকিউরিটি গ্রুপ সকল ইনস্টেসের জন্য ধরকার এবং ফায়ারওয়াল বিধিগুলি অন্তর্ভুক্ত যা দৃষ্টান্তগুলিতে দূরবর্তী অ্যাক্সেসকে অস্বীকার করে। লিনাক্স ইমেজগুলির জন্য যেমন সিরোস, আমরা কমপক্ষে ICMP (ping) এবং সুরক্ষিত শেল (SSH) অনুমতি দেওয়ার পরামর্শ দিই।
cs: Standardně bezpečnostní skupina ``default`` se týká všech instancí a obsahuje pravidla brány firewall zakazující vzdálený přístup k instancím. Pro obrazy Linux jako ke CirrOS doporučujeme povolit alespoň ICMP (ping) a zabezpečený shell (SSH).

source: By default, the controller node synchronizes the time via a pool of public servers. However, you can optionally configure alternative servers such as those provided by your organization.
bn_in: ডিফল্টরূপে, কন্ট্রোলার নোড সর্বজনীন সার্ভারের একটি পুলের মাধ্যমে সময়টি সিঙ্ক্রোনাইজ করে। তবে, আপনি বিকল্প হিসাবে যেমন আপনার প্রতিষ্ঠানের সরবরাহকৃত সার্ভারগুলি কনফিগার করতে পারেন।
cs: Standardně je čas synchronizován uzlem kontroléru pomocí zásoby veřejných serverů. Nicméně můžete nastavit jiné servery, např. ty, které Vám poskytne vaše organizace.

source: CentOS does not require these repositories.
cs: CentOs tyto repozitáře nepotřebuje.

source: Check the status of your floating IP address:
bn_in: আপনার ভাসমান আইপি এড্রেসটির অবস্থা পরীক্ষা করুনঃ
cs: Zkontrolujte stav svých plovoucích IP adres:
ru: Проверьте статус своего внешнего IP-адреса:

source: Check the status of your instance:
bn_in: আপনার ইনস্টেস এর অবস্থা পরীক্ষা করুনঃ
cs: Zkontrolujte stav své instance:
ru: Проверьте статус инстанса:

source: Choose a suitable password for the database root account.
cs: Zvolte si vhodné heslo pro účet root v databázi.

source: Choose the same networking option that you chose for the controller node to configure services specific to it.
cs: Zvolte stejnou volbu sítě, kterou jste zvolili pro uzel kontroléru, pro nastavení služeb určených pro uzel výpočtu.

source: Comment out any other session storage configuration.
cs: Okomentujte všechny ostatní nastavení uložení sezení.
ru: Закомментируйте любые другие настройки хранилища сессии.

source: Comment out or remove any other options in the ``[keystone_authtoken]`` section.
cs: Okomentujte nebo odstraňte všechny ostatní možnosti v části ``[keystone_authtoken]``.
ru: Закомментируйте или удалите любые другие опции в разделе ``[keystone_authtoken]``.

source: Compute Node: 1 processor, 2 GB memory, and 10 GB storage
bn_in: কম্পিউট নোড: ১ প্রসেসর, ২ জিবি মেমোরি এবং ১০ জিবি স্টোরেজ
cs: Výpočtový uzel: 1 procesor, 2 GB paměti a 10 GB diskové kapacity
ru: Вычислительный узел: 1 процессор, 2 ГБ памяти и 10 ГБ хранилища

source: Compute node
bn_in: কম্পিউড নোড
cs: Výpočetní uzel
ru: Вычислительный узел

source: Configure Cinder to use Telemetry
cs: Nastavení Cinder pro použití telemetrie

source: Configure Compute to use Block Storage
cs: Nastavení výpočtové služby pro použití blokového úložiště
ru: Настройте вычислительные ресурсы для использования блочных хранилищ

source: Configure Compute to use Networking
cs: Nastavení výpočetní služby pro použití sítě

source: Configure Compute to use Telemetry
cs: Nastavení výpočtové služby pro použití telemetrie

source: Configure Object Storage to use Telemetry
cs: Nastavení úložiště objektů pro použití telemetrie

source: Configure OpenStack with debconf
cs: Nastavení OpenStack pomocí debconf

source: Configure ``user`` as the default role for users that you create via the dashboard:
cs: Nastavte uživatele ``user`` jako výchozí roli pro uživatele, kteří budou vytvořeny pomocí nástěnky:

source: Configure name resolution
bn_in: নাম রেজ্যুলেশন কনফিগার করুন
cs: Nastavení překladu názvů
ru: Настройте определение имен

source: Configure network interfaces
bn_in: নেটওয়ার্ক ইন্টারফেসগুলো কনফিগার করুন
cs: Nastavení síťových rozhraní
ru: Настройка сетевых интерфейсов

source: Configure networking options
cs: Nastavení možností sítě
ru: Настройте параметры сети

source: Configure the Apache HTTP server
cs: Nastavení HTTP serveru Apache
ru: Крнфигурация Apache HTTP сервера

source: Configure the DHCP agent
cs: Nastavení agenta DHCP
ru: Настройте DHCP агент:

source: Configure the Identity API version:
cs: Nastavte verzi API služby identit:

source: Configure the Image service to use Telemetry
cs: Nastavení služby obrazů pro použití telemetrie

source: Configure the Linux bridge agent
cs: Nastavení Linux agenta přemostění
ru: Настройте Linux Bridge агента

source: Configure the Modular Layer 2 (ML2) plug-in
cs: Nastavení zásuvného modulu Modular Layer 2 (ML2)
ru: Настройте плагин Modular Layer 2 (ML2)

source: Configure the Networking components on a *compute* node.
cs: Nastavte součásti sítí na uzlu *výpočtu*.
ru: Настройте сетевые компоненты на *управляющем* узле.

source: Configure the ``bind_ip`` key to use the management interface IP address of the controller node.
cs: Nastavte klíč ``bind_ip`` pro zvolení IP adresy rozhraní pro správu v uzlu kontroléru.

source: Configure the ``memcached`` session storage service:
cs: Nastavte službu ``memcached`` pro uložení sezení:

source: Configure the authentication token:
cs: Nastavte příznak ověření:

source: Configure the common component
cs: Nastavení společných součástí
ru: Настройте общий компонент

source: Configure the dashboard to use OpenStack services on the ``controller`` node:
cs: Nastavte nástěnku pro využití služeb OpenStack na uzlu ``controller``:

source: Configure the database with dbconfig-common
cs: Nastavení databáze pomocí dbconfig-common

source: Configure the endpoint URL:
cs: Nastavte URL koncového bodu:

source: Configure the first interface as the management interface:
bn_in: প্রথম ইন্টারফেসটি ম্যানেজমেন্ট হিসেবে কনফিগার করুন
cs: Nastavte první rozhraní jako rozhraní pro správu:
ru: Настройте первый интерфейс как управляющий интерфейс:

source: Configure the initial administration token:
cs: Nastavte hodnotou počátečního příznaku správce:

source: Configure the layer-3 agent
cs: Nastavení agenta layer-3
ru: Настройте layer-3 агент

source: Configure the management interface:
bn_in: ম্যানেজমেন্ট ইন্টারফেসটি কনফিগার করুনঃ
cs: Nastavte rozhraní pro správu:
ru: Настройте управляющий интерфейс:

source: Configure the server component
cs: Nastavení součástí serveru
ru: Настройте сервер компонентов

source: Configure the web server:
cs: Nastavte internetový server:

source: Confirm upload of the image and validate attributes:
cs: Potvrďte nahrání obrazu a ověřte vlastnosti:
ru: Подтвердите загрузку образа и проверьте атрибуты:

source: Contents
cs: Obsah
ru: Содержание

source: Contents in the *Name/IP address* column should indicate the hostname of the controller node.
bn_in: *Name/IP address* কলামের সূচিগুলিতে কন্ট্রোলার নোডের হোস্টনামটি নির্দেশ করা উচিত।
cs: Údaje ve sloupci *Name/IP address* by měly označovat název hostitele uzlu kontroléru.
ru: Информация в *Имя/IP адресс* столбце должна содержать имя хоста управляющего узла

source: Contents in the *Name/IP address* column should indicate the hostname or IP address of one or more NTP servers. Contents in the *S* column should indicate *\** for the server to which the NTP service is currently synchronized.
cs: Údaje ve sloupci *Name/IP address* by měly označovat název hostitele nebo Ip adresu jednoho nebo více serverů NTP. Údaje ve sloupci *S* by měly obsahovat *\** u serverů, kde je služba NTP v současnosti synchronizována.

source: Controller node
bn_in: কন্ট্রোলার নোডঃ
cs: Uzel kontroléru
ru: Управляющий узел

source: Copy the ``/usr/lib/systemd/system/epmd.socket`` file to the ``/etc/systemd/system`` directory.
cs: Zkopírujte soubor ``/usr/lib/systemd/system/epmd.socket`` do adresáře ``/etc/systemd/system``.

source: Create OpenStack client environment scripts
cs: Vytvoření skriptů prostředí klienta OpenStack
ru: Создайте скрипты клиентских сред OpenStack

source: Create a 1 GB volume:
bn_in: একটি ১ জিবি ভলিউম তৈরি করুন:
cs: Vytvořte svazek o velikosti 1 GB:
ru: Создайте 1 ГБ диск:

source: Create a :term:`floating IP address` on the ``public`` provider network:
cs: Vytvořte :term:`Plovoucí IP adresu<floating IP address>` v síti poskytovatele ``public``:

source: Create a ``cinder`` user:
cs: Vytvořte uživatele ``cinder``:
ru: Создайте пользователя ``cinder``:

source: Create a router
bn_in: একটি রাউটার তৈরি করুন
cs: Vytvoření směrovače
ru: Создать маршрутизатор

source: Create a stack
cs: Vytvoření zásobníku

source: Create a stack of one CirrOS instance on the public network:
cs: Vytvořte jednu instanci CirrOS na síti public:

source: Create a stack using the ``demo-template.yml`` template.
cs: Vytvořte zásobník pomocí šablony ``demo-template.yml``.

source: Create a subnet on the network:
bn_in: নেটওয়ার্কে একটি সাবনেট তৈরি করুনঃ
cs: Vytvořte podsíť:
ru: Создайте подсеть в сети:

source: Create a template
cs: Vytvoření šablony

source: Create a volume
bn_in: একটি ভলিউম তৈরি করুন ।
cs: Vytvoření svazku
ru: Создайте диск

source: Create an administrative project, user, and role for administrative operations in your environment:
cs: Ve vašem prostředí vytvořte projekt pro správce, uživatele a roli pro správcovské operace:

source: Create and edit the ``/etc/my.cnf.d/mariadb_openstack.cnf`` file and complete the following actions:
cs: Vytvořte a upravte soubor ``/etc/my.cnf.d/mariadb_openstack.cnf`` a proveďte následující úkony:

source: Create and edit the ``/etc/mysql/conf.d/mysqld_openstack.cnf`` file and complete the following actions:
cs: Vytvořte a upravte soubor ``/etc/mysql/conf.d/mysqld_openstack.cnf`` a proveďte následující úkony:

source: Create client environment scripts for the ``admin`` and ``demo`` projects and users. Future portions of this guide reference these scripts to load appropriate credentials for client operations.
cs: Vytváření skriptů prostředí klienta pro projekty a uživatele ``admin`` a ``demo``. Další části tohoto průvdoce pracují s těmito skripty pro načtení odpovídajících přihlašovacích údajů pro operace klienta.
ru: Создайте клиента скриптов клиентских средств для ``admin`` и ``demo`` проектов и пользователей. Будущие части этого руководства ссылаются на эти скрипты для загрузки соответствующих учетных данных для клиентских операций.

source: Create projects, users, and roles
cs: Vytvoření projektů, uživatelů a rolí

source: Create the Block Storage service API endpoints:
cs: Vytvořte koncové body API služby blokového úložiště:
ru: Создайте конечные точки API для сервиса блочных хранилищ:

source: Create the Identity service API endpoints:
cs: Vytvořte koncové body API služby identit:

source: Create the Image service API endpoints:
cs: Vytvořte koncové body API služby obrazů:
ru: Создайте конечные точки API для сервиса управления образами:

source: Create the LVM physical volume ``/dev/sdb``:
cs: Vytvořte fyzický svazek LVM ``/dev/sdb``:
ru: Создайте ``/dev/sdb`` физический LVM диск:

source: Create the LVM volume group ``cinder-volumes``:
cs: Vytvořte skupinu svazku LVM ``cinder-volumes``:
ru: Создайте ``cinder-volumes``группу дисков LVM:

source: Create the Orchestration service API endpoints:
cs: Vytvořte koncové body API služby orchestrace:

source: Create the Telemetry service API endpoints:
cs: Vytvořte koncové body API služby telemetrie:

source: Create the ``/etc/apache2/conf.d/wsgi-keystone.conf`` file with the following content:
cs: Vytvořte soubor ``/etc/apache2/conf.d/wsgi-keystone.conf`` s následujícím obsahem:
ru: Создайте файл ``/etc/apache2/conf.d/wsgi-keystone.conf`` со следующим контентом:

source: Create the ``/etc/apache2/sites-available/wsgi-keystone.conf`` file with the following content:
cs: Vytvořte soubor ``/etc/apache2/sites-available/wsgi-keystone.conf`` s následujícím obsahem:

source: Create the ``/etc/httpd/conf.d/wsgi-keystone.conf`` file with the following content:
cs: Vytvořte soubor ``/etc/httpd/conf.d/wsgi-keystone.conf`` s následujícím obsahem:

source: Create the ``ResellerAdmin`` role:
cs: Vytvořte roli ``ResellerAdmin``:

source: Create the ``admin`` project and user:
cs: Vytvořte projekt a uživatele ``admin``:

source: Create the ``admin`` project:
cs: Vytvořte projekt ``admin``:

source: Create the ``admin`` role:
cs: Vytvořte roli ``admin``:

source: Create the ``admin`` user:
cs: Vytvořte uživatele ``admin``:

source: Create the ``ceilometer`` database:
cs: Vytvořte databázi ``ceilometer``:

source: Create the ``ceilometer`` service entity:
cs: Vytvořte objekt služby ``ceilometer``:

source: Create the ``ceilometer`` user:
cs: Vytvořte uživatele ``ceilometer``:

source: Create the ``cinder`` and ``cinderv2`` service entities:
cs: Vytvořte objekty služby ``cinder`` a ``cinderv2``:
ru: Создайте записи о сервисах ``cinder `` и ``cinderv2``:

source: Create the ``cinder`` database:
cs: Vytvořte databázi ``cinder``:
ru: Создайте базу данных ``cinder ``:

source: Create the ``demo-template.yml`` file with the following content:
cs: Vytvořte soubor ``demo-template.yml`` s následujícím obsahem:

source: Create the ``demo`` project:
cs: Vytvořte projekt ``demo``:

source: Create the ``demo`` user:
cs: Vytvořte uživatele ``demo``:

source: Create the ``glance`` database:
cs: Vytvořte databázi ``glance``:
ru: Создайте базу данных ``glance``:

source: Create the ``glance`` service entity:
cs: Vytvořte objekt služby ``glance``:
ru: Создайте запись о сервисе ``glance``:

source: Create the ``glance`` user:
cs: Vytvořte uživatele ``glance``:
ru: Создайте пользователя ``glance``:

source: Create the ``heat_domain_admin`` user to manage projects and users in the ``heat`` domain:
cs: Vytvořte uživatele ``heat_domain_admin`` pro správu projektů a uživatelů v doméně ``heat``:

source: Create the ``heat_stack_owner`` role:
cs: Vytvořte roli ``heat_stack_owner``:

source: Create the ``heat_stack_user`` role:
cs: Vytvořte roli ``heat_stack_user``:

source: Create the ``heat`` and ``heat-cfn`` service entities:
cs: Vytvořte objekty služby ``heat`` a ``heat-cfn``:

source: Create the ``heat`` database:
cs: Vytvořte databázi ``heat``:

source: Create the ``heat`` domain that contains projects and users for stacks:
cs: Vytvořte doménu ``heat`` obsahující projekty a uživatele pro zásobníky:

source: Create the ``heat`` user:
cs: Vytvořte uživatele ``heat``:

source: Create the ``keystone`` database:
cs: Vytvořte databázi ``keystone``:
ru: Создайте базу данных ``keystone``:

source: Create the ``user`` role:
cs: Vytvořte roli ``user``:

source: Create the network:
bn_in: নেটওয়ার্ক তৈরি করুন ।
cs: Vytvořte síť:
ru: Создайте сеть:

source: Create the private project network
cs: Vytvoření soukromé sítě projektu

source: Create the public network
cs: Vytvoření veřejné sítě

source: Create the router:
bn_in: রাউটার তৈরি করুনঃ
cs: Vytvořte směrovač:
ru: Создать маршрутизатор:

source: Create the service entity and API endpoints
cs: Vytvoření objektů služby a koncových bodů API

source: Create the service entity for the Identity service:
cs: Vytvořte objekt služby identit:

source: Create virtual networks
bn_in: ভার্চুয়াল নেটওয়ার্ক তৈরি করুন
cs: Vytvoření virtuálních sítí
ru: Создайте виртуальные сети
