Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: This guide documents the OpenStack Newton release.
ru: Это руководство документирует OpenStack релиз Newton.

source: This guide uses installation with debconf set to non-interactive mode. That is, there will be no debconf prompt. To configure a computer to use this mode, run the following command:
ru: В этом руководстве используется установка с набором debconf в неинтерактивном режиме. Поэтому подсказок debconf не будет. Для конфигурации компьютера на использование этого режиме, выполните следующую команду:

source: This guide uses the Apache HTTP server with ``mod_wsgi`` to serve Identity service requests on ports 5000 and 35357. By default, the keystone service still listens on these ports. Therefore, this guide manually disables the keystone service.
ru: В этом руководстве используется HTTP сервер Apache с установленным ``mod_wsgi``для обслуживания запросов к сервису идентификации по портам 5000 и 35357. По умолчанию сервис keystone слушает эти порты. Тем не менее, в этом руководстве сервис keystone выключается.

source: This guide will show you how to install OpenStack by using packages available on Red Hat Enterprise Linux 7 and its derivatives through the RDO repository.
ru: Это руководство покажет вам, как установить OpenStack, используя пакеты, доступные для Red Hat Enterprise Linux 7 и его производных, через репозиторий RDO.

source: This guide will show you how to install OpenStack by using packages on openSUSE Leap 42.2 and SUSE Linux Enterprise Server 12 - for both SP1 and SP2 - through the Open Build Service Cloud repository.
ru: Это руководство покажет вам как установить OpenStack, используя пакеты, доступные для openSUSE Leap 42.2 и SUSE Linux Enterprise Server 12 SP1 и SP2, через репозиторий Open Build Service Cloud.

source: This guide will walk through an installation by using packages available through Canonical's Ubuntu Cloud archive repository for Ubuntu 16.04 (LTS).
ru: Это руководство демонстрирует установку с использованием пакетов из архива репозитория Canonical's Ubuntu Cloud для Ubuntu 16.04 (LTS).

source: This instance uses the ``provider`` provider network. However, you must reference this network using the ID instead of the name.
bn_in: এই ইনস্টেসটি ``provider`` প্রোভাইডার নেটওয়ার্ক ব্যবহার করে। তবে আপনাকে অবশ্যই নামের পরিবর্তে আইডি ব্যবহার করে এই নেটওয়ার্কটি উল্লেখ করতে হবে।
ru: Этот инстанс использует ``provider`` провайдерскую сеть. Как бы то ни было, вы должны указать эту сеть используя ID вместо имени.

source: This instance uses the ``selfservice`` self-service network. However, you must reference this network using the ID instead of the name.
bn_in: এই ইনস্টেসটি ``selfservice`` সেল্ফ-সার্ভিস নেটওয়ার্ক ব্যবহার করে। তবে আপনাকে অবশ্যই নামের পরিবর্তে আইডি ব্যবহার করে এই নেটওয়ার্কটি উল্লেখ করতে হবে।
ru: Этот инстанс использует ``selfservice`` собственный сетевой сервис. Как бы то ни было, вы должны указать эту сеть используя ID вместо имени.

source: This section describes how to install and configure the Compute service, code-named nova, on the controller node.
ru: Этот раздел описывает, как установить и настроить службу Вычислений, названную nova, на управляющем узле.

source: This section describes how to install and configure the OpenStack Identity service, code-named keystone, on the controller node. For scalability purposes, this configuration deploys Fernet tokens and the Apache HTTP server to handle requests.
ru: Этот раздел описывает как установить и настроить сервис идентификации OpenStack, известный как keystone, на управляющем узле. Для масштабируемости, данная конфигурация разворачивает токены Fernet и Apache HTTP сервер для обработки запросов.

source: This section explains how to configure the controller node and one compute node using the example architecture.
bn_in: এই বিভাগটি উদাহরণস্বরূপ আর্কিটেকচারটি ব্যবহার করে কীভাবে কন্ট্রোলার নোড এবং একটি কম্পিউট নোড কনফিগার করবেন তা ব্যাখ্যা করে।
ru: В этом разделе объясняется как настроить управляющий узел и один вычислительный узел использующий указанную архитектуру.

source: This service requires two nodes. Each node requires a minimum of one network interface. You can deploy more than two object storage nodes.
ru: Эта служба требует два узла. На каждый узел требуется как минимум один сетевой интерфейс. Вы можете развернуть больше двух узлов хранилища объектов.

source: To create the databases, complete these steps:
ru: Для создания баз данных, выполните следующие шаги:

source: Unset the temporary ``OS_AUTH_URL`` and ``OS_PASSWORD`` environment variable:
ru: Сбросьте временные переменные окружения ``OS_AUTH_URL`` и ``OS_PASSWORD``:

source: Use the pool identifiers found in the previous step to attach your RHEL entitlements:
ru: Используйте идентификаторы пулов, найденные на прошлом шаге, для присоединения к вашим RHEL правам:

source: Use the verification section for the networking option that you chose to deploy.
ru: Используйте проверку частей для сетевых настроек, которые вы выбрали для использования.

source: Verify access to the provider physical network gateway:
bn_in: প্রোভাইডার পিজিক্যাল নেটওয়ার্ক গেটওয়ে অ্যাক্সেস যাচাই করুনঃ
ru: Проверьте доступ к шлюзу провайдерской сети:

source: Verify access to the self-service network gateway:
bn_in: সেল্ফ-সার্ভিস নেটওয়ার্কে গেটওয়ে অ্যাক্সেস যাচাই করুনঃ
ru: Проверьте доступ к шлюзу собственного сервиса сети:

source: Verify connectivity to the instance from the controller node or any host on the provider physical network:
bn_in: কন্ট্রোলার নোড বা প্রোভাইডার পিজিক্যাল নেটওয়ার্কের কোনও হোস্ট থেকে ইনস্টেসের সাথে সংযোগটি যাচাই করুনঃ
ru: Проверьте подключение к инстансу с управляющего узла или любого другого хоста в физической сети провайдера:

source: Verify connectivity to the instance via floating IP address from the controller node or any host on the provider physical network:
bn_in: কন্ট্রোলার নোড বা প্রোভাইডার পিজিক্যাল নেটওয়ার্কের কোনও হোস্ট থেকে ভাসমান আইপি ঠিকানাটির মাধ্যমে ইনস্টেসের সাথে সংযোগটি যাচাই করুনঃ
ru: Проверьте подключение к инстансу по назначаемому IP адресу с управляющего узла или любого другого хоста в физической сети провайдера:

source: Verify operation of the Compute service.
ru: Проверьте работу Вычислительного сервиса.

source: We recommend disabling EPEL when using RDO packages due to updates in EPEL breaking backwards compatibility. Or, preferably pin package versions using the ``yum-versionlock`` plugin.
ru: Мы рекомендуем отключение EPEL при использовании RDO пакетов из-за обновлений в EPEL, нарушающих обратную совместимость. Альтернативой может служить фиксация версий пакетов с использованием плагина ``yum-versionlock``.

source: You can deploy more than one block storage node. Each node requires a minimum of one network interface.
ru: Вы можете развернуть более одного узла Блочного хранения. Каждый узел требует как минимум один сетевой интерфейс.

source: You can deploy more than one compute node. Each node requires a minimum of two network interfaces.
ru: Вы можете развернуть несколько вычислительных узлов. Каждый узел требует как минимум два сетевых интерфейса.

source: You must :ref:`create the provider network <launch-instance-networks-provider>` before the self-service network.
bn_in: আপনাকে অবশ্যই: রেফ: সেল্প-সার্ভিস নেটওয়ার্কের আগে <launch-instance-networks-provider>` প্রোভাইডার নেটওয়ার্ক তৈরি করতে হবে ।
ru: Вы должны :ref:`создать провайдерскую сеть <launch-instance-networks-provider>` до создания сети самообслуживания.

source: You should install Chrony, an implementation of :term:`NTP <Network Time Protocol (NTP)>`, to properly synchronize services among nodes. We recommend that you configure the controller node to reference more accurate (lower stratum) servers and other nodes to reference the controller node.
ru: Вам нужно установить Chrony, реализацию :term: `NTP <Network Time Protocol (NTP)>`, для надлежащей синхронизации сервисов между узлами. Мы рекомендуем конфигурацию, при которой управляющий узел ссылаеться на более точные(низкоуровневые) серверы, а другие узлы ссылаются на управляющий узел

source: Your OpenStack environment now includes the core components necessary to launch a basic instance. You can :ref:`launch-instance` or add more OpenStack services to your environment.
ru: Ваше OpenStack окружение теперь включает в себя ключевые компоненты, необходимые для запуска базового инстанса. Вы можете :ref:`запустить-инстанс`или добавить больше OpenStack сервисов в ваше окружение.

source: **On SLES for OpenStack Pike:**
bn_in: ** ওপেনস্ট্যাক পাইকের জন্য SLES ব্যবহার করুন: **

source: **On SLES for OpenStack Queens:**
bn_in: ** ওপেনস্ট্যাক কুইন্সের জন্য SLES ব্যবহার করুন: **

source: **On SLES for OpenStack Rocky:**
bn_in: ** ওপেনস্ট্যাক রকির জন্য SLES ব্যবহার করুন: **

source: **On SLES for OpenStack Stein:**
bn_in: ** ওপেনস্ট্যাক স্টেইনের জন্য SLES ব্যবহার করুন : **

source: **On openSUSE for OpenStack Pike:**
bn_in: ** ওপেনস্ট্যাক(OpenStack) পাইকের জন্য openSUSE: **

source: **On openSUSE for OpenStack Queens:**
bn_in: ** ওপেনস্ট্যাক(OpenStack) কুইন্সের জন্য openSUSE: **

source: **On openSUSE for OpenStack Rocky:**
bn_in: ** ওপেনস্ট্যাক(OpenStack) রকির জন্য openSUSE: **

source: **On openSUSE for OpenStack Stein:**
bn_in: ** ওপেনস্ট্যাক(OpenStack) স্টেইনের জন্য openSUSE: **

source: **OpenStack Pike for Ubuntu 16.04 LTS:**
bn_in: ** Ubuntu 16.04 LTS এর জন্য ওপেনস্ট্যাক পাইক দেখুন : **

source: **OpenStack Queens for Ubuntu 16.04 LTS:**
bn_in: ** Ubuntu 16.04 LTS এর জন্য ওপেনস্ট্যাক কুইন্স: **

source: **OpenStack Rocky for Ubuntu 18.04 LTS:**
bn_in: ** Ubuntu 18.04 LTS এর জন্য ওপেনস্ট্যাক রকি: **

source: **OpenStack Stein for Ubuntu 18.04 LTS:**
bn_in: ** Ubuntu 18.04 LTS এর জন্য ওপেনস্ট্যাক স্টেইন: **

source: **Others:**
bn_in: **অন্যান্য:**

source: **When installing the Pike release, run:**
bn_in: ** Pike রিলিজ ইনস্টল করার সময়, প্যাকেজটি চালান: **

source: **When installing the Queens release, run:**
bn_in: ** Queens রিলিজ ইনস্টল করার সময়, প্যাকেজটি চালান: **

source: **When installing the Rocky release, run:**
bn_in: ** Rocky রিলিজ ইনস্টল করার সময়, প্যাকেজটি চালান: **

source: After becoming familiar with basic installation, configuration, operation, and troubleshooting of these OpenStack services, you should consider the following steps toward deployment using a production architecture:
bn_in: এই ওপেনস্ট্যাক সার্ভিসগুলির বেসিক ইনস্টলেশন, কনফিগারেশন, পরিচালনা এবং সমস্যা সমাধানের সাথে পরিচিত হওয়ার পরে, আপনাকে একটি প্রোডাকশন আর্কিটেকচার ব্যবহার করে স্থাপনার দিকে নিচের পদক্ষেপগুলি বিবেচনা করা উচিত:

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the documentation.
bn_in: প্রত্যেক নোড এ অপারেটিং সিস্টেম ইনস্টল করার পর এই আর্কিটেকচারটি চালু করার জন্য আপনাকে যা করতে হবে, আপনাকে অবশ্যই নেটওয়ার্ক ইন্টারফেজ গুলো কনফিগার করতে হবে। আমরা আপনাকে পরামর্শ দিব যে, যে কোন অটোমেটেড নেটওয়ার্ক টুলগুলো অক্ষম করা এবং আপনার ডিস্ট্রিবিউশন এর সঠিক কনফিগারেশন ফাইলটি সাধারণভাবে সম্পাদন করার জন্য। আপনার ডিস্ট্রিবিউশন এ কিভাবে নেটওয়ার্ক কনফিগার করবেন তা সম্পর্কে আরও জানার জন্য এর ডুকুমেন্টেশন দেখুন।

source: Although most environments include Identity, Image service, Compute, at least one networking service, and the Dashboard, the Object Storage service can operate independently. If your use case only involves Object Storage, you can skip to
bn_in: যদিও বেশিরভাগ এনভারমেন্ট মধ্যে আইডেন্টিটি, ইমেজ সার্ভিস, কম্পিউট, কমপক্ষে একটি নেটওয়ার্কিং সার্ভিস এবং ড্যাশবোর্ড অন্তর্ভুক্ত থাকে তবে অবজেক্ট স্টোরেজ সার্ভিসটি স্বাধীনভাবে কাজ করতে পারে। যদি আপনার ব্যবহারের ক্ষেত্রে কেবল অবজেক্ট স্টোরেজ জড়িত থাকে তবে আপনি এড়িয়ে যেতে পারেন ।

source: Any OpenStack service that is enabled for SSL, especially secure-access dashboard.
bn_in: যে কোনও ওপেনস্ট্যাক সার্ভিস যা SSL এর জন্য চালু, বিশেষভাবে নিরাপদ অ্যাক্সেস ড্যাশবোর্ড।

source: Application Catalog (``murano``)
bn_in: অ্যাপ্লিকেশন ক্যাটালগ (`` murano``)

source: As of Ubuntu 16.04, MariaDB was changed to use the "unix_socket Authentication Plugin". Local authentication is now performed using the user credentials (UID), and password authentication is no longer used by default. This means that the root user no longer uses a password for local access to the server.
bn_in: Ubuntu 16.04 এর জন্য, "unix_socket Authentication Plugin" ব্যবহার করতে MariaDB পরিবর্তন করা হয়েছিল। লোকাল অথেনটিকেশন এখন ব্যবহারকারী পরিচয় (UID) ব্যবহার করে সম্পাদিত হয় এবং পাসওয়ার্ড অথেনটিকেশন আর ডিফল্টরূপে ব্যবহার হয় না। এর অর্থ এই যে রুট ব্যবহারকারীরা সার্ভারে লোকাল অ্যাক্সেসের জন্য আর পাসওয়ার্ড ব্যবহার করে না।

source: As of Ubuntu 18.04, the ``etcd`` package is no longer available from the default repository. To install successfully, enable the ``Universe`` repository on Ubuntu.
bn_in: মূল রিপোজিটরি এর মধ্যে Ubuntu 18.04 এর "etcd" প্যাকেজটি নেই। তাই সফল ভাবে ইনস্টল করার জন্য Ubuntu এর "Universe" রিপোজিটরিটি সক্ষম করুন।

source: As of Ubuntu 18.04, the ``mariadb-server`` package is no longer available from the default repository. To install successfully, enable the ``Universe`` repository on Ubuntu.
bn_in: মূল রিপোজিটরি এর মধ্যে Ubuntu 18.04 ``mariadb-server``প্যাকেজটি নেই। তাই সফল ভাবে ইনস্টল করার জন্য Ubuntu এর "Universe" রিপোজিটরিটি চালু করুন।

source: As shown in :ref:`get_started_conceptual_architecture`, OpenStack consists of several independent parts, named the OpenStack services. All services authenticate through a common Identity service. Individual services interact with each other through public APIs, except where privileged administrator commands are necessary.
bn_in: যেসব দেখানো হয়েছে: ref:`get_started_conceptual_architecture`, ওপেনস্ট্যাক একাধিক নিজর্স অংশ রয়েছে, যার নাম ওপেনস্ট্যাক সার্ভিস। সকল সার্ভিস একটি কমন আইডেন্টেটি সার্ভিসের মাধ্যমে অনুমোদন করে। সুবিধাজনক অ্যাডমিনিস্ট্রেটর কমান্ডের প্রয়োজনীয়তা ব্যতীত ব্যক্তিগত সার্ভিসগুলি সর্বজনীন API এর মাধ্যমে একে অপরের সাথে যোগাযোগ করে।

source: At a minimum, you need to install the following services. Install the services in the order specified below:
bn_in: সর্বনিম্ন, আপনাকে নিম্নলিখিত সার্ভিসগুলি ইনস্টল করতে হবে। নীচে নির্দিষ্ট ক্রমে সার্ভিসগুলি ইনস্টল করুনঃ

source: Block Storage (``cinder``)
bn_in: ব্লক স্টোরেজ (``cinder``)

source: Block Storage service – `cinder installation for Pike <https://docs.openstack.org/cinder/pike/install/>`_
bn_in: ব্লক স্টোরেজ সার্ভিস - পাইকের জন্য সিন্ডার ইনস্টলেশন <https://docs.openstack.org/cinder/pike/install/>`_

source: Block Storage service – `cinder installation for Queens <https://docs.openstack.org/cinder/queens/install/>`_
bn_in: ব্লক স্টোরেজ সার্ভিস - কুইন্সের জন্য সিন্ডার ইনস্টলেশন <https://docs.openstack.org/cinder/queens/install/>`_

source: Block Storage service – `cinder installation for Rocky <https://docs.openstack.org/cinder/rocky/install/>`_
bn_in: ব্লক স্টোরেজ সার্ভিস - রকির জন্য সিন্ডার ইনস্টলেশন <https://docs.openstack.org/cinder/rocky/install/>`_

source: Block Storage service – `cinder installation for Stein <https://docs.openstack.org/cinder/stein/install/>`_
bn_in: ব্লক স্টোরেজ সার্ভিস - স্টেইনের জন্য সিন্ডার ইনস্টলেশন <https://docs.openstack.org/cinder/stein/install/>`_

source: Block Storage service – `cinder installation for Train <https://docs.openstack.org/cinder/train/install/>`_
bn_in: ব্লক স্টোরেজ সার্ভিস - ট্রেনের জন্য সিন্ডার ইনস্টলেশন <https://docs.openstack.org/cinder/train/install/>`_

source: Block Storage service – `cinder installation for Ussuri <https://docs.openstack.org/cinder/ussuri/install/>`_
bn_in: ব্লক স্টোরেজ সার্ভিস - উসুরির জন্য সিন্ডার ইনস্টলেশন <https://docs.openstack.org/cinder/ussuri/install/>`_

source: Change the existing line ``MEMCACHED_PARAMS="-l 127.0.0.1"``.
bn_in: এই লাইনটি পরিবর্তন করুন "MEMCACHED_PARAMS="-l 127.0.0.1""।

source: Change the existing line ``OPTIONS="-l 127.0.0.1,::1"``.
bn_in: এই লাইনটি পরিবর্তন করুন "MEMCACHED_PARAMS="-l 127.0.0.1""।

source: Change the existing line that had ``-l 127.0.0.1``.
bn_in: এই লাইনটি পরিবর্তন করুন "-l 127.0.0.1"।

source: Clustering (``senlin``)
bn_in: ক্লাস্টারিং (``senlin``)

source: Comment out the ``pool 2.debian.pool.ntp.org offline iburst`` line.
bn_in: ``pool 2.debian.pool.ntp.org offline iburst`` টি কমেন্ট আউট করুন ।

source: Compute (``nova``) endpoints
bn_in: কম্পিউট (``nova``) শেষ পয়েন্ট

source: Compute VNC proxy for traditional VNC clients (openstack-nova-xvpvncproxy)
bn_in: টেডিশনাল ভিএনসি ক্লায়েন্টগুলির জন্য কম্পিউট ভিএনসি প্রক্সি (openstack-nova-xvpvncproxy) ব্যবহার করুন ।

source: Compute ports for access to virtual machine consoles
bn_in: ভার্চুয়াল মেশিন কনসোলগুলিতে অ্যাক্সেসের জন্য কম্পিউট পোর্টগুলি প্রয়োজন ।

source: Compute service – `nova installation for Pike <https://docs.openstack.org/nova/pike/install/>`_
bn_in: কম্পিউট সার্ভিস- পাইকের জন্য নোভা ইনস্টলেশন <https://docs.openstack.org/nova/pike/install/>`_

source: Compute service – `nova installation for Queens <https://docs.openstack.org/nova/queens/install/>`_
bn_in: কম্পিউট সার্ভিস- কুইন্সের জন্য নোভা ইনস্টলেশন <https://docs.openstack.org/nova/queens/install/>`_

source: Compute service – `nova installation for Rocky <https://docs.openstack.org/nova/rocky/install/>`_
bn_in: কম্পিউট সার্ভিস - রকির জন্য নোভা ইনস্টলেশন <https://docs.openstack.org/nova/rocky/install/>`_

source: Compute service – `nova installation for Stein <https://docs.openstack.org/nova/stein/install/>`_
bn_in: কম্পিউট সার্ভিস - স্টেইনের জন্য নোভা ইনস্টলেশন <https://docs.openstack.org/nova/stein/install/>`_

source: Compute service – `nova installation for Train <https://docs.openstack.org/nova/train/install/>`_
bn_in: কম্পিউট সার্ভিস - ট্রেনের জন্য নোভা ইনস্টলেশন <https://docs.openstack.org/nova/train/install/>`_

source: Compute service – `nova installation for Ussuri <https://docs.openstack.org/nova/ussuri/install/>`_
bn_in: কম্পিউট সার্ভিস - উসুরির জন্য নোভা ইনস্টলেশন <https://docs.openstack.org/nova/ussuri/install/>`_

source: Conceptual architecture
bn_in: কনস্টেসুয়াল আর্কিটেকচার

source: Configure the ``chrony.conf`` file and comment out or remove all but one ``server`` key. Change it to reference the controller node.
bn_in: ``chrony.conf`` ফাইলটি কনফিগার করুন এবং কমেন্ট করুন বা একটি ``server`` কী ছাড়া সবগুলী পরিবর্তন করুন। কন্ট্রোলার নোডের রেফারেন্সে এটি পরিবর্তন করুন।

source: Configure the service to use a different port if the default port is already being used by another application.
bn_in: যদি ডিফল্ট পোর্টটি ইতিমধ্যে অন্য কোনও অ্যাপ্লিকেশন ব্যবহার করে থাকে তবে আলাদা একটি পোর্ট ব্যবহার করতে সার্ভিসটি কনফিগার করুন।

source: Configure the service to use the management IP address of the controller node. This is to enable access by other nodes via the management network:
bn_in: কন্ট্রোলার নোড এর ম্যানেজমেন্ট আইপি এড্রেস দিয়ে সার্ভিসটি কনফিগার করুন। এটার মাধ্যমে অন্যান্য নোডগুলো ম্যানেজমেন্ট নেটওয়ার্ক দিয়ে এক্সেস করতে সক্ষম হবেঃ

source: Contents in the *Name/IP address* column should indicate the hostname or IP address of one or more NTP servers. Contents in the *MS* column should indicate *\** for the server to which the NTP service is currently synchronized.
bn_in: *Name/IP address* কলামের বিষয়বস্তুতে এক বা একাধিক NTP সার্ভারের হোস্টনেম বা আইপি ঠিকানা নির্দেশ করা উচিত। *MS* কলামের বিষয়বস্তুগুলিতে NTP সার্ভিস বর্তমানে সিঙ্ক্রোনাইজ হওয়া সার্ভারের জন্য * \ ** নির্দেশ করা উচিত।

source: Create and edit the ``/etc/etcd/etcd.conf.yml`` file and set the ``initial-cluster``, ``initial-advertise-peer-urls``, ``advertise-client-urls``, ``listen-client-urls`` to the management IP address of the controller node to enable access by other nodes via the management network:
bn_in: "/etc/etcd/etcd.conf.yml" ফাইলটি তৈরি করুন এবং এর মধ্যে লিখুন ``initial-cluster``, ``initial-advertise-peer-urls``, ``advertise-client-urls``, ``listen-client-urls``অন্যান্য নোডগুলো যাতে ম্যানেজমেন্ট নেটোওয়ার্ক এর মাধ্যমে এক্সেস করতে পারে সেজন্য কন্ট্রোলার নোড এর ম্যানেজমেন্ট আইপি এড্রেসটি লিখুনঃ

source: Create and edit the ``/etc/my.cnf.d/openstack.cnf`` file (backup existing configuration files in ``/etc/my.cnf.d/`` if needed) and complete the following actions:
bn_in: ``/etc/my.cnf.d/openstack.cnf``ফাইলটি তৈরি এবং পরিবর্তন করুন(backup existing configuration files in ``/etc/my.cnf.d/`` if needed) এবং নিম্নলিখিত ধাপগুলি অনুসরন করুন:

source: Create and edit the ``/usr/lib/systemd/system/etcd.service`` file:
bn_in: "/usr/lib/systemd/system/etcd.service" ফাইলটি তৈরি করুন এবং সম্পাদন করুনঃ

source: Create etcd user:
bn_in: Etcd ব্যবহারকারী তৈরি করুনঃ

source: Create the necessary directories:
bn_in: প্রয়োজনীয় ডিরেক্টরিগুলো তৈরি করুনঃ

source: Create virtual networks for the networking option that you chose when configuring Neutron. If you chose option 1, create only the provider network. If you chose option 2, create the provider and self-service networks.
bn_in: নিউট্রন কনফিগার করার সময় আপনি যে নেটওয়ার্কিং অপশনটি বেছে নিয়েছিলেন তার জন্য ভার্চুয়াল নেটওয়ার্কগুলি তৈরি করুন। আপনি যদি অপশন 1 পছন্দ করে থাকেন তবে কেবল প্রোভাইডার নেটওয়ার্ক তৈরি করুন। আপনি যদি অপশন 2 পছন্দ করে থাকেন তবে প্রোভাইডার এবং সেল্ফ-সার্ভিস নেটওয়ার্ক তৈরি করুন।

source: Dashboard – `horizon installation for Pike <https://docs.openstack.org/horizon/pike/install/>`_
bn_in: ড্যাশবোর্ড - পাইকের জন্য হরিজন ইনস্টলেশন <https://docs.openstack.org/horizon/pike/install/>`_

source: Dashboard – `horizon installation for Queens <https://docs.openstack.org/horizon/queens/install/>`_
bn_in: ড্যাশবোর্ড - কুইন্সের জন্য হরিজন ইনস্টলেশন <https://docs.openstack.org/horizon/queens/install/>`_

source: Dashboard – `horizon installation for Rocky <https://docs.openstack.org/horizon/rocky/install/>`_
bn_in: ড্যাশবোর্ড - রকির জন্য হরিজন ইনস্টলেশন <https://docs.openstack.org/horizon/rocky/install/>`_

source: Dashboard – `horizon installation for Stein <https://docs.openstack.org/horizon/stein/install/>`_
bn_in: ড্যাশবোর্ড - স্টেইনের জন্য হরিজন ইনস্টলেশন <https://docs.openstack.org/horizon/stein/install/>`_

source: Dashboard – `horizon installation for Train <https://docs.openstack.org/horizon/train/install/>`_
bn_in: ড্যাশবোর্ড - ট্রেনের জন্য হরিজন ইনস্টলেশন <https://docs.openstack.org/horizon/train/install/>`_

source: Dashboard – `horizon installation for Ussuri <https://docs.openstack.org/horizon/ussuri/install/>`_
bn_in: ড্যাশবোর্ড - উসুরির জন্য হরিজন ইনস্টলেশন <https://docs.openstack.org/horizon/ussuri/install/>`_

source: Data processing service (``sahara``) endpoint
bn_in: ডেটা প্রসেসিং সার্ভিস (``sahara``) শেষ পয়েন্ট

source: Database password for the Dashboard
bn_in: ড্যাশবোর্ডের এর জন্য ডেটাবেস পাসওয়ার্ড দেখুন ।

source: Default port
bn_in: ডিফল্ট পোর্ট

source: Default ports
bn_in: ডিফল্ট পোর্ট ব্যবহার করুন ।

source: Default ports that OpenStack components use
bn_in: ওপেনস্ট্যাক উপাদানগুলি ব্যবহার করে এমন ডিফল্ট পোর্ট দেখুন ।

source: Default ports that secondary services related to OpenStack components use
bn_in: ডিফল্ট পোর্টগুলি যা ওপেনস্ট্যাক কম্পোনেটগুলির সাথে রিলেটেড সেকেন্টডারি সার্ভিসগুলি ব্যবহার করে থাকে ।

source: Determine your system architecture:
bn_in: আপনার সিস্টেম আর্কিটেকচার সম্পর্কে নিশ্চিত হন

source: Download and install the etcd tarball for x86_64/amd64:
bn_in: x86_64/amd64 এর জন্য etcd tarball ডাউনলোড করুন এবং ইনস্টল করুনঃ

source: Edit the ``/etc/default/etcd`` file and set the ``ETCD_INITIAL_CLUSTER``, ``ETCD_INITIAL_ADVERTISE_PEER_URLS``, ``ETCD_ADVERTISE_CLIENT_URLS``, ``ETCD_LISTEN_CLIENT_URLS`` to the management IP address of the controller node to enable access by other nodes via the management network:
bn_in: "/etc/etcd/etcd" ফাইলটির মধ্যে লিখুন "ETCD_INITIAL_CLUSTER" , " ETCD_INITIAL_ADVERTISE_PEER_URLS", "ETCD_ADVERTISE_CLIENT_URLS", "ETCD_LISTEN_CLIENT_URLS" অন্যান্য নোডগুলো যাতে ম্যানেজমেন্ট নেটোওয়ার্ক এর মাধ্যমে এক্সেস করতে পারে।
