Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: (Optional) If you intend to use non-raw image types such as QCOW2 and VMDK, install the QEMU package:
cs: (Nepovinné) Pokud budete chtít používat obrazy v neprostém formátu, jako např. QCOW2 a VMDK, nainstalujte balíček QEMU:
ru: (Необязательно) Если вы планируете использовать несырые (non-raw) типы образов, такие как QCOW2 и VMDK, установите пакет QEMU:

source: (Optional) To assist with troubleshooting, enable verbose logging in the ``[DEFAULT]`` section:
cs: (Nepovinné) Pro pomoc při řešení problémů povolte podrobný záznam v části ``[DEFAULT]``:

source: **Example**
cs: **Příklad**
ru: **Пример**

source: **Networking Option 1: Provider networks - Overview**
bn_in: ** নেটওয়ার্কিং অপশন 1: প্রােভাইডার নেটওয়ার্ক - ওভারভিউ **
cs: **Volba sítě 1: Sítě poskytovatele - přehled**
ru: **Вариант сети 1: Сеть провайдера - Обзор**

source: **Networking Option 2: Provider networks - Connectivity**
cs: **Volba sítě 1: Sítě poskytovatele - propojení**

source: **Networking Option 2: Self-service networks - Connectivity**
bn_in: ** নেটওয়ার্কিং অপশন 2: সেল্ফ-সার্ভিস নেটওয়ার্ক - কানেক্টিভিটি **
cs: **Volba sítě 2: Samoobslužné sítě - propojení**

source: **Networking Option 2: Self-service networks - Overview**
bn_in: ** নেটওয়ার্কিং অপশন 2: সেল্ফ-সার্ভিস নেটওয়ার্ক - ওভারভিউ **
cs: **Volba sítě 2: Samoobslužné sítě - přehled**
ru: **Сетевая Опция 2: Сети самообслуживания - Обзор**

source: **On SLES 12:**
cs: **V SLES 12:**

source: **On openSUSE 13.2:**
cs: **V openSUSE 13.2:**

source: **OpenStack services**
cs: **Služby OpenStack**

source: **Passwords**
bn_in: ** পাসওয়ার্ড **
cs: **Hesla**
ru: **Пароли**

source: A flavor specifies a virtual resource allocation profile which includes processor, memory, and storage.
bn_in: একটি প্লেভর একটি ভার্চুয়াল উপায় বিভাজন প্রোফাইল নির্দিষ্ট করে যার মধ্যে প্রসেসর, মেমরি এবং স্টোরেজ অন্তর্ভুক্ত রয়েছে।
cs: Konfigurace určuje profil přidělení virtuálních zdrojů zahrnující procesory, paměť a úložný prostor.
ru: Схема описывает выделение виртуальных ресурсов, которые включают процессор, память и хранилище.

source: A single disk partition on each node works for most basic installations. However, you should consider :term:`Logical Volume Manager (LVM)` for installations with optional services such as Block Storage.
bn_in: প্রতিটি নোডের একটি সিঙ্গেল ডিস্ক পার্টিশন বেশিরভাগ বেসিক ইনস্টলেশনগুলির জন্য কাজ করে। তবে, আপনার বিবেচনা করা উচিত :term:`Logical Volume Manager (LVM)` ঐচ্ছিক সার্ভিস যেমন ব্লক স্টোরেজ সহ ইনস্টলেশনগুলির জন্য।
cs: Pro nejjednodušší instalace lze mít na každém uzlu jeden diskový oddíl. U instalací s doplňkovými službami jako je blokové úložiště byste ale měli zvážit použít :term:`Správce logických svazků (LVM) <Logical Volume Manager (LVM)>`.
ru: Одиночный раздел диска на каждом узле работает для большинства базовых установок. Тем не менее, вы должны учитывать :term:`Logical Volume Manager (LVM)` для установок с дополнительными сервисами, такими как блочное хранилище.

source: Ability to take periodic "snap shots" throughout the installation process and "roll back" to a working configuration in the event of a problem.
bn_in: কোনও সমস্যা হওয়ার পরে ইনস্টলেশন প্রক্রিয়া গ্রহন করে সাময়িক "snap shots" নেওয়ার এবং কোনও কার্যকারী কনফিগারেশনে "roll back" নেওয়ার ক্ষমতা রাখে ।
cs: Možnost si pravidelně vytvářet "snímky" během instalačního procesu a v případě problémů mít možnost "vrátit se" zpět do bodu s fungujícím nastavením.
ru: Возможность создавать периодические "быстрые копии" во время процесса установки и "откатываться" на рабочую конфигурацию в случае проблем.

source: Abstract
cs: Abstrakt
ru: Введение

source: Access the dashboard using a web browser at ``http://controller/``.
cs: Vstupte na nástěnku pomocí internetového prohlížeče na adrese ``http://controller/``.
ru: Зайдите в панель управления через веб-браузер ``http://controller/``.

source: Access the dashboard using a web browser at ``http://controller/dashboard``.
cs: Vstupte na nástěnku pomocí internetového prohlížeče na adrese ``http://controller/dashboard``.
ru: Зайдите в панель управления через веб-браузер ``http://controller/dashboard``.

source: Access the dashboard using a web browser at ``http://controller/horizon``.
cs: Vstupte na nástěnku pomocí internetového prohlížeče na adrese ``http://controller/horizon``.
ru: Зайдите в панель управления через веб-браузер ``http://controller/horizon``.

source: Access the instance remotely
bn_in: রিমুটলি ইনস্টেস অ্যাক্সেস করুন
cs: Získání vzdáleného přístupu k instanci
ru: Удаленный доступ к инстансу

source: Access the instance using a virtual console
bn_in: ভার্চুয়াল কনসোল ব্যবহার করে ইনস্টেসটি অ্যাক্সেস করুন
cs: Získání přístupu k instanci pomocí virtuální konzole
ru: Зайдите на инстанс используя виртуальную консоль

source: Access the instance using the virtual console
bn_in: ভার্চুয়াল কনসোল ব্যবহার করে ইনস্টেসটি অ্যাক্সেস করুন
cs: Získání přístupu k instanci pomocí virtuální konzole
ru: Зайдите на инстанс используя виртуальную консоль

source: Access your instance using SSH and use the ``fdisk`` command to verify presence of the volume as the ``/dev/vdb`` block storage device:
bn_in: SSH ব্যবহার করে আপনার ইনস্টেস অ্যাক্সেস করুন এবং volume ``/dev/vdb`` ব্লক স্টোরেজ ডিভাইস হিসাবে ভলিউমের কমান্ড যাচাই করতে``fdisk`` কমান্ডটি ব্যবহার করুন ।
cs: Vstupte do instance pomocí SSH a použijte příkaz ``fdisk`` pro ověření přítomnosti svazku v zařízení blokového úložiště ``/dev/vdb``:
ru: Войдите в ваш инстанс по SSH и используйте команду ``fdisk`` для того чтобы убедиться в наличии тома как устройства блочного хранилища ``/dev/vdb``:

source: Access your instance using SSH from the controller node or any host on the public physical network:
cs: Vstupte do vaší instance pomocí SSH z uzlu kontroléru nebo jakéhokoli hostitele na veřejné fyzické síti:

source: Activate the Apache module ``mod_version``:
cs: Aktivujte Apache modul ``mod_version``:

source: Add rules to the ``default`` security group:
bn_in: `` default`` সিকিউরিটি গ্রুপে নিয়ম যুক্ত করুনঃ
cs: Přidejte pravidla do bezpečnostní skupiny ``default``:
ru: Добавьте правила в группу безопасности ``default``:

source: Add security group rules
bn_in: সিকিউরিটি গ্রুপ নিয়ম যুক্ত করুন
cs: Přidání pravidel bezpečnostní skupiny
ru: Добавьте правила групп безопасности

source: Add the Block Storage service
cs: Přidání služby blokového úložiště

source: Add the Compute service
cs: Přidání služby výpočtu

source: Add the Identity service
cs: Přidání služby identit

source: Add the Image service
cs: Přidání služby obrazů

source: Add the Orchestration service
cs: Přidání služby Orchestrace

source: Add the Telemetry service
cs: Přidání služby telemetrie

source: Add the ``ResellerAdmin`` role to the ``ceilometer`` user:
cs: Předejte roli ``ResellerAdmin`` uživateli ``ceilometer``:

source: Add the ``admin`` role to the ``admin`` project and user:
cs: Předejte roli ``admin`` uživateli a projektu ``admin``:

source: Add the ``admin`` role to the ``ceilometer`` user.
cs: Předejte roli ``admin`` uživateli ``ceilometer``.

source: Add the ``admin`` role to the ``cinder`` user:
cs: Předejte roli ``admin`` uživateli ``cinder``:
ru: Добавьте роль ``admin`` пользователю ``cinder ``:

source: Add the ``admin`` role to the ``glance`` user and ``service`` project:
cs: Předejte roli ``admin`` uživateli ``glance`` a projektu ``service``:
ru: Добавьте роль ``admin`` пользователю ``glance`` и проекту ``service``:

source: Add the ``admin`` role to the ``heat_domain_admin`` user in the ``heat`` domain to enable administrative stack management privileges by the ``heat_domain_admin`` user:
cs: Předejte roli ``admin`` uživateli ``heat_domain_admin`` v doméně ``heat`` pro předání oprávnění ke správě zásobníku uživateli ``heat_domain_admin``:

source: Add the ``admin`` role to the ``heat`` user:
cs: Předejte roli ``admin`` uživateli ``heat``:

source: Add the ``heat_stack_owner`` role to the ``demo`` project and user to enable stack management by the ``demo`` user:
cs: Předejte roli ``heat_stack_owner`` projektu a uživateli ``demo`` pro umožnění správy zásobníku tímto uživatelem:

source: Add the ``openstack`` user:
bn_in: "openstack" ব্যবহারকারীটি যুক্ত করুনঃ
cs: Předejte uživatele ``openstack``:
ru: Добавьте пользователя ``openstack``:

source: Add the ``router: external`` option to the ``public`` provider network:
cs: Přidejte volbu ``router: external`` do ``public`` sítě poskytovatele:

source: Add the ``user`` role to the ``demo`` project and user:
cs: Předejte roli ``user`` uživateli a projektu ``demo``:

source: Add the dashboard
cs: Přidejte nástěnku

source: Add the private network subnet as an interface on the router:
cs: Přidejte podsíť soukromé sítě jako rozhraní do směrovače:

source: Additional compute nodes should use 10.0.0.32, 10.0.0.33, and so on.
bn_in: অতিরিক্ত কম্পিউড নোডগুলোতে 10.0.0.32, 10.0.0.33 এবং এই ধারাবাহিক ভাবে ব্যবহার করা উচিত।
cs: Další výpočtové uzly by měly používat 10.0.0.32, 10.0.0.33, atd.
ru: Дополнительные вычислительные узлы должны использовать 10.0.0.32, 10.0.0.33, и так далее.

source: Additionally, you can allocate IP addresses on external networks to ports on the internal network. Whenever something is connected to a subnet, that connection is called a port. You can associate external network IP addresses with ports to VMs. This way, entities on the outside network can access VMs.
cs: Dále můžete přidružit IP adresy ve vnějších sítích k portům na vnitřní síti. Kdykoliv je něco připojeného k podsíti je toto spojení nazváno portem. Ip adresy vnější sítě lze přidružit k portům virtuálního stroje. Takto mohou objekty ve vnější síti získat přístup k virtuálním strojům.

source: After a short time, the volume status should change from ``creating`` to ``available``:
bn_in: কিছু সময়ের পরে, ভলিউমের অবস্থাটি ``creating``থেকে`available`` এ পরিবর্তন হওয়া দরকার ।
cs: Po chvíli by se stav svazku měl změnit z ``creating`` na ``available``:
ru: Довольно быстро статус диска должен изменится с ``creating` на ``available``:

source: After a short time, verify successful creation of the stack:
cs: Po chvíli ověřte úspěšné vytvoření zásobníku:

source: After creating the appropriate networks for your environment, you can continue preparing the environment to launch an instance.
bn_in: আপনার ইনভারমেন্টের জন্য উপযুক্ত নেটওয়ার্ক তৈরির পরে, আপনি একটি ইনস্টেস চালু করার জন্য ইনভারমেন্ট প্রস্তুত করে চালিয়ে যেতে পারেন।
cs: Po vytvoření odpovídajících sítí pro vaše prostředí můžete pokračovat v přípravě spuštění instance.
ru: После создания необходимых сетей для вашего окружения, вы можете продолжить подготовку окружения к запуску инстанса.

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the `SLES 12 <https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_basicnet_manconf.html>`__ or `openSUSE <http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking>`__ documentation.
cs: Po instalaci operačního systému na každém uzlu pro architekturu, kterou chcete zavést, musíte nastavit síťová rozhraní. Doporučujeme Vám zakázat jakékoli nástroje pro automatickou správu sítí a ručně si upravit odpovídající soubory s nastavením ve vaší distribuci. Pro další informace o nastavení sítě ve vaš distribuci si přečtěte dokumentaci `SLES 12 <https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_basicnet_manconf.html>`__ nebo `openSUSE <http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking>`__ .

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the `documentation <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/Networking_Guide/sec-Using_the_Command_Line_Interface.html>`__ .
cs: Po instalaci operačního systému na každém uzlu pro architekturu, kterou chcete zavést, musíte nastavit síťová rozhraní. Doporučujeme Vám zakázat jakékoli nástroje pro automatickou správu sítí a ručně si upravit odpovídající soubory s nastavením ve vaší distribuci. Pro další informace o nastavení sítě ve vaš distribuci si přečtěte `dokumentaci <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/Networking_Guide/sec-Using_the_Command_Line_Interface.html>`__ .

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the `documentation <https://help.ubuntu.com/lts/serverguide/network-configuration.html>`__ .
cs: Po instalaci operačního systému na každém uzlu pro architekturu, kterou chcete zavést, musíte nastavit síťová rozhraní. Doporučujeme Vám zakázat jakékoli nástroje pro automatickou správu sítí a ručně si upravit odpovídající soubory s nastavením ve vaší distribuci. Pro další informace o nastavení sítě ve vaš distribuci si přečtěte `dokumentaci <https://help.ubuntu.com/lts/serverguide/network-configuration.html>`__ .
ru: После установки операционной системы на каждом узле архитектуры которую вы выбрали для развертывания, вы должны настроить сетевые интерфейсы. Мы рекомендуем вам отключить все автоматизированные средства управления сетями и вручную отредактировать соотвествующие конфигурационные файлы для вашего дистрибутива. Больше информации о настройке сети на вашем дистрибутиве вы можете узнать из `документации <https://help.ubuntu.com/lts/serverguide/network-configuration.html>`__ .

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the `documentation <https://wiki.debian.org/NetworkConfiguration>`__ .
cs: Po instalaci operačního systému na každém uzlu pro architekturu, kterou chcete zavést, musíte nastavit síťová rozhraní. Doporučujeme Vám zakázat jakékoli nástroje pro automatickou správu sítí a ručně si upravit odpovídající soubory s nastavením ve vaší distribuci. Pro další informace o nastavení sítě ve vaš distribuci si přečtěte `dokumentaci <https://wiki.debian.org/NetworkConfiguration>`__ .

source: After you configure the ML2 plug-in, removing values in the ``type_drivers`` option can lead to database inconsistency.
cs: Po nastavení zásuvného modulu může odstraněním hodnot z voleb ``type_drivers`` vést k nesouladu v databázi.
ru: После того как вы сконфигурируете ML2 плагин, удаление значений в опции ``type_drivers`` может привести к нарушению целостности базы данных.

source: After you create this file, run this command:
cs: Poté, co soubor vytvoříte, spusťte tento příkaz:

source: After you install and configure the dashboard, you can complete the following tasks:
cs: Po instalaci a nastavení nástěnky můžete provádět následující úkony:
ru: После установки и настройки панели управления, вы можете выполнить следующие задачи:

source: All Debian packages for API services, except the ``heat-api`` package, register the service in the Identity service catalog. This feature is helpful because API endpoints are difficult to remember.
cs: Všechny balíčky Debian pro služby API, kromě balíčku ``heat-api``, registrují službu v katalogu služby identit. Tato funkce je užitečná, protože koncové body API je těžké si zapamatovat.

source: All nodes require Internet access for administrative purposes such as package installation, security updates, :term:`DNS`, and :term:`NTP`. In most cases, nodes should obtain internet access through the management network interface. To highlight the importance of network separation, the example architectures use `private address space <https://tools.ietf.org/html/rfc1918>`__ for the management network and assume that the physical network infrastructure provides Internet access via :term:`NAT` or other method. The example architectures use routable IP address space for the public network and assume that the physical network infrastructure provides direct Internet access. In the provider networks architecture, all instances attach directly to the public network. In the self-service networks architecture, instances can attach to a private or public network. Private networks can reside entirely within OpenStack or provide some level of public network access using :term:`NAT`.
cs: Všechny uzly vyžadují přístup k Internetu za účelem správy jako např. instalace balíčků, bezpečnostní aktualizace, :term:`DNS` a :term:`NTP`. Ve většině případů by uzly měly přístup k internetu získat přes síťové rozhraní pro správu. Pro zdůraznění důležitosti oddělení sítí ukázková architektura využívá `soukromý prostor adres <https://tools.ietf.org/html/rfc1918>`__ pro síť správy a je předpokládáno, že infrastruktura fyzické sítě poskytuje přístup k internetu pomocí :term:`NAT`, nebo jiné metody. Architektura používá směrovatelný prostor IP adres pro veřejnou síť a předpokládá, že infrastruktura fyzické sítě poskytuje přímý přístup k internetu. V architektuře poskytovatele sítě jsou všechny instance připojeny přímo k veřejné síti. Pro samoobslužné síťové architektury mohou být instance připojeny jak k veřejné tak k soukromé síti. Soukromé sítě mohou být umístěny zcela do OpenStack nebo mohou poskytovat určitou úroveň veřejné sítě použitím :term:`NAT`.

source: Allow all hosts to access the dashboard:
cs: Umožněte všem hostitelům přístup k nástěnce:

source: Also, the Networking service assumes default values for kernel network parameters and modifies firewall rules. To avoid most issues during your initial installation, we recommend using a stock deployment of a supported distribution on your hosts. However, if you choose to automate deployment of your hosts, review the configuration and policies applied to them before proceeding further.
cs: Služba sítí předpokládá výchozí hodnoty pro parametry sítě jádra a mění pravidla brány firewall. Abyste se vyhnuli většině problémů během počáteční instalace, doporučujeme ve vašich hostitelích použít výchozí zavedení u podporované distribuce. Pokud se ale rozhodnete jejich zavedení automatizovat, zkontrolujte si prosím použité nastavení a zásady, než budete pokračovat.
ru: Также, сервис управления сетью присваивает стандартные значения сетевым параметрам ядра и модифицирует правила брандмауэра. Для избежания большого количества проблем во время первоначальной установки, мы рекомендуем использовать базовые параметры для вашего дистрибутива. Тем не менее, если Вы решите автоматизировать процесс развертывания для ваших узлов, рассмотрите конфигурации и политики, применимые к ним, перед тем, как продолжить.

source: Alternatively, if you do not want to install this package, run this script to enable remote root access:
cs: Nebo, pokud nechcete tento balíček instalovat, spusťte tento skript pro povolení přístupu vzdáleného uživatele root:

source: Alternatively, you can skip the ``ssh-keygen`` command and use an existing public key.
bn_in: বিকল্পভাবে, আপনি ``ssh-keygen`` কমান্ডটি এড়াতে এবং একটি বিদ্যমান পাবলিক কী ব্যবহার করতে পারেন।
cs: Nebo můžete přidat existující veřejný klíč a příkaz ``ssh-keygen`` přeskočit.
ru: Либо, вы можете пропустить команду ``ssh-keygen`` и использовать существующий публичный ключ.

source: Although most environments include Identity, Image service, Compute, at least one networking service, and the dashboard, the Object Storage service can operate independently. If your use case only involves Object Storage, you can skip to :ref:`swift` after configuring the appropriate nodes for it. However, the dashboard requires at least the Image service, Compute, and Networking.
cs: I když většina prostředí má službu identit, obrazů a výpočtu spolu s alespoň jednou službou sítí a nástěnkou, služba úložiště objektů může pracovat nezávisle. Pokud chcete používat pouze úložiště objektů, můžete po nastavení odpovídajících uzlů rovnou přeskočit na :ref:`swift`. Nástěnka ale vyžaduje alespoň služby obrazům, výpočtu a sítí.

source: Another way to disable the ``debconf`` package is to prefix the :command:`apt` command with ``DEBIAN_FRONTEND=noninteractive``, as follows:
cs: Další způsob jak zakázat balíček ``debconf`` je před příkaz :command:`apt`zadat ``DEBIAN_FRONTEND=noninteractive`` takto:

source: Any given Networking set up has at least one external network. Unlike the other networks, the external network is not merely a virtually defined network. Instead, it represents a view into a slice of the physical, external network accessible outside the OpenStack installation. IP addresses on the external network are accessible by anybody physically on the outside network.
cs: Všechny infrastruktury mají alespoň jednu vnější síť. Na rozdíl od ostatních sítí, tato síť není pouhou virtuálně určenou sítí, ale představuje pohled do části fyzické, vnější sítě dostupné mimo instalaci OpenStack. IP adresy ve vnější síti jsou přístupné komukoliv přistupujícími k síti zvenku.
ru: В любой сетевой настройке присутствует хотя бы одна внешняя сеть. В отличии от остальных сетей, внешняя сеть не является полностью виртуальной сетью. Вместо этого, она представляет фрагмент физической внешней сети, доступной вне OpenStack. IP адреса во внешней сети физически доступны всем во внешней сети.

source: Any roles that you create must map to roles specified in the ``policy.json`` file in the configuration file directory of each OpenStack service. The default policy for most services grants administrative access to the ``admin`` role. For more information, see the `Operations Guide - Managing Projects and Users <http://docs.openstack.org/openstack-ops/content/projects_users.html>`__.
cs: Všechny role, které vytvoříte, musí být namapovány k rolím uvedených v souboru ``policy.json`` umístěného v adresáři souborů s nastavením v každé službě OpenStack. Výchozí zásada pro většinu služeb uděluje přístup pro správce roli ``admin``. Pro další informace si přečtěte `Průvodce provozováním - Správa projektů a uživatelů <http://docs.openstack.org/openstack-ops/content/projects_users.html>`__.

source: As an example, here are screenshots from the ``cinder-common`` package:
cs: Jako příklad jsou zde umístěny obrazovky z balíčku ``cinder-common``:

source: As the ``admin`` user, request an authentication token:
cs: Požádejte o příznak ověření jako uživatel ``admin``:
ru: Используя пользоваетля ``admin`` запросите аутентификационный токен:

source: As the ``demo`` user, request an authentication token:
cs: Požádejte o příznak ověření jako uživatel ``demo``:
ru: Используя пользоваетля ``demo`` запросите аутентификационный токен:

source: Associate the floating IP address with the instance:
bn_in: ইনস্টেস এর সাথে ভাসমান আইপি এড্রেসটি সংযুক্ত করুনঃ
cs: Přidružte plovoucí IP adresu k instanci:
ru: Укажите назначаемый IP-адрес для инстанса:

source: Attach a volume to an instance:
bn_in: একটি ইনস্টেস সাথে আর একটি ভলিউম সংযুক্ত করুন:
cs: Připojte svazek k instanci:
ru: Подключите диск к инстансу
