Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: Replace ``OVERLAY_INTERFACE_IP_ADDRESS`` with the IP address of the underlying physical network interface that handles overlay networks. The example architecture uses the management interface.
cs: Nahraďte ``OVERLAY_INTERFACE_IP_ADDRESS`` IP adresou základním rozhraní fyzické sítě, která spravuje překryvné sítě. Ukázková architektura používá rozhraní pro správu.

source: Replace ``PRIVATE_NETWORK_CIDR`` with the subnet you want to use on the private network. You can use any arbitrary value, although we recommend a network from `RFC 1918 <https://tools.ietf.org/html/rfc1918>`_.
cs: ``PRIVATE_NETWORK_CIDR`` nahraďte podsítí, kterou chcete použít v soukromé síti. Můžete zvolit náhodnou hodnotu, přesto Vám doporučujeme se přvýběru řídit `RFC 1918 <https://tools.ietf.org/html/rfc1918>`_.

source: Replace ``PRIVATE_NETWORK_GATEWAY`` with the gateway you want to use on the private network, typically the ".1" IP address.
cs: ``PRIVATE_NETWORK_GATEWAY`` nahraďte bránou, kterou chcete použít v soukromé síti, obyčejně je to IP adresa ".1".

source: Replace ``PRIVATE_NET_ID`` with the ID of the ``private`` project network.
cs: Nahraďte ``PRIVATE_NET_ID`` ID sítě projektu ``private``.

source: Replace ``PUBLIC_INTERFACE_NAME`` with the name of the underlying physical public network interface.
cs: Nahraďte ``PUBLIC_INTERFACE_NAME`` název základního rozhraní veřejné fyzické sítě.

source: Replace ``PUBLIC_NETWORK_CIDR`` with the subnet on the public physical network in CIDR notation.
cs: ``PUBLIC_NETWORK_CIDR`` nahraďte podsítí na veřejné fyzické síti zapsaném ve formátu CIDR.

source: Replace ``PUBLIC_NETWORK_GATEWAY`` with the gateway IP address on the public physical network, typically the ".1" IP address.
cs: ``PRIVATE_NETWORK_GATEWAY`` nahraďte IP adresou brány ve veřejné fyzické síti, obyčejně je to IP adresa ".1".

source: Replace ``PUBLIC_NET_ID`` with the ID of the ``public`` provider network.
cs: Nahraďte ``PUBLIC_NET_ID`` ID sítě poskytovatele ``public``.

source: Replace ``RABBIT_PASS`` with a suitable password.
bn_in: "RABBIT_PASS" এর পরিবর্তনে একটি পছন্দমত পাসওয়ার্ড দিন।
cs: Nahraďte ``RABBIT_PASS`` vhodným heslem.
ru: Замените ``RABBIT_PASS`` подходящим паролем.

source: Replace ``RABBIT_PASS`` with the password you chose for the ``openstack`` account in RabbitMQ.
cs: Nahraďte ``RABBIT_PASS`` Vámi zvoleným heslem pro účet ``openstack`` v RabbitMQ.
ru: Замените ``RABBIT_PASS`` паролем, который вы выбрали для учетной записи ``openstack`` в RabbitMQ.

source: Replace ``RABBIT_PASS`` with the password you chose for the ``openstack`` account in ``RabbitMQ``.
cs: Nahraďte ``RABBIT_PASS`` Vámi zvoleným heslem pro účet ``openstack`` v ``RabbitMQ``.
ru: Замените ``RABBIT_PASS`` паролем, который вы выбрали для аккаунта ``openstack`` в ``RabbitMQ``.

source: Replace ``START_IP_ADDRESS`` and ``END_IP_ADDRESS`` with the first and last IP address of the range within the subnet that you want to allocate for instances. This range must not include any existing active IP addresses.
bn_in: আপনি যে সাবনেটগুলির জন্য বরাদ্দ করতে চান তার মধ্যে থাকা রেঞ্জের প্রথম এবং শেষ আইপি এড্রেসটি `` START_IP_ADDRESS`` এবং `` END_IP_ADDRESS`` সংযুক্ত করুন। এই রেঞ্জ কোনও নিযর্স সক্রিয় আইপি এড্রেস অন্তর্ভুক্ত করা হয় না ।
cs: ``START_IP_ADDRESS`` a ``END_IP_ADDRESS`` nahraďte první a poslední IP adresou rozsahu uvnitř podsítě, jenž chcete přidělit instancím. Tento rozsah nesmí obsahovat existující aktivní IP adresy.
ru: Замените ``START_IP_ADDRESS`` и ``END_IP_ADDRESS`` первым и последним IP адресами из диапазона в подсети, которую вы хотите выделить для инстансов. Этот диапазон не должен включать существующие активные адреса.

source: Replace ``TIME_ZONE`` with an appropriate time zone identifier. For more information, see the `list of time zones <http://en.wikipedia.org/wiki/List_of_tz_database_time_zones>`__.
cs: ``TIME_ZONE`` nahraďte vhodným identifikátorem časového pásma. Pro další informace si prohlédněte `seznam časových pásem <http://en.wikipedia.org/wiki/List_of_tz_database_time_zones>`__.
ru: Замените ``TIME_ZONE`` уместным идентификатором часового пояса. Для получения дополнительной информации, обратитесь к `списку часовых поясов <http://en.wikipedia.org/wiki/List_of_tz_database_time_zones>`__.

source: Request an authentication token:
cs: Zažádejte o ověřovací příznak:

source: Respond to prompts for :doc:`database management <debconf/debconf-dbconfig-common>`, :doc:`Identity service credentials <debconf/debconf-keystone-authtoken>`, :doc:`service endpoint registration <debconf/debconf-api-endpoints>`, and :doc:`message broker credentials <debconf/debconf-rabbitmq>`.
cs: Odpovězte na otázky pro :doc:`správu databáze <debconf/debconf-dbconfig-common>`, :doc:`přihlašovací údaje do služby identit <debconf/debconf-keystone-authtoken>`, :doc:`registrace koncového bodu služby <debconf/debconf-api-endpoints>` a :doc:`přihlašovací údaje zprostředkovatele zpráv <debconf/debconf-rabbitmq>`.

source: Respond to prompts for :doc:`debconf/debconf-dbconfig-common`, which will fill the below database access directive.
cs: Zodpovězte dotazy pro :doc:`debconf/debconf-dbconfig-common`, které vyplní níže uvedený příkaz pro přístup k databázi.

source: Respond to prompts for ``database management``, ``Identity service credentials``, ``service endpoint``, and ``message queue credentials``.
cs: Odpovězte na otázky pro ``database management``, ``Identity service credentials``, ``service endpoint`` a ``message queue credentials``.

source: Respond to prompts for `database management <#debconf-dbconfig-common>`__, `Identity service credentials <#debconf-keystone_authtoken>`__, `service endpoint registration <#debconf-api-endpoints>`__, and `message queue credentials <#debconf-rabbitmq>`__.
cs: Odpovězte na otázky pro `správu databáze <#debconf-dbconfig-common>`__, `přihlašovací údaje do služby identit <#debconf-keystone_authtoken>`__, `registrace koncového bodu služby <#debconf-api-endpoints>`__ a `přihlašovací údaje zprostředkovatele zpráv <#debconf-rabbitmq>`__.

source: Respond to prompts for web server configuration.
cs: Zodpovězte dotazy pro nastavení internetového serveru.
ru: Ответьте на запросы для настройки веб сервера.

source: Restart the Apache HTTP server:
cs: Restartujte HTTP server Apache:

source: Restart the Block Storage services on the controller node:
cs: Restartujte službu blokového úložiště na uzlu kontroléru:

source: Restart the Block Storage services on the storage nodes:
cs: Restartujte službu blokového úložiště na uzlu úložiště:

source: Restart the Block Storage services:
cs: Restartujte služby blokového úložiště:
ru: Перезапустите сервисы Блочного Хранения:

source: Restart the Block Storage volume service including its dependencies:
cs: Restartujte službu svazku blokového úložiště včetně jejích závislostí:
ru: Перезапустите сервис дисков Блочного Хранения, включая его зависимости:

source: Restart the Compute API service:
cs: Restartujte API výpočtové služby:
ru: Перезапустите API сервис вычислительных ресурсов:

source: Restart the Compute service:
cs: Restartujte výpočtovou službu:
ru: Перезапустите службу Compute:

source: Restart the Image service services:
cs: Restartujte služby obrazů:

source: Restart the Image service:
cs: Restartujte službu obrazů:

source: Restart the Linux bridge agent:
cs: Restartujte Linux agenta přemostění:
ru: Перезапустите Linux Bridge агента:

source: Restart the NTP service:
bn_in: NTP সার্ভিসটি পুনরায় চালু করুন:
cs: Restartujte službu NTP:
ru: Перезапустите сервис NTP:

source: Restart the Object Storage proxy service:
cs: Restartujte proxy službu úložiště objektů:

source: Restart the Orchestration services:
cs: Restartujte služby orchestrace:

source: Restart the Telemetry services:
cs: Restartujte služby telemetrie:

source: Restart the agent:
cs: Restartujte agenta:

source: Restart the database service:
bn_in: ডাটাবেস সার্ভিসটি পুনরায় চালু করুন:
cs: Restartujte službu databáze:
ru: Перезапустите сервис баз данных:

source: Restart the web server and session storage service:
cs: Restartujte internetový server a službu uložení sezení:
ru: Перезапустите веб-сервер и сервис сессии хранилища:

source: Retrieve usage statistics from the ``image.download`` meter:
cs: Získejte statistiky o využití z měřidla ``image.download``:

source: Return to :ref:`Launch an instance - Create virtual networks <launch-instance-networks>`.
bn_in: পুনরায় দেখুন: রেফ: `Launch an instance - ভার্চুয়াল নেটওয়ার্কগুলি <launch-instance-networks> তৈরি করুন `
cs: Vraťte se na :ref:`Spuštění instance - Vytváření virtuálních sítí <launch-instance-networks>`.

source: Return to :ref:`Launch an instance <launch-instance-complete>`.
bn_in: পুনরায় দেখুন: ref: `Launch an instance <launch-instance-complete>`
cs: Návrat na :ref:`Spuštění instance <launch-instance-complete>`.

source: Return to :ref:`Networking compute node configuration <neutron-compute-compute>`.
cs: Návrat na :ref:`Nastavení sítě výpočetního uzlu <neutron-compute-compute>`.
ru: Вернитесь к :ref:`Настройки сети вычислительного узла <neutron-compute-compute>`.

source: Return to :ref:`Networking controller node configuration <neutron-controller-metadata-agent>`.
cs: Návrat na :ref:`Nastavení sítě uzlu kontroléru <neutron-controller-metadata-agent>`.
ru: Вернитесь к :ref:`Networking controller node configuration <neutron-controller-metadata-agent>`.

source: Return to :ref:`launch-instance`.
cs: Návrat na :ref:`launch-instance`.
ru: Вернитесь к :ref:`launch-instance`.

source: Root password for the database
bn_in: ডাটাবেসের জন্য রুট পাসওয়ার্ড
cs: Heslo pro účet root v databázi
ru: Пароль root для базы данных

source: Run the following command to install the packages:
cs: Proveďte následující příkaz pro instalaci balíčků:
ru: Исполните следующую команду для установки пакетов:

source: Run the following commands to install the packages:
cs: Proveďte následující příkaz pro instalaci balíčků:

source: Run the same command on *all other* nodes:
bn_in: *all other* নোডে একই কমান্ডটি পুনরায় চালু করুন ।
cs: Spusťte stejný příkaz na *všech ostatních* uzlech:
ru: Выполните эту же команду на *всех остальных* узлах

source: Run this command on the *controller* node:
bn_in: *controller* নোডে এই কমান্ডটি চালু করুন ।
cs: Spusťte tento příkaz na uzlu *kontroléru*:

source: SQL database
bn_in: SQL ডাটাবেস দেখুন
cs: Databáze SQL
ru: SQL база данных

source: Search in this guide
cs: Hledat v tomto průvodci
ru: Поиск по руководству

source: Second node
cs: Druhý uzel

source: Secure the database service by running the ``mysql_secure_installation`` script.
cs: Zabezpečte službu databáze spuštěním skriptu ``mysql_secure_installation``.

source: Security
bn_in: সিকিউরিটি
cs: Bezpečnost
ru: Безопасность

source: Select the ML2 plug-in:
cs: Vyberte zásuvný modul ML2:

source: Select the ``keystone`` pipeline to configure the Image service to use the Identity service:
cs: Vyberte možnost ``keystone`` pro nastavení služby obrazů k použití služby identit:

source: Selecting the ML2 plug-in also populates the ``core_plugin`` option in the ``/etc/neutron/neutron.conf`` file with the appropriate values (in this case, it is set to the value ``ml2``).
cs: Výběrem této možnosti vyplníte také volbu ``core_plugin`` v souboru ``/etc/neutron/neutron.conf`` vhodnými hodnotami (v tomto případě je nastavena na hodnotu ``ml2``).

source: Selecting the ML2 plug-in also populates the ``service_plugins`` and ``allow_overlapping_ips`` options in the ``/etc/neutron/neutron.conf`` file with the appropriate values.
cs: Výběrem této možnosti vyplníte také volby ``service_plugins`` a ``allow_overlapping_ips`` v souboru ``/etc/neutron/neutron.conf`` vhodnými hodnotami.

source: Service
bn_in: সেবা
cs: Služba

source: Services and the [keystone_authtoken]
cs: Služby a [keystone_authtoken]

source: Set a gateway on the public network on the router:
cs: Nastavte bránu na veřejné síti na směrovači:

source: Set the ``NET_ID`` environment variable to reflect the ID of a network. For example, using the ``public`` network:
cs: Nastavte proměnnou prostředí ``NET_ID`` aby obsahovala ID sítě. Například při použití sítě ``public``:

source: Set the hostname of the node to ``block1``.
bn_in: এই নোড এর হোস্ট নামটি পরিবর্তন করে "block1" লিখুন।
cs: Nastavte název hostitele uzle na ``block1``.
ru: Установите имя хоста узла как ``block1``.

source: Set the hostname of the node to ``compute1``.
bn_in: এই নোড এর হোস্ট নামটি পরিবর্তন করে "compute1" লিখুন।
cs: Nastavte název hostitele uzle na ``compute1``.
ru: Установите имя хоста узла как``compute1``.

source: Set the hostname of the node to ``controller``.
bn_in: এই নোড এর হোস্ট নামটি পরিবর্তন করে "controller" লিখুন।
cs: Nastavte název hostitele uzle na ``controller``.
ru: Установите имя хоста узла как ``controller``.

source: Set the hostname of the node to ``object1``.
cs: Nastavte název hostitele uzle na ``object1``.

source: Set the hostname of the node to ``object2``.
cs: Nastavte název hostitele uzle na ``object2``.

source: Set up session storage. See `Set up session storage for the dashboard <http://docs.openstack.org/admin-guide-cloud/dashboard_sessions.html>`__.
cs: Nastavit uložení sezení. Viz `Nastavení uložení sezení na nástěnce <http://docs.openstack.org/admin-guide-cloud/dashboard_sessions.html>`__.

source: Show the name and IP address of the instance and compare with the output of the ``nova`` command:
cs: Zobrazte název a IP adresu instance a porovnejte je s výstupe příkazu ``nova``:

source: Similarly, if your compute nodes use LVM on the operating system disk, you must also modify the filter in the ``/etc/lvm/lvm.conf`` file on those nodes to include only the operating system disk. For example, if the ``/dev/sda`` device contains the operating system:
cs: Podobně, pokud vaše výpočtové uzly využívají LVM na disku s operačním systémem, musíte také změnit filtr v souboru ``/etc/lvm/lvm.conf`` v těchto uzlech, aby byl zahrnut pouze disk s operačním systémem. Například, pokud zařízení ``/dev/sda`` obsahuje operační systém:
ru: Точно так же если узлы вычислительных ресурсов используют LVM в качестве диска операционной системы, необходимо также изменить фильтр в файле "/etc/lvm/lvm.conf" на таких узлах, чтобы он содержал в себе только диск с операционной системой. Например, если операционная система расположена на устройстве "/dev/sda" :

source: So, if using Debian, you wont need to care about database creation, access rights and character sets. All that is handled for you by the packages.
cs: Pokud tedy používáte Debian, nemusíte se starat o vytvoření databáze, přístupová práva, nebo znakové sady. To vše za Vás obstarají balíčky.

source: Some distributions include LVM by default.
cs: Některé distribuce jsou vydávány s již nainstalovaným balíčkem LVM.
ru: Некоторые дистрибутивы включают LVM по умолчанию.

source: Source the ``admin`` credentials to gain access to admin-only CLI commands.
cs: Použijte příkaz source pro přihlašovací údaje pro ``admin`` pro získání přístupu k příkazům příkazového řádku pro správce.

source: Source the ``admin`` credentials to gain access to admin-only CLI commands:
cs: Použijte příkaz source pro přihlašovací údaje pro ``admin`` pro získání přístupu k příkazům příkazového řádku pro správce:
ru: Подставьте учетную запись ``admin`` для получения доступа к инструкциям командной строки, доступным только администраторам:

source: Source the ``admin`` tenant credentials:
cs: Použijte příkaz source pro přihlašovací údaje u nájemníka pro ``admin``:

source: Source the ``demo`` credentials to gain access to user-only CLI commands:
cs: Použijte příkaz source pro přihlašovací údaje pro ``demo`` pro získání přístupu k příkazům příkazového řádku pro uživatele:
ru: Укажите учетную запись ``demo`` для получения доступа к инструкциям командной строки, доступным только пользователям:

source: Source the ``demo`` credentials to perform the following steps as a non-administrative project:
bn_in: নিজর্স-অ্যাডমিনিস্ট্রেটিভ প্রােজেট হিসাবে নিম্নলিখিত পদক্ষেপগুলি সম্পাদন করার জন্য ``demo``পরিচয় প্রয়োজন ।
cs: Použijte příkaz source pro přihlašovací údaje pro ``demo`` pro provedení následujících kroků ve standardním projektu:
ru: Используйте полномочия ``demo`` для выполнения следующих шагов:

source: Source the ``demo`` tenant credentials:
cs: Použijte příkaz source pro přihlašovací údaje u nájemníka pro ``demo``:

source: Start the Apache HTTP service and configure it to start when the system boots:
cs: Spusťte službu Apache HTTP a nastavte ji, aby byla spuštěna při zavedení systému:
ru: Запустите Apache HTTP сервис и настройте его автоматический запуск при загрузке системы:

source: Start the Block Storage services and configure them to start when the system boots:
cs: Spusťte služby blokového úložiště a nastavte je pro spouštění při zavedení systému:
ru: Запустите сервис службы Блочного хранения и настройте его автоматический запуск при загрузке системы:

source: Start the Block Storage volume service including its dependencies and configure them to start when the system boots:
cs: Spusťte službu svazku blokového úložiště, včetně jejích závislostí, a nastavte ji pro spouštění při zavedení systému:
ru: Запустите сервис дисков Блочного хранения, включая его зависимости, и настройте их автоматический запуск при загрузке системы:

source: Start the Image service services and configure them to start when the system boots:
cs: Spusťte služby obrazů a nastavte je, aby byly spuštěny při zavedení systému:

source: Start the LVM metadata service and configure it to start when the system boots:
cs: Spusťte službu popisných dat LVM a nastavte ji, aby byla spuštěna při zavedení systému:
ru: Запустите сервис метаданных LVM и настройте его автоматический запуск при загрузке системы:

source: Start the Linux Bridge agent and configure it to start when the system boots:
cs: Spusťte Linux agenta přemostění a nastavte ho aby byl spuštěn při zavedení systému:
ru: Запустите Linux Bridge агент и настройте его на запуск вместе со стартом системы:

source: Start the Linux bridge agent and configure it to start when the system boots:
cs: Spusťte Linux agenta přemostění a nastavte ho aby byl spuštěn při zavedení systému:
ru: Запустите Linux Bridge агент и настройте его на запуск вместе со стартом системы:

source: Start the Memcached service and configure it to start when the system boots:
bn_in: ম্যামক্যাসড সার্ভিসটি চালু করুন এবং সিস্টেম বুট থকে চালু হওয়ার জন্য কনফিগার করুনঃ
cs: Spusťte službu Memcached a nastavte ji, aby byla spuštěna při zavedení systému:
ru: Запустите сервис Memcached и настройте его автоматический запуск при загрузке системы:

source: Start the MongoDB service and configure it to start when the system boots:
cs: Spusťte službu MongoDB a nastavte ji, aby byla spuštěna při zavedení systému:

source: Start the NTP service and configure it to start when the system boots:
cs: Spusťte službu NTP a nastavte ji, aby byla spuštěna při zavedení systému:
ru: Запустите сервис NTP и настройте его автоматический запуск при загрузке системы:

source: Start the Orchestration services and configure them to start when the system boots:
cs: Spusťte služby orchestrace a nastavte je pro spouštění při zavedení systému:

source: Start the Telemetry services and configure them to start when the system boots:
cs: Spusťte služby telemetrie a nastavte je pro spouštění při zavedení systému:

source: Start the agent and configure it to start when the system boots:
cs: Spusťte agenta a nastavte ho aby byl spuštěn při zavedení systému:

source: Start the database service and configure it to start when the system boots:
bn_in: ডাটাবেস সার্ভিসটি চালু করুন এবং সিস্টেম পুনরায় চালু হওয়ার পরে এটি কনফিগার করুন:
cs: Spusťte službu databáze a nastavte ji, aby byla spuštěna při zavedení systému:
ru: Запустите сервис баз данных и настройте его автоматический запуск при загрузке системы:

source: Start the message queue service again.
cs: Znovu spusťte službu fronty zpráv.

source: Start the message queue service and configure it to start when the system boots:
cs: Spusťte službu fronty zpráv a nastavte ji, aby byla spuštěna při zavedení systému:
ru: Запустите сервис очереди сообщений и настройте его автоматический запуск при загрузке системы:

source: Telemetry uses a combination of notifications and an agent to collect Compute meters. Perform these steps on each compute node.
cs: Telemetrie využívá kombinaci upozornění a agentů pro shromažďování měřidel výpočtu. Proveďte tyto kroky na každém výpočtovém uzlu.

source: Telemetry uses a combination of polling and notifications to collect Object Storage meters.
cs: Telemetrie využívá kombinaci dotazů a upozornění shromažďování měřidel úložiště objektů.

source: Telemetry uses notifications to collect Block Storage service meters. Perform these steps on the controller and Block Storage nodes.
cs: Telemetrie využívá upozornění pro shromažďování měřidel služby blokového úložiště. Proveďte tyto kroky na uzlech kontroléru a blokového úložiště.

source: Telemetry uses notifications to collect Image service meters. Perform these steps on the controller node.
cs: Telemetrie využívá upozornění pro shromažďování měřidel služby obrazů. Proveďte tyto kroky na uzlu kontroléru.

source: The :command:`systemctl enable` call on openSUSE outputs a warning message when the service uses SysV Init scripts instead of native systemd files. This warning can be ignored.
bn_in: openSUSE -তে: কমান্ড: `systemctl enable`কলটি একটি সতর্কতা মেসেজ আউটপুট দেয় যখন সার্ভিসটি স্থানীয় সিস্টেমড ফাইলগুলির পরিবর্তে SysV Init স্ক্রিপ্টগুলি ব্যবহার করে। এই সতর্কতা আপনি এরিয়ে যেতে পারেন।
cs: Zavolání :command:`systemctl enable` v openSUSE vypíše varovnou zprávu, pokud služba využívá SysV jako skripty zavedení místo systémových systemd. Toto varování můžete ignorovat.

source: The :term:`DHCP agent` provides DHCP services for virtual networks.
cs: :term:`Agent DHCP<DHCP agent>` poskytuje služby DHCP virtuálním sítím.
ru: :term:`DHCP agent` предоставляет DHCP сервис для виртуальных сетей.

source: The :term:`Layer-3 (L3) agent` provides routing and NAT services for virtual networks.
cs: :term:`Agent Layer-3 (L3)<Layer-3 (L3) agent>` poskytuje služby směrování a NAT virtuálním sítím.

source: The Block Storage service creates logical volumes in this volume group.
cs: Služba blokového úložiště bude vytvářet svazky v této skupině.
ru: Служба Блочного Хранения будет создавать логические диски в этой группе дисков.

source: The Block Storage services require endpoints for each service entity.
cs: Služby blokového úložiště vyžadují koncové body pro každý objekt služby.
ru: Сервисы блочных хранилищ требуют конечные точки для каждой из сущностей.

source: The Block Storage services require two service entities.
cs: Služby blokového úložiště vyžadují dva objekty.
ru: Сервисы блочных хранилищ требуют двух сущностей сервисов.

source: The CirrOS image includes conventional user name/password authentication and provides these credentials at the login prompt. After logging into CirrOS, we recommend that you verify network connectivity using ``ping``.
bn_in: CirrOS ইমেজটিতে প্রচলিত ব্যবহারকারীর নাম / পাসওয়ার্ড অথেন্টিক্যাশন অন্তর্ভুক্ত রয়েছে এবং লগইন প্রম্পটে এই শংসাপত্রগুলি সরবরাহ করে। CirrOS লগ ইন করার পরে, আমরা আপনাকে ``ping`` ব্যবহার করে নেটওয়ার্ক সংযোগ যাচাই করার পরামর্শ দেয়া হচ্ছে ।
cs: Obraz CirrOS obsahuje standardní ověření pomocí uživatelského jména/hesla a tyto údaje jsou poskytnutí při přihlašování. Po přihlášení Vám doporučujeme ověřit připojení k síti pomocí příkazu ``ping``.

source: The Dashboard enables web-based interactions with the OpenStack Compute cloud controller through the OpenStack APIs.
cs: Nástěnka umožňuje pracovat s kontrolérem výpočtového cloud Openstack pomocí OpenStack API.
