Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: OpenStack and supporting services require administrative privileges during installation and operation. In some cases, services perform modifications to the host that can interfere with deployment automation tools such as Ansible, Chef, and Puppet. For example, some OpenStack services add a root wrapper to ``sudo`` that can interfere with security policies. See the `Cloud Administrator Guide <http://docs.openstack.org/ admin-guide-cloud/compute-root-wrap-reference.html>`__ for more information.
cs: OpenStack a podpůrné služby vyžaduje správcovská oprávnění během instalace a provozu. V některých případech služby provádějí změny v hostiteli, které mohou bránit v zavedení nástrojů pro automatizaci jako např. Ansible, Chef a Puppet. Například, některé služby OpenStack přidává obal uživatele root do ``sudo``, což může způsobit problém v bezpečnostních zásadách. Pro další informace si přečtěte `Příručku správců Cloudu <http://docs.openstack.org/ admin-guide-cloud/compute-root-wrap-reference.html>`__.

source: OpenStack generates IDs dynamically, so you will see different values in the example command output.
cs: OpenStack ID vytváří dynamicky, proto ve výstupu příkazu můžete vidět různé hodnoty.

source: OpenStack packages
bn_in: ওপেনস্ট্যাক প্যাকেজগুলি দেখুন ।
cs: Balíčky OpenStack
ru: Пакеты OpenStack

source: OpenStack services support various security methods including password, policy, and encryption. Additionally, supporting services including the database server and message broker support at least password security.
cs: Služby OpenStack podporují různé metody zabezpečení včetně hesla, zásad a šifrování. U podpůrných služeb, jako podpora databázového serveru a zprostředkovatele zpráv, lze vždy využít alespoň zabezpečení heslem.
ru: Службы OpenStack поддерживают различные механизмы безопасности, включая пароли, политики и шифрование. Дополнительно, вспомогательные службы, включающие сервер баз данных и брокер сообщений, поддерживают как минимум пароли.

source: OpenStack uses a :term:`message queue` to coordinate operations and status information among services. The message queue service typically runs on the controller node. OpenStack supports several message queue services including `RabbitMQ <http://www.rabbitmq.com>`__, `Qpid <http://qpid.apache.org>`__, and `ZeroMQ <http://zeromq.org>`__. However, most distributions that package OpenStack support a particular message queue service. This guide implements the RabbitMQ message queue service because most distributions support it. If you prefer to implement a different message queue service, consult the documentation associated with it.
cs: Openstack používá :term:`frontu zpráv <message queue>` pro sladění operací a informací o stavu napříč službami. Služba fronty zpráv většinou běží na uzlu kontroléru. OpenStack podpora několik služeb front zpráv včetně `RabbitMQ <http://www.rabbitmq.com>`__, `Qpid <http://qpid.apache.org>`__ a `ZeroMQ <http://zeromq.org>`__. Nicméně většina distribucí spravující balíčky OpenStack podporují konkrétní službu fronty zpráv. Tento průvodce pracuje s RabbitMQ, protože jej většina distribucí podporuje. Pokud chcete použít jinou službu, přečtěte si její dokumentaci.
ru: OpenStack использует понятие 'очереди сообщений' для координации производимых операций и информации о статусах между сервисами. Сервис очереди сообщений обычно запущен на узле контроллера. OpenStack поддерживает несколько сервисов очередей сообщений, включая `RabbitMQ <http://www.rabbitmq.com>`__, `Qpid <http://qpid.apache.org>`__, и `ZeroMQ <http://zeromq.org>`__. Однако, большинство дистрибутивов, в которые входит OpenStack, поддерживают какой-то определённый сервис очереди сообщений. Это руководство поможет в установке RabbitMQ, так как большее количество дистрибутивов его поддерживает. Если вы предпочитаете использовать другой сервис очереди сообщений, обратитесь к соответствующей ему документации.

source: OpenStack uses three API endpoint variants for each service: admin, internal, and public. The admin API endpoint allows modifying users and tenants by default, while the public and internal APIs do not allow these operations. In a production environment, the variants might reside on separate networks that service different types of users for security reasons. For instance, the public API network might be visible from the Internet so customers can manage their clouds. The admin API network might be restricted to operators within the organization that manages cloud infrastructure. The internal API network might be restricted to the hosts that contain OpenStack services. Also, OpenStack supports multiple regions for scalability. For simplicity, this guide uses the management network for all endpoint variations and the default ``RegionOne`` region.
cs: OpenStack využívá tři druhý koncových bodů API pro každou službu: admin, internal a public. Koncový bod API admin standardně umožňuje změnu uživatelů a nájemníků, zatímco API internal a public toto neumožňují. V ostrém provozu mohou být z bezpečnostních důvodů tyto druhy umístěny na oddělených sítích stejné služby. Například, síť pro public API může být dostupná z internetu zákazníkům, aby mohli spravovat své cloudy. Síť pro admin API může být omezena správcům v organizaci, kteří se starají o infrastrukturu cloudu. Síť pro internal API může být dostupná pouze hostitelům provozující služby OpenStack. Pro škálovatelnost OpenStack podporuje více oblastí. Pro zjednodušení tento průvodce používá síť pro správu u všech druhů koncových bodů a výchozí oblast ``RegionOne``.

source: Option 2 augments option 1 with the layer-3 (routing) service and enables self-service (private) networks. If you want to use public (provider) and private (self-service) networks, choose option 2.
cs: Volba 2 vylepšuje volbu 1 o layer-3 službu (přesměrování) a umožňuje samoobslužné (soukromé) sítě. Pokud chcete používat veřejné (od poskytovatele) a soukromé (samoobslužné) sítě, zvolte volbu 2.

source: Optionally, configure the time zone:
cs: Můžete také nastavit časové pásmo:
ru: Дополнительно можно настроить часовой пояс:

source: Orchestration
bn_in: অর্কেস্ট্রারচন
cs: Orchestrace
ru: Оркестрация

source: Orchestration requires additional information in the Identity service to manage stacks. To add this information, complete these steps:
cs: Pro správu zásobníků potřebuje služba orchestrace další údaje. Pro jejich přidání proveďte tyto kroky:

source: Other nodes
bn_in: অন্যান্য নোড
cs: Ostatní uzle
ru: На других узлах

source: Other nodes reference the controller node for clock synchronization. Perform these steps on all other nodes.
bn_in: অন্য নোডগুলি ক্লক সিঙ্ক্রোনাইজেশনের জন্য কন্ট্রোলার নোডে উল্লেখ করে। অন্য সমস্ত নোডে এই পদক্ষেপগুলি পরিবর্তন করুন।
cs: Ostatní uzly se spoléhají na uzel kontroléru pro synchronizaci hodin. Tyto kroky proveďte na ostatních uzlech.

source: Overlay networks such as VXLAN include additional packet headers that increase overhead and decrease space available for the payload or user data. Without knowledge of the virtual network infrastructure, instances attempt to send packets using the default Ethernet :term:`maximum transmission unit (MTU)` of 1500 bytes. :term:`Internet protocol (IP)` networks contain the :term:`path MTU discovery (PMTUD)` mechanism to detect end-to-end MTU and adjust packet size accordingly. However, some operating systems and networks block or otherwise lack support for PMTUD causing performance degradation or connectivity failure.
cs: Překryvné sítě jako VXLAN odesílají dodatečné hlavičky paketů, čímž zvyšují čas pro zpracování a snižují prostor vyhrazený pro obsah nebo data uživatelů. Bz znalostí infrastruktury virtuální sítě se instance pokusí odeslat pakety pomocí výchozí :term:`maximální přenosové jednotky (MTU) <maximum transmission unit (MTU)>` Ethernetu mající velikost 1500 bajtů. Sítě :term:`Internetového protokolu (IP) <Internet protocol (IP)>` mají možnost jak zjistit počáteční i koncové MTU a upravovat velikost paketů pomocí :term:`cesty ke zjištění MTU (PMTUD) <path MTU discovery (PMTUD)>`. Některé operační systémy a sítě ale blokují nebo nepodporují PMTUD, čímž způsobují zhoršení výkony, nebo selhání připojení.

source: Overview
bn_in: সংক্ষিপ্ত বিবরণ
cs: Přehled
ru: Обзор

source: Password name
bn_in: পাসওয়ার্ডের নাম দেখুন ।
cs: Název hesla
ru: Имя пароля

source: Password of Block Storage service user ``cinder``
bn_in: ব্লক স্টোরেজ সার্ভিস ব্যবহারকারীর পাসওয়ার্ড হচ্ছে ``cinder``
cs: Heslo pro uživatele služby blokového úložiště ``cinder``
ru: Пароль пользователя ``cinder`` сервиса блочных хранилищ

source: Password of Compute service user ``nova``
bn_in: কম্পিউট সার্ভিস ইউজার এর পাসওয়ার্ড হচ্ছে `` nova``
cs: Heslo pro uživatele služby výpočtu ``nova``
ru: Пароль пользователя ``nova `` сервиса Вычислительных ресурсов

source: Password of Image service user ``glance``
bn_in: ইমেজ সার্ভিস ইউজার এর পাসওয়ার্ড ``glance``
cs: Heslo pro uživatele služby obrazů ``glance``

source: Password of Networking service user ``neutron``
bn_in: নেটওয়ার্কিং সার্ভিস এর ইউজার পাসওয়ার্ড হচ্ছে ``neutron``
cs: Heslo pro uživatele služby sítí ``neutron``
ru: Пароль пользователя ``neutron `` сервиса управления сетью

source: Password of Object Storage service user ``swift``
cs: Heslo pro uživatele služby úložiště objektů ``swift``

source: Password of Orchestration domain
cs: Heslo pro doménu orchestrace

source: Password of Orchestration service user ``heat``
cs: Heslo pro uživatele služby orchestrace ``heat``

source: Password of Telemetry service user ``ceilometer``
cs: Heslo pro uživatele služby telemetrie ``ceilometer``

source: Password of user ``admin``
bn_in: ব্যবহারকারীর পাসওয়ার্ড ``admin``
cs: Heslo pro uživatele ``admin``
ru: Пароль пользователя ``admin``

source: Password of user ``demo``
bn_in: ইউজার এর পাসওয়ার্ড হচ্ছে ``demo``
cs: Heslo pro uživatele ``demo``
ru: Пароль пользователя ``demo``

source: Password of user guest of RabbitMQ
cs: Heslo pro uživatele guest pro RabbitMQ
ru: Пароль гостевого пользователя RabbitMQ

source: Perform these commands on the controller node.
cs: Proveďte tyto příkazy na uzlu kontroléru.
ru: Выполните эти команды на управляющем узле.

source: Perform these steps on the controller and any other nodes that run the Object Storage proxy service.
cs: Proveďte tyto kroy na kontroléru a všech ostatních uzlech, na kterých běží proxy služba úložiště objektů.

source: Perform these steps on the controller node.
bn_in: কন্ট্রোলার নোডে এই স্টেপগুলি সম্পাদন করুন।
cs: Proveďte tyto kroky na uzlu kontroléru.

source: Perform these steps on the storage node.
cs: Proveďte tyto kroky na uzlu úložiště.
ru: Выполните следующие шаги на узле хранилища.

source: Permit :term:`ICMP` (ping):
cs: Povolte :term:`ICMP` (ping):

source: Permit configuration, write, and read access for the ``openstack`` user:
bn_in: "openstack" ব্যবহারকারীকে write এবং read করার অনুমতি দিনঃ
cs: Uživateli ``openstack`` povolte přístup pro nastavení, zápis a čtení:
ru: Разрешите изменение настроек, запись и чтение для пользователя ``openstack``:

source: Permit secure shell (SSH) access:
bn_in: সুরক্ষিত শেল (SSH) অ্যাক্সেসের অনুমতি দিনঃ
cs: Povolte přístup přes zabezpečený shell (SSH):
ru: Разрешите доступ до защищённой оболочки (SSH):

source: Ping this IP address from the controller node or any host on the public physical network:
cs: Zkontrolujte odezvu této IP adresy z uzlu kontroléru nebo jakéhokoli hostitele na veřejné fyzické síti:

source: Populate the Block Storage database:
cs: Zaplňte databázi blokového úložiště:
ru: Заполните базу данных сервиса Блочного хранилища:

source: Populate the Identity service database:
cs: Zaplňte databázi služby identit:
ru: Заполните базу данных службы Идентификации:

source: Populate the Image service database:
cs: Zaplňte databázi úložiště obrazů:
ru: Заполните базу данных сервиса управления образами:

source: Populate the Orchestration database:
cs: Zaplňte databázi orchestrace:

source: Pre-seed debconf prompts
cs: Předvyplnění dotazů debconf

source: Prerequisites
bn_in: পূর্বশর্ত
cs: Požadavky
ru: Предварительные требования

source: Private project network
cs: Soukromá síť projektu

source: Private project networks connect to public provider networks using a virtual router. Each router contains an interface to at least one private project network and a gateway on a public provider network.
cs: Soukromé sítě projektů se připojují k veřejným sítím poskytovatele pomocí virtuálního směrovače. Každý směrovač obsahuje rozhraní pro alespoň jednu soukromou síť projektu a bránu na veřejné síti poskytovatele.

source: Provide users with a public IP address, a username, and a password so they can access the dashboard through a web browser. In case of any SSL certificate connection problems, point the server IP address to a domain name, and give users access.
cs: Předat uživatelům veřejnou IP adresu, uživatelské jméno a heslo pro přístup na nástěnku pomocí internetového prohlížeče.. V případě jakýchkoli problému s připojením pomocí SSL certifikátu, můžete pomocí internetové domény odkazovat na IP adresu serveru a uživatelům dát přístup tímto způsobem.
ru: Предоставьте пользователям публичный IP адрес, имя пользователя и пароль, для того чтобы у них был доступ к панели управления через веб-браузер. В случае каких-либо проблем подключения, связных с SSL сертификатом, укажите IP адрес сервера доменному имени и предоставьте пользовательский доступ.

source: Public on 203.0.113.0/24 with gateway 203.0.113.1
cs: Veřejná na 203.0.113.0/24 s bránou 203.0.113.1

source: Public provider network
cs: Veřejná síť poskytovatele

source: RHEL and CentOS enable :term:`SELinux` by default. Install the ``openstack-selinux`` package to automatically manage security policies for OpenStack services:
bn_in: RHEL এবং CentOS সক্ষম: শব্দ: ডিফল্টরূপে `SELinux`। ওপেনস্ট্যাক সার্ভিস এর জন্য স্বয়ংক্রিয়ভাবে সিকোরিটি নীতিগুলি পরিচালনা করতে ``openstack-selinux`` প্যাকেজটি ইনস্টল করুন:
cs: RHEL a CentOS standardně povolují :term:`SELinux`. Nainstalujte balíček ``openstack-selinux`` pro automatickou správu bezpečnostních zásad služeb OpenStack:
ru: RHEL и CentOS по умолчанию активируют :term:`SELinux`. Установите пакет ``openstack-selinux``для автоматического управления политиками безопасности для сервисов OpenStack:

source: RabbitMQ credentials parameters
cs: Parametry ověřovacích údajů RabbitMQ

source: Reboot the system to activate the changes.
bn_in: পরিবর্তনগুলো সক্রিয় করার জন্য সিস্টেমটি বন্ধ করে আবার চালু করুন।
cs: Restartujte systém pro použití změn.
ru: Перезагрузите систему чтобы применить изменения.

source: Reconfiguring network interfaces will interrupt network connectivity. We recommend using a local terminal session for these procedures.
bn_in: নেটওয়ার্ক ইন্টারফেসগুলি পুনরায় কনফিগার করার ফলে নেটওয়ার্ক সংযোগ বিঘ্নিত হবে। তাই এই পদ্ধতিগুলির জন্য লোকাল টার্মিনাল সেশনটি ব্যবহার করার জন্য অনুমতি দিকে পারি।
cs: Nastavování síťových rozhraní přeruší spojení k síti. Pro tyto kroky doporučujeme použít místní terminál.
ru: Перенастройка сетевых интерфейсов сбросит сетевые соединения. Мы рекомендуем использовать локальную терминальную сессию для этих процедур.

source: Recursively change the ownership of the ``/etc/keystone`` directory:
cs: Rekurzivně změňte vlastnictví adresáře ``/etc/keystone``:
ru: Рекурсивно измените владельцев папки ``/etc/keystone``:

source: Register API endpoints
cs: Registrace koncových bodů API

source: Regular (non-admin) tasks should use an unprivileged project and user. As an example, this guide creates the ``demo`` project and user.
cs: Obyčejné úkony (ne pro správce) by měly využívat projekt a uživatele bez patřičných oprávnění. Jako ukázku vytváří tento průvodce projekt a uživatele ``demo``.

source: Reload the web server configuration:
cs: Znovu načtěte nastavení internetového serveru:
ru: Перезагрузите конфигурацию веб-сервера:

source: Remove the previously downloaded image file ``/tmp/cirros.img``:
cs: Odstraňte stažený obraz v minulém kroku ``/tmp/cirros.img``:

source: Replace ``ADMIN_PASS`` with the password you chose for the ``admin`` user in the Identity service.
cs: Nahraďte ``ADMIN_PASS`` vámi zvoleným heslem pro uživatele ``admin`` ve službě identit.
ru: Замените ``ADMIN_PASS`` на выбранный вами пароль для ``admin`` пользователя в идентификаторе.

source: Replace ``ADMIN_TOKEN`` with the authentication token that you generated in the section called :doc:`keystone-install`. For example:
cs: Nahraďte ``ADMIN_TOKEN`` příznakem ověření, který jste vytvořili v části :doc:`keystone-install`. Například:

source: Replace ``ADMIN_TOKEN`` with the random value that you generated in a previous step.
cs: Nahraďte ``ADMIN_TOKEN`` náhodnou hodnotou vytvořenou v předchozím kroku.

source: Replace ``CEILOMETER_DBPASS`` with a suitable password.
cs: Nahraďte ``CEILOMETER_DBPASS`` vhodným heslem.

source: Replace ``CEILOMETER_DBPASS`` with the password you chose for the Telemetry service database. You must escape special characters such as ':', '/', '+', and '@' in the connection string in accordance with RFC2396.
cs: Nahraďte ``CEILOMETER_DBPASS`` Vámi zvoleným heslem pro databázi služby telemetrie. Speciální znaky jako např. ':', '/', '+', a '@' je třeba v řetězci připojení zamaskovat podle standardu RFC2396.

source: Replace ``CEILOMETER_PASS`` with the password you chose for the Telemetry service database.
cs: Nahraďte ``CEILOMETER_PASS`` vámi zvoleným heslem pro databázi služby telemetrie.

source: Replace ``CEILOMETER_PASS`` with the password you chose for the ``ceilometer`` user in the Identity service.
cs: Nahraďte ``CEILOMETER_PASS`` vámi zvoleným heslem pro uživatele ``ceilometer`` ve službě identit.

source: Replace ``CINDER_DBPASS`` with a suitable password.
cs: Nahraďte ``CINDER_DBPASS`` vhodným heslem.
ru: Замените ``CINDER_DBPASS `` подходящим паролем.

source: Replace ``CINDER_DBPASS`` with the password you chose for the Block Storage database.
cs: Nahraďte ``CINDER_DBPASS`` vámi zvoleným heslem pro databázi blokového úložiště.
ru: Замените ``CINDER_DBPASS `` паролем, который вы выбрали для базы данных блочных хранилищ.

source: Replace ``CINDER_PASS`` with the password you chose for the ``cinder`` user in the Identity service.
cs: Nahraďte ``CINDER_PASS`` vámi zvoleným heslem pro uživatele ``cinder`` ve službě identit.
ru: Замените ``CINDER_PASS `` паролем, который вы выбрали для пользователя ``cinder `` в идентификаторе.

source: Replace ``DEMO_PASS`` with the password you chose for the ``demo`` user in the Identity service.
cs: Nahraďte ``DEMO_PASS`` vámi zvoleným heslem pro uživatele ``demo`` ve službě identit.

source: Replace ``DNS_RESOLVER`` with the IP address of a DNS resolver. In most cases, you can use one from the ``/etc/resolv.conf`` file on the host.
bn_in: একটি DNS resolver আইপি ঠিকানা দিয়ে ``DNS_RESOLVER`` পুনরায় চালু করুন। বেশিরভাগ ক্ষেত্রে, আপনি হোস্টের ``/etc/resolv.conf`` ফাইল থেকে একটি ব্যবহার করতে পারেন।
cs: ``DNS_RESOLVER`` nahraďte IP adresou překladače DNS. Ve většině případů lze použít jednu ze souboru ``/etc/resolv.conf`` v hostiteli.
ru: Замените ``DNS_RESOLVER`` IP адресом DNS распознавателя. В большинстве случаев, вы можете использовать адрес из файла ``/etc/resolv.conf`` на хосте.

source: Replace ``GLANCE_DBPASS`` with a suitable password.
cs: Nahraďte ``GLANCE_DBPASS`` vhodným heslem.
ru: Замените ``GLANCE_DBPASS`` подходящим паролем.

source: Replace ``GLANCE_DBPASS`` with the password you chose for the Image service database.
cs: Nahraďte ``GLANCE_DBPASS`` vámi zvoleným heslem pro databázi služby obrazů.
ru: Замените ``GLANCE_DBPASS`` паролем, который вы выбрали для базы данных сервиса управления образами.

source: Replace ``GLANCE_PASS`` with the password you chose for the ``glance`` user in the Identity service.
cs: Nahraďte ``GLANCE_PASS`` vámi zvoleným heslem pro uživatele ``glance`` ve službě identit.
ru: Замените ``GLANCE_PASS`` паролем, который вы выбрали для пользователя ``glance`` в идентификаторе.

source: Replace ``HEAT_DBPASS`` with a suitable password.
cs: Nahraďte ``HEAT_DBPASS`` vhodným heslem.

source: Replace ``HEAT_DBPASS`` with the password you chose for the Orchestration database.
cs: Nahraďte ``HEAT_DBPASS`` vámi zvoleným heslem pro databázi orchestrace.

source: Replace ``HEAT_DOMAIN_PASS`` with the password you chose for the ``heat_domain_admin`` user in the Identity service.
cs: Nahraďte ``HEAT_DOMAIN_PASS`` vámi zvoleným heslem pro uživatele ``heat_domain_admin`` ve službě identit.

source: Replace ``HEAT_PASS`` with the password you chose for the ``heat`` user in the Identity service.
cs: Nahraďte ``HEAT_PASS`` vámi zvoleným heslem pro uživatele ``heat`` ve službě identit.

source: Replace ``INSTANCE_NAME`` with the name of the instance and ``VOLUME_ID`` with the ID of the volume you want to attach to it.
cs: Nahraďte ``INSTANCE_NAME`` názvem instance a ``VOLUME_ID`` ID svazku, který chcete k ní připojit.

source: Replace ``INTERFACE_NAME`` with the actual interface name. For example, *eth1* or *ens224*.
bn_in: ইন্টারফেসটি প্রকৃত ইন্টারফেস এর নামে পরিবর্তন করুন। যেমন, *eth1* অথবা *ens224*।
cs: Nahraďte ``INTERFACE_NAME`` skutečným názvem rozhraní. Například *eth1* nebo *ens224*.
ru: Замените ``INTERFACE_NAME`` реалным именем интерфейса. Например, *eth1* or *ens224*.

source: Replace ``KEYSTONE_DBPASS`` with a suitable password.
cs: Nahraďte ``KEYSTONE_DBPASS`` vhodným heslem.
ru: Замените ``KEYSTONE_DBPASS`` подходящим паролем.

source: Replace ``KEYSTONE_DBPASS`` with the password you chose for the database.
cs: Nahraďte ``Keystone_DBPASS`` vámi zvoleným heslem pro databázi.
ru: Замените ``KEYSTONE_DBPASS`` на пароль, который вы выбрали для базы данных.

source: Replace ``MANAGEMENT_INTERFACE_IP_ADDRESS`` with the IP address of the management network interface on your controller node.
cs: Nahraďte ``MANAGEMENT_INTERFACE_IP_ADDRESS`` IP adresou síťového rozhraní pro správu ve vašem uzlu kontroléru.

source: Replace ``MANAGEMENT_INTERFACE_IP_ADDRESS`` with the IP address of the management network interface on your storage node, typically 10.0.0.41 for the first node in the :ref:`example architecture <overview-example-architectures>`.
cs: Nahraďte ``MANAGEMENT_INTERFACE_IP_ADDRESS`` IP adresou síťového rozhraní pro správu ve vašem uzlu úložiště. Standardně 10.0.0.41 pro první uzel v :ref:`ukázkové architektuře <overview-example-architectures>`.
ru: Замените ``MANAGEMENT_INTERFACE_IP_ADDRESS`` IP адресом управляющего сетевого интерфейса на вашем узле хранилища, обычно это 10.0.0.41 для первого узла в :ref:`архитектуре примера <overview-example-architectures>`.

source: Replace ``NEUTRON_DBPASS`` with the password you chose for the database.
cs: Nahraďte ``Neutron_DBPASS`` vámi zvoleným heslem pro databázi.
ru: Замените ``NEUTRON_DBPASS`` на пароль, который вы выбрали для базы данных.

source: Replace ``NEUTRON_PASS`` with the password you chose for the ``neutron`` user in the Identity service.
cs: Nahraďte ``NEUTRON_PASS`` vámi zvoleným heslem pro uživatele ``neutron`` ve službě identit.
ru: Замените ``NEUTRON_PASS `` паролем, который вы выбрали для пользователя ``neutron`` в идентификаторе.

source: Replace ``NOVA_PASS`` with the password you chose for the ``nova`` user in the Identity service.
cs: Nahraďte ``NOVA_PASS`` vámi zvoleným heslem pro uživatele ``nova`` ve službě identit.
ru: Замените ``NOVA_PASS `` паролем, который вы выбрали для пользователя ``nova`` в службе идентификации.

source: Replace ``NTP_SERVER`` with the hostname or IP address of a suitable more accurate (lower stratum) NTP server. The configuration supports multiple ``server`` keys.
cs: Nahraďte ``NTP_SERVER`` názvem hoatitele nebo IP adresou vhodného, přesnějšího NTP serveru (s nižší vrstvou). Nastavení podporuje zadání více klíčů ``server``.
