Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: OpenStack uses a :term:`message queue` to coordinate operations and status information among services. The message queue service typically runs on the controller node. OpenStack supports several message queue services including `RabbitMQ <https://www.rabbitmq.com>`__, `Qpid <https://qpid.apache.org>`__, and `ZeroMQ <http://zeromq.org>`__. However, most distributions that package OpenStack support a particular message queue service. This guide implements the RabbitMQ message queue service because most distributions support it. If you prefer to implement a different message queue service, consult the documentation associated with it.
bn_in: ওপেনস্টেক সকল সমূহের মধ্যে সমন্বয় করা এবং সকল সার্ভিস সমূহের সার্বিক পরিস্থিতির তথ্য সংগ্রহ করতে "message queue" নামে একটি সার্ভিস ব্যবহার করে থাকে। "message queue" সার্ভিসটি সাধারনত কন্ট্রোলার নোডে চালু হয়। ওপেনস্টেক বিভিন্ন ধরনের message queue সার্ভিস সাপোর্ট করে। যেমনঃ "RabbitMQ <https://www.rabbitmq.com>"___,"Qpid <https://qpid.apache.org>"__,"ZeroMQ <http://zeromq.org>"__। যাহোক, অনেক ডিস্ট্রিবিউশনগুলোর ওপেনস্টেক প্যাকেজ নির্দিষ্ট ধরনের message queue সার্ভিস সাপোর্ট করে থাকে। এই গাইডে RabbitMQ message queue ব্যবহার করা হয়েছে কারণ, বেশিরভাগ ডিস্ট্রিবিউশন এটি সাপোর্ট করে। যদি আপনি অন্যটি ব্যবহার করতে আগ্রহী হন তাহলে সেটার সাথে সংশ্লিষ্ট ডুকুমেন্টেশন দেখুন।

source: Or download and install the etcd tarball for arm64:
bn_in: অথবা arm64 এর জন্য etcd tarball ডাউনলোড করুন এবং ইনস্টল করুনঃ

source: Orchestration (``heat``) endpoint
bn_in: অর্কেস্ট্রেশন (``heat``) শেষ পয়েন্ট

source: Orchestration AWS CloudFormation-compatible API (``openstack-heat-api-cfn``)
bn_in: অর্কেস্ট্রেশন AWS ক্লাউডফর্মেশন-সামঞ্জস্যপূর্ণ এপিআই (``openstack-heat-api-cfn``)

source: Orchestration AWS CloudWatch-compatible API (``openstack-heat-api-cloudwatch``)
bn_in: অর্কেস্ট্রেশন AWS ক্লাউডওয়াচ-কমপেটিবল এপিআই (``openstack-heat-api-cloudwatch``)

source: Password of RabbitMQ user ``openstack``
bn_in: RabbitMQ ইউজার এর পাসওয়ার্ড হচ্ছে``openstack``

source: Password of the Placement service user ``placement``
bn_in: প্লেসমেন্ট সার্ভিস ইউজার এর পাসওয়ার্ড হচ্ছে``placement``

source: Placement service – `placement installation for Stein <https://docs.openstack.org/placement/stein/install/>`_
bn_in: প্লেসমেন্ট সার্ভিস - স্টেইনের জন্য প্লেসমেন্ট ইনস্টলেশন <https://docs.openstack.org/placement/stein/install/>`_

source: Placement service – `placement installation for Train <https://docs.openstack.org/placement/train/install/>`_
bn_in: প্লেসমেন্ট সার্ভিস- ট্রেনের জন্য প্লেসমেন্ট ইনস্টলেশন <https://docs.openstack.org/placement/train/install/>`_

source: Placement service – `placement installation for Ussuri <https://docs.openstack.org/placement/ussuri/install/>`_
bn_in: প্লেসমেন্ট সার্ভিস - উসুরির জন্য প্লেসমেন্ট ইনস্টলেশন<https://docs.openstack.org/placement/ussuri/install/>`_

source: Provider on 203.0.113.0/24 with gateway 203.0.113.1
bn_in: প্রোভাইডার নেটওয়ার্ক 203.0.113.0/24 এবং গেইটওয়ে 203.0.113.1

source: Proxy port for HTML5 console used by Compute service
bn_in: কম্পিউট সার্ভিস দ্বারা ব্যবহৃত HTML5 কনসোলের জন্য প্রক্সি পোর্ট দেখুন ।

source: RHEL, CentOS and SUSE distributions enable a restrictive :term:`firewall` by default. During the installation process, certain steps will fail unless you alter or disable the firewall. For more information about securing your environment, refer to the `OpenStack Security Guide <https://docs.openstack.org/security-guide/>`_.
bn_in: RHEL, CentOS and SUSE ডিস্ট্রিবিউশনগুলো ডিফল্টভাবে একটি নিয়ন্ত্রণমূলক সার্ভিসঃ "firewall" সক্ষম করে রাখে। যদি আপনি ইনস্টলেশন চলা কালিন firewall সার্ভিসটি বন্ধ অথবা অক্ষম না করেন তাহলে কিছু ধাপ ব্যর্থ হতে পারে। আপনার সেটআপটি নিরাপদ করা সম্পর্কে আরও জানতে "ওপেনস্টেক এর নিরাপত্তামূলক গাইড <https://docs.openstack.org/security-guide/>" এ গিয়ে দেখতে পারেন।

source: RHEL, CentOS and SUSE distributions enable a restrictive :term:`firewall` by default. Ubuntu does not. For more information about securing your environment, refer to the `OpenStack Security Guide <https://docs.openstack.org/security-guide/>`_.
bn_in: RHEL, CentOS and SUSE ডিস্ট্রিবিউশনগুলো ডিফল্টভাবে একটি নিয়ন্ত্রণমূলক সার্ভিসঃ "firewall" সক্ষম করে রাখে। Ubuntu হবে না। আপনার ইনভারমেন্ট সুরক্ষিত করার বিষয়ে আরও তথ্যের জন্য, `OpenStack Security Guide দেখুন <https://docs.openstack.org/security-guide/>`_.

source: Reload systemd service files with:
bn_in: এর সাথে systemd service ফাইলগুলি পুনরায় চালু করুনঃ

source: Replace ``SELFSERVICE_NETWORK_CIDR`` with the subnet you want to use on the self-service network. You can use any arbitrary value, although we recommend a network from `RFC 1918 <https://tools.ietf.org/html/rfc1918>`_.
bn_in: আপনি সেল্ফ-সার্ভিস নেটওয়ার্কে যে সাবনেটটি ব্যবহার করতে চান তার সাথে ``SELFSERVICE_NETWORK_CIDR`` রিপ্লেস করুন। আপনি যেকোন মান ব্যবহার করতে পারেন, যদি আমরা RFC 1918 <https://tools.ietf.org/html/rfc1918>`_.থেকে একটি নেটওয়ার্ক রিকমান্ড করতে পারি ।

source: Restart the NTP service.
bn_in: NTP সার্ভিসটি পুনরায় চালু করুন।

source: Right now, there is no distro package available for etcd3. This guide uses the tarball installation as a workaround until proper distro packages are available.
bn_in: এই মূহুর্তে, Etcd এর জন্য কোন ডিস্ট্রো প্যাকেজ নেই। এই গাইডটি tarball থেকে ইনস্টল এর জন্য ব্যবহার করা হয়েছে। যতদিন পর্যন্ত ডিস্ট্রো প্যাকেজ তৈরি হবে না।

source: SQL database for RHEL and CentOS
bn_in: RHEL এবং CentOS এর জন্য SQL ডাটাবেস

source: SQL database for SUSE
bn_in: SUSE এর জন্য SQL ডাটাবেস দেখুন ।

source: SQL database for Ubuntu
bn_in: Ubuntu এর জন্য SQL ডাটাবেস দেখুন ।

source: Secret for the metadata proxy
bn_in: সিক্রেট এর জন্য মেটাডেটা প্রক্সিটি ব্যবহার করুন ।

source: Secure the database service by running the ``mysql_secure_installation`` script. In particular, choose a suitable password for the database ``root`` account:
bn_in: ``mysql_secure_installation`` স্ক্রিপ্ট চালিয়ে ডাটাবেস সার্ভিস সুরক্ষিত করুন। বিশেষত, ডাটাবেস ``root`` অ্যাকাউন্টের জন্য উপযুক্ত পাসওয়ার্ড পচন্দ করুন:

source: Self-service networks connect to provider networks using a virtual router that typically performs bidirectional NAT. Each router contains an interface on at least one self-service network and a gateway on a provider network.
bn_in: সেল্ফ-সার্ভিস নেটওয়ার্কগুলি একটি ভার্চুয়াল রাউটার ব্যবহার করে প্রোভাইডার নেটওয়ার্কগুলিতে সংযোগ করে যা সাধারণত bidirectional NAT চালু করে। প্রতিটি রাউটারে কমপক্ষে একটি সেল্ফ-সার্ভিস নেটওয়ার্ক এবং একটি প্রোভাইডার নেটওয়ার্ক একটি গেটওয়েতে একটি ইন্টারফেস থাকে।

source: Source the ``demo`` project credentials:
bn_in: র্সোস করুন ``demo``প্রোজেক্ট আস্থাপত্রটি

source: The :term:`OpenStack` project is an open source cloud computing platform that supports all types of cloud environments. The project aims for simple implementation, massive scalability, and a rich set of features. Cloud computing experts from around the world contribute to the project.
bn_in: শব্দটি: `ওপেনস্ট্যাক` প্রকল্পটি একটি ওপেন সোর্স ক্লাউড কম্পিউটিং প্ল্যাটফর্ম যা সকল ধরণের ক্লাউড ইনভারমেন্টকে সার্পোট করে। প্রকল্পটির লক্ষ্য সাধারণ বাস্তবায়ন, বিশাল পরিমাণের স্কেলাবিলিটি এবং বৈশিষ্ট্যগুলির একটি সমৃদ্ধ সেট। বিশ্বজুড়ে ক্লাউড কম্পিউটিং বিশেষজ্ঞরা এই প্রকল্পে অবদান রাখেন।

source: The Networking service assumes default values for kernel network parameters and modifies firewall rules. To avoid most issues during your initial installation, we recommend using a stock deployment of a supported distribution on your hosts. However, if you choose to automate deployment of your hosts, review the configuration and policies applied to them before proceeding further.
bn_in: নেটওয়ার্কিং সার্ভিস কার্নেল নেটওয়ার্ক পরিমিতিগুলির জন্য ডিফল্ট মান ধরে এবং ফায়ারওয়াল বিধিগুলিকে সংশোধন করে। আপনার প্রাথমিক ইনস্টলেশন চলাকালীন সময় বেশিরভাগ সমস্যা এড়াতে, আমরা আপনার হোস্টগুলিতে সাপােটেড ডিস্ট্রিবিউশন স্টক ডেপ্লোমেন্ট ব্যবহার করার পরামর্শ দিচ্ছি। তবে, আপনি যদি আপনার হোস্টগুলি ডেপ্লোমেন্ট এর কাজটি স্বয়ংক্রিয়ভাবে বেছে নিতে চান তবে সামনের দিকে যাওয়ার আগে কনফিগারেশন এবং সেগুলি প্রয়োগ করা নীতিগুলি পর্যালোচনা করুন।

source: The OpenStack architecture
bn_in: ওপেনস্ট্যাক আর্কিটেকচার

source: The OpenStack project is an open source cloud computing platform for all types of clouds, which aims to be simple to implement, massively scalable, and feature rich. Developers and cloud computing technologists from around the world create the OpenStack project.
bn_in: ওপেনস্ট্যাক প্রজেট হলো সকল ধরণের ক্লাউড এর জন্য একটি ওপেন সোর্স ক্লাউড কম্পিউটিং প্ল্যাটফর্ম, যার লক্ষ্য বাস্তবায়নের জন্য সহজ, বৃহত্তর আকারে পরিমাপযোগ্য এবং সমৃদ্ধ বৈশিষ্ট্যযুক্ত। বিশ্বজুড়ে ডেভেলপার এবং ক্লাউড কম্পিউটিং প্রযুক্তিবিদগণ ওপেনস্ট্যাক প্রকল্প তৈরি করে।

source: The OpenStack services
bn_in: ওপেনস্ট্যাক সার্ভিসগুলি

source: The RDO repository RPM installs the latest available OpenStack release.
bn_in: RDO রিপোজটরি RPM সর্বশেষ উপলব্ধ ওপেনস্ট্যাক রিলিজ ইনস্টল করে।

source: The `OpenStack project navigator <https://www.openstack.org/software/project-navigator/openstack-components>`_ lets you browse the OpenStack services that make up the OpenStack architecture. The services are categorized per the service type and release series.
bn_in: `ওপেনস্ট্যাক প্রোজেট নেভিগেটর <https://www.openstack.org/software/project-navigator/openstack-components>`_ আপনাকে ওপেনস্ট্যাক সার্ভিসগুলি ব্রাউজ করতে দেয়া হয় যেটি ওপেনস্ট্যাক আর্কিটেকচার তৈরি করে। সার্ভিসগুলির ধরণ এবং প্রকাশের সিরিজ অনুযায়ী শ্রেণিবদ্ধ করা হয়।

source: The ``--external`` option defines the virtual network to be external. If you wish to create an internal network, you can use ``--internal`` instead. Default value is ``internal``.
bn_in: এই ``--external`` অপশনটি ভার্চুয়াল নেটওয়ার্কটিকে বাহ্যিক হিসাবে সংজ্ঞায়িত করে। যদি আপনি কোনও ইন্টারনাল নেটওয়ার্ক তৈরি করতে চান তবে আপনি ``--internal`` ইউজ ব্যবহার করতে পারেন। ডিফল্ট মান ``internal``. দেখায় ।

source: The etcd service runs on the controller node.
bn_in: Etcd সার্ভিসটি কন্ট্রোলার নোড এ চালু হবে।

source: The following diagram shows the most common, but not the only possible, architecture for an OpenStack cloud:
bn_in: নিম্নলিখিত ডায়াগ্রামটি ওপেনস্ট্যাক ক্লাউড এর জন্য অধিকাংশ কমন, তবে একমাত্র সম্ভব নয়, আর্কিটেকচারটি দেখায়:

source: The following diagram shows the relationships among the OpenStack services:
bn_in: নিম্নলিখিত ডায়াগ্রামটি ওপেনস্ট্যাক সার্ভিসটির মধ্যে সম্পর্কগুলি দেখায়:

source: The following minimum requirements should support a proof-of-concept environment with core services and several :term:`CirrOS` instances:
bn_in: নিম্নলিখিত মিনিমাম প্রয়োজনীয়তাগুলি মূল সার্ভিস এবং বেশ কয়েকটি সহ একটি প্রমাণ-ধারণা ধারণাটি সমর্থন করে: পদ:`CirrOS` দৃষ্টান্ত:

source: The following sections describe the OpenStack architecture in more detail:
bn_in: নিম্নলিখিত বিভাগগুলি আরও বিস্তারিত ওপেনস্ট্যাক আর্কিটেকচারের বর্ণনা করে ।

source: The following steps apply to RHEL only. CentOS does not require these steps.
bn_in: নিম্নলিখিত পদক্ষেপগুলি কেবল RHEL এর জন্য প্রযোজ্য। CentOS এই পদক্ষেপগুলির প্রয়োজন হয় না।

source: The following table provides a list of services that require passwords and their associated references in the guide.
bn_in: নিম্নলিখিত টেবিলটি সার্ভিস একটি তালিকা সরবরাহ করে যা পাসওয়ার্ড এবং গাইডের সাথে সম্পর্কিত রেফারেন্সগুলির প্রয়োজন হয়।

source: The installation of individual OpenStack services is covered in the Project Installation Guides that are available at the following locations:
bn_in: ব্যক্তিগত ওপেনস্ট্যাক সার্ভিসগুলির ইনস্টলেশনটি নিম্নলিখিত ইনস্টলেশনগুলিতে কভার্ড প্রজেক্ট ইনস্টলেশন গাইডগুলিতে অবস্থানগুলি রয়েছে:

source: The instructions in this section use command-line interface (CLI) tools on the controller node. However, you can follow the instructions on any host that the tools are installed.
bn_in: এই বিভাগের নির্দেশাবলী কন্ট্রোলার নোডে কমান্ড-লাইন ইন্টারফেস (CLI) সরঞ্জাম ব্যবহার করে। তবে, আপনি যে কোনও হোস্টের যে সরঞ্জামগুলি ইনস্টল করা হয়েছে তার নির্দেশাবলী অনুসরণ করতে পারেন।

source: The provider network must include the ``router:external`` option to enable self-service routers to use it for connectivity to external networks such as the Internet. The ``admin`` or other privileged user must include this option during network creation or add it later. In this case, the ``router:external`` option was set by using the ``--external`` parameter when creating the ``provider`` network.
bn_in: প্রোভাইডার নেটওয়ার্কটিতে অবশ্যই ইন্টারনেটের মতো বাহ্যিক নেটওয়ার্কগুলিতে সংযোগের জন্য এটি সেল্ফ-সার্ভিস রাউটারগুলিকে চালু করার জন্য-``router:external`` অপশনটি অন্তর্ভুক্ত করতে হবে। নেটওয়ার্ক তৈরির সময় অপশন ``admin`` বা অন্যান্য সুবিধাভোগী ইউজারকে অবশ্যই এই অপশনটি অন্তর্ভুক্ত করতে হবে বা এটি পরে যুক্ত করতে হবে। এই ক্ষেত্রে, ``router:external`` ``--external`` পারামেটার ব্যবহার করে ``provider`` নেটওয়ার্ক তৈরি করার সময় সেট করা হয়েছিল কিনা দেখতে হবে ।

source: The self-service network uses 172.16.1.0/24 with a gateway on 172.16.1.1. A DHCP server assigns each instance an IP address from 172.16.1.2 to 172.16.1.254. All instances use 8.8.4.4 as a DNS resolver.
bn_in: সেল্ফ-সার্ভিস নেটওয়ার্ক 172.16.1.0/24 এবং 172.16.1.1 এ একটি গেটওয়ে সহ ব্যবহার করে। একটি DHCP সার্ভার প্রতিটি উদাহরণ 172.16.1.2 থেকে 172.16.1.254 পর্যন্ত একটি আইপি ঠিকানা বরাদ্দ করে। সকল ইনস্টেস 8.8.4.4 DNS রিস্লবার হিসাবে ব্যবহার করে।

source: This guide covers step-by-step deployment of the major OpenStack services using a functional example architecture suitable for new users of OpenStack with sufficient Linux experience. This guide is not intended to be used for production system installations, but to create a minimum proof-of-concept for the purpose of learning about OpenStack.
bn_in: এই গাইডটিতে ওপেনস্ট্যাকের নতুন ব্যবহারকারীদের জন্য পর্যাপ্ত লিনাক্স অভিজ্ঞতার জন্য উপযুক্ত একটি কার্যকরী উদাহরণ আর্কিটেকচার ব্যবহার করে প্রধান ওপেনস্ট্যাক সার্ভিসের পদক্ষেপে মোতায়েনের ব্যবস্থা রয়েছে। এই গাইডটি উত্পাদন সিস্টেমের ইনস্টলেশনের জন্য ব্যবহার করার উদ্দেশ্যে নয়, ওপেনস্ট্যাক সম্পর্কে শেখার উদ্দেশ্যে একটি ন্যূনতম প্রুফ-অফ-ধারণা তৈরি করা

source: This section creates the necessary virtual networks to support launching instances. Networking option 1 includes one provider (external) network with one instance that uses it. Networking option 2 includes one provider network with one instance that uses it and one self-service (private) network with one instance that uses it.
bn_in: এই বিভাগটি প্রবর্তনকারী দৃষ্টান্তগুলি সমর্থন করার জন্য প্রয়োজনীয় ভার্চুয়াল নেটওয়ার্কগুলি তৈরি করে। নেটওয়ার্কিং বিকল্প 1 এর মধ্যে একটি প্রোভাইডার (external) নেটওয়ার্ক রয়েছে যার একটি ইনস্টেস রয়েছে । নেটওয়ার্কিং অপশন 2 এর মধ্যে একটি ইনস্টেস প্রদানকারী একটি প্রোভাইডার নেটওয়ার্ক এবং এটি ব্যবহার করে এমন একটি ইনস্টেস সহ একটি সেল্ফ-সার্ভিস (private) নেটওয়ার্ক অন্তর্ভুক্ত রয়েছে।

source: This table lists the ports that other OpenStack components use:
bn_in: এই টেবিলটি অন্যান্য ওপেনস্ট্যাক উপাদানগুলি ব্যবহার করে এমন পোর্টগুলি তালিকাভুক্ত করে:

source: To design, deploy, and configure OpenStack, administrators must understand the logical architecture.
bn_in: ওপেনস্ট্যাকের ডিজাইন, ডেপ্লো এবং কনফিগার করতে অ্যাডমিনিস্ট্রেশন অবশ্যই লজিকাল আর্কিটেকচারটি বুঝতে হবে।

source: To enable other nodes to connect to the chrony daemon on the controller node, add this key to the same ``chrony.conf`` file mentioned above:
bn_in: কন্ট্রোলার নোডের chrony daemon এর সাথে যোগাযোগ রাখার জন্য অন্য নোডগুলিকে যুক্ত করতে, এই key টি একই `` chrony.conf`` ফাইলের সাথে mentioned above এ যুক্ত করুন ।

source: To function properly, some OpenStack components depend on other, non-OpenStack services. For example, the OpenStack dashboard uses HTTP for non-secure communication. In this case, you must configure the firewall to allow traffic to and from HTTP.
bn_in: সঠিকভাবে কাজ করতে, কিছু ওপেনস্ট্যাক উপাদানগুলি অন্যান্য, non-OpenStack সার্ভিসের উপর নির্ভর করে। উদাহরণস্বরূপ, ওপেনস্ট্যাক ড্যাশবোর্ডটি নিরাপদ যোগাযোগের জন্য HTTP ব্যবহার করে। এই ক্ষেত্রে, আপনাকে HTTP থেকে এবং ট্রাফিকের অনুমতি দেওয়ার জন্য ফায়ারওয়ালটি কনফিগার করতে হবে।

source: To manually configure a firewall, you must permit traffic through the ports that each OpenStack service uses. This table lists the default ports that each OpenStack service uses:
bn_in: একটি ফায়ারওয়াল ম্যানুয়ালি কনফিগার করতে, আপনাকে প্রতিটি ওপেনস্ট্যাক সার্ভিস ব্যবহার করে এমন পোর্টগুলির মাধ্যমে ট্র্যাফিকের অনুমতি দিতে হবে। এই টেবিলটি প্রতিটি ওপেনস্ট্যাক সার্ভিস ব্যবহার করে এমন ডিফল্ট পোর্টগুলি তালিকাভুক্ত করে:

source: To properly synchronize services among nodes, you can install Chrony, an implementation of :term:`NTP <Network Time Protocol (NTP)>`. We recommend that you configure the controller node to reference more accurate (lower stratum) servers and other nodes to reference the controller node.
bn_in: নোডগুলির মধ্যে সার্ভিসগুলি সঠিকভাবে সিঙ্ক্রোনাইজ করতে আপনি Chrony ইনস্টল করতে পারেন, এটি একটি শব্দ: `NTP <Network Time Protocol (NTP)>` এর প্রয়োগ ` আমরা আপনাকে পরামর্শ দিচ্ছি যে আপনি কন্ট্রোলার নোডকে আরও সঠিক (নিম্ন স্তরের) সার্ভার এবং অন্যান্য নোডের রেফারেন্সের জন্য নিয়ন্ত্রণকারী নোডটি কনফিগার করুন।

source: To use the dashboard, see the `Dashboard User Documentation for Pike <https://docs.openstack.org/horizon/pike/user/>`_, the `Dashboard User Documentation for Queens <https://docs.openstack.org/horizon/queens/user/>`_, or the `Dashboard User Documentation for Rocky <https://docs.openstack.org/horizon/rocky/user/>`_.
bn_in: ড্যাশবোর্ড ইউজ করতে পাইকের জন্য `ড্যাশবোর্ড ইউজার ডকুমেন্টেশন দেখুন<https://docs.openstack.org/horizon/pike/user/>`_,কুইন্সের জন্য `ড্যাশবোর্ড ইউজার ডকুমেন্টেশন<https://docs.openstack.org/horizon/queens/user/>`_,বা রকির জন্য `ড্যাশবোর্ড ইউজার ডকুমেন্টেশন<https://docs.openstack.org/horizon/rocky/user/>`_.

source: Ubuntu does not enable a restrictive :term:`firewall` by default. For more information about securing your environment, refer to the `OpenStack Security Guide <https://docs.openstack.org/security-guide/>`_.
bn_in: Ubuntu ডিফল্টভাবে একটি নিয়ন্ত্রণমূলক সার্ভিসঃ "firewall" সক্ষম করে না। আপনার সেটআপটি নিরাপদ করা সম্পর্কে আরও জানতে "ওপেনস্টেক এর নিরাপত্তামূলক গাইড <https://docs.openstack.org/security-guide/>" এ গিয়ে দেখতে পারেন।

source: Ubuntu has changed the network interface naming concept. Refer `Changing Network Interfaces name Ubuntu 16.04 <https://askubuntu.com/questions/767786/changing-network-interfaces-name-ubuntu-16-04>`_.
bn_in: Ubuntu নেটওয়ার্ক ইন্টারফেসের নামকরণের ধারণাটি পরিবর্তন করেছে। দেখুন নেটওয়ার্ক ইন্টারফেসের নাম পরিবর্তন করে Ubuntu 16.04 <https://askubuntu.com/questions/767786/changing-network-interfaces-name-ubuntu-16-04>`_.

source: Ubuntu releases OpenStack with each Ubuntu release. Ubuntu LTS releases are provided every two years. OpenStack packages from interim releases of Ubuntu are made available to the prior Ubuntu LTS via the Ubuntu Cloud Archive.
bn_in: Ubuntu প্রতিটি Ubuntu রিলিজ এর সাথে ওপেনস্ট্যাক প্রকাশ করে। Ubuntu LTS রিলিজ প্রতি দুই বছর অন্তর সরবরাহ করা হয়। Ubuntu অন্তর্বর্তীকালীন প্রকাশের ওপেনস্ট্যাক প্যাকেজগুলি Ubuntu ক্লাউড আর্কাইভের মাধ্যমে পূর্ববর্তী Ubuntu LTS উপলব্ধ করা হয়েছে।

source: Unless you intend to use the exact configuration provided in this example architecture, you must modify the networks in this procedure to match your environment. Each node must resolve the other nodes by name in addition to IP address. For example, the ``controller`` name must resolve to ``10.0.0.11``, the IP address of the management interface on the controller node.
bn_in: আপনি যদি এই উদাহরণটি আর্কিটেকচারে প্রদত্ত সঠিক কনফিগারেশনটি ব্যবহার না করতে চান তাহলে আপনার পরিবেশের সাথে মিলে যাওয়ার জন্য আপনাকে অবশ্যই এই পদ্ধতিতে নেটওয়ার্কগুলি পরিবর্তন করতে হবে। প্রতিটি নোডের অবশ্যই আইপি ঠিকানা ছাড়াও অন্যান্য নোডকে নামের সাথে সমাধান করতে হবে। উদাহরণস্বরূপ, ``controller`` নামটি অবশ্যই কন্ট্রোলার নোডের মেনেজমেন্ট ইন্টারফেসের আইপি ঠিকানা ``. 10.0.0.11`` এ সমাধান করতে হবে।

source: Upgrade packages on all nodes:
bn_in: সবগুলী নোডে প্যাকেজ আপগ্রেড করুন:

source: Upgrade the packages on all nodes:
bn_in: সবগুলাে নোডে প্যাকেজগুলি আপগ্রেড করুন:

source: We advise to also install the following components after you have installed the minimal deployment services:
bn_in: আপনি ন্যূনতম ড্যাপ্লোমেন্ট সার্ভিস ইনস্টল করার পরে নিম্নলিখিত উপাদানগুলি ইনস্টল করতে পারেনঃ

source: We recommend that you verify operation and fix any issues before proceeding. The following steps use the IP address ranges from the network and subnet creation examples.
bn_in: আমরা আপনাকে অপারেশন যাচাই করতে এবং সামনের দিকে যাওয়ার আগে কোনও সমস্যা হলে তা সমাধান করতে হবে । নিম্নলিখিত পদক্ষেপগুলি নেটওয়ার্ক এবং সাবনেট তৈরির সতর্কীকরণ থেকে আইপি এড্রেস রেঞ্জ ব্যবহার করতে হবে ।

source: Workflow service (``Mistral``)
bn_in: ওয়ার্কপ্লো সার্ভিস (``Mistral``)

source: `Object Storage Installation Guide for Pike <https://docs.openstack.org/swift/pike/install/>`_
bn_in: পাইকের জন্য অবজেক্ট স্টোরেজ ইনস্টলেশন গাইড দেখুন <https://docs.openstack.org/swift/pike/install/>`_

source: `Object Storage Installation Guide for Queens <https://docs.openstack.org/swift/queens/install/>`_
bn_in: কুইন্স এর জন্য অবজেক্ট স্টোরেজ ইনস্টলেশন গাইড দেখুন <https://docs.openstack.org/swift/queens/install/>`_

source: `Object Storage Installation Guide for Rocky <https://docs.openstack.org/swift/rocky/install/>`_
bn_in: রকির এর জন্য অবজেক্ট স্টোরেজ ইনস্টলেশন গাইড দেখুন <https://docs.openstack.org/swift/rocky/install/>`_

source: `Object Storage Installation Guide for Stein <https://docs.openstack.org/swift/stein/install/>`_
bn_in: স্টেইনের এর জন্য অবজেক্ট স্টোরেজ ইনস্টলেশন গাইড দেখুন <https://docs.openstack.org/swift/stein/install/>`_

source: `OpenStack Installation Guides for Pike <https://docs.openstack.org/pike/install/>`_
bn_in: পাইক জন্য ওপেনস্ট্যাক ইনস্টলেশন গাইড <https://docs.openstack.org/pike/install/>`_

source: `OpenStack Installation Guides for Queens <https://docs.openstack.org/queens/install/>`_
bn_in: কুইন্স জন্য ওপেনস্ট্যাক ইনস্টলেশন গাইড <https://docs.openstack.org/queens/install/>`_

source: `OpenStack Installation Guides for Rocky <https://docs.openstack.org/rocky/install/>`_
bn_in: রকি জন্য ওপেনস্ট্যাক ইনস্টলেশন গাইড <https://docs.openstack.org/rocky/install/>`_

source: `OpenStack Installation Guides for Stein <https://docs.openstack.org/stein/install/>`_
bn_in: স্টেইন জন্য ওপেনস্ট্যাক ইনস্টলেশন গাইড <https://docs.openstack.org/stein/install/>`_

source: `OpenStack Installation Guides for Train <https://docs.openstack.org/train/install/>`_
bn_in: ট্রেনের জন্য ওপেনস্ট্যাক ইনস্টলেশন গাইড <https://docs.openstack.org/train/install/>`_

source: `OpenStack Installation Guides for Ussuri <https://docs.openstack.org/ussuri/install/>`_
bn_in: ওসুরির জন্য ওপেনস্ট্যাক ইনস্টলেশন গাইড <https://docs.openstack.org/ussuri/install/>`_

source: `SLES 12 <https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_basicnet_manconf.html>`__ or `SLES 15 <https://www.suse.com/documentation/sles-15/book_sle_admin/data/sec_network_manconf.html>`__ or `openSUSE <https://doc.opensuse.org/documentation/leap/reference/html/book.opensuse.reference/cha.network.html>`__ Network Configuration
bn_in: 'SLES 12 এর নেটওয়ার্ক কনফিগারেশন এর জন্য <https://www.suse.com/documentation/sles-12/book_sle_admin/data/sec_basicnet_manconf.html>'__ অথবা 'SLES 15 এর নেটওয়ার্ক কনফিগারেশন এর জন্য <https://www.suse.com/documentation/sles-15/book_sle_admin/data/sec_network_manconf.html>'__ অথবা 'openSUSE এর নেটওয়ার্ক কনফিগারেশন এর জন্য <https://doc.opensuse.org/documentation/leap/reference/html/book.opensuse.reference/cha.network.html>' __ এই লিংকগুলোতে গিয়ে দেখুন।

source: `Ubuntu Network Configuration <https://help.ubuntu.com/lts/serverguide/network-configuration.html>`__
bn_in: 'Ubuntu এর নেটওয়ার্ক কনফিগারেশন এর জন্য <https://help.ubuntu.com/lts/serverguide/network-configuration.html>'__ এই লিংকটিতে গিয়ে দেখুন।

source: after configuring the appropriate nodes for it.
bn_in: এর জন্য উপযুক্ত নোড কনফিগার করতে পারেন।
