Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: Use the ``cinder-volume-usage-audit`` command on Block Storage nodes to retrieve meters on demand. For more information, see the `Cloud Administrator Guide <http://docs.openstack.org/admin-guide-cloud/ telemetry-data-collection.html#block-storage-audit-script-setup-to-get- notifications>`__.
cs: Použijte příkaz ``cinder-volume-usage-audit`` na uzlech blokového úložiště pro získání měřidel na požádání. Pro další informace si přečtěte `Příručku správců Cloudu <http://docs.openstack.org/admin-guide-cloud/ telemetry-data-collection.html#block-storage-audit-script-setup-to-get- notifications>`__.

source: Use the database access client to connect to the database server as the ``root`` user:
cs: Použijte klienta pro přístup k databázi a přihlaste se na něj jako uživatel ``root``:
ru: Используйте клиент баз данных для подключения к серверу БД под пользователем ``root``:

source: Use the random value that you generated in a previous step. If you install using non-interactive mode or you do not specify this token, the configuration tool generates a random value.
cs: Použijte náhodnou hodnotu vytvořenou v předchozím kroku. Pokud instalujete v režimu bez zásahu uživatele, nebo tento příznak nezadáte, vytvoří nástroj náhodnou hodnotu.

source: Using the scripts
cs: Používání skriptů

source: Verify access to the ``private`` project network gateway:
cs: Ověřte přístup k bráně sítě projektu ``private``:

source: Verify access to the internet:
bn_in: ইন্টারনেটে অ্যাক্সেস যাচাই করুনঃ
cs: Ověřte přístup k internetu:
ru: Проверьте доступ к интернету:

source: Verify access to the public provider network gateway:
cs: Ověřte přístup k bráně sítě veřejného poskytovatele:

source: Verify addition of the key pair:
bn_in: কী পেয়ার সংযোজন যাচাই করুনঃ
cs: Ověřte přidání páru klíčů:
ru: Проверьте добавленую пару ключей:

source: Verify connectivity
bn_in: সংযোগটি যাচাই করুন।
cs: Ověření připojení
ru: Проверка соединения

source: Verify connectivity to the instance from the controller node or any host on the public physical network:
cs: Ověřte připojení k instanci z uzlu kontroléru nebo jakéhokoli hostitele na veřejné fyzické síti:

source: Verify connectivity to the instance via floating IP address from the controller node or any host on the public physical network:
cs: Ověřte připojení k instanci pomocí plovoucí IP adresy z uzlu kontroléru nebo jakéhokoli hostitele na veřejné fyzické síti:

source: Verify operation
bn_in: সংযোগটি পুনরায় যাচাই করুন।
cs: Ověření funkčnosti
ru: Проверьте работу

source: Verify operation of the Block Storage service.
cs: Ověření funkčnosti služby blokového úložiště.
ru: Проверьте работу сервиса блочных хранилищ.

source: Verify operation of the Identity service before installing other services.
cs: Před instalací ostatních služeb ověřte funkčnost služby identit.
ru: Проверьте работоспособность идентификатора перед устиновкой других сервисов

source: Verify operation of the Image service using `CirrOS <http://launchpad.net/cirros>`__, a small Linux image that helps you test your OpenStack deployment.
cs: K ověření funkčnosti služby obrazů využijte `CirrOS <http://launchpad.net/cirros>`__, malý obraz Linux, který Vám pomůže vyzkoušet vaše zavedení OpenStack.
ru: Проверьте работу сервиса управления образами, используя `CirrOS <http://launchpad.net/cirros>`__, маленький образ Linux, который поможет протестировать установку OpenStack.

source: Verify operation of the Orchestration service.
cs: Ověření funkčnosti služby orchestrace.

source: Verify operation of the Telemetry service. These steps only include the Image service meters to reduce clutter. Environments with ceilometer integration for additional services contain more meters.
cs: Ověření funkčností služby telemetrie. Pro zpřehlednění se tyto kroky zabývají pouze měřidly služby obrazů. Prostředí, kde je u dalších služeb zavedeno Ceilometer, obsahují více měřidel.

source: Verify operation of the dashboard.
cs: Ověření funkčnosti nástěnky.
ru: Проверьте работу панели управления.

source: We recommend that you verify NTP synchronization before proceeding further. Some nodes, particularly those that reference the controller node, can take several minutes to synchronize.
bn_in: আমরা আপনাকে পরামর্শ দিচ্ছি যে আপনি সামনের দিকে যাওয়ার আগে NTP সিঙ্ক্রোনাইজেশনটি যাচাই করুন। কিছু নোড, বিশেষকরে কন্ট্রোলার নোডে উল্লেখ করে সেগুলি সিঙ্ক্রোনাইজ হতে কয়েক মিনিট সময় লাগতে পারে।
cs: Před pokračováním doporučujeme ověřit synchronizaci NTP. Synchronizace u některých uzlů, zvláště u těch odkazující se na uzel kontroléru, může trvat až několik minut.
ru: Мы рекомендуем вам проверить синхронизацию NTP перед тем, как двигаться дальше. Некоторым узлам, особенно тем, которые используют управляющий узел, может потребоваться несколько минут.

source: We recommend that you verify network connectivity to the Internet and among the nodes before proceeding further.
bn_in: আমরা সুপারিশ করছি যে, অন্যান্য ধাপ শুরু করার পূর্বে সকল নোডগুলোর ইন্টারনেট সহ নেটওয়ার্ক সংযোগটি যাচাই করুন।
cs: Před pokračováním doporučujeme ověřit připojení k síti a mezi uzly.
ru: Мы рекомендуем проверить связь с Интернетом и между узлами перед тем как двигаться дальше.

source: We recommend that you verify operation and fix any issues before proceeding The following steps use the IP address ranges from the network and subnet creation examples.
cs: Před pokračováním doporučujeme ověřit funkčnost a opravit jakékoli chyby. Následující kroky používají rozsahy IP adres sítě a podsítě zadané v ukázce výše.

source: When you install a package for an API service, you are prompted to register that service. However, after you install or upgrade the package for an API service, Debian immediately removes your response to this prompt from the debconf database. Consequently, you are prompted to re-register the service with the Identity service. If you already registered the API service, respond ``no`` when you upgrade.
cs: Při instalaci balíčku pro službu API jste vyzváni k její registraci. Avšak po instalaci nebo aktualizaci balíčku, Debian okamžitě odstraní vaši odpověď na tento dotaz z databáze debconf. Následně jste dotázání pro znovu registrování služby ve službě identit. Pokud jste službu API již registrovali, odpovězte ``no`` při aktualizaci.

source: When you install or upgrade a Debian package, all configuration file values are preserved. Using the ``debconf`` database as a registry is considered a bug in Debian. If you edit something in any OpenStack configuration file, the ``debconf`` package reads that value when it prepares to prompt the user. For example, to change the log in name for the RabbitMQ messaging queue for a service, you can edit its value in the corresponding configuration file.
cs: Při instalaci nebo aktualizaci balíčku Debian jsou všechny hodnoty souboru s nastavením zachovány. Používat databázi ``debconf`` jako registr je v Debian považováno za chybu. Pokud něco upravíte v jakémkoli souboru s nastavením OpenStack, budou změny přečteny balíčkem ``debconf`` při přípravě dotazů na uživatele. Například pro změnu přihlašovacího jména pro službu fronty zpráv RabbitMQ můžete upravit odpovídající hodnoty v souboru s nastavením.

source: You are prompted for the Identity service ``admin_token`` value. The Identity Service uses this value to register the API service. When you set up the ``keystone`` package, this value is configured automatically.
cs: Jste dotázání na hodnotu ``admin_token`` pro službu identit. Služba používá tuto hodnotu k registraci služby API. Při nastavování balíčku ``keystone`` je tato volba nastavena automaticky.

source: You can also disable journaling. For more information, see the `MongoDB manual <http://docs.mongodb.org/manual/>`__.
cs: Žurnály lze i zcela zakázat. Pro další informace si přečtěte `Příručku MongoDB <http://docs.mongodb.org/manual/>`__.

source: You can also reference a flavor by ID.
bn_in: আপনার আইডি থেকে একটি ফ্লেভর রেফারেন্স করতে পারেন।
cs: Na konfiguraci můžete také odkazovat pomocí jejího ID.
ru: Вы так же можете указывать схему по ID.

source: You can modify these ranges and gateways to work with your particular network infrastructure.
bn_in: আপনার নির্দিষ্ট নেটওয়ার্ক অবকাঠামো নিয়ে কাজ করার জন্য আপনি এই রেঞ্জগুলি এবং গেটওয়েগুলি সংশোধন পরিবর্তন করতে পারেন।
cs: Tyto rozsahy a brány můžete změnit tak, aby odpovídali vaši konkrétní síťové architektuře.
ru: Вы можете изменить эти диапазоны согласно вашей сетевой инфраструктуре.

source: You can pre-seed all ``debconf`` prompts. To pre-seed means to store responses in the ``debconf`` database so that ``debconf`` does not prompt the user for responses. Pre-seeding enables a hands-free installation for users. The package maintainer creates scripts that automatically configure the services.
cs: Všechny dotazy ``debconf`` můžete předvyplnit. To znamená, že odpovědi budou uloženy v databázi ``debconf`` a tím se nezobrazí uživateli při instalaci. Předvyplnění znamená, že uživatelé se nemusí o instalaci starat, správce balíčku vytvoří skripty, které služby nastaví automaticky.

source: You can repeat this procedure to create additional projects and users.
cs: Tento krok můžete opakovat pro vytvoření dalších projektů a uživatelů.
ru: Вы можете повторить операцию для создания проектов и пользователей.

source: You must :ref:`create the public provider network <launch-instance-networks-public>` before the private project network.
cs: Před vytvořením sítě soukromého projektu musíte :ref:`vytvořit síť veřejného poskytovatele <launch-instance-networks-public>`.

source: You must add the ``heat_stack_owner`` role to each user that manages stacks.
cs: Každý uživatel spravující zásobníky musí mít roli ``heat_stack_owner``.

source: You must create a file system on the device and mount it to use the volume.
bn_in: আপনার ডিভাইসে একটি ফাইল সিস্টেম তৈরি করতে হবে এবং ভলিউমটি ব্যবহার করতে এটি মাউন্ট করতে হবে।
cs: Pro použití svazku musíte v zařízení vytvořit systém souborů a připojit ho.
ru: Вам необходимо создать на устройстве файловую систему и монтировать её, чтобы использовать том.

source: You must enable remote access before you install OpenStack services on multiple nodes.
cs: Než budete moci instalovat služby OpenStack na více uzlů, je třeba povolit vzdálený přístup.

source: You must pass the value of the authentication token to the :command:`openstack` command with the ``--os-token`` parameter or set the OS_TOKEN environment variable. Similarly, you must also pass the value of the Identity service URL to the :command:`openstack` command with the ``--os-url`` parameter or set the OS_URL environment variable. This guide uses environment variables to reduce command length.
cs: Hodnotu příznaku ověření musíte předat příkazu :command:`openstack` pomocí parametru ``--os-token`` nebo s nastavenou proměnnou prostředí OS_TOKEN. Podobně musíte příkazu předat hodnotu URL služby identit pomocí parametru ``--os-url``, nebo nastavit její proměnnou OS_URL. Pro snížení velikosti příkazů tento průvodce používá proměnné prostředí.

source: You must use an account with administrative privileges to configure each node. Either run the commands as the ``root`` user or configure the ``sudo`` utility.
bn_in: প্রতিটি নোড কনফিগার করতে আপনাকে অ্যাডমিনিস্ট্রেটিভ অগ্রাধিকার সহ একটি অ্যাকাউন্ট ব্যবহার করতে হবে। ``root`` মূল ব্যবহারকারী হিসাবে কমান্ডগুলি চালু করুন বা ``sudo`` ইউটিলিটি কনফিগার করুন।
cs: Pro nastavení každého uzlu je třeba použít účet mající oprávnění správce. Buď příkazy provádějte jako uživatel ``root``, nebo nastavte nástroj ``sudo``.

source: You should install Chrony, an implementation of :term:`NTP`, to properly synchronize services among nodes. We recommend that you configure the controller node to reference more accurate (lower stratum) servers and other nodes to reference the controller node.
cs: Pro správnou synchronizaci služeb napříč uzly byste měli nainstalovat Chrony, implementaci :term:`NTP`. Doporučuje se nastavit uzel kontroléru tak, aby se odkazoval na přesnější servery (s nižší vrstvou) a ostatní uzly aby se odkazovaly na zel kontroléru.

source: Your OpenStack environment now includes Block Storage. You can :doc:`launch an instance <launch-instance>` or add more services to your environment in the following chapters.
cs: Vaše prostředí OpenStack nyní využívá blokové úložiště. Můžete :doc:`spustit instanci <launch-instance>` nebo, v následujících kapitolách, přidat další služby do vašeho prostředí.
ru: Ваше OpenStack окружение теперь включает в себя сервис блочных хранилищ. Вы можете :doc:`запустить инстанс <launch-instance>` или добавить больше сервисов в ваше окружение в последующих главах.

source: Your OpenStack environment now includes Orchestration. You can :ref:`launch-instance` or add more services to your environment in the following chapters.
cs: Vaše prostředí OpenStack nyní využívá orchestraci. Můžete :ref:`launch-instance` nebo v následujících kapitolách přidat další služby do vašeho prostředí.

source: Your OpenStack environment now includes Telemetry. You can :ref:`launch-instance` or add more services to your environment.
cs: Vaše prostředí OpenStack nyní využívá telemetrii. Můžete :ref:`launch-instance` nebo přidat další služby do vašeho prostředí.

source: Your OpenStack environment now includes the dashboard. You can :ref:`launch-instance` or add more services to your environment.
cs: Vaše prostředí OpenStack nyní využívá nástěnku. Můžete :ref:`launch-instance` nebo přidat další služby do vašeho prostředí.
ru: Ваша OpenStack окружение теперь включает в себя панель управления. Вы можете :ref:`launch-instance` или добавить больше сервисов в ваше окружение.

source: Your distribution does not enable a restrictive :term:`firewall` by default. For more information about securing your environment, refer to the `OpenStack Security Guide <http://docs.openstack.org/sec/>`__.
cs: Vaše distribuce standardně nepovoluje přísnou bránu :term:`firewall`. Pro další informace o zabezpečení vašeho prostředí si přečtěte `Průvodce zabezpečením OpenStack <http://docs.openstack.org/sec/>`__.
ru: Ваша дистрибуция по умолчанию не включает ограничения :term:`файрвола`. За дальнейшей информацией по защите вашего окружения обратитесь к `Руководству по безопасности OpenStack <http://docs.openstack.org/sec/>`__.

source: Your distribution enables a restrictive :term:`firewall` by default. During the installation process, certain steps will fail unless you alter or disable the firewall. For more information about securing your environment, refer to the `OpenStack Security Guide <http://docs.openstack.org/sec/>`__.
cs: Vaše distribuce standardně povoluje přísnou bránu :term:`firewall`. Během instalačního procesu některé kroky selžou, pokud pravidla firewall nezměníte, nebo ho nezakážete. Pro další informace o zabezpečení vašeho prostředí si přečtěte `Průvodce zabezpečením OpenStack <http://docs.openstack.org/sec/>`__.
ru: Ваша дистрибуция по умолчанию включает ограничения :term:`файрвола`. Определенные шаги во время процесса установки закончатся неудачей, если вы не не исправите или выключите файрвол. За дальнейшей информацией по защите вашего окружения обратитесь к `Руководству по безопасности OpenStack <http://docs.openstack.org/sec/>`__.

source: Your environment must include the Block Storage service.
cs: Vaše prostředí musí obsahovat službu blokového úložiště.

source: Your environment must include the Object Storage service.
cs: Vaše prostředí musí obsahovat službu úložiště objektů.

source: Your hosts must contain the latest versions of base installation packages available for your distribution before proceeding further.
bn_in: সামনের দিকে যাওয়ার আগে আপনার হোস্টগুলিকে অবশ্যই আপনার ডিস্ট্রিবিউশন এর জন্য উপলব্ধ বেস ইনস্টলেশন প্যাকেজের সর্বশেষতম সংস্করণ থাকতে হবে।
cs: Před pokračováním se ujistěte, že vaši hostitelé musí obsahovat nejnovější verze základních instalačních balíčků dostupných pro vaší distribuci.
ru: Для дальнейшего продолжения ваши хосты должны иметь последние версию установочных пакетов, доступных для вашего дистрибутива

source: and run the helper script:
cs: a spusťte pomocný skript:

source: debconf concepts
cs: Používání debconf

source: **Hardware requirements**
ru: **Аппаратные требования**

source: **Networking Option 1: Provider networks - Connectivity**
bn_in: ** নেটওয়ার্কিং অপশন 1: প্রােভাইডার নেটওয়ার্ক - কানেক্টিভিটি **
ru: **Вариант сети 1: Сеть провайдера - Подключение**

source: **On SLES:**
ru: **На SLES:**

source: **On openSUSE:**
ru: **На openSUSE:**

source: Access your instance using SSH from the controller node or any host on the provider physical network:
bn_in: কন্ট্রোলার নোড বা প্রোভাইডার পিজিক্যাল নেটওয়ার্কের কোনও হোস্ট থেকে SSH ব্যবহার করে আপনার ইনস্টেসটি অ্যাক্সেস করুনঃ
ru: Войдите в ваш инстанс по SSH с управляющего узла или любого хоста в провайдерской сети:

source: Actual output may differ slightly from this example.
ru: Реальный вывод может слегка отличаться от этого примера

source: Add the ``admin`` role to the ``neutron`` user:
ru: Добавьте ``admin`` роль пользователю ``neutron``:

source: Add the ``admin`` role to the ``nova`` user:
ru: Добавьте ``admin`` роль пользователю ``nova``:

source: Add the ``router: external`` option to the ``provider`` network:
ru: Добавьте опцию ``router: external`` для ``provider`` сети:

source: Add the self-service network subnet as an interface on the router:
bn_in: রাউটারে একটি ইন্টারফেস হিসাবে সেল্ফ-সার্ভিস নেটওয়ার্ক সাবনেট যুক্ত করতে হবেঃ
ru: Добавьте собственную сеть в интерфейс маршрутизатора:

source: Additional services
ru: Дополнительные службы

source: Although most environments include Identity, Image service, Compute, at least one networking service, and the Dashboard, the Object Storage service can operate independently. If your use case only involves Object Storage, you can skip to `Object Storage Installation Guide <http://docs.openstack.org/project-install-guide/object-storage/draft/>`_ after configuring the appropriate nodes for it.
ru: Несмотря на то, что большинство окружений включают сервис идентификации, сервис управления образами, сервис вычислительных ресурсов, хотя бы один сервис управления сетями и панель управления; сервис объектного хранилища может управляться независимо. Если ваш случай только включает объектное хранилища, Вы можете перейти к `Object Storage Installation Guide <http://docs.openstack.org/project-install-guide/object-storage/draft/>`_ после конфигурирования соответствующих узлов для этого.

source: Appendix
ru: Приложение

source: As the number of OpenStack services and virtual machines increase, so do the hardware requirements for the best performance. If performance degrades after enabling additional services or virtual machines, consider adding hardware resources to your environment.
bn_in: ওপেনস্ট্যাক সার্ভিস এবং ভার্চুয়াল মেশিনের সংখ্যা বাড়ার সাথে সাথে সর্বোত্তম পারফরম্যান্সের জন্য হার্ডওয়্যার প্রয়োজনীয়তাগুলিও করুন। অতিরিক্ত সার্ভিস বা ভার্চুয়াল মেশিনগুলি চালু করার পরে যদি কর্মক্ষমতা বৃদ্ধি পায় তবে আপনার এনভারমেন্ট হার্ডওয়্যার সংস্থান যুক্ত করার বিষয়টি বিবেচনা করুন।
ru: С увеличением числа OpenStack сервисов и виртуальных машин делайте требования к оборудованию для лучшей производительности. Если производительность снижается после включения дополнительных сервисов или виртуальных машин, рассмотрите вопрос о добавлении аппаратных ресурсов для вашего окружения.

source: Attach the ``volume1`` volume to the ``provider-instance`` instance:
bn_in: সংযুক্ত করুন ``volume1``ভলিউম``provider-instance``ইনস্টেস
ru: Подключите том ``volume1`` к инстансу``provider-instance``

source: Authenticate using ``admin`` or ``demo`` user and ``default`` domain credentials.
ru: Аутентифицируйтесь как пользователь ``admin`` или ``demo``и используйте учетные данные домена ``default``.

source: Bare Metal service (ironic)
ru: Служба Bare Metal (ironic)

source: Before launching an instance, you must create the necessary virtual network infrastructure. For networking option 1, an instance uses a provider (external) network that connects to the physical network infrastructure via layer-2 (bridging/switching). This network includes a DHCP server that provides IP addresses to instances.
ru: Перед запуском инстанса вы должны создать необходимые виртуальные сети. В первом варианте сети инстанс использует сеть провайдера (внешняя) которая подключена к физической сети через уровень 2 (layer-2, bridging/switching). Эта сеть включает DHCP сервер который предоставляет IP адреса инстансам.

source: Before you configure the OpenStack Networking (neutron) service, you must create a database, service credentials, and API endpoints.
ru: Перед конфигурацией сервиса управления сетями OpenStack (neutron) вы должны создать базу данных, учетные записи сервиса и конечные точки API.

source: Before you install and configure the Compute service, you must create databases, service credentials, and API endpoints.
ru: Перед установкой и конфигурацией сервиса вычислений вы должны создать базы данных, учетные записи сервиса и конечные точки API.

source: Block Storage service
ru: Служба блочных хранилищ

source: CentOS does not require the following steps.
ru: CentOS не требует следующих шагов.

source: Choose the same networking option that you chose for the controller node to configure services specific to it. Afterwards, return here and proceed to :ref:`neutron-compute-compute`.
ru: Выберите ту же сетевую настройку, что и для управляющего узла, чтобы настроить специфичные для него службы. Затем вернитесь сюда и перейдите к :ref:`neutron-compute-compute`.

source: Collects event and metering data by monitoring notifications sent from services.
ru: Собирают данные о событиях и измерениях, отслеживая уведомления от служб.

source: Comment out or remove any other ``connection`` options in the ``[database]`` section.
ru: Закомментируйте или удалите любые другие опции ``connection`` в разделе ``[database]``.

source: Compute
ru: Вычислительные ресурсы

source: Compute service
ru: Вычислительная служба

source: Configure the Compute service to use the Networking service
ru: Настройте вычислительную службу для использования сетевой службы.

source: Configure the metadata agent
ru: Настройте агент метаданных

source: Container Infrastructure Management service (magnum)
ru: Служба управления инфраструктурой контейнеров (magnum)

source: Controller
ru: Контроллер

source: Controller Node: 1 processor, 4 GB memory, and 5 GB storage
bn_in: কন্ট্রোলার নোড: ১ প্রসেসর, ৪ জিবি মেমোরি এবং ৫ জিবি স্টোরেজ
ru: Управляющий узел: 1 процессор, 4 Гб оперативной памяти и 5 Гб хранилище

source: Create a :term:`floating IP address` on the provider virtual network:
bn_in: প্রােভাইডার ভার্চুয়াল নেটওয়ার্কে একটি: শব্দ: `floating IP address` তৈরি করুনঃ
ru: Создайте :term:`floating IP address` в провайдерской сети:

source: Create a ``[mysqld]`` section, and set the ``bind-address`` key to the management IP address of the controller node to enable access by other nodes via the management network. Set additional keys to enable useful options and the UTF-8 character set:
bn_in: `` [mysqld] `` বিভাগটি তৈরি করুন এবং ম্যানেজমেন্ট নেটওয়ার্কের মাধ্যমে অন্যান্য নোডের অ্যাক্সেস চালু করতে কন্ট্রোলার নোডের ম্যানেজমেন্ট আইপি এড্রেসের জন্য ``bind-address`` কীটি সেট করুন। প্রয়োজনীয় বিকল্পগুলি এবং UTF-8 অক্ষর সেট চালু করতে অতিরিক্ত কীগুলি সেট করুন:
ru: Создайте раздел ``[mysqld]`` и задайте ключу ``bind-address``значение управляющего IP адреса управляющего узла для открытия доступа другими узлами в управляющей сети. Задайте дополнительные ключи для включения полезных опций и набора символов UTF-8:
