Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: The service provisions logical volumes on this device using the :term:`LVM <Logical Volume Manager (LVM)>` driver and provides them to instances via :term:`iSCSI` transport. You can follow these instructions with minor modifications to horizontally scale your environment with additional storage nodes.
cs: Služba poskytuje na tomto zařízení logické svazky pomocí ovladače :term:`LVM <Logical Volume Manager (LVM)>`, které předává instancím pomocí přenosu :term:`iSCSI`. Těmito pokyny se můžete řídit a s malými úpravami a dalšími uzly úložiště lze vaše prostředí horizontálně rozšířit.

source: The status changes from ``BUILD`` to ``ACTIVE`` when the build process successfully completes.
bn_in: বিল্ড প্রক্রিয়া সফলভাবে শেষ হলে অবস্থাটি ``BUILD`` থেকে ``ACTIVE` এ পরিবর্তিত হয়।
cs: Stav by se měl změnit z ``BUILD`` na ``ACTIVE``, jakmile bude proces sestavení úspěšně dokončen.

source: The values of ``AUTH_TOKEN``, ``KEYSTONE_ENDPOINT_IP``, ``PKG_ENDPOINT_IP``, and ``REGION_NAME`` depend on the answer you will provide to the debconf prompts. But the values of ``SERVICE_NAME``, ``SERVICE_TYPE``, ``SERVICE_DESC``, and ``SERVICE_URL`` are already pre-wired in each package, so you don't have to remember them.
cs: Hodnoty ``AUTH_TOKEN``, ``KEYSTONE_ENDPOINT_IP``, ``PKG_ENDPOINT_IP`` a ``REGION_NAME`` závisí na vašich odpovědích na dotazy debconf. Hodnoty ``SERVICE_NAME``, ``SERVICE_TYPE``, ``SERVICE_DESC`` a ``SERVICE_URL`` jsou pro každý balíček již předvyplněny a proto si je nemusíte pamatovat.

source: Then, ``debconf`` does not prompt you.
cs: Pak se Vás ``debconf`` nebude na nic ptát.

source: There are two modes of installation. One using ``/horizon`` as the URL, keeping your default vhost and only adding an Alias directive: this is the default. The other mode will remove the default Apache vhost and install the dashboard on the webroot. It was the only available option before the Liberty release. If you prefer to set the Apache configuration manually, install the ``openstack-dashboard`` package instead of ``openstack-dashboard-apache``.
cs: Existují dva režimy instalace. Jeden používající ``/horizon`` jako URL adresu, ponechávající výchozí vhost a pouze přidávající příkaz Alias: toto je výchozí. Druhý režim odstraní výchozí vhost Apache a instaluje nástěnku do kořene serveru. Toto byla jediná dostupná možnost před vydáním Liberty. Pokud chcete nastavit Apache ručně, nainstalujte balíček ``openstack-dashboard`` místo ``openstack-dashboard-apache``.

source: These debconf screens appear in: ``ceilometer-common``, ``cinder-common``, ``glance-common``, ``heat-common``, ``neutron-common``, and ``nova-common``.
cs: Tyto obrazovky jsou zobrazeny v balíčcích: ``ceilometer-common``, ``cinder-common``, ``glance-common``, ``heat-common``, ``neutron-common`` a ``nova-common``.

source: These screens appear when you re-configure the ``dbconfig-common`` package:
cs: Tyto obrazovky budou zobrazeny při znovu nastavování balíčku ``dbconfig-common``:

source: This ``connection`` directive will be handled by the ``dbconfig-common`` package, which provides a standard Debian interface. It enables you to configure Debian database parameters. It includes localized prompts for many languages and it supports the following database backends: SQLite, MySQL, and PostgreSQL.
cs: Tento příkaz bude zpracován balíčkem ``dbconfig-common``, který poskytuje standardní rozhraní Debian. Umožňuje Vám nastavit parametry databáze Debian. Má v sobě přeložené dotazy pro mnoho jazyků a podporuje následující jádra databáze: SQLite, MySQL a PostgreSQL.

source: This calls the post-installation script for the ``PACKAGE-NAME`` package after the user responds to all prompts. If you cannot install a Debian package in a non-interactive way, you have found a release-critical bug in Debian. Report it to the Debian bug tracking system.
cs: Toto zavolá skript po instalaci pro balíček ``PACKAGE-NAME`` poté co uživatel zodpoví všechny dotazy. Pokud nemůžete balíček Debian nainstalovat způsobem bez zásahu uživatele, narazili jste na velmi vážnou chybu v Debian. Nahlaste ji do systému pro hlášení chyb Debian.

source: This chapter explains how to use the Debian ``debconf`` and ``dbconfig-common`` packages to configure OpenStack services. These packages enable users to perform configuration tasks. When users install OpenStack packages, ``debconf`` prompts the user for responses, which seed the contents of configuration files associated with that package. After package installation, users can update the configuration of a package by using the :command:`dpkg-reconfigure` program.
cs: Tato kapitola popisuje jak používat Debian balíčky ``debconf`` a ``dbconfig-common`` k nastavení služeb OpenStack. Tyto balíčky umožňují uživatelům provádět jejich nastavování. Když uživatelé balíčky OpenStack nainstalují, ``debconf`` se uživatelů zeptá na odpovědi, kterými naplní obsah souborů s nastavením přidružených k balíčku. Po instalaci mohou uživatelé nastavení balíčku aktualizovat pomocí příkazu :command:`dpkg-reconfigure`.

source: This chapter omits the backup manager because it depends on the Object Storage service.
cs: Tato kapitola vynechává správce záloh, protože závisí na službě úložiště objektů.

source: This command provides no output.
bn_in: এই কমান্ডটি কোনও আউটপুট দেখাবে না ।
cs: Tento příkaz nemá žádný výstup.
ru: Эта команда ничего не выводит.

source: This command uses the password for the ``admin`` user.
cs: Tento příkaz používá heslo pro uživatele ``admin``.
ru: Эта команда использует пароль от ``admin`` пользователя

source: This command uses the password for the ``demo`` user and API port 5000 which only allows regular (non-admin) access to the Identity service API.
cs: Tento příkaz používá heslo pro uživatele ``demo`` a API port 5000 zprostředkovávající standardní (ne správcovský) přístup k API službě identit.
ru: Эта команда использует пароль для пользователя ``demo``и API порт 5000 который позволяет получить обычный (не административный) доступ к API идентификатора.

source: This example deployment uses an Apache web server.
cs: Toto ukázkové nasazení využívá internetový server Apache.
ru: В этом примере установки используется веб-сервер Apache.

source: This guide documents OpenStack Liberty release.
cs: Tento průvodce používá verzi OpenStack Liberty.

source: This guide is a work-in-progress and is subject to frequent updates. Pre-release packages have been used for testing, and some instructions might not work with final versions. Please help us make this guide better by reporting any errors you encounter.
cs: Práce na tomto průvodci nejsou dokončeny a jsou předmětem častých změn. Pro zkoušení byly použity balíčky před oficiálním vydáním a některé pokyny nemusí v konečné verzi fungovat. Pomozte nám tohoto průvodce zlepšit nahlášením všech chyb, na které narazíte.

source: This guide shows you how to install OpenStack by using packages available on Red Hat Enterprise Linux 7 and its derivatives through the EPEL repository.
cs: Tento průvodce Vám ukáže jak nainstalovat OpenStack pomocí balíčků dostupných pro Red Hat Enterprise Linux 7 a jeho odnoží přes repozitář EPEL.

source: This guide shows you how to install OpenStack by using packages on openSUSE 13.2 and SUSE Linux Enterprise Server 12 through the Open Build Service Cloud repository.
cs: Tento průvodce Vám ukáže jak nainstalovat OpenStack pomocí balíčků dostupných na openSUSE 13.2 a SUSE Linux Enterprise Server 12 přes repozitář Open Build Service Cloud.

source: This guide uses a service project that contains a unique user for each service that you add to your environment. Create the ``service`` project:
cs: Tento průvodce využívá projekt služby obsahující jedinečného uživatele pro každou službu přidanou do prostředí. Vytvořte službu ``service``:

source: This guide walks through an installation by using packages available through Canonical's Ubuntu Cloud archive repository.
cs: Tento průvodce Vás provede instalaci pomocí balíčků dostupných v repozitáři archivu Canonical's Ubuntu Cloud.

source: This guide walks through an installation by using packages available through Debian 8 (code name: Jessie).
cs: Tento průvodce Vás provede instalaci pomocí balíčků dostupných v Debian 8 (kódové označení: Jessie).
ru: Это руководство демонстрирует установку с использованием пакетов для Debian 8 (кодовое название: Jessie).

source: This information is stored in the configuration file for each service. For example:
cs: Tyto údaje jsou uloženy v souboru s nastavením pro každou službu. Například:

source: This instance uses the ``cirros`` image.
bn_in: এই ইনস্টেসটি ``cirros`` ইমেজটি ব্যবহার করে।
cs: Tato instance používá obraz ``cirros``.
ru: Этот инстанс использует образ ``cirros``.

source: This instance uses the ``default`` security group.
bn_in: এই ইনস্টেসটি ``default`` সিকিউরিটি গ্রুপ ব্যবহার করে।
cs: Instance využívá bezpečnostní skupinu ``default``.
ru: Этот инстанс использует группу безопасности ``default``.

source: This instance uses the ``m1.tiny`` flavor.
cs: Tato instance používá konfiguraci ``m1.tiny``.

source: This instance uses the ``private`` project network. However, you must reference this network using the ID instead of the name.
cs: Tato instance využívá síť projektu ``private``. Na tuto síť ale musíte odkázat pomocí jejího ID místo jejího názvu.

source: This instance uses the ``public`` provider network. However, you must reference this network using the ID instead of the name.
cs: Tato instance využívá síť poskytovatele ``public``. Na tuto síť ale musíte odkázat pomocí jejího ID místo jejího názvu.

source: This network requires a gateway to provide Internet access to all nodes for administrative purposes such as package installation, security updates, :term:`DNS`, and :term:`NTP`.
cs: Tato síť vyžaduje bránu poskytující přístup k internetu pro všechny uzly za účelem správy, jako např. instalace balíčků, bezpečnostních aktualizací, :term:`DNS` a :term:`NTP`.

source: This network requires a gateway to provide Internet access to instances in your OpenStack environment.
bn_in: আপনার ওপেনস্টেক সেটআপ এর ইনস্টেন্স গুলোতে ইন্টারনেট পাওয়ার জন্য এই নেটওয়ার্ক এর অবশ্যই একটি গেইটওয়ে থাকতে হবে।
cs: Tato síť vyžaduje bránu poskytující přístup k internetu pro instance ve vašem prostředí OpenStack.
ru: Этой сети требуется шлюз для обеспечения доступа в Интернет инстансам в вашей среде OpenStack.

source: This output may differ from your environment.
cs: Tento výstup se může lišit v závislosti na prostředí.

source: This output should indicate four ``heat-engine`` components on the controller node.
cs: Výstup by měl obsahovat čtyři součásti ``heat-engine`` v uzlu kontroléru.

source: This screen configures the IP addresses for the service. The configuration script automatically detects the IP address used by the interface that is connected to the default route (``/sbin/route`` and ``/sbin/ip``).
cs: Tato obrazovka nastavuje IP adresu služby. Skript automaticky zjistí IP adresu používanou rozhraním připojeném k výchozí cestě (``/sbin/route`` a ``/sbin/ip``).

source: This screen configures the region name for the service. For example, ``us-east-coast`` or ``europe-paris``.
cs: Tato obrazovka nastavuje název oblasti pro službu. Například ``us-east-coast`` nebo ``europe-paris``.

source: This screen registers packages in the Identity service catalog:
cs: Tato obrazovka registruje balíčky v katalogu služby identit:

source: This section assumes proper installation, configuration, and operation of the Identity service using the Apache HTTP server and Memcached service as described in the :ref:`Install and configure the Identity service <keystone-install>` section.
cs: Tato část předpokládá, že služba identit je správně nainstalována, nastavena a pracuje využitím HTTP serveru Apache a služby Memcached, tak jak je popsáno v části :ref:`isntalace a nasatvení služby identit <keystone-install>`.

source: This section creates the necessary virtual networks to support launching one more instances. Networking option 1 includes one public virtual network and one instance that uses it. Networking option 2 includes one public virtual network, one private virtual network, and one instance that uses each network. The instructions in this section use command-line interface (CLI) tools on the controller node. For more information on the CLI tools, see the `OpenStack User Guide <http://docs.openstack.org/user-guide/cli_launch_instances.html>`__. To use the dashboard, see the `OpenStack User Guide <http://docs.openstack.org/user-guide/dashboard.html>`__.
cs: Tato část se zabývá vytvořením požadovaných virtuálních sítí pro podporu spuštění více jak jedné instance. Volba sítě 1 obsahuje jednu veřejnou virtuální síť a jednu instanci, která ji využívá. Volba sítě 2 obsahuje jednu veřejnou a jednu soukromou virtuální síť a jednu instanci využívající obě sítě. Pokyny v této části využívají nástroje rozhraní příkazového řádku (CLI) v uzlu kontroléru. Pro další informace o těchto nástrojích si přečtěte `Uživatelskou příručku OpenStack <http://docs.openstack.org/user-guide/cli_launch_instances.html>`__. Pokud chcete použít nástěnku, podívejte se na `patřičnou část příručky <http://docs.openstack.org/user-guide/dashboard.html>`__.

source: This section describes how to install and configure storage nodes for the Block Storage service. For simplicity, this configuration references one storage node with an empty local block storage device. The instructions use ``/dev/sdb``, but you can substitute a different value for your particular node.
cs: Tato část popisuje jak nainstalovat a nastavit uzly úložiště pro službu blokového úložiště. Pro zjednodušení toto nastavení pracuje s jedním uzlem úložiště obsahující prázdné místní zařízení blokového úložiště. Pokyny využívají ``/dev/sdb``, ale tuto hodnotu můžete nahradit jinou, podle vašich konkrétních potřeb.
ru: Этот раздел описывает как установить и настроить узлы хранилища для сервиса блочных хранилищ. Для простоты данный мануал рассматривает один узел хранилища с пустым локальным блочным устройством. Данная инструкция использует ``/dev/sdb``, но вы можете заменить другим значением, подходящим конкретному узлу.

source: This section describes how to install and configure the Block Storage service, code-named cinder, on the controller node. This service requires at least one additional storage node that provides volumes to instances.
cs: Tato část popisuje jak nainstalovat a nastavit službu blokového úložiště, pojmenovanou Cinder, na uzel kontroléru. Služba vyžaduje alespoň jeden další uzel úložiště, který poskytuje svazky instancím.
ru: Этот раздел описывает как установить и настроить службу блочных хранилищ, известную как Cinder, на Управляющем узле. Данная служба требует как минимум один дополнительный узел хранилища, который будет предоставлять диски для инстансов.

source: This section describes how to install and configure the Image service, code-named glance, on the controller node. For simplicity, this configuration stores images on the local file system.
cs: Tato část popisuje jak nainstalovat a nastavit službu obrazů, pojmenovanou Glance, na uzel kontroléru. Pro zjednodušení bude toto nastavení ukládat obrazy na místním systému souborů.
ru: Этот раздел описывает как установить и настроить службу управления образами, известную как glance, на управляющий узел. Для простоты, данная конфигурация хранит образы в локальной файловой системе.

source: This section describes how to install and configure the OpenStack Identity service, code-named keystone, on the controller node. For performance, this configuration deploys the Apache HTTP server to handle requests and Memcached to store tokens instead of an SQL database.
cs: Tato část popisuje jak nainstalovat a nastavit službu identit, pojmenovanou Keystone, na uzel kontroléru. Vzhledem k výkonu toto nastavení používá HTTP server Apache pro obsloužení žádostí a Memchached pro uložení příznaků místo databáze SQL.

source: This section describes how to install and configure the Orchestration service, code-named heat, on the controller node.
cs: Tato část popisuje jak nainstalovat a nastavit službu orchestrace, pojmenovanou Heat, na uzel kontroléru.

source: This section describes how to install and configure the Telemetry service, code-named ceilometer, on the controller node. The Telemetry service collects measurements from most OpenStack services and optionally triggers alarms.
cs: Tato část popisuje jak nainstalovat a nastavit službu telemetrie, pojmenovanou Ceilometer, na uzel kontroléru. Služba shromažďuje měření od většiny služeb OpenStack a může také spouštět poplachy.

source: This section describes how to install and configure the dashboard on the controller node.
cs: Tato část popisuje jak nainstalovat a nastavit nástěnku v uzlu kontroléru.
ru: Этот раздел описывает как установить и настроить панель управления на управляющем узле.

source: This section explains how to configure the controller and one compute node using the example architecture.
cs: V této části jsou uvedeny kroky k nastavení jednoho kontrolního a jednoho výpočetního uzle pomocí ukázkové architektury.

source: This will configure the below directives (example from ``nova.conf``):
cs: Toto nastaví následující příkazy (převzato z ``nova.conf``):

source: To create the database, complete the following actions:
cs: Proveďte následující úkony pro vytvoření databáze:
ru: Для создания базы данных, выполните следующие действия:

source: To create the database, complete these steps:
cs: Proveďte následující kroky pro vytvoření databáze:
ru: Для создания базы данных, выполните следующие шаги:

source: To create the service credentials, complete these steps:
cs: Proveďte následující kroky pro vytvoření přihlašovacích údajů služby:
ru: Для создания служебных учётных данных, выполните следующие шаги:

source: To ease the installation process, this guide only covers password security where applicable. You can create secure passwords manually, generate them using a tool such as `pwgen <http://sourceforge.net/projects/pwgen/>`__, or by running the following command:
cs: Pro usnadnění instalačního procesu se tento průvodce bude zabývat pouze zabezpečení heslem, kde je to možné. Bezpečná hesla můžete vytvořit ručně pomocí nástroje jako např. `pwgen <http://sourceforge.net/projects/pwgen/>`__, nebo použitím náslejícího příkazu:
ru: Для простоты установки данная инструкция рассматривает, где применимо, только безопасность с использованием паролей. Вы можете создать безопасные пароли вручную, сгенерировать их с использованием утилит, таких как `pwgen <http://sourceforge.net/projects/pwgen/>`__, или выполнив следующую команду:

source: To enable other nodes to connect to the chrony daemon on the controller, add the following key to the ``/etc/chrony.conf`` file:
cs: Pro povolení připojení ostatních uzlů k démonu chrony v kontroléru, přidejte následující klíč do souboru ``/etc/chrony.conf``:

source: To launch an instance, you must at least specify the flavor, image name, network, security group, key, and instance name.
bn_in: একটি ইনস্টেস চালু করতে, আপনাকে অবশ্যই কমপক্ষে প্লেভর, ইমেজ নেম, নেটওয়ার্ক, সিকিউরিটি গ্রুপ, কী এবং ইনস্টেসের নামটি উল্লেখ করতে হবে।
cs: Pro spuštění instance je třeba minimálně zadat její konfiguraci, název jejího obrazu, síť, bezpečnostní skupinu, klíč a její název.
ru: Для запуска инстанса, вам необходимо как минимум выбрать схему, имя образа, сеть, группу безопасности, ключ и имя инстанса.

source: To minimize clutter and provide more resources for OpenStack, we recommend a minimal installation of your Linux distribution. Also, you must install a 64-bit version of your distribution on each node.
bn_in: জামেলা মুক্ত চালু করতে এবং ওপেনস্ট্যাকের জন্য আরও সংস্থান সরবরাহ করতে, আমরা আপনার লিনাক্স ডিস্ট্রিবিউশন একটি মিনিমাম ইনস্টলেশন করতে পারেন। এছাড়াও, আপনাকে অবশ্যই প্রতিটি নোডে আপনার ডিস্ট্রিবিউশন একটি 64-bit version ইনস্টল করতে হবে।
cs: Pro snížení zátěže a poskytnutí více zdrojů pro OpenStack doporučujeme zvolit minimální instalaci vaší Linuxové distribuce, jejíž 64bitovou verzi musíte nainstalovat na každý uzel.
ru: Чтобы свести к минимуму беспорядок и обеспечить дополнительные ресурсы для OpenStack, мы рекомендуем минимальную установку вашего дистрибутива Linux. Кроме того, необходимо установить 64-битную версию вашего дистрибутива на каждый узел.

source: To opt out of using the ``debconf`` package, run the :command:`dpkg-reconfigure` command and select non-interactive mode:
cs: Pokud nechcete balíček ``debconf`` využívat, spusťte příkaz :command:`dpkg-reconfigure` a vyberte režim bez zásahu uživatele:

source: To run clients as a specific project and user, you can simply load the associated client environment script prior to running them. For example:
cs: Pro spuštění klientů jako konkrétní uživatel nebo projekt stačí načíst přidružený skript prostředí klienta před jejich spuštěním. Například:

source: To use the VNC client with the dashboard, the browser must support HTML5 Canvas and HTML5 WebSockets.
cs: Pro použití klienta VNC s nástěnkou musí prohlížeč podporovat HTML5 Canvas a HTML5 WebSockets.
ru: Для работы VNC в панели управления ваш браузер должен поддерживать HTML5 Canvas и HTML5 WebSockets.

source: Unless you have a unique set up for your network, press **ENTER**.
cs: Pokud nemáte jinak nastavenou síť, stiskněte **ENTER**.

source: Unless you intend to use the exact configuration provided in this example architecture, you must modify the networks in this procedure to match your environment. Also, each node must resolve the other nodes by name in addition to IP address. For example, the ``controller`` name must resolve to ``10.0.0.11``, the IP address of the management interface on the controller node.
cs: Pokud nechcete použít naprosto stejné nastavení, které bylo zde v ukázkové architektuře uvedeno, musíte v tomto kroku změnit sítě, aby odpovídaly vašemu prostředí. Také musí každý uzel být schopen přeložit názvy ostatních uzlů na IP adresy. Například název ``controller`` musí být přeložen na ``10.0.0.11``, což je IP adresa rozhraní pro správu v uzlu kontroléru.

source: Unlike other debconf prompts, you cannot pre-seed the responses for the ``dbconfig-common`` prompts by using ``debconf-set-selections``. Instead, you must create a file in :file:`/etc/dbconfig-common`. For example, you might create a keystone configuration file for ``dbconfig-common`` that is located in :file:`/etc/dbconfig-common/keystone.conf`, as follows:
cs: Na rozdíl od ostatních výzev debconf nemůžete předvyplnito odpovědi pro ``dbconfig-common`` pomocí ``debconf-set-selections``. Místo toho musíte vytvořit soubor v :file:`/etc/dbconfig-common`. Například takto vytvoříte soubor pro nastavení keystone pro `dbconfig-common`` umístěný v :file:`/etc/dbconfig-common/keystone.conf`:

source: Unset the temporary ``OS_TOKEN`` and ``OS_URL`` environment variables:
cs: Smažte proměnné prostředí ``OS_TOKEN`` a ``OS_URL``:

source: Upgrade the packages on your host:
cs: Aktualizujte balíčky na vašem hostiteli:
ru: Обновите пакеты на вашем хосте:

source: Upload the image to the Image service using the :term:`QCOW2 <QEMU Copy On Write 2 (QCOW2)>` disk format, :term:`bare` container format, and public visibility so all projects can access it:
cs: Obraz nahrajte do služby obrazů ve formátu :term:`QCOW2 <QEMU Copy On Write 2 (QCOW2)>`, kontejner ve formátu :term:`bare` s veřejnou viditelností, aby k němu měli přístup všechny projekty:
ru: Загрузите образ в сервис управления образами используя :term:`QCOW2 <QEMU Copy On Write 2 (QCOW2)>` формат диска, :term:`bare` формат контейнера, и общую видимость, так все проекты смогут получить доступ к нему:
