Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: OpenStack and supporting services require administrative privileges during installation and operation. In some cases, services perform modifications to the host that can interfere with deployment automation tools such as Ansible, Chef, and Puppet. For example, some OpenStack services add a root wrapper to ``sudo`` that can interfere with security policies. See the `OpenStack Administrator Guide <http://docs.openstack.org/ admin-guide/compute-root-wrap-reference.html>`__ for more information.
ru: OpenStack и вспомогательные сервисы требуют прав администратора во время установки и администрирования. В некоторых случаях сервисы выполняют модификацию хоста, что может помешать разворачиванию с помощью автоматических инструментов, таких как Ansible, Chef, и Puppet. К примеру, некоторые сервисы OpenStack добавляют администраторскую обёртку над коммандой ``sudo`` что может помешать политикам безопасности. Смотрите `OpenStack Administrator Guide <http://docs.openstack.org/ admin-guide/compute-root-wrap-reference.html>`__для получения большей информации.

source: Optionally, the controller node runs portions of the Block Storage, Object Storage, Orchestration, and Telemetry services.
ru: Дополнительно, узел контроллера может запускать управляющие модули блочного хранилища, хранилища объектов, службы оркестрации и телеметрии

source: Orchestration service (heat)
ru: Служба оркестрации (heat)

source: Overlay (tunnel) traffic for self-service networks traverses the management network instead of a dedicated network.
ru: Оверлейный (туннельный) трафик для собственных сетей проходит через управляющую сеть, а не через выделенную.

source: Perform these steps on the Block Storage node.
ru: Выполните следующие шаги на узле блочного хранилища.

source: Permit :term:`ICMP <Internet Control Message Protocol (ICMP)>` (ping):
ru: Разрешить :term:`ICMP <Internet Control Message Protocol (ICMP)>` (ping):

source: Ping this IP address from the controller node or any host on the physical provider network:
bn_in: কন্ট্রোলার নোড বা পিজিক্যাল প্রোভাইডার নেটওয়ার্কের কোনও হোস্ট থেকে এই আইপি ঠিকানাটি পিং করুনঃ
ru: Пропингуйте этот IP адрес с управляющего узла или любого другого хоста в физической сети провайдера:

source: Populate the Compute databases:
ru: Заполните базу данных Вычислительного сервиса:

source: Populate the database:
ru: Заполните базу данных:

source: Provider network
bn_in: প্রোভাইডার নেটওয়ার্ক
ru: Сеть провайдера

source: Publishes collected data to various targets including data stores and message queues.
ru: Публикуют собранные данные для различных целевых объектов, включая хранилища данных и очереди сообщений.

source: Replace ``INSTANCE_NAME`` with the name of the instance and ``VOLUME_NAME`` with the name of the volume you want to attach to it.
bn_in: উদাহরণের নামের সাথে `` INSTANCE_NAME`` এবং `VOLUME_NAME`` এর পরিবর্তে আপনি যে ভলিউমটি সংযুক্ত করতে চান তার নামটি প্রতিস্থাপন করুন।
ru: Замените ``INSTANCE_NAME`` на имя инстанса и `VOLUME_NAME`` на имя тома, который вы хотите к нему подключить.

source: Replace ``MANAGEMENT_INTERFACE_IP_ADDRESS`` with the IP address of the management network interface on your compute node, typically 10.0.0.31 for the first node in the :ref:`example architecture <overview-example-architectures>`.
ru: Замените ``MANAGEMENT_INTERFACE_IP_ADDRESS`` IP адресом управляющего сетевого интерфейса на вашем вычислительном узле, обычно это 10.0.0.31 для первого узла в :ref:`архитектуре примера <overview-example-architectures>`.

source: Replace ``NOVA_DBPASS`` with a suitable password.
ru: Замените ``NOVA_DBPASS`` подходящим паролем.

source: Replace ``PROVIDER_INTERFACE_NAME`` with the name of the underlying provider physical network interface. See :ref:`environment-networking` for more information.
ru: Замените ``PROVIDER_INTERFACE_NAME`` именем физического сетевого интерфейса провайдера. Смотрите :ref:`environment-networking` для более подробной информации.

source: Replace ``PROVIDER_NETWORK_CIDR`` with the subnet on the provider physical network in CIDR notation.
bn_in: CIDR সল্পপরিসরে প্রােভাইডার পিজিক্যাল নেটওয়ার্কের সাবনেটের সাথে ``PROVIDER_NETWORK_CIDR`` রিপ্লেস করুন।
ru: Замените ``PROVIDER_NETWORK_CIDR`` подсетью в провайдерской физической сети нотации CIDR.

source: Replace ``PROVIDER_NETWORK_GATEWAY`` with the gateway IP address on the provider network, typically the ".1" IP address.
bn_in: প্রোভাইডার নেটওয়ার্কের গেটওয়ে আইপি এড্রেস, সাধারণত ".1" আইপি এড্রেস দিয়ে ``PROVIDER_NETWORK_GATEWAY`` পরিবর্তন করুন।
ru: Замените ``PROVIDER_NETWORK_GATEWAY`` IP адресом шлюза провайдерской сети, обычно это ".1".

source: Replace ``PROVIDER_NET_ID`` with the ID of the ``provider`` provider network.
bn_in: ``provider`` প্রোভাইডার নেটওয়ার্কের আইডি দিয়ে ``PROVIDER_NET_ID`` পরিবর্তন করুন।
ru: Замените ``PROVIDER_NET_ID`` на ID ``provider`` провайдерской сети.

source: Replace ``SELFSERVICE_NETWORK_GATEWAY`` with the gateway you want to use on the self-service network, typically the ".1" IP address.
bn_in: আপনি সেল্ফ-সার্ভিস নেটওয়ার্কে সাধারণত ".1" আইপি ঠিকানাটি ব্যবহার করতে চান গেটওয়ে দিয়ে `` SELFSERVICE_NETWORK_GATEWAY`` পরিবর্তন করুন।
ru: Замените ``SELFSERVICE_NETWORK_GATEWAY`` на шлюз который вы будете использовать для собственной сети, обычно это ".1" IP адрес.

source: Replace ``SELFSERVICE_NET_ID`` with the ID of the ``selfservice`` network.
bn_in: ``selfservice`` নেটওয়ার্কের আইডি দিয়ে``SELFSERVICE_NET_ID`` পরিবর্তন করুন।
ru: Замените ``SELFSERVICE_NET_ID`` на ID ``selfservice``сети.

source: Replace ``SWIFT_URL`` with the URL of the Object Storage service, typically ``http://10.0.0.51:8080/v1/AUTH_`` if using the installation guide architecture.
ru: Замените ``SWIFT_URL`` на URL службы объектного хранилища, обычно ``http://10.0.0.51:8080/v1/AUTH_`` если используете архитектуру руководства по установке.

source: Replace the ``nova-compute-kvm`` package with ``nova-compute-qemu`` which automatically changes the ``/etc/nova/nova-compute.conf`` file and installs the necessary dependencies:
ru: Замените пакет ``nova-compute-kvm`` на ``nova-compute-qemu``, что автоматически меняет файл ``/etc/nova/nova-compute.conf`` и устанавливает необходимые зависимости:

source: Restart the Block Storage backup service:
ru: Перезапустите службу резервного копирования Блочного хранилища:

source: Restart the Compute services:
ru: Перезапустите службу Вычислений:

source: Restart the Image services:
ru: Перезапустите службы управления образами:

source: Restart the Memcached service:
bn_in: ম্যামক্যাসড সার্ভিসটি পুনরায় চালু করুনঃ
ru: Перезапустите сервис Memcached:

source: Restart the Networking services.
ru: Перезапустите службы Сети.

source: Secure the database service by running the ``mysql_secure_installation`` script. In particular, choose a suitable password for the database ``root`` account.
ru: Защитите сервис баз данных запустив скрипт ``mysql_secure_installation``. В частности, выберете подходящий пароль для учётной записи ``root`` к базе данных.

source: Self-service network
bn_in: সেল্প-সার্ভিস নেটওয়ার্ক
ru: Собственная сеть

source: Set a gateway on the provider network on the router:
bn_in: রাউটারে প্রোভাইডার নেটওয়ার্কে একটি গেটওয়ে সেট করতে হবেঃ
ru: Укажите шлюз сети провайдера на маршрутизаторае:

source: Shared File Systems
bn_in: শেয়ার্ড ফাইল সিস্টেম
ru: Общие файловые системы

source: Shared File Systems service (manila)
ru: Служба общих файловых систем (manila)

source: Start the Block Storage backup service and configure it to start when the system boots:
ru: Запустите службу резервного копирования Блочного хранилища и настройте ее автоматический запуск при загрузке системы:

source: Start the Compute service including its dependencies and configure them to start automatically when the system boots:
ru: Запустите сервис службы Вычислений, включая его зависимости, и настройте их автоматический запуск при загрузке системы:

source: Start the Compute services and configure them to start when the system boots:
ru: Запустите сервис службы Вычислений и настройте его автоматический запуск при загрузке системы:

source: Start the Image services and configure them to start when the system boots:
ru: Запустите сервисы управления образами и настройте их автоматический запуск при загрузке системы:

source: Start the Networking services and configure them to start when the system boots.
ru: Запустите сервисы службы Сети и настройте их автоматический запуск при загрузке системы.

source: Telemetry Alarming services (aodh)
ru: Служба оповещений телеметрии (aodh)

source: Telemetry Data Collection service (ceilometer)
ru: Служба сбора данных телеметрии (ceilometer)

source: The Bare Metal service is a collection of components that provides support to manage and provision physical machines.
ru: Служба Bare Metal представляет собой коллекцию компонентов по управлению и предоставлению физических машин.

source: The Block Storage API and scheduler services typically run on the controller nodes. Depending upon the drivers used, the volume service can run on controller nodes, compute nodes, or standalone storage nodes.
ru: Сервисы API блочного хранилища и планировщика обычно работают на Управляющих узлах. В зависимости от используемых драйверов, сервис дисков может работать на Управляющих узлах, узлах вычислительных ресурсов или отдельных узлах хранилища.

source: The Block Storage service (cinder) provides block storage devices to guest instances. The method in which the storage is provisioned and consumed is determined by the Block Storage driver, or drivers in the case of a multi-backend configuration. There are a variety of drivers that are available: NAS/SAN, NFS, iSCSI, Ceph, and more.
ru: Сервис блочных хранилищ (cinder) предоставляет устройства блочных хранилищ гостевым инстансам. Способ, которым хранилище предоставляется и расходуется, определяется драйвером блочного хранилища, или драйверами, в случае конфигурации с несколькими бэкендами. Существует множество доступных драйвером: NAS/SAN, NFS, iSCSI, Ceph и т.д.

source: The Container Infrastructure Management service (magnum) is an OpenStack API service making container orchestration engines (COE) such as Docker Swarm, Kubernetes and Mesos available as first class resources in OpenStack.
ru: Служба управления инфраструктурой контейнеров (magnum) - это служба API OpenStack, предоставляющая платформы по оркестрации контейнерами, такие как Docker Swarm, Kubernetes и Mesos, как ресурсы первого уровня OpenStack.

source: The Dashboard (horizon) is a web interface that enables cloud administrators and users to manage various OpenStack resources and services.
ru: Панель управления (horizon) - это веб-интерфейс который позволяет администраторам и пользователям управлять различными ресурсами и сервисами OpenStack.

source: The Database service (trove) provides cloud provisioning functionality for database engines.
ru: Служба базы данных (trove) предоставляет функциональность по выделению ресурсов в облаке для баз данных.

source: The Identity service authentication mechanism for services uses Memcached to cache tokens. The memcached service typically runs on the controller node. For production deployments, we recommend enabling a combination of firewalling, authentication, and encryption to secure it.
bn_in: আইডেন্টিটি সার্ভিস অথেনটিকেশন ব্যবস্থা সকল সার্ভিসের টোকেনগুলো ক্যাশে রাখার জন্য ম্যামক্যাসড ব্যবহার করে থাকে। ম্যামক্যাসড সার্ভিসটি সাধারণত কন্ট্রোলার নোডে চালু হয়। প্রোডাকশন ডেপ্লয়মেন্ট এর জন্য সুপারিশ করি যে, firewalling, authentication, and encryption এর সমন্বয় করে সক্ষম করা। যাতে করে এটি আরও বেশি নিরাপদ হয়।
ru: Механизм идентификатора по аутентификации сервисов использует Memcached для кэширования токенов. Сервис memcached обычно работает на Управляющем узле. Для продакшн конфигураций мы рекомендуем для безопасности включать комбинацию из файрвола, аутентификации и шифрования.

source: The Key Manager service provides a RESTful API for the storage and provisioning of secret data such as passphrases, encryption keys, and X.509 certificates.
ru: Служба управления ключами предоставляет RESTful API для хранения и предоставления секретной информации, такой как пароли, ключи шифрования и X.509 сертификаты.

source: The Linux bridge agent builds layer-2 (bridging and switching) virtual networking infrastructure for instances and handles security groups.
ru: Linux bridge agent создает layer-2 (bridging and switching) виртуальную сетевую инфраструктуру для инстансов и регулирует группы безопасности.

source: The Messaging service allows developers to share data between distributed application components performing different tasks, without losing messages or requiring each component to be always available.
ru: Служба сообщений позволяет разработчикам обмениваться данными между распределенными компонентами приложений, выполняя задачи без потери сообщений и требования для каждого из компонентов быть всегда доступным.

source: The Networking service initialization scripts expect the variable ``NEUTRON_PLUGIN_CONF`` in the ``/etc/sysconfig/neutron`` file to reference the ML2 plug-in configuration file. Ensure that the ``/etc/sysconfig/neutron`` file contains the following:
ru: Скрипты инициализации сетевого сервиса ожидают переменную ``NEUTRON_PLUGIN_CONF`` в файле ``/etc/sysconfig/neutron`` содержащую путь до конфигурационного файла плагина ML2. Убедитесь что файл ``/etc/sysconfig/neutron`` содержит следующее:

source: The Newton release is available directly through the official Debian backports repository. To use this repository, follow the instruction from the official `Debian website <http://backports.debian.org/Instructions/>`_, which basically suggest doing the following steps:
ru: Релиз Newton доступен напрямую из репозитория обратной совместимости Debian. Для использования данного репозитория следуйте инструкциям на официальном сайте Debian <http://backports.debian.org/Instructions/>`_, который, в целом, предлагает выполнить следующие шаги:

source: The Object Storage services (swift) work together to provide object storage and retrieval through a REST API.
ru: Службы объектного хранилища (swift) работают совместно над предоставлением хранения и получения объектов при помощи REST API.

source: The OpenStack system consists of several key services that are separately installed. These services work together depending on your cloud needs and include the Compute, Identity, Networking, Image, Block Storage, Object Storage, Telemetry, Orchestration, and Database services. You can install any of these projects separately and configure them stand-alone or as connected entities.
ru: Система OpenStack состоит из нескольких ключевых сервисов, которые устанавливаются независимо. Эти сервисы работают сообща в зависимости от ваших облачных потребностей. и включают в себя сервис вычислительных ресурсов, идентификации, сетевого управления, управления образами, блочных хранилищ, объектных хранилищ, сервис телеметрии, оркестрации и баз данных. Все эти проекты можно устанавливать независимо и настраивать по отдельности или как связанные сущности.

source: The Orchestration service (heat) uses a `Heat Orchestration Template (HOT) <http://docs.openstack.org/developer/heat/template_guide/hot_guide.html>`_ to create and manage cloud resources.
ru: Служба оркестрации (heat) использует `Шаблон оркестрации Heat (Heat Orchestration Template (HOT))<http://docs.openstack.org/developer/heat/template_guide/hot_guide.html>`_ для создания и управления облачными ресурсами.

source: The Shared File Systems service (manila) provides coordinated access to shared or distributed file systems.
ru: Служба общих файловых систем(manila) предоставляет возможность координировать общие или распределённые файловые системы

source: The Telemetry Alarming services trigger alarms when the collected metering or event data break the defined rules.
ru: Служба оповещений телеметрии активирует оповещение, если собранные данные о событиях или измерениях нарушают определенные правила.

source: The Telemetry Data Collection services provide the following functions:
ru: Службы сбора данных телеметрии обеспечивают следующие функции.

source: The ``--provider-physical-network provider`` and ``--provider-network-type flat`` options connect the flat virtual network to the flat (native/untagged) physical network on the ``eth1`` interface on the host using information from the following files:
bn_in: এই ``--provider-physical-network provider`` এবং ``--provider-network-type flat`` অপশনগুলি ফ্ল্যাট ভার্চুয়াল নেটওয়ার্কটিকে এই ``eth1`` ইন্টারফেসের ফ্ল্যাট (native/untagged) ফিজিকাল নেটওয়ার্কের সাথে সংযুক্ত করে হোস্টটিতে নিম্নলিখিত ফাইলগুলি থেকে তথ্য ব্যবহার করেঃ
ru: Опции ``--provider-physical-network provider`` и ``--provider-network-type flat`` соединяют плоскую виртаульную сеть с плоской (родной/непомеченной) физической сетью на интерфейсе ``eth1``хоста используя информацию из следующих файлов:

source: The ``--share`` option allows all projects to use the virtual network.
bn_in: এই ``--share`` অপশনটি সকল প্রোজেক্ট ভার্চুয়াল নেটওয়ার্ক ব্যবহার করতে পারে ।
ru: Флаг ``--share`` разрешает всем проектам использовать виртуальную сеть

source: The ``demo`` or other unprivileged user can create this network because it provides connectivity to instances within the ``demo`` project only.
bn_in: ``demo`` বা অন্য সুবিধাভোগী ব্যবহারকারীরা এই নেটওয়ার্কটি তৈরি করতে পারেন কারণ এটি কেবলমাত্র ``demo`` প্রোজেক্ট এর মধ্যে ইনস্টেসগুলির সাথে সংযোগ স্থাপন করে।
ru: ``demo`` или другой не привилегированный пользователь может создать эту сеть поскольку она обеспечивает подключение к инстансам только для проекта ``demo``.

source: The controller node requires a minimum of two network interfaces.
ru: Узел управления требует как минимум два сетевых интерфейса.

source: The controller node runs the Identity service, Image service, management portions of Compute, management portion of Networking, various Networking agents, and the dashboard. It also includes supporting services such as an SQL database, :term:`message queue`, and :term:`NTP <Network Time Protocol (NTP)>`.
ru: На узле контроллера запускает служба идентификации, служба образов, управляющие модули вычеслительных ресурсов, управляющие модули сетевых агент, различные сетевые агенты и панель управления. Также он включает вспомогательные службы, такие как база данных SQL, :term:`message queue`, and :term:`NTP <Network Time Protocol (NTP)>`.

source: The message queue runs on the controller node.
bn_in: Message queue টি কন্ট্রোলার নোডে চালু হয়ঃ
ru: Очередь сообщений работает на управляющем узле.

source: The optional Block Storage node contains the disks that the Block Storage and Shared File System services provision for instances.
ru: Необязательный узел Блочного хранения содержит диски блочного хранилища и служб общих файловых систем предоставляемые инстансам

source: The optional Object Storage node contain the disks that the Object Storage service uses for storing accounts, containers, and objects.
ru: Необязательный узел хранилища объектов содержит диски службы хранилища объектов для сохранения учетных записей, контейнеров и объектов.

source: The output should indicate four agents on the controller node and one agent on each compute node.
ru: Вывод должен указывать на четырех агентов на управляющем узле и одного агента на каждом вычислительном узле.

source: The output should indicate three agents on the controller node and one agent on each compute node.
ru: Вывод должен указывать на трех агентов на управляющем узле и одного агента на каждом вычислительном узле.

source: The provider interface uses a special configuration without an IP address assigned to it. Configure the second interface as the provider interface:
bn_in: প্রোবাইডার ইন্টারফেসটি বিশেষভাবে আইপি ছাড়া কনফিগার করতে হবে। দ্বিতীয় ইন্টারফেসটি প্রোবাইডার ইন্টারফেস হিসেবে কনফিগার করুনঃ
ru: Интерфейс провайдера использует специальную конфигурацию без указания IP-адреса. Настройте второй интерфейс как интерфейс провайдера:

source: The provider network uses 203.0.113.0/24 with a gateway on 203.0.113.1. A DHCP server assigns each instance an IP address from 203.0.113.101 to 203.0.113.250. All instances use 8.8.4.4 as a DNS resolver.
bn_in: প্রোভাইডার নেটওয়ার্ক 203.0.113.1 / 20 এ গেটওয়ে সহ 203.0.113.0/24 ব্যবহার করে। একটি DHCP সার্ভার প্রতিটি ক্ষেত্রে 203.0.113.101 থেকে 203.0.113.250 পর্যন্ত একটি আইপি এড্রেস ঠিক করে। সকল ঘটনা 8.8.4.4 DNS রিসল্বার হিসাবে ব্যবহার করে।
ru: Провайдерская сеть использует 203.0.113.0/24 со шлюзом 203.0.113.1. DHCP сервер назначает каждому инстансы адрес из диапазона 203.0.113.101 - 203.0.113.250. Все инстансы используют 8.8.4.4 в качестве DNS распознавателя.

source: The server component listens on all IP addresses and the proxy component only listens on the management interface IP address of the compute node. The base URL indicates the location where you can use a web browser to access remote consoles of instances on this compute node.
ru: Серверный компонент слушает на всех IP-адресах, а прокси компонент слушает только на IP-адресе управляющего интерфейса вычислительного узла. Базовый URL указывает адрес, на который вы можете зайти с помощью веб браузера, чтобы получить доступ до удалённых консолей инстансов на вычислительном узле.

source: The service provisions logical volumes on this device using the :term:`LVM <Logical Volume Manager (LVM)>` driver and provides them to instances via :term:`iSCSI <iSCSI Qualified Name (IQN)>` transport. You can follow these instructions with minor modifications to horizontally scale your environment with additional storage nodes.
ru: Данный сервис предоставляет логические диски на данное устройство, используя драйвер :term:`LVM <Logical Volume Manager (LVM)>` и подключает их к инстансам через транспорт :term:`iSCSI <iSCSI Qualified Name (IQN)>`. Вы можете следовать данным инструкциям с небольшими изменениями для горизонтального масштабирования вашего окружения дополнительными узлами хранилища.

source: The set up of OpenStack packages described here needs to be done on all nodes: controller, compute, and Block Storage nodes.
bn_in: এখানে বর্ণিত ওপেনস্ট্যাক প্যাকেজগুলির সেটআপটি সকল নোডে করা দরকার: কন্ট্রোলার, কম্পিউট এবং ব্লক স্টোরেজ নোডগুলিতে।
ru: Настройка описанных здесь пакетов OpenStack должна быть выполнена на всех узлах: управляющих, узлах вычислительных ресурсов, узлах блочного хранилища.

source: The smallest default flavor consumes 512 MB memory per instance. For environments with compute nodes containing less than 4 GB memory, we recommend creating the ``m1.nano`` flavor that only requires 64 MB per instance. Only use this flavor with the CirrOS image for testing purposes.
bn_in: ক্ষুদ্রতম ডিফল্ট ফ্লেভর প্রতি ইনস্টেন্সে 512 এমবি মেমরি গ্রহণ করে। 4 গিগাবাইটের চেয়ে কম মেমরিযুক্ত কম্পিউট নোডযুক্ত ইনভারমেন্টগুলির জন্য, আমরা ``m1.nano`` ফ্লেভর তৈরি করার পরামর্শ দিচ্ছি যা প্রতি ইনস্ট্যান্সে কেবলমাত্র 64 এমবি প্রয়োজন। পরীক্ষার উদ্দেশ্যে কেবল সির্রোস ইমেজ সাথে এই ফ্লেভরটি ব্যবহার করুন।
ru: Самый маленький стандартный тип инстанса включает 512Мб ОЗУ на инстанс. Для окружений с вычислительными узлами с менее чем 4Гб ОЗУ мы рекомендуем создать шаблон инстанса ``m1.nano`` который требует всего 64Мб на инстанс. Используйте этот тип инстанса только для CirrOS образа в тестовых целях.

source: This chapter explains how to install and configure the Networking service (neutron) using the :ref:`provider networks <network1>` or :ref:`self-service networks <network2>` option.
ru: Этот раздел поясняет, как установить и настроить службу Сети (neutron), используя :ref:`сети провайдера<network1>` или :ref:`собственные сети<network2>`.

source: This example architecture differs from a minimal production architecture as follows:
ru: Этот пример архитектуры отличается от минимальной производственной архитектуры следующим образом:
