Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: For more information about system requirements, see the `OpenStack Operations Guide <http://docs.openstack.org/ops/>`_.
cs: Pro další informace o požadavcích na systém si přečtěte `Průvodce provozováním OpenStack <http://docs.openstack.org/ops/>`__.
ru: Для получения большей информации о системных требованиях, смотрите `OpenStack Operations Guide <http://docs.openstack.org/ops/>`_.

source: For networking option 2, also install the ``neutron-l3-agent`` package.
cs: Pro volbu sítě2 musíte také nainstalovat balíček ``neutron-l3-agent``.

source: For security reasons, disable the temporary authentication token mechanism:
cs: Z bezpečnostních důvodů zakažte možnost přihlášení přes dočasný příznak ověření:
ru: Из соображений безопасности отключите механизм аутентификации по временному токену:

source: For security reasons, do not use the temporary authentication token for longer than necessary to initialize the Identity service.
cs: Z bezpečnostních důvodů nepoužívejte dočasný příznak ověření déle, než je nutné k zavedení služby identit.

source: For simplicity, this guide describes configuring the Image service to use the ``file`` back end, which uploads and stores in a directory on the controller node hosting the Image service. By default, this directory is ``/var/lib/glance/images/``.
cs: Pro zjednodušení tento průvodce nastavuje službu obrazů k použití podpůrné vrstvy ``file``, která obrazy ukládá a nahrává do adresáře v uzlu kontroléru provozující službu obrazů. Standardně je tento adresář v ``/var/lib/glance/images/``.

source: For simplicity, this guide uses the ``default`` domain.
cs: Pro zjednodušení používá tento průvodce doménu ``default``.

source: For the outside network to access VMs, and vice versa, routers between the networks are needed. Each router has one gateway that is connected to an external network and one or more interfaces connected to internal networks. Like a physical router, subnets can access machines on other subnets that are connected to the same router, and machines can access the outside network through the gateway for the router.
cs: Pro přístup k virtuálním strojů zvenčí a naopak jsou zapotřebí směrovače mezi jednotlivými sítěmi. Každý směrovač má jednu bránu, která je připojena k vnější síti a jedno nebo více rozhraní připojené k vnitřní síti. Jako u fyzického směrovače, podsítě mohou přistupovat ke strojím v jiných podsítích, které jsou připojeny ke stejnému směrovači a stroje mají přístup ke vnější síti přes bránu směrovače.

source: From the *compute* node, test access to the Internet:
bn_in: *কম্পিউট* নোড থেকে ইন্টারনেট পাওয়া যায়কিনা যাচাই করুন।
cs: Vyzkoušejte přístup k internetu z *výpočtového* uzlu:
ru: Проверьте доступ к интернету с узла вычислительных ресурсов:

source: From the *compute* node, test access to the management interface on the *controller* node:
bn_in: *কম্পিউট* নোড থেকে ম্যানেজমেন্ট ইন্টারফেস দিয়ে *কন্ট্রোলার* নোড কে পাওয়া যায়কিনা যাচাই করুন।
cs: Vyzkoušejte přístup k rozhraní pro správu v uzlu *kontroléru* z *výpočtového* uzlu:
ru: С узла *вычислительных ресурсов* проверьте доступ к управляющему интерфейсу на *Управляющему* узлу:

source: From the *controller* node, test access to the Internet:
bn_in: *কন্ট্রোলার* নোড থেকে ইন্টারনেট পাওয়া যায়কিনা যাচাই করুন।
cs: Vyzkoušejte přístup k internetu z uzlu *kontroléru*:
ru: Проверьте доступ к интернету с *управляющего* узла:

source: From the *controller* node, test access to the management interface on the *compute* node:
bn_in: *কন্ট্রোলার* নোড থেকে ম্যানেজমেন্ট ইন্টারফেস দিয়ে *কম্পিউট* নোড কে পাওয়া যায়কিনা যাচাই করুন।
cs: Vyzkoušejte přístup k rozhraní pro správu *výpočtového* uzlu z uzlu *kontroléru*:
ru: С *управляющего* узла проверьте доступ к управляющему интерфейсу на узле *вычислительных ресурсов*:

source: Generally, the ``-common`` packages install the configuration files. For example, the ``glance-common`` package installs the ``glance-api.conf`` and ``glance-registry.conf`` files. So, for the Image service, you must re-configure the ``glance-common`` package. The same applies for ``cinder-common``, ``nova-common``, and ``heat-common`` packages.
cs: Obvykle balíčky ``-common`` instalují soubory s nastavením. Například balíček ``glance-common`` nainstaluje soubory ``glance-api.conf`` a ``glance-registry.conf``. Takže pro službu obrazů musíte znovu nastavit balíček ``glance-common``. To stejné platí pro balíčky ``cinder-common``, ``nova-common`` a ``heat-common``.

source: Generally, this section looks like this:
cs: Obvykle by tato část měla vypadat takto:

source: Generate a key pair
cs: Vytvoření páru klíčů
ru: Сгенерируйте пару ключей

source: Generate a random value to use as the administration token during initial configuration:
cs: Vytvořte náhodnou hodnotu , jenž bude použita jako příznak správce během počátečního nastavení:

source: Generate and add a key pair:
cs: Vytvořte a přidejte pár klíčů:
ru: Сгенерируйте и добавьте пару ключей:

source: Grant proper access to the ``cinder`` database:
cs: Udělte přístup do databáze ``cinder``:
ru: Предоставьте необходимый доступ к базе данных ``cinder ``:

source: Grant proper access to the ``glance`` database:
cs: Udělte přístup do databáze ``glance``:
ru: Дайте необходимые права доступа к базе ``glance``:

source: Grant proper access to the ``heat`` database:
cs: Udělte přístup do databáze ``heat``:

source: Grant proper access to the ``keystone`` database:
cs: Udělte přístup do databáze ``keystone``:
ru: Предоставьте необходимый доступ к базе данных ``keystone``:

source: Horizon enables you to customize the brand of the dashboard.
cs: Horizon Vám umožňuje si přizpůsobit značku nástěnky.

source: Horizon provides a set of core classes and reusable templates and tools.
cs: Horizon poskytuje sadu základních tříd a použitelných šablon a nástrojů.

source: Host networking
bn_in: হোস্ট নেটওয়ার্কিং
cs: Vytváření sítě hostitele
ru: Сеть узлов

source: However, VMs will reduce performance of your instances, particularly if your hypervisor and/or processor lacks support for hardware acceleration of nested VMs.
bn_in: যাহোক, VMs আপনার পারফরম্যান্সের কর্মক্ষমতা বৃদ্ধি করবে, বিশেষ করে যদি আপনার হাইপারভাইজার এবং / অথবা প্রসেসরের নেস্টেড VMsগুলির হার্ডওয়্যার গতিবেগ বৃদ্ধি জন্য সাপোট না থাকে।
cs: Avšak virtuální stroje sníží výkon vašich instancí, zvláště pokud hypervizor a/nebo procesor nemají podporu pro hardwarovou akceleraci vnořených VM.
ru: Однако, ВМ уменьшают производительность ваших инстансов OpenStack, особенно если ваш гипервизор и/или процессор не поддерживают аппаратное ускорение вложенных ВМ.

source: IP address: 10.0.0.11
bn_in: আইপি এড্রেসঃ 10.0.0.11
cs: IP adresa: 10.0.0.11
ru: IP-адрес: 10.0.0.11

source: IP address: 10.0.0.31
bn_in: আইপি এড্রেসঃ 10.0.0.31
cs: IP adresa: 10.0.0.31
ru: IP-адрес: 10.0.0.31

source: IP address: ``10.0.0.41``
bn_in: আইপি এড্রেসঃ 10.0.0.41
cs: IP adresa: ``10.0.0.41``
ru: IP-адрес: ``10.0.0.41``

source: IP address: ``10.0.0.51``
cs: IP adresa: ``10.0.0.51``

source: IP address: ``10.0.0.52``
cs: IP adresa: ``10.0.0.52``

source: If necessary, replace ``10.0.0.0/24`` with a description of your subnet.
bn_in: প্রয়োজনে আপনার সাবনেটের বিবরণ দিয়ে `` 10.0.0.0 / 24`` এখানে যুক্ত করুন।
cs: Pokud je to nutné, nahraďte ``10.0.0.0/24`` popisem vaší podsítě.

source: If the upgrade process includes a new kernel, reboot your host to activate it.
bn_in: যদি আপগ্রেড প্রক্রিয়াটিতে একটি নতুন কার্নেল অন্তর্ভুক্ত থাকে তবে আপনার হোস্টটিকে এটি চালু করতে পুনরায় বুট করুন।
cs: Pokud proces aktualizace obsahuje i nové jádro, restartuje hostitele k jeho aktivaci.
ru: Если обновление включает новое ядро, перезагрузите хост, чтобы задействовать его.

source: If you are familiar with these packages and pre-seeding, you can proceed to :doc:`../keystone`.
cs: Pokud již umíte pracovat s těmito balíčky a předvyplňováním, můžete rovnou pokračovat na :doc:`../keystone`.

source: If you change the journaling configuration, stop the MongoDB service, remove the initial journal files, and start the service:
cs: Pokud změníte nastavení žurnálů, zastavte službu MongoDB, odstraňte počáteční žurnálové soubory a znovu službu spusťte:

source: If you choose to install on VMs, make sure your hypervisor provides a way to disable MAC address filtering on the ``public`` network interface.
cs: Pokud budete chtít nainstalovat VM, ujistěte se, že hypervisor umožňuje zakázat filtrování MAC na síťovém rozhraní ``public``.

source: If you chose networking option 1, you can only launch an instance on the public network. If you chose networking option 2, you can launch an instance on the public network and the private network.
cs: Pokud si zvolíte volbu 1 můžete instanci spustit pouze na veřejné síti. Pokud si zvolíte volbu 2, můžete ji spustit na veřejné i soukromé síti.

source: If you chose networking option 2, you can also create a private project virtual network that connects to the physical network infrastructure via layer-3 (routing) and NAT. This network includes a DHCP server that provides IP addresses to instances. An instance on this network can automatically access external networks such as the Internet. However, access to an instance on this network from external networks such as the Internet requires a :term:`floating IP address`.
cs: Pokud zvolíte 2 volbu pro síť, můžete také vytvořit virtuální síť soukromého projektu, která se připojí k infrastruktuře fyzické sítě pomocí layer-3 (směrování) a NAT. Tato síť zahrnuje DHCP server poskytující IP adresy instancím. Instance na této síti má automaticky přístup ke vnějším sítím jako internet. Avšak přístup k instanci na této síti z vnějších sítí vyžaduje :term:`Plovoucí IP adresu <floating IP address>`.

source: If you chose option 1 and your environment contains only one network, you can omit the ``--nic`` option because OpenStack automatically chooses the only network available.
bn_in: যদি আপনি অপশন 1 ঠিক করে থাকেন এবং আপনার ইনভারমেন্ট কেবল একটি নেটওয়ার্কে রয়েছে, আপনি ``--nic``অপশনটি বাদ দিতে পারেন কারণ ওপেনস্ট্যাক অটোমেটিকেলী সহজলভ্য একমাত্র নেটওয়ার্ক ঠিক করে ।
cs: Pokud si zvolíte volbu 1 a vaše prostředí obsahuje pouze jednu síť, můžete vynechat volbu ``--nic``, protože OpenStack si automaticky vybere jedinou dostupnou síť.

source: If you chose option 2, the output should also contain the private network.
cs: Pokud jste si zvolili volbu 2, výstup by měl také obsahovat soukromou síť.

source: If you configure a package with ``debconf`` incorrectly, you can re-configure it, as follows:
cs: Pokud balíček pomocí ``debconf`` nastavíte nesprávně, můžete ho znovu nastavit pomocí:

source: If you decide to not use ``dbconfig-common``, then you have to create the database and manage its access rights yourself, and run the following by hand.
cs: Pokud se rozhodnete nepoužívat ``dbconfig-common``, pak musíte sami vytvořit databázi a spravovat její přístupová práva a ručně provést následující.

source: If you want to deploy the Block Storage service, configure one additional storage node.
bn_in: আপনি যদি ব্লক স্টোরেজ যুক্ত করতে চান তাহলে, অতিরিক্ত একটি নোড কনফিগার করুন।
cs: Pokud chcete zavést službu blokového úložiště, nastavte jeden dodatečný uzel úložiště.
ru: Если вы хотите развернуть сервис блочных хранилищ, настройте один дополнительный узел хранилища.

source: If you want to deploy the Object Storage service, configure two additional storage nodes.
cs: Pokud chcete zavést službu úložiště objektů, nastavte dva dodatečné uzly úložiště.

source: If your environment includes the Block Storage service, you can create a volume and attach it to an instance.
bn_in: যদি আপনার ইনভারমেন্টে ব্লক স্টোরেজ সার্ভিস অন্তর্ভুক্ত থাকে তবে আপনি একটি ভলিউম তৈরি করতে পারেন এবং এটি একটি ইনস্টেসের সাথে সংযুক্ত করতে পারেন।
cs: Pokud vaše prostředí má službu blokového úložiště, můžete vytvořit svazek a připojit ho k instanci.
ru: Если ваша среда включает службу Блочного Хранилища, вы можете создать диск и подключить его к инстансу.

source: If your environment includes the Orchestration service, you can create a stack that launches an instance.
bn_in: যদি আপনার ইনভারমেন্টে অর্কেস্টেশন সার্ভিস অন্তর্ভুক্ত থাকে তবে আপনি একটি স্ট্যাক তৈরি করতে পারেন যা একটি ইনস্টেস চালু করে।
cs: Pokud vaše prostředí má službu orchestrace, můžete vytvořit zásobník který spouští instance.
ru: Если ваша среда включает службу Оркестрации, вы можете создать диск и подключить его к инстансу.

source: If your host does not contain the public/private key pair created in an earlier step, SSH prompts for the default password associated with the ``cirros`` user, ``cubswin:)``.
cs: Pokud váš hostitel neobsahuje pár veřejného/soukromého klíče vytvořený v předchozím kroku, zeptá se Vás SSH na výchozí heslo přidružené k uživateli ``cirros``: ``cubswin:)``.

source: If your instance does not launch or seem to work as you expect, see the `OpenStack Operations Guide <http://docs.openstack.org/ops>`__ for more information or use one of the :doc:`many other options <common/app_support>` to seek assistance. We want your first installation to work!
cs: Pokud se vaše instance nespustí, nebo nepracuje tak, jak očekáváte, prohlédněte si `Průvodce provozováním OpenStack <http://docs.openstack.org/ops>`__ pro další informace, nebo použijte :doc:`z mnoha dalších možností <common/app_support>` pro získání pomoci. Opravdu chceme, aby vaše první instalace fungovala!

source: If your storage nodes use LVM on the operating system disk, you must also add the associated device to the filter. For example, if the ``/dev/sda`` device contains the operating system:
cs: Pokud vaše uzly úložiště využívají LVM na disku s operačním systémem, musíte také přidat přidružené zařízení do filtru. Například, pokud zařízení ``/dev/sda`` obsahuje operační systém:
ru: Если узлы хранилища используют LVM для диска операционной системы, нужно также добавить связанное устройство к фильтру. Например, если операционная система расположена на устройстве ``/dev/sda`` :

source: If your web browser runs on a host that cannot resolve the ``controller`` host name, you can replace ``controller`` with the IP address of the management interface on your controller node.
bn_in: যদি আপনার ওয়েব ব্রাউজার কোনও হোস্টে চলে যা ``controller`` হোস্ট নামটি সমাধান করতে পারে না, আপনি আপনার কন্ট্রোলার নোডের মেনেজমেন্ট ইন্টারফেসের আইপি ঠিকানার সাথে ``controller`` পরিবর্তন করতে পারেন।
cs: Pokud váš internetová prohlížeč běží na hostiteli, který nemůže přeložit název hostitele ``controller``, můžete jej nahradit Ip adresou rozhraní pro správu na vašem uzlu kontroléru.
ru: Если ваш браузер открыт на хосте который не распозноет имя хоста ``controller``, вы можете изменить ``controller`` на IP адрес менеджерского интерфейса вашего управляющего узла.

source: In Debian, the Keystone package offers automatic registration of Keystone in the service catalogue. This is equivalent of running the below commands:
cs: V Debian balíček Keystone nabízí automatickou registraci Keystone v katalogu služeb. Toto je stejné jako provedení níže uvedených příkazů:

source: In Kilo and Liberty releases, the keystone project deprecates eventlet in favor of a separate web server with WSGI extensions. This guide uses the Apache HTTP server with ``mod_wsgi`` to serve Identity service requests on port 5000 and 35357. By default, the keystone service still listens on ports 5000 and 35357. Therefore, this guide disables the keystone service. The keystone project plans to remove eventlet support in Mitaka.
cs: Ve verzích Kilo a Liberty projekt Keystone označil eventlet za zastaralý a nahradill ho samostatným internetovým serverem s rozšířením WSGI. Tento režim využívá HTTP server Apache s ``mod_wsgi`` pro obsloužení žádosti služby identit na portech 5000 a 35357. Standardně služba Keystone stále poslouchá na stejných portech a proto v tomto průvodci je služba zakázána. Projekt má v plánu podporu eventlet odstranit ve verzi Mitaka.

source: In ``debconf``, the higher the priority for a screen, the greater the chance that the user sees that screen. If a ``debconf`` screen has ``medium`` priority and you configure the Debian system to show only ``critical`` prompts, which is the default in Debian, the user does not see that ``debconf`` screen. Instead, the default for the related package is used. In the Debian OpenStack packages, a number of ``debconf`` screens are set with ``medium`` priority. Consequently, if you want to respond to all ``debconf`` screens from the Debian OpenStack packages, you must run the following command and select the ``medium`` priority before you install any packages:
cs: Čím vyšší má prioritu obrazovka v ``debconf``, tím větší je šance, že ji uživatel uvidí. Pokud má obrazovka prioritu ``medium`` a vy Debian nastavíte, aby zobrazoval pouze výzvy s prioritou ``critical``, což je v Debian výchozí nastavení, uživatel obrazovku ``debconf`` neuvidí. Místo toho je použita výchozí hodnota pro související balíček. V balíčcích Openstack pro Debian má mnoho obrazovek ``debconf`` prioritu ``medium``. Tudíž pokud chcete odpovídat na všechny obrazovky ``debconf`` z balíčku OpenStack pro Debian, musíte spustit následující příkaz a vybrat prioritu ``medium`` před instalací jakéhokoli balíčku:

source: In addition to external networks, any Networking set up has one or more internal networks. These software-defined networks connect directly to the VMs. Only the VMs on any given internal network, or those on subnets connected through interfaces to a similar router, can access VMs connected to that network directly.
cs: Vedle vnějších sítí má každá infrastruktura nastavenu jednu nebo více vnitřních sítí. Tyto softwarem určené sítě se připojují přímo k virtuálnímu stroji. K těmto virtuálním strojům lze získat přístup pouze ze zadané vnitřní sítě přes jiné virtuální stroje, nebo podsítí připojených pomocí rozhraní k podobnému směrovači.
ru: В дополнение ко внешним сетям, в любой сетевой настройке есть хотя бы одна внутренняя сеть. Эти программно-определяемые сети подключаются напрямую к виртуальным машинам. Только виртуальные машины в данной внутренней сети, либо в подсетях, подключенных через интерфейсы к тому же маршрутизатору, имеют прямой доступ к виртуальным машинам в этой сети.

source: In case the message queue service does not start and returns a ``nodedown`` error, perform the following actions:
cs: V případě, že se služba fronty zpráv nespustí a vrátí chybu ``nodedown``, proveďte následující úkony:

source: In each client environment script, configure the Image service client to use API version 2.0:
cs: V každém skriptu prostředí klienta nastavte službu obrazů, aby používala API verze 2.0:

source: In the ``[DEFAULT]`` and ``[keystone_authtoken]`` sections, configure Identity service access:
cs: V částech ``[DEFAULT]`` a ``[keystone_authtoken]`` nastavte přístup ke službě identit:
ru: Настройте доступ к идентификатору в разделах ``[DEFAULT]`` и ``[keystone_authtoken]``:

source: In the ``[DEFAULT]`` and ``[nova]`` sections, configure Networking to notify Compute of network topology changes:
cs: V částech ``[DEFAULT]`` a ``[nova]`` nastavte službu sítí aby oznamovala službě výpočtu změny v topologii sítě:

source: In the ``[DEFAULT]`` and ``[oslo_messaging_rabbit]`` sections, configure RabbitMQ message queue access:
cs: V částech ``[DEFAULT]`` a ``[oslo_messaging_rabbit]`` nastavte přístup ke frontě zpráv RabbitMQ:

source: In the ``[DEFAULT]`` and ``[oslo_messaging_rabbit]`` sections, configure ``RabbitMQ`` message queue access:
cs: V částech ``[DEFAULT]`` a ``[oslo_messaging_rabbit]`` nastavte přístup ke frontě zpráv ``RabbitMQ``:

source: In the ``[DEFAULT]`` and ``[oslo_messaging_rabbit]`` sections, configure notifications and RabbitMQ message broker access:
cs: V částech ``[DEFAULT]`` a ``[oslo_messaging_rabbit]`` nastavte upozornění a přístup zprostředkovatele zpráv RabbitMQ:

source: In the ``[DEFAULT]`` section, configure notifications:
cs: V části ``[DEFAULT]`` nastavte upozornění:

source: In the ``[DEFAULT]`` section, configure the Linux bridge interface driver and external network bridge:
cs: V části ``[DEFAULT]`` nastavte ovladač rozhraní přemostění Linux a vnější síťový most:
ru: Настройте Linux bridge драйвер и мост во внешнюю сеть, в разделе ``[DEFAULT]``:

source: In the ``[DEFAULT]`` section, configure the Linux bridge interface driver, Dnsmasq DHCP driver, and enable isolated metadata so instances on public networks can access metadata over the network:
cs: V části ``[DEFAULT]`` nastavte ovladač rozhraní přemostění Linux, ovladač DHCP Dnsmasq a povolte izolovaná popisná data, aby instance mohli na veřejných sítích získat přístup k popisným datům napříč sítí:

source: In the ``[DEFAULT]`` section, configure the ``my_ip`` option to use the management interface IP address of the controller node:
cs: V části ``[DEFAULT]`` nastavte volbu ``my_ip`` pro zvolení IP adresy rozhraní pro správce v uzlu kontroléru:
ru: Настройте опцию ``my_ip`` в разделе ``[DEFAULT]`` под использование IP адреса с менеджмент интерфейса на Управляющем узле:

source: In the ``[DEFAULT]`` section, configure the ``my_ip`` option:
cs: V části ``[DEFAULT]`` nastavte volbu ``my_ip``:
ru: В разделе "[DEFAULT]" задайте опцию "my_ip":

source: In the ``[DEFAULT]`` section, configure the ``noop`` notification driver to disable notifications because they only pertain to the optional Telemetry service:
cs: V části ``[DEFAULT]`` nastavte ovladač upozornění ``noop`` pro jejich zákaz, protože se vztahují pouze k doplňkové službě telemetrie:

source: In the ``[DEFAULT]`` section, configure the location of the Image service:
cs: V části ``[DEFAULT]`` nastavte umístění služby obrazů:

source: In the ``[DEFAULT]`` section, configure the metadata and wait condition URLs:
cs: V části ``[DEFAULT]`` nastavte popisná data a URL pro podmínky čekání:

source: In the ``[DEFAULT]`` section, configure the stack domain and administrative credentials:
cs: V části ``[DEFAULT]`` nastavte doménu zásobníku a přihlašovací údaje správce:

source: In the ``[DEFAULT]`` section, define the value of the initial administration token:
cs: V části ``[DEFAULT]`` uveďte hodnotou počátečního příznaku správce:

source: In the ``[DEFAULT]`` section, disable additional plug-ins:
cs: V části ``[DEFAULT]`` zakažte další zásuvné moduly:

source: In the ``[DEFAULT]`` section, enable the LVM back end:
cs: V části ``[DEFAULT]`` povolte podpůrnou vrstvu LVM:
ru: Включите LVM бэкенд в разделе ``[DEFAULT]``:

source: In the ``[DEFAULT]`` section, enable the Modular Layer 2 (ML2) plug-in and disable additional plug-ins:
cs: V části ``[DEFAULT]`` povolte zásuvný modul Modular Layer 2 (ML2) a zakažte další zásuvné moduly:

source: In the ``[DEFAULT]`` section, enable the Modular Layer 2 (ML2) plug-in, router service, and overlapping IP addresses:
cs: V části ``[DEFAULT]`` povolte zásuvný modul Modular Layer 2 (ML2), službu směrovače a překrývání IP adres:
ru: Включите Modular Layer 2 (ML2) плагин, сервис маршрутизации и пересекающиеся IP адреса в разделе ``[DEFAULT]``:

source: In the ``[agent]`` section, enable ARP spoofing protection:
cs: V části ``[agent]`` povolte ochranu proti falšování ARP:

source: In the ``[collector]`` section, configure the dispatcher:
cs: V části ``[collector]``nastavte odesílatele:

source: In the ``[database]`` section, comment out any ``connection`` options because compute nodes do not directly access the database.
cs: V části ``[database]`` okomentujte všechny volby ``connection`` protože uzly výpočty nevyužívají přímý přístup k databázi.
ru: В секции ``[database]`` закомментируйте все опции``connection`` потому что вычислительные узлы не обращаются напрямую к базе данных.

source: In the ``[database]`` section, configure database access:
cs: V části ``[database]`` nastavte přístup k databázi:
ru: Сконфигурируйте доступ к базе данных в разделе ``[database]``:
