Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: The Debian OpenStack packages offer automation for this, so OpenStack users do not have to manually edit the configuration files.
cs: Balíčky Debian OpenStack tyto kroky automatizují, aby uživatelé OpenStack nemuseli soubory upravovat ručně.

source: The Debian package post installation scripts will then perform the below commands for you:
cs: Skripty spouštěné po instalaci pak za Vás provedou následující příkazy:

source: The Debian packages
cs: Balíčky Debian

source: The Identity service is installed with MySQL as the database back end, ``keystonedb`` as database name, and the localhost socket file. The corresponding DSN (Database Source Name) will then be:
cs: Služba identit je nainstalovaná spolu s MySQL sloužící jako jádro databáze, databází ``keystonedb`` a souborem socketu na místním hostiteli. Odpovídající DNS (Název zdroje databáze) tedy bude:

source: The Identity service manages a catalog of API endpoints associated with the services in your OpenStack environment. Services use this catalog to determine how to communicate with other services in your environment.
cs: Služba identit spravuje katalog koncových bodů API přidružených ke službám ve vašem prostředí OpenStack. Služby tento katalog využívají pro zjištění jak komunikovat s ostatními službami ve vašem prostředí.

source: The Identity service manages a catalog of services in your OpenStack environment. Services use this catalog to determine the other services available in your environment.
cs: Služba identit spravuje katalog služeb ve vašem prostředí OpenStack. Služby tento katalog využívají pro zjištění dostupnosti ostatních služeb ve vašem prostředí.

source: The Identity service provides a catalog of services and their locations. Each service that you add to your OpenStack environment requires a :term:`service` entity and several :term:`API endpoints<API endpoint>` in the catalog.
cs: Služba identit poskytuje katalog služeb a jejich umístění. Každá služba, kterou přidáte do vašeho prostředí OpenStack vyžaduje objekt :term:`služby<service>` a několik :term:`Koncových bodů API <API endpoint>` v katalogu.

source: The Identity service provides authentication services for each OpenStack service. The authentication service uses a combination of :term:`domains <domain>`, :term:`projects<project>` (tenants), :term:`users<user>`, and :term:`roles<role>`.
cs: Služba identit poskytuje možnosot ověření pro každou službu OpenStack. Služba ověření využívá kombinaci :term:`domén<domain>`, :term:`projektů<project>` (nájemníků), :term:`uživatelů<user>` a :term:`rolí<role>`.

source: The Liberty release is available directly through the official Debian backports repository. To use this repository, follow the instruction from the official `Debian website <http://backports.debian.org/Instructions/>`_, which basically suggest doing the following steps:
cs: Verze Liberty je dostupná přímo přes oficiální repozitář Debian backports. Pro použití tohoto repozitáře se řiďte pokyny z oficiální `stránky Debian <http://backports.debian.org/Instructions/>`_, která Vás v podstatě navede k provedení těchto úkonů:

source: The Linux bridge agent builds layer-2 (bridging and switching) virtual networking infrastructure for instances including VXLAN tunnels for private networks and handles security groups.
cs: Linux agent přemostění sestaví layer-2 (přemostění/rozbočování) infrastrukturu virtuální sítě pro instance včetně tunelů VXLAN pro soukromé sítě a správy bezpečnostních skupin.

source: The Linux bridge agent only supports VXLAN overlay networks.
cs: Agent přemostění Linux podporuje pouze překryvné sítě VXLAN.

source: The ML2 plug-in uses the Linux bridge mechanism to build layer-2 (bridging and switching) virtual networking infrastructure for instances.
cs: Zásuvný modul ML2 využívá Linux agenta přemostění pro sestavení layer-2 (přemostění/rozbočování) infrastruktury virtuální sítě pro instance.

source: The Networking common component configuration includes the authentication mechanism, message queue, and plug-in.
cs: Nastavení společných součástí sítě zahrnuje mechanismus ověření, frontu zpráv a zásuvný modul.
ru: Настройка общего сетевого компонента включает механизм аутентификации, очередь сообщений и плагин.

source: The Networking server component configuration includes the database, authentication mechanism, message queue, topology change notifications, and plug-in.
cs: Nastavení součásti serveru služby sítí spočívá v nastavení databáze, nástroje pro ověření, fronty zpráv, oznamování změn v topologii a zásuvných modulů.

source: The Networking service initialization scripts expect a symbolic link ``/etc/neutron/plugin.ini`` pointing to the ML2 plug-in configuration file, ``/etc/neutron/plugins/ml2/ml2_conf.ini``. If this symbolic link does not exist, create it using the following command:
cs: Skripty pro zavedení služby sítí očekávají symbolický odkaz ``/etc/neutron/plugin.ini`` odkazující na soubor s nastavením zásuvného modulu ML2 ``/etc/neutron/plugins/ml2/ml2_conf.ini``. Pokud tento odkaz neexistuje, vytvořte pomocí následujícího příkazu:

source: The Networking service initialization scripts expect the variable ``NEUTRON_PLUGIN_CONF`` in the ``/etc/sysconfig/neutron`` file to reference the ML2 plug-in configuration file. Edit the ``/etc/sysconfig/neutron`` file and add the following:
cs: Skripty pro zavedení služby sítí očekávají proměnnou ``NEUTRON_PLUGIN_CONF`` v souboru ``/etc/sysconfig/neutron`` odkazující na soubor s nastavením zásuvného modulu ML2. Upravte soubor ``/etc/sysconfig/neutron`` a přidejte následující:

source: The OpenStack Block Storage service provides block storage devices to guest instances. The method in which the storage is provisioned and consumed is determined by the Block Storage driver, or drivers in the case of a multi-backend configuration. There are a variety of drivers that are available: NAS/SAN, NFS, iSCSI, Ceph, and more. The Block Storage API and scheduler services typically run on the controller nodes. Depending upon the drivers used, the volume service can run on controllers, compute nodes, or standalone storage nodes. For more information, see the `Configuration Reference <http://docs.openstack.org/liberty/ config-reference/content/section_volume-drivers.html>`__.
cs: OpenStack služba blokového úložiště poskytuje zařízení blokového úložiště pro instance hosta. Metoda, jak je úložiště poskytnuto a spotřebováno, je určena ovladačem blokového úložiště, nebo ovladači v případě nastavení více podpůrných vrstev. Je dostupná široká škála ovladačů: NAS/SAN, NFS, iSCSI, Ceph a další. API blokového úložiště a služby plánovače zpravidla běží na uzlech kontroléru. V závislosti na použitých ovladačích může služba svazku běžet na kontrolorech, výpočetních uzlech, nebo samostatných uzlech úložiště. Pro další informace si přečtěte `Stránku se seznamem podporovaných ovladačů <http://docs.openstack.org/liberty/ config-reference/content/section_volume-drivers.html>`__.

source: The OpenStack Dashboard, also known as `horizon <https://git.openstack.org/cgit/openstack/horizon>`__ is a web interface that enables cloud administrators and users to manage various OpenStack resources and services.
cs: Nástěnka OpenStack, známá také jako `Horizon <https://git.openstack.org/cgit/openstack/horizon>`__ je internetové rozhraní, které umožňuje správcům a uživatelům cloud spravovat různé služby a zdroje OpenStack.

source: The OpenStack Image service (glance) enables users to discover, register, and retrieve virtual machine images. It offers a :term:`REST <RESTful>` API that enables you to query virtual machine image metadata and retrieve an actual image. You can store virtual machine images made available through the Image service in a variety of locations, from simple file systems to object-storage systems like OpenStack Object Storage.
cs: Služba obrazů OpenStack (Glance) umožňuje uživatelům zobrazit, registrovat a získat obrazy virtuálních strojů. Nabízí :term:`REST <RESTful>` API, díky čemuž můžete vytvářet dotazy na popisná data obrazu a pak je získávat. Obrazy virtuálních obrazů umístěné do služby lze ukládat do různých umístění, od jednoduchých systémů souborů až po systémy úložiště objektů, jež OpenStack také nabízí.

source: The OpenStack system consists of several key projects that you install separately. These projects work together depending on your cloud needs. These projects include Compute, Identity Service, Networking, Image Service, Block Storage, Object Storage, Telemetry, Orchestration, and Database. You can install any of these projects separately and configure them stand-alone or as connected entities.
cs: Systém OpenStack se skládá z několika klíčových projektů, které instalujete jednotlivě. Tyto projekty pracují spolu v závislosti na potřebách vašeho cloudu. Tyto projekty jsou služba výpočtu, identit, sítí, obrazů, blokového úložiště, úložiště objektů, telemetrie, orchestrace a databáze. Všechny tyto projekty lze nainstalovat odděleně a nastavit je jako samostatné nebo propojené entity.

source: The Orchestration service (heat) uses a heat orchestration template (HOT) to create and manage cloud resources.
cs: Služba orchestrace (Heat) využívá šablony pro orchestraci (HOT) pro vytváření a správu zdrojů v cloud.

source: The Orchestration service uses templates to describe stacks. To learn about the template language, see `the Template Guide <http://docs.openstack.org/developer/heat/template_guide/index.html>`__ in the `Heat developer documentation <http://docs.openstack.org/developer/heat/index.html>`__.
cs: Služba orchestrace využívá šablony k vytvoření zásobníků. Pro další informace o jazyce šablon si přečtěte `příručku šablon <http://docs.openstack.org/developer/heat/template_guide/index.html>`__ v `Dokumentaci pro vývojáře Heat <http://docs.openstack.org/developer/heat/index.html>`__.

source: The Telemetry chapter provides an Image service configuration that enables notifications.
cs: Kapitola o telemetrii obsahuje nastavení služby obrazů pracující s upozorněními.

source: The Telemetry service requires access to the Object Storage service using the ``ResellerAdmin`` role. Perform these steps on the controller node.
cs: Služba telemetrie vyžaduje přístup do úložiště objektů pomocí role ``ResellerAdmin``. Proveďte tyto kroky na uzlu kontroléru.

source: The Telemetry service uses a NoSQL database to store information. The database typically runs on the controller node. The procedures in this guide use MongoDB.
cs: Služba telemetrie využívá NoSQL databázi k ukládání informací. Databáze je standardně provozována na uzlu kontroléru. Instrukce v tomto průvodci používají MongoDB.

source: The ``--provider:physical_network public`` and ``--provider:network_type flat`` options connect the flat virtual network to the flat (native/untagged) public physical network on the ``eth1`` interface on the host using information from the following files:
cs: Volby ``--provider:physical_network public`` a ``--provider:network_type flat`` připojují plochou virtuální síť do ploché (neoznačené/přirozené) veřejné fyzické sítě přes rozhraní ``eth1`` na hostiteli pomocí údajů z následujících souborů:

source: The ``--shared`` option allows all projects to use the virtual network.
cs: Volba ``--shared`` umožňuje všem projektům využít virtuální síť.

source: The ``admin`` or other privileged user must create this network because it connects directly to the physical network infrastructure.
bn_in: ``admin`` বা অন্যান্য সুবিধাভোগী ব্যবহারকারীকে অবশ্যই এই নেটওয়ার্কটি তৈরি করতে হবে কারণ এটি সরাসরি পিজিক্যাল নেটওয়ার্কের অবকাঠামোর সাথে সংযুক্ত।
cs: Uživatel ``admin``, nebo jakýkoli jiný oprávněný uživatel musí tuto síť vytvořit, protože se připojuje přímo k infrastruktuře fyzické sítě.
ru: ``admin`` или другой привилегированный пользователь должен создать эту сеть потому что она подключается прямо к физической сетевой инфраструктуре.

source: The ``dbconfig-common`` package will configure MySQL for these access rights, and create the database for you. Since OpenStack 2014.1.1, all OpenStack packages in Debian are performing the following MySQL query after database creation (if you decide to use MySQL as a back-end):
cs: Balíček ``dbconfig-common`` nastaví v MySQL tyto přístupová práva a vytvoří za Vás databázi. Od OpenStack 2014.1.1 všechny balíčky OpenStack v Debian provádějí následující dotaz na MySQL po vytvoření databáze (pokud se rozhodnete využít MySQL jako jádro databáze):

source: The ``demo`` or other unprivileged user can create this network because it only provides connectivity to instances within the ``demo`` project.
cs: Uživatel ``demo``, nebo jakýkoli jiný uživatel bez správcovských oprávnění může tuto síť vytvořit, protože poskytuje připojení pouze k instancím v rámci projektu ``demo``.

source: The ``external_network_bridge`` option intentionally lacks a value to enable multiple external networks on a single agent.
cs: Volba ``external_network_bridge`` schválně nemá hodnotu pro umožnění mnoha vnějších sítí v jednom agentovi.

source: The ``heat-common`` package and not the ``heat-api`` package configures the Orchestration service.
cs: Službu orchestrace registruje balíček ``heat-common`` a ne ``heat-api``.

source: The ``seen true`` option tells ``debconf`` that a specified screen was already seen by the user so do not show it again. This option is useful for upgrades.
cs: Volba ``seen true`` říká ``debconf``, žw konkrétní obrazovku již uživatel viděl a proto není třeba ji znovu zobrazovat. Tato volba je vhodná pro aktualizace.

source: The ``systemctl restart`` command starts each service if not currently running.
cs: Příkaz ``systemctl restart`` spustí každou službu, pokud tomu ještě tak není.
ru: Команда ``systemctl restart`` запускает каждый сервис, в случае если он не был запущен.

source: The automatic configuration process generates a self-signed SSL certificate. Consider obtaining an official certificate for production environments.
cs: Proces automatického nastavení vytvoření SSL certifikát podepsaný sám sebou. Pro ostré provozy prosím zvažte pořízení oficiálního certifikátu.
ru: Автоматическая настройка генерирует самоподписанный сертификат SSL. Обдумайте получение официального сертификата для производственной среды.

source: The compute node handles connectivity and :term:`security groups <security group>` for instances.
cs: Výpočetní uzel obsluhuje připojení a :term:`bezpečnostní skupiny <security group>` instancí.

source: The dashboard relies on functional core services including Identity, Image service, Compute, and either Networking (neutron) or legacy networking (nova-network). Environments with stand-alone services such as Object Storage cannot use the dashboard. For more information, see the `developer documentation <http://docs.openstack.org/developer/ horizon/topics/deployment.html>`__.
cs: Nástěnka závisí na fungování hlavních služeb, včetně služby identit, obrazů, výpočtu a buď sítí (Neutron), nebo zastaralé služby sítí (nova-network). Prostředí mající nezávislé služby jako např. úložiště objektů nemohou nástěnku použít. Pro další informace si přečtěte `dokumentaci pro vývojáře <http://docs.openstack.org/developer/ horizon/topics/deployment.html>`__.

source: The debconf system helps users configure the ``auth_uri``, ``identity_uri``, ``admin_tenant_name``, ``admin_user``, and ``admin_password`` options.
cs: Systém debconf pomáhá uživatelům nastavit volby ``auth_uri``, ``identity_uri``, ``admin_tenant_name``, ``admin_user`` a ``admin_password``.

source: The example architectures assume use of the following networks:
bn_in: এই আর্কিটেকচার উদাহরণে নিচের নেটওয়ার্কগুলো ব্যবহার করা হয়েছেঃ
cs: Ukázková architektura předpokládá využití následujících sítí:

source: The following example shows how to pre-seed an automated MySQL Server installation:
cs: Následující příklad ukazuje, jak předvyplnit automatickou instalaci serveru MySQL:

source: The following instructions and diagrams use example IP address ranges. You must adjust them for your particular environment.
bn_in: নিম্নলিখিত নির্দেশাবলী এবং ডায়াগ্রামগুলি আইপি অ্যাড্রেস রেঞ্জ উদাহরণ ব্যবহার করে example আপনার অবশ্যই নির্দিষ্ট ইনবারমেন্ট জন্য এগুলি এডজাষ্ট করতে হবে।
cs: Následující pokyny a schémata používají vzorové rozsahy IP adres. Musíte si je přizpůsobit tak, aby odpovídaly vašemu prostředí.
ru: Следующие инструкции и схемы используют примерные диапазоны IP адресов. Вы должны изменить их для вашего конкретного окружения.

source: The following screens show an example Image service configuration:
cs: Následující obrazovky představují vzorové nastavení služby obrazů:

source: The following table provides a list of services that require passwords and their associated references in the guide:
cs: Následující tabulka uvádí seznam služeb, které vyžadují hesla a názvy pod kterými jsou označovány v tomto průvodci:
ru: Следующая таблица содержит список сервисов требующих пароли и связанные с ними ссылки в инструкции:

source: The installation of the NoSQL database server is only necessary when installing the Telemetry service as documented in :ref:`install_ceilometer`.
cs: Instalace databázového serveru NoSQL je nutná pouze v případě, že instalujete službu telemetrie, tak jak je popsáno v :ref:`install_ceilometer`.

source: The openSUSE distribution uses the concept of patterns to represent collections of packages. If you selected 'Minimal Server Selection (Text Mode)' during the initial installation, you may be presented with a dependency conflict when you attempt to install the OpenStack packages. To avoid this, remove the minimal\_base-conflicts package:
cs: Distribuce openSUSE využívá koncept vzorů představujících sadu balíčků. Pokud jste při instalaci zvolili 'Minimal Server Selection (Text Mode)', je možné, že dojde ke konfliktu závislostí při pokusu o instalaci balíčků OpenStack. Abyste se tomuto vyhnuli, odstraňte balíček minimal\_base-conflicts:
ru: Дистрибутив openSUSE использует концепцию паттернов для представления коллекции пакетов. Если вы выбрали 'Минимальный сервер (Текстовый режим)' во время первоначальной установки, вы можете столкнуться с конфликтом зависимостей при попытке установить пакеты OpenStack. Для избежания проблемы, удалите пакет minimal\_base-conflicts:

source: The other directives concerning RabbitMQ will stay untouched.
cs: Další příkazy týkající se RabbitMQ zůstávají nezměněny.

source: The packages are signed by GPG key ``05905EA8``. You should verify the fingerprint of the imported GPG key before using it.
cs: Balíčky jsou podepsány klíčem GPG ``05905EA8``. Před importováním klíče GPG byste měli ověřit jeho otisk.

source: The packages are signed by GPG key ``17280DDF``. You should verify the fingerprint of the imported GPG key before using it.
cs: Balíčky jsou podepsány klíčem GPG ``17280DDF``. Před importováním klíče GPG byste měli ověřit jeho otisk.

source: The packages are signed by GPG key ``D85F9316``. You should verify the fingerprint of the imported GPG key before using it.
bn_in: প্যাকেজগুলি GPG কী `85 D85F9316`` দ্বারা স্বাক্ষরিত `` আপনার আমদানি করা GPG কীটি ব্যবহারের আগে ফিঙ্গারপ্রিন্টটি যাচাই করা উচিত।
cs: Balíčky jsou podepsány klíčem GPG ``D85F9316``. Před importováním klíče GPG byste měli ověřit jeho otisk.
ru: Пакеты подписаны GPG ключом ``D85F9316``. Вам следует проверить отпечаток проимпортированного ключа перед его использованием.

source: The packages can automatically create the service entity and API endpoint.
cs: Balíčky mohou objekt služby a koncový bod API automaticky vytvořit.

source: The packages can automatically create the service entity and API endpoints.
cs: Balíčky mohou objekt služby a koncové body API automaticky vytvořit.

source: The packages do not require pre-depends. If ``dbconfig-common`` is already installed on the system, the user sees all prompts. However, you cannot define the order in which the ``debconf`` screens appear. The user must make sense of it even if the prompts appear in an illogical order.
cs: Balíčky nevyžadují pre-depends. Pokud je ``dbconfig-common`` v systému již nainstalován, uživatel uvidí všechny dotazy. Pořadí zobrazení obrazovek ``debconf`` ale nelze určit. Uživatel musí sám porozumět dotazům, i když se budou zobrazovat v nelogickém pořadí.

source: The previous section used a combination of environment variables and command options to interact with the Identity service via the ``openstack`` client. To increase efficiency of client operations, OpenStack supports simple client environment scripts also known as OpenRC files. These scripts typically contain common options for all clients, but also support unique options. For more information, see the `OpenStack User Guide <http://docs.openstack.org/user-guide/common/ cli_set_environment_variables_using_openstack_rc.html>`__.
cs: Předchozí část využívala kombinaci proměnných prostředí a voleb příkazů pro práci se službou identit přes klienta ``openstack``. Pro zvýšení účinnosti operací klienta, OpenStack podporuje jednoduché skripty prostředí klienta, známé taky jako soubory OpenRC. Tyto skripty většinou obsahují společné volby pro všechny klienty, ale také podporují specifické volby. Pro další informace si přečtěte `Uživatelskou příručku OpenStack <http://docs.openstack.org/user-guide/common/ cli_set_environment_variables_using_openstack_rc.html>`__.

source: The private network uses 172.16.1.0/24 with a gateway on 172.16.1.1. A DHCP server assigns each instance an IP address from 172.16.1.2 to 172.16.1.254. All instances use 8.8.4.4 as a DNS resolver.
cs: Soukromá síť využívá 172.16.1.0/24 s bránou na 172.16.1.1. DHCP server přidělí každé instanci Ip adresu v rozsahu od 172.16.1.2 do 172.16.1.254. Všechny instance využívají 8.8.4.4 jako překladač DNS.

source: The public interface uses a special configuration without an IP address assigned to it. Configure the second interface as the public interface:
cs: Veřejné rozhraní používá zvláštní nastavení bez přidělené IP adresy. Nastavte druhé rozhraní jako veřejné:

source: The public network uses 203.0.113.0/24 with a gateway on 203.0.113.1. A DHCP server assigns each instance an IP address from 203.0.113.101 to 203.0.113.200. All instances use 8.8.4.4 as a DNS resolver.
cs: Veřejná síť využívá 203.0.113.0/24 s bránou na 203.0.113.1. DHCP server přidělí každé instanci Ip adresu v rozsahu od 203.0.113.101 do 203.0.113.200. Všechny instance využívají 8.8.4.4 jako překladač DNS.

source: The public provider network must include the ``router: external`` option to enable project routers to use it for connectivity to external networks such as the Internet. The ``admin`` or other privileged user must include this option during network creation or add it later. In this case, we can add it to the existing ``public`` provider network.
cs: Veřejná síť poskytovatele musí mít volbu ``router: external`` aby směrovače projektu ji mohli využít pro připojení k vnějším sítím, jako např. Internet. Uživatel ``admin`` nebo jiný oprávnění uživatelé musí tuto volbu použít při vytváření sítě, nebo ji přidat později. V tomto případě ji můžeme přidat do existující ``public`` sítě poskytovatele.

source: The rules described here are from the `Debian Policy Manual <http://www.debian.org/doc/debian-policy/>`__. If any rule described in this chapter is not respected, you have found a serious bug that must be fixed.
cs: Pravidla popsaná zde pocházejí z `Příručky zásad Debian <http://www.debian.org/doc/debian-policy/>`__. Pokud je jakékoli pravidlo, popsané v této kapitole, porušeno, narazili jste na vážnou chybu, kterou je třeba opravit.
