Repository: openstack/openstack-manuals
Catalog: doc/install-guide/source/locale/*/LC_MESSAGES/install-guide.po
Languages: bn_in, cs, ru

source: Edit the ``/etc/etcd/etcd.conf`` file and set the ``ETCD_INITIAL_CLUSTER``, ``ETCD_INITIAL_ADVERTISE_PEER_URLS``, ``ETCD_ADVERTISE_CLIENT_URLS``, ``ETCD_LISTEN_CLIENT_URLS`` to the management IP address of the controller node to enable access by other nodes via the management network:
bn_in: "/etc/etcd/etcd.conf" ফাইলটির মধ্যে লিখুন "ETCD_INITIAL_CLUSTER" , " ETCD_INITIAL_ADVERTISE_PEER_URLS", "ETCD_ADVERTISE_CLIENT_URLS", "ETCD_LISTEN_CLIENT_URLS" অন্যান্য নোডগুলো যাতে ম্যানেজমেন্ট নেটোওয়ার্ক এর মাধ্যমে এক্সেস করতে পারে।

source: Edit the ``/etc/memcached.conf`` file and configure the service to use the management IP address of the controller node. This is to enable access by other nodes via the management network:
bn_in: "/etc/memcached.conf" ফাইলটি সম্পাদন করুন এবং কন্ট্রোলার নোড এর ম্যানেজমেন্ট আইপি এড্রেস দিয়ে সার্ভিসটি কনফিগার করুন। এটার মাধ্যমে অন্যান্য নোডগুলো ম্যানেজমেন্ট নেটওয়ার্ক দিয়ে এক্সেস করতে সক্ষম হবেঃ

source: Edit the ``/etc/sysconfig/memcached`` file and complete the following actions:
bn_in: "/etc/sysconfig/memcached" ফাইলটি সম্পাদন করুন এবং নিচের ধাপগুলো সম্পন্ন করুনঃ

source: Edit the ``chrony.conf`` file and add, change, or remove the following keys as necessary for your environment.
bn_in: ``chrony.conf``এই ফাইলটি Edit করুন এবং আপনার এনভারমেন্ট এর জন্য প্রয়োজনীয় হিসাবে নিম্নলিখিত কীগুলি যুক্ত করুন, পরিবর্তন করুন বা অপসারণ করুন।

source: Enable and restart the etcd service:
bn_in: Etcd সার্ভিসটি সক্ষম করুন এবং পুনরায় চালু করুনঃ

source: Enable and start the etcd service:
bn_in: Etcd সার্ভিসটি সক্ষম করুন এবং চালু করুনঃ

source: Enable the Open Build Service repositories based on your openSUSE or SLES version, and on the version of OpenStack you want to install:
bn_in: আপনার openSUSE or SLES version উপর ভিত্তি করে ওপেনস্ট্যাকের(OpenStack) version ওপেন বিল্ড সার্ভিস সংগ্রহস্থলগুলি চালু করুন:

source: Enable the repository for Ubuntu Cloud Archive
bn_in: Ubuntu Cloud আরকাইবটির জন্য রিপোজিটরি চালু করুন

source: Etcd for RHEL and CentOS
bn_in: RHEL এবং CentOS এর জন্য Etcd

source: Etcd for SUSE
bn_in: SUSE এর জন্য Etcd

source: Etcd for Ubuntu
bn_in: Ubuntu এর জন্য Etcd

source: Firewalls and default ports
bn_in: ফায়ারওয়াল এবং ডিফল্ট পোর্ট ব্যবহার করুন ।

source: For RHEL or CentOS:
bn_in: RHEL অথবা CentOS এর জন্যঃ

source: For RHEL, CentOS, or SUSE, edit the ``/etc/chrony.conf`` file:
bn_in: RHEL, CentOS, or SUSE এর জন্য, `` / etc/ chrony.conf`` ফাইলটি edit করুন:

source: For RHEL, CentOS, or SUSE:
bn_in: RHEL, CentOS, or SUSE এর জন্য

source: For SUSE:
bn_in: SUSE এর জন্যঃ

source: For Ubuntu, edit the ``/etc/chrony/chrony.conf`` file:
bn_in: Ubuntu, এর জন্য, `` /etc/chrony /chrony.conf`` ফাইলটি edit করুন:

source: For Ubuntu:
bn_in: Ubuntu এর জন্যঃ

source: For a full list of supported Ubuntu OpenStack releases, see "Ubuntu OpenStack release cycle" at https://www.ubuntu.com/about/release-cycle.
bn_in: Supported Ubuntu ওপেনস্ট্যাক রিলিজ এর পুরো তালিকার জন্য, "Ubuntu OpenStack release cycle" দেখুন at https://www.ubuntu.com/about/release-cycle.

source: For best performance, we recommend that your environment meets or exceeds the hardware requirements in :ref:`figure-hwreqs`.
bn_in: সর্বোত্তম পারফরম্যান্সের জন্য, আমরা আপনাকে রিকুমেন্ড করছি আপনার এনভারমেন্টটি হার্ডওয়্যার প্রয়োজনীয়তাগুলি পূরণ করে বা এতে চালানো হয়েছে: :ref:`figure-hwreqs`.

source: For communication between the processes of one service, an AMQP message broker is used. The service's state is stored in a database. When deploying and configuring your OpenStack cloud, you can choose among several message broker and database solutions, such as RabbitMQ, MySQL, MariaDB, and SQLite.
bn_in: এই সার্ভিস প্রক্রিয়াগুলির মধ্যে যোগাযোগের জন্য, একটি AMQP মেসেজ ব্রোকার ব্যবহৃত হয়। সার্ভিসটির স্থিতি একটি ডাটাবেসে সংরক্ষণ করা হয়। আপনার ওপেনস্ট্যাক ক্লাউড স্থাপন ও কনফিগার করার সময় আপনি বেশ কয়েকটি মেসেজ ব্রোকার এবং ডাটাবেস সমাধানগুলির মধ্যে বেছে নিতে পারেন যেমন RabbitMQ, MySQL, MariaDB এবং SQLite।

source: For more information about how to manage volumes, see the `python-openstackclient documentation for Pike <https://docs.openstack.org/python-openstackclient/pike/cli/command-objects/volume.html>`_, the `python-openstackclient documentation for Queens <https://docs.openstack.org/python-openstackclient/queens/cli/command-objects/volume.html>`_, or the `python-openstackclient documentation for Rocky <https://docs.openstack.org/python-openstackclient/rocky/cli/command-objects/volume.html>`_.
bn_in: ভলিউমটি কীভাবে পরিচালনা করবেন সে সম্পর্কে আরও তথ্যের জন্য পাইকের জন্য `python-openstackclient ডকুমেন্টেশন দেখুন<https://docs.openstack.org/python-openstackclient/pike/cli/command-objects/volume.html>`_কুইন্সের জন্য python-openstackclient ডকুমেন্টেশন<https://docs.openstack.org/python-openstackclient/queens/cli/command-objects/volume.html>`_,এবং রকির জন্য `python-openstackclient ডকুমেন্টেশন<https://docs.openstack.org/python-openstackclient/rocky/cli/command-objects/volume.html>`_.

source: For more information about system requirements, see the `OpenStack Pike Administrator Guides <https://docs.openstack.org/pike/admin/>`_, the `OpenStack Queens Administrator Guides <https://docs.openstack.org/queens/admin/>`_, or the `OpenStack Rocky Administrator Guides <https://docs.openstack.org/rocky/admin/>`_.
bn_in: সিস্টেমের প্রয়োজনীয়তা সম্পর্কে আরও তথ্যের জন্য, `ওপেনস্ট্যাক পাইক অ্যাডমিনিস্ট্রেটর গাইড দেখুন<https://docs.openstack.org/pike/admin/>`_,ওপেনস্ট্যাক কুইন্স অ্যাডমিনিস্ট্রেটর গাইড দেখুন<https://docs.openstack.org/queens/admin/>`_,এবং ওপেনস্ট্যাক রকি অ্যাডমিনিস্ট্রেটর গাইড দেখুন <https://docs.openstack.org/rocky/admin/>`_.

source: For more information on the CLI tools, see the `OpenStackClient documentation for Pike <https://docs.openstack.org/python-openstackclient/pike/cli/command-objects/server.html#server-create>`_, the `OpenStackClient documentation for Queens <https://docs.openstack.org/python-openstackclient/queens/cli/command-objects/server.html#server-create>`_, or the `OpenStackClient documentation for Rocky <https://docs.openstack.org/python-openstackclient/rocky/cli/command-objects/server.html#server-create>`_.
bn_in: CLI tools সম্পর্কে আরও তথ্যের জন্য পাইকের জন্য `ওপেনস্ট্যাকক্লায়েন্ট ডকুমেন্টেশন দেখুন <https://docs.openstack.org/python-openstackclient/pike/cli/command-objects/server.html#server-create>`_,কুইন্সের জন্য ওপেনস্ট্যাকক্লায়েন্ট ডকুমেন্টেশন<https://docs.openstack.org/python-openstackclient/queens/cli/command-objects/server.html#server-create>`_,রকির জন্য `ওপেনস্ট্যাকক্লায়েন্ট ডকুমেন্টেশন<https://docs.openstack.org/python-openstackclient/rocky/cli/command-objects/server.html#server-create>`_.

source: For more information, see the `Orchestration installation guide for Pike <https://docs.openstack.org/heat/pike/install/>`_, the `Orchestration installation guide for Queens <https://docs.openstack.org/heat/queens/install/>`_, or the `Orchestration installation guide for Rocky <https://docs.openstack.org/heat/rocky/install/>`_.
bn_in: আরও তথ্যের জন্য, পাইকের জন্য অর্কেস্ট্রেশন ইনস্টলেশন গাইডটি দেখুন<https://docs.openstack.org/heat/pike/install/>`_,কুইন্সের জন্য অর্কেস্ট্রেশন ইনস্টলেশন গাইড<https://docs.openstack.org/heat/queens/install/>`_,রকির জন্য অর্কেস্ট্রেশন ইনস্টলেশন গাইড<https://docs.openstack.org/heat/rocky/install/>`_.

source: For more information, see the `Shared File Systems installation guide for Pike <https://docs.openstack.org/manila/pike/install/>`_, the `Shared File Systems installation guide for Queens <https://docs.openstack.org/manila/queens/install/>`_, or the `Shared File Systems installation guide for Rocky <https://docs.openstack.org/manila/rocky/install/>`_.
bn_in: আরও তথ্যের জন্য, পাইকের জন্য শেয়ার্ড ফাইল সিস্টেম ইনস্টলেশন গাইড দেখুন<https://docs.openstack.org/manila/pike/install/>`_, কুইন্সের জন্য শেয়ার্ড ফাইল সিস্টেম ইনস্টলেশন গাইড<https://docs.openstack.org/manila/queens/install/>`_, অথবা রকির জন্য শেয়ার্ড ফাইল সিস্টেম ইনস্টলেশন গাইড<https://docs.openstack.org/manila/rocky/install/>`_.

source: Generate a key pair and add a public key:
bn_in: একটি কী পেয়ার জেনারেট করুন এবং একটি পাবলিক কী যুক্ত করুনঃ

source: Get started with OpenStack
bn_in: ওপেনস্ট্যাক দিয়ে শুরু করুন ।

source: Identity service – `keystone installation for Pike <https://docs.openstack.org/keystone/pike/install/>`_
bn_in: আইডেন্টেটি সার্ভিস - পাইকের জন্য `কীস্টোন ইনস্টলেশন <https://docs.openstack.org/keystone/pike/install/>`_

source: Identity service – `keystone installation for Queens <https://docs.openstack.org/keystone/queens/install/>`_
bn_in: আইডেন্টেটি সার্ভিস - কুইন্সের জন্য কীস্টোন ইনস্টলেশন <https://docs.openstack.org/keystone/queens/install/>`_

source: Identity service – `keystone installation for Rocky <https://docs.openstack.org/keystone/rocky/install/>`_
bn_in: আইডেন্টেটি সার্ভিস - রকির জন্য কীস্টোন ইনস্টলেশন <https://docs.openstack.org/keystone/rocky/install/>`_

source: Identity service – `keystone installation for Stein <https://docs.openstack.org/keystone/stein/install/>`_
bn_in: আইডেন্টেটি সার্ভিস - স্টেইনের জন্য কীস্টোন ইনস্টলেশন <https://docs.openstack.org/keystone/stein/install/>`_

source: Identity service – `keystone installation for Train <https://docs.openstack.org/keystone/train/install/>`_
bn_in: আইডেন্টেটি সার্ভিস - ট্রেনের জন্য কীস্টোন ইনস্টলেশন <https://docs.openstack.org/keystone/train/install/>`_

source: Identity service – `keystone installation for Ussuri <https://docs.openstack.org/keystone/ussuri/install/>`_
bn_in: আইডেন্টেটি সার্ভিস - উসুরির জন্য কীস্টোন ইনস্টলেশন <https://docs.openstack.org/keystone/ussuri/install/>`_

source: If a service's default port falls within this range, run the following program to check if the port has already been assigned to another application:
bn_in: যদি কোনও সার্ভিসের ডিফল্ট পোর্ট এই সীমার মধ্যে পড়ে, ইতিমধ্যে পোর্টটি অন্য কোনও অ্যাপ্লিকেশনকে দেওয়া হয়েছে কিনা তা পরীক্ষা করতে নিম্নলিখিত প্রোগ্রামটি চালাতে হবে ।

source: If you chose networking option 1, you can only launch an instance on the provider network. If you chose networking option 2, you can launch an instance on the provider network and the self-service network.
bn_in: আপনি যদি নেটওয়ার্কিং অপশন 1 পছন্দ করে থাকেন তবে আপনি কেবল প্রােভাইডার নেটওয়ার্কে একটি ইনস্টেস চালু করতে পারেন। আপনি যদি নেটওয়ার্কিং অপশন 2 পছন্দ করেন তবে আপনি প্রােভাইডার নেটওয়ার্ক এবং সেল্ফ-সার্ভিস নেটওয়ার্কে একটি ইনস্টেস চালু করতে পারেন।

source: If you chose option 2, the output should also contain the ``selfservice`` self-service network.
bn_in: আপনি যদি অপশন 2 পছন্দ করে থাকেন তবে আউটপুটে ``selfservice`` সেল্প-সার্ভিস নেটওয়ার্ক থাকা প্রয়োজন ।

source: If you see ``Too many connections`` or ``Too many open files`` error log messages on OpenStack services, verify that maximum number of connection settings are well applied to your environment. In MariaDB, you may also need to change `open_files_limit <https://mariadb.com/kb/en/library/server-system-variables/#open_files_limit>`__ configuration.
bn_in: আপনি যদি ওপেনস্ট্যাক সার্ভিসগুলিতে ``Too many connections`` or ``Too many open files`` সমস্যা লগ মেসেজ দেখেন তবে আপনার এনভারমেন্ট সাথে সংযোগের সর্বোচ্চ সংখ্যক সেটিংস ভালভাবে প্রয়োগ হয়েছে কিনা তা যাচাই করুন। MariaDB আপনার `open_files_limit পরিবর্তন করতেও পারে <https://mariadb.com/kb/en/library/server-system-variables/#open_files_limit>`__কনফিগারেশন করুন ।

source: Image service (``glance``) API
bn_in: ইমেজ সার্ভিস (``glance``) API

source: Image service – `glance installation for Pike <https://docs.openstack.org/glance/pike/install/>`_
bn_in: ইমেজ সার্ভিস- পাইকের জন্য গ্রেন্স ইনস্টলেশন <https://docs.openstack.org/glance/pike/install/>`_

source: Image service – `glance installation for Queens <https://docs.openstack.org/glance/queens/install/>`_
bn_in: ইমেজ সার্ভিস - কুইন্সের জন্য গ্রেন্স ইনস্টলেশন <https://docs.openstack.org/glance/queens/install/>`_

source: Image service – `glance installation for Rocky <https://docs.openstack.org/glance/rocky/install/>`_
bn_in: ইমেজ সার্ভিস - রকির জন্য গ্রেন্স ইনস্টলেশন <https://docs.openstack.org/glance/rocky/install/>`_

source: Image service – `glance installation for Stein <https://docs.openstack.org/glance/stein/install/>`_
bn_in: ইমেজ সার্ভিস - স্টেইনের জন্য গ্রেন্স ইনস্টলেশন <https://docs.openstack.org/glance/stein/install/>`_

source: Image service – `glance installation for Train <https://docs.openstack.org/glance/train/install/>`_
bn_in: ইমেজ সার্ভিস - ট্রেনের জন্য গ্রেন্স ইনস্টলেশন <https://docs.openstack.org/glance/train/install/>`_

source: Image service – `glance installation for Ussuri <https://docs.openstack.org/glance/ussuri/install/>`_
bn_in: ইমেজ সার্ভিস - উসুরির গ্রেন্স ইনস্টলেশন <https://docs.openstack.org/glance/ussuri/install/>`_

source: Install OpenStack services
bn_in: ওপেনস্ট্যাক সার্ভিসগুলি ইনস্টল করুন

source: Install etcd:
bn_in: Etcd ইনস্টল করুনঃ

source: Install the ``etcd`` package:
bn_in: Etcd প্যাকেজটি ইনস্টল করুনঃ

source: Install the packages.
bn_in: প্যাকেজ ইনস্টল করুন।

source: Internally, OpenStack services are composed of several processes. All services have at least one API process, which listens for API requests, preprocesses them and passes them on to other parts of the service. With the exception of the Identity service, the actual work is done by distinct processes.
bn_in: ইনটারনালী, ওপেনস্ট্যাক সার্ভিসগুলি বেশ কয়েকটি প্রক্রিয়া দ্বারা গঠিত। সমস্ত সার্ভিসটিতে কমপক্ষে একটি API প্রক্রিয়া থাকে, যা API অনুরোধগুলির জন্য শোনায়, এগুলিকে প্রসেসোসেস করে এবং সার্ভিস অন্যান্য অংশগুলিতে প্রেরণ করে। আইডেন্টেটি সার্ভিস বাদে প্রকৃত কাজ নিজর্স প্রক্রিয়া দ্বারা সম্পন্ন হয়।

source: List ports on the router to determine the gateway IP address on the provider network:
bn_in: প্রোভাইডার নেটওয়ার্কের গেটওয়ে আইপি এড্রেস নির্ধারণ করতে রাউটারে পোর্টগুলি তালিকাভুক্ত করুনঃ

source: Logical architecture
bn_in: লজিকাল আর্কিটেকচার

source: Memcached
bn_in: ম্যামক্যাসড

source: Memcached for RHEL and CentOS
bn_in: RHEL and CentOS এর জন্য ম্যামক্যাসড

source: Memcached for SUSE
bn_in: SUSE এর জন্য Memcached

source: Message Broker (AMQP traffic)
bn_in: মেসেজ ব্রোকার (AMQP traffic)

source: Message queue for RHEL and CentOS
bn_in: RHEL এবং CentOS এর জন্য Message queue

source: Message queue for SUSE
bn_in: SUSE এর জন্য Message queue

source: Message queue for Ubuntu
bn_in: Ubuntu এর জন্য Message queue

source: Minimal deployment for Pike
bn_in: পাইকের জন্য সর্বনিম্ন ড্যাপ্লোমেন্ট দেখুন

source: Minimal deployment for Queens
bn_in: কুইন্সের জন্য ন্যূনতম ড্যাপ্লোমেন্ট দেখুন

source: Minimal deployment for Rocky
bn_in: রকির জন্য ন্যূনতম ড্যাপ্লোমেন্ট দেখুন

source: Minimal deployment for Stein
bn_in: স্টেইনের জন্য ন্যূনতম ড্যাপ্লোমেন্ট দেখুন

source: Minimal deployment for Train
bn_in: ট্রেনের জন্য ন্যূনতম ড্যাপ্লোমেন্ট দেখুন

source: Minimal deployment for Ussuri
bn_in: উসুরির জন্য ন্যূনতম ড্যাপ্লোমেন্ট দেখুন

source: Most OpenStack components.
bn_in: বেশিরভাগ ওপেনস্ট্যাক কম্পোনেট এর জন্য ।

source: Most OpenStack services use an SQL database to store information. The database typically runs on the controller node. The procedures in this guide use MariaDB or MySQL depending on the distribution. OpenStack services also support other SQL databases including `PostgreSQL <https://www.postgresql.org/>`__.
bn_in: বেশিরভাগ ওপেনস্ট্যাক সার্ভিসের তথ্য সংরক্ষণের জন্য একটি SQL ডাটাবেস ব্যবহার করে। ডাটাবেসগুলি সাধারণত কন্ট্রোলার নোডে চলে। এই গাইডের পদ্ধতিগুলি ডিস্ট্রিবিউশন উপর নির্ভর করে MariaDB or MySQL ব্যবহার করে। ওপেনস্ট্যাক সার্ভিসগুলি `PostgreSQL সহ অন্যান্য SQL ডেটাবেসগুলিকে সমর্থন করে । <https://www.postgresql.org/>`__.

source: MySQL database service
bn_in: MySQL ডাটাবেস সার্ভিস

source: Network interface names vary by distribution. Traditionally, interfaces use ``eth`` followed by a sequential number. To cover all variations, this guide refers to the first interface as the interface with the lowest number and the second interface as the interface with the highest number.
bn_in: নেটওয়ার্ক ইন্টারফেসের নাম ডিস্ট্রিভিউশন অনুসারে পরিবর্তিত হয় । টেডিশনালী, ইন্টারফেসগুলি একটি ক্রমিক সংখ্যা পরে `eth` নীতি ব্যবহার করে। সমস্ত প্রকারের জন্য, এই গাইডটি প্রথম ইন্টারফেসটিকে সর্বনিম্ন সংখ্যার ইন্টারফেস হিসাবে এবং দ্বিতীয় ইন্টারফেসটিকে সর্বোচ্চ সংখ্যার ইন্টারফেস হিসাবে উল্লেখ করে।

source: Networking (``neutron``)
bn_in: নেটওয়ার্কিং (``neutron``)

source: Networking service – `neutron installation for Pike <https://docs.openstack.org/neutron/pike/install/>`_
bn_in: নেটওয়ার্কিং সার্ভিস - পাইকের জন্য নিউট্রন ইনস্টলেশন <https://docs.openstack.org/neutron/pike/install/>`_

source: Networking service – `neutron installation for Queens <https://docs.openstack.org/neutron/queens/install/>`_
bn_in: নেটওয়ার্কিং সার্ভিস - কুইন্সের জন্য নিউট্রন ইনস্টলেশন <https://docs.openstack.org/neutron/queens/install/>`_

source: Networking service – `neutron installation for Rocky <https://docs.openstack.org/neutron/rocky/install/>`_
bn_in: নেটওয়ার্কিং সার্ভিস - রকির জন্য নিউট্রন ইনস্টলেশন <https://docs.openstack.org/neutron/rocky/install/>`_

source: Networking service – `neutron installation for Stein <https://docs.openstack.org/neutron/stein/install/>`_
bn_in: নেটওয়ার্কিং সার্ভিস - স্টেইনের জন্য নিউট্রন ইনস্টলেশন <https://docs.openstack.org/neutron/stein/install/>`_

source: Networking service – `neutron installation for Train <https://docs.openstack.org/neutron/train/install/>`_
bn_in: নেটওয়ার্কিং সার্ভিস - ট্রেনের জন্য নিউট্রন ইনস্টলেশন <https://docs.openstack.org/neutron/train/install/>`_

source: Networking service – `neutron installation for Ussuri <https://docs.openstack.org/neutron/ussuri/install/>`_
bn_in: নেটওয়ার্কিং সার্ভিস - উসুরির জন্য নিউট্রন ইনস্টলেশন <https://docs.openstack.org/neutron/ussuri/install/>`_

source: Note that OpenStack Queens is included in Ubuntu 18.04 LTS without enabling the Ubuntu Cloud Archive.
bn_in: নোট করুন ওপেনস্ট্যাক কুইন্স Ubuntu Cloud আরকাইবটি চালু না করেই Ubuntu 18.04 LTS অন্তর্ভুক্ত রয়েছে।

source: Object Storage (``swift``)
bn_in: অবজেক্ট স্টোরেজ (``swift``)

source: On some deployments, such as ones where restrictive firewalls are in place, you might need to manually configure a firewall to permit OpenStack service traffic.
bn_in: কিছু ডেপ্লোমেন্ট এর ক্ষেত্রে, যেমন বাধা সৃষ্টি করে এমন ফায়ারওয়ালগুলি রয়েছে সেখানে আপনাকে ওপেনস্ট্যাক সার্ভিস ট্র্যাফিকের অনুমতি দেওয়ার জন্য ম্যানুয়ালি একটি ফায়ারওয়াল কনফিগার করতে হবে।

source: On some deployments, the default port used by a service may fall within the defined local port range of a host. To check a host's local port range:
bn_in: কিছু ডেপ্লোমেন্ট, কোনও সার্ভিস দ্বারা ব্যবহৃত ডিফল্ট পোর্ট কোনও হোস্টের সংজ্ঞায়িত স্থানীয় পোর্ট সীমার মধ্যে পড়তে পারে। একটি হোস্টের লোকাল বন্দর পরিসর পরীক্ষা করতে হবে ।

source: OpenStack Block Storage, Networking, Orchestration, and Compute.
bn_in: ওপেনস্ট্যাক ব্লক স্টোরেজ, নেটওয়ার্কিং, অর্কেস্টেশন এবং কম্পিউট।

source: OpenStack Block Storage. Required.
bn_in: ওপেনস্ট্যাক ব্লক স্টোরেজ এর জন্য এটি প্রয়োজন ।

source: OpenStack Installation Guide
bn_in: ওপেনস্ট্যাক ইনস্টলেশন গাইড

source: OpenStack Object Storage (``swift``) service.
bn_in: ওপেনস্ট্যাক অবজেক্ট স্টোরেজ (`` swift``) সার্ভিস।

source: OpenStack Object Storage. Required.
bn_in: ওপেনস্ট্যাক অবজেক্ট স্টোরেজ এর জন্য এটি প্রয়োজন ।

source: OpenStack Queens is available directly using Ubuntu 18.04 LTS and OpenStack Mitaka is available directly using Ubuntu 16.04 LTS without having to enable an Ubuntu Cloud Archive repository.
bn_in: ওপেনস্ট্যাক কুইন্স সরাসরি Ubuntu 18.04 LTS ব্যবহার করে এবং Ubuntu ক্লাউড আর্কাইভ রিপোজিটরি চালু না করেই Ubuntu16.04 LTS ব্যবহার করে সরাসরি চালু করুন ।

source: OpenStack and supporting services require administrative privileges during installation and operation. In some cases, services perform modifications to the host that can interfere with deployment automation tools such as Ansible, Chef, and Puppet. For example, some OpenStack services add a root wrapper to ``sudo`` that can interfere with security policies. See the `Compute service documentation for Pike <https://docs.openstack.org/nova/pike/admin/root-wrap-reference.html>`_, the `Compute service documentation for Queens <https://docs.openstack.org/nova/queens/admin/root-wrap-reference.html>`_, or the `Compute service documentation for Rocky <https://docs.openstack.org/nova/rocky/admin/root-wrap-reference.html>`_ for more information.
bn_in: ওপেনস্ট্যাক এবং সাপোটিং সার্ভিসগুলি ইনস্টলেশন ও অপারেশন চলাকালীন অ্যাডমিনিস্ট্রেটিভ সুযোগ-সুবিধার প্রয়োজন। কিছু ক্ষেত্রে, সার্ভিসগুলি হোস্টটিতে এমন পরিবর্তনগুলি সম্পাদন করে যা ইন্টারপেয়ার করে, Chef, and Puppet এর মতো ডেপ্লোমেন্ট অটোমেশন সরঞ্জামগুলিতে হস্তক্ষেপ করতে পারে। উদাহরণস্বরূপ, কিছু ওপেনস্ট্যাক সার্ভিস সিকিউরিটি নীতিগুলিতে হস্তক্ষেপ করতে পারে এমন ``sudo`` এ একটি মূল মোড়ক যুক্ত করে। পাইকের এর জন্য কম্পিউট সার্ভিস ডকুমেন্টেশন দেখুন <https://docs.openstack.org/nova/pike/admin/root-wrap-reference.html>`_,কুইন্স এর জন্য কম্পিউট সার্ভিস ডকুমেন্টেশন দেখুন <https://docs.openstack.org/nova/queens/admin/root-wrap-reference.html>`_,এবং রকির এর জন্য কম্পিউট সার্ভিস ডকুমেন্টেশন দেখুন<https://docs.openstack.org/nova/rocky/admin/root-wrap-reference.html>`_

source: OpenStack dashboard (``Horizon``) when it is not configured to use secure access.
bn_in: ওপেনস্ট্যাক ড্যাশবোর্ড (``Horizon``) যখন এটি নিরাপদ অ্যাক্সেস ব্যবহার করার জন্য কনফিগার করা হয়নি।

source: OpenStack packages for RHEL and CentOS
bn_in: RHEL and CentOS এর জন্য ওপেনস্ট্যাক প্যাকেজ ব্যবহার করুন

source: OpenStack packages for SUSE
bn_in: SUSE এর জন্য ওপেনস্ট্যাক প্যাকেজ দেখুন ।

source: OpenStack packages for Ubuntu
bn_in: Ubuntu এর জন্য ওপেনস্ট্যাক প্যাকেজ দেখুন ।

source: OpenStack provides an :term:`Infrastructure-as-a-Service (IaaS)` solution through a variety of complementary services. Each service offers an :term:`Application Programming Interface (API)` that facilitates this integration.
bn_in: ওপেনস্ট্যাক একটি প্রোভাইডার করে: শব্দ: `ইনফ্রাস্ট্রাকচার-এ-এ-সার্ভিস (আইএএএস) complement বিভিন্ন পরিপূরক সার্ভিসের মাধ্যমে সমাধান করে । প্রতিটি সার্ভিস একটি শর্ত দেয়: অ্যাপ্লিকেশন প্রোগ্রামিং ইন্টারফেস (এপিআই) যা এই সংহতকরণকে সহজতর করে।

source: OpenStack service
bn_in: ওপেনস্ট্যাক সার্ভিস

source: OpenStack services may use Etcd, a distributed reliable key-value store for distributed key locking, storing configuration, keeping track of service live-ness and other scenarios.
bn_in: ডিস্ট্রিবিউটেড কিই লকিং, কনফিগারেশন স্টোরিং, সার্ভিস লাইভ-নেস এবং অন্যান্য পরিস্থিতিগুলোর ট্র্যাক রাখার জন্য ওপেনস্টেক Etcd, একটি ডিস্ট্রিবিউটেড কিই-ভেলু স্টোর ব্যবহার করে থাকে।

source: OpenStack services support various security methods including password, policy, and encryption. Additionally, supporting services including the database server and message broker support password security.
bn_in: ওপেনস্ট্যাক সার্ভিস পাসওয়ার্ড, নীতি এবং এনক্রিপশন সহ বিভিন্ন সুরক্ষা পদ্ধতি সমর্থন করে। অতিরিক্তভাবে, ডেটাবেস সার্ভার এবং মেসেজ ব্রোকার সহ পাসওয়ার্ড সিকিউরিটি সমর্থনকারী সার্ভিসগুলি দেখায় ।
