Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: Start the Image Service services and configure them to start when the system boots:
pt_br: Inicie os serviços do Serviço de Imagem e configure-os para iniciar quando o sistema inicializar:

source: This section describes how to install and configure the dashboard on the controller node.
pt_br: Esta seção descreve como instalar e configurar o dashboard no nodo controlador.

source: Before you proceed, verify that your system meets the requirements in <xref linkend="dashboard-system-requirements"/>. Also, the dashboard relies on functional core services including Identity, Image Service, Compute, and either Networking (neutron) or legacy networking (nova-network). Environments with stand-alone services such as Object Storage cannot use the dashboard. For more information, see the <link href="http://docs.openstack.org/developer/horizon/topics/deployment.html">developer documentation</link>.
pt_br: Antes de prosseguir, verifique que seu sistema atende aos requisitos em <xref linkend="dashboard-system-requirements"/>. Também, o dashboard depende de serviços básicos funcionais, incluindo Identidade, Serviço de Imagem, Computação, e quer seja Rede (neutron) ou rede legada (nova-network). Ambiente com serviços autônomos como Object Storage não podem utilizar o dashboard. Para mais informações, consulte <link href="http://docs.openstack.org/developer/horizon/topics/deployment.html">developer documentation</link>.

source: To install the dashboard components
pt_br: Para instalar os componentes do dashboard

source: Ubuntu installs the <package>openstack-dashboard-ubuntu-theme</package> package as a dependency. Some users reported issues with this theme in previous releases. If you encounter issues, remove this package to restore the original OpenStack theme.
pt_br: O Ubuntu instala o pacote <package>openstack-dashboard-ubuntu-theme</package> como uma dependência. Alguns usuários reportaram problemas com esse tema em versões anteriores. Se você encontrar problemas, remova este pacote para restaurar o tema original do OpenStack.

source: Respond to prompts for web server configuration.
pt_br: Responda às questões para a configuração do servidor web.

source: The automatic configuration process generates a self-signed SSL certificate. Consider obtaining an official certificate for production environments.
pt_br: O processo de configuração automática gera um certificado SSL auto-assinado. Considere a obtenção de um certificado oficial para ambientes de produção.

source: To configure the dashboard
pt_br: Para configurar o dashboard

source: Configure the web server:
pt_br: Configure o servidor web:

source: Edit the <filename>/etc/openstack-dashboard/local_settings.py</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/openstack-dashboard/local_settings.py</filename> e complete as seguintes ações:

source: Edit the <filename>/etc/openstack-dashboard/local_settings</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/openstack-dashboard/local_settings</filename> e complete as seguintes ações:

source: Edit the <filename>/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> e complete as seguintes ações:

source: Configure the dashboard to use OpenStack services on the <literal>controller</literal> node:
pt_br: Configure o dashboard para utilizar os serviços OpenStack no nodo <literal>controlador</literal>:

source: Allow all hosts to access the dashboard:
pt_br: Permita a todos os hosts acessarem o dashboard:

source: Configure the <application>memcached</application> session storage service:
pt_br: Configure a sessão de serviço de armazenamento do <application>memcached</application>:

source: Comment out any other session storage configuration.
pt_br: Comente qualquer outra sessão de configuração de armazenamento.

source: By default, SLES and openSUSE use a SQL database for session storage. For simplicity, we recommend changing the configuration to use <application>memcached</application> for session storage.
pt_br: Por padrão, o SLES e o openSUSE utilizam uma base de dados SQL para armazenamento de sessão. Para simplificar, recomendamos alterar a configuração para utilizar <application>memcached</application> para armazenamento de sessão.

source: Optionally, configure the time zone:
pt_br: Opcionalmente, configure o fuso horário:

source: Replace <replaceable>TIME_ZONE</replaceable> with an appropriate time zone identifier. For more information, see the <link href="http://en.wikipedia.org/wiki/List_of_tz_database_time_zones">list of time zones</link>.
pt_br: Substitua <replaceable>TIME_ZONE</replaceable> com um identificador de fuso horário apropriado. Para mais informações, consulte a <link href="http://en.wikipedia.org/wiki/List_of_tz_database_time_zones">lista de fuso horário</link>.

source: On RHEL and CentOS, configure SELinux to permit the web server to connect to OpenStack services:
pt_br: No RHEL e CentOS, configure o SELinux para permitir o servidor web conectar aos serviços OpenStack:

source: Due to a packaging bug, the dashboard CSS fails to load properly. Run the following command to resolve this issue:
pt_br: Devido a um bug de empacotamento, o CSS do dashboard falha para carregar adequadamente. Execute os seguintes comandos para resolver esse problema:

source: For more information, see the <link href="https://bugzilla.redhat.com/show_bug.cgi?id=1150678">bug report</link>.
pt_br: Para mais informações, consulte <link href="https://bugzilla.redhat.com/show_bug.cgi?id=1150678">bug report</link>.

source: Restart the web server and session storage service:
pt_br: Reinicie o servidor web e o serviço de armazenamento de sessão:

source: Start the web server and session storage service and configure them to start when the system boots:
pt_br: Inicie o servidor web e o serviço de armazenamento de sessão e configure-os para iniciar quando o sistema inicializar:

source: Networking
ko_kr: 네트워킹
pt_br: Rede

source: After installing the operating system on each node for the architecture that you choose to deploy, you must configure the network interfaces. We recommend that you disable any automated network management tools and manually edit the appropriate configuration files for your distribution. For more information on how to configure networking on your distribution, see the <link os="ubuntu" href="https://help.ubuntu.com/lts/serverguide/network-configuration.html">documentation.</link><link os="debian" href="https://wiki.debian.org/NetworkConfiguration">documentation.</link><link os="rhel;centos;fedora" href="https://access.redhat.com/site/documentation/en-US/Red_Hat_Enterprise_Linux/6/html/Deployment_Guide/s1-networkscripts-interfaces.html">documentation.</link><link os="sles;opensuse" href="https://www.suse.com/documentation/sles11/book_sle_admin/data/sec_basicnet_manconf.html">SLES 11</link><phrase os="sles;opensuse"> or </phrase><link os="sles;opensuse" href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking">openSUSE documentation.</link>
pt_br: Depois de instalar o sistema operacional em cada nodo para a arquitetura que você escolheu implantar, você deve configurar as interfaces de rede. Recomendamos que você desabilite quaisquer ferramentas de automação de rede e edite manualmente os arquivos de configuração apropriados para sua distribuição. Para mais informações sobre como configurar a rede em sua distribuição, consulte a <link os="ubuntu" href="https://help.ubuntu.com/lts/serverguide/network-configuration.html">documentação.</link><link os="debian" href="https://wiki.debian.org/NetworkConfiguration">documentação.</link><link os="rhel;centos;fedora" href="https://access.redhat.com/site/documentation/en-US/Red_Hat_Enterprise_Linux/6/html/Deployment_Guide/s1-networkscripts-interfaces.html">documentação.</link><link os="sles;opensuse" href="https://www.suse.com/documentation/sles11/book_sle_admin/data/sec_basicnet_manconf.html">SLES 11</link><phrase os="sles;opensuse"> ou </phrase><link os="sles;opensuse" href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking">documentação do openSUSE.</link>

source: All nodes require Internet access for administrative purposes such as package installation, security updates, <glossterm>DNS</glossterm>, and <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>. In most cases, nodes should obtain Internet access through the management network interface. To highlight the importance of network separation, the example architectures use <link href="https://tools.ietf.org/html/rfc1918">private address space</link> for the management network and assume that network infrastructure provides Internet access via <glossterm baseform="Network Address Translation (NAT)">NAT</glossterm>. To illustrate the flexibility of <glossterm>IaaS</glossterm>, the example architectures use public IP address space for the external network and assume that network infrastructure provides direct Internet access to instances in your OpenStack environment. In environments with only one block of public IP address space, both the management and external networks must ultimately obtain Internet access using it. For simplicity, the diagrams in this guide only show Internet access for OpenStack services.
pt_br: Todos os nodos requerem acesso à Internet para propósitos administrativos, tais como instalação de pacotes, atualizações de segurança, <glossterm>DNS</glossterm>, e <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>. Na maioria dos casos, os nodos devem obter o acesso à Internet através da interface de gerenciamento de rede. Para destacar a importância do isolamento de rede, a arquitetura de exemplo utiliza <link href="https://tools.ietf.org/html/rfc1918">espaço de endereço privado</link> para a rede de gerenciamento e assume que a infraestrutura de rede fornece acesso à Internet via <glossterm baseform="Network Address Translation (NAT)">NAT</glossterm>. Para ilustrar a flexibilidade do <glossterm>IaaS</glossterm>, a arquitetura de exemplo utiliza espaço de endereço público para a rede externa e assume que a infraestrutura de rede fornece acesso direto à Internet para as instâncias em seu ambiente OpenStack. Em ambientes com um único bloco de espaço de endereço público, ambas a redes, de gerenciamento e externa, devem finalmente obter acesso utilizando-o. Para simplificar, os diagramas neste guia somente mostram o acesso à Internet para os serviços OpenStack.

source: To disable Network Manager
pt_br: Para desabilitar o Network Manager

source: Use the YaST network module:
ko_kr: TaST 네트워크 모듈 사용:
pt_br: Utilize o módulo de rede do YaST:

source: For more information, see the <link href="https://www.suse.com/documentation/sles11/book_sle_admin/data/sec_nm_activate.html">SLES </link> or the <link href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking#sec.basicnet.yast.netcard.global"> openSUSE documentation</link>.
ko_kr: 더 자세한 정보는 <link href="https://www.suse.com/documentation/sles11/book_sle_admin/data/sec_nm_activate.html">SLES </link> 또는 <link href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking#sec.basicnet.yast.netcard.global"> openSUSE 문서</link>에서 확인하십시오.
pt_br: Para mais informações, consulte <link href="https://www.suse.com/documentation/sles11/book_sle_admin/data/sec_nm_activate.html">SLES </link> ou a <link href="http://activedoc.opensuse.org/book/opensuse-reference/chapter-13-basic-networking#sec.basicnet.yast.netcard.global">documentação do openSUSE</link>.

source: Your distribution enables a restrictive <glossterm>firewall</glossterm> by default. During the installation process, certain steps will fail unless you alter or disable the firewall. For more information about securing your environment, refer to the <link href="http://docs.openstack.org/sec/">OpenStack Security Guide</link>.
pt_br: Sua distribuição habilita um <glossterm>firewall</glossterm> restritivo por padrão. Durante o processo de instalação, certos passos irão falhar a menos que você altere ou desabilite o firewall. Para mais informações sobre como proteger seu ambiente, consulte o <link href="http://docs.openstack.org/sec/">OpenStack Security Guide</link>.

source: Your distribution does not enable a restrictive <glossterm>firewall</glossterm> by default. For more information about securing your environment, refer to the <link href="http://docs.openstack.org/sec/">OpenStack Security Guide</link>.
pt_br: Sua distribuição não habilita um <glossterm>firewall</glossterm> restritivo por padrão. Para mais informações sobre como proteger seu ambiente, consulte <link href="http://docs.openstack.org/sec/">OpenStack Security Guide</link>.

source: Proceed to network configuration for the example <link linkend="basics-networking-neutron">OpenStack Networking (neutron) </link> or <link linkend="basics-networking-nova">legacy networking (nova-network)</link> architecture.
pt_br: Prossiga com a configuração de rede para a arquitetura de exemplo <link linkend="basics-networking-neutron">OpenStack Networking (neutron) </link> ou <link linkend="basics-networking-nova">legacy networking (nova-network)</link>.

source: Install and configure compute node
pt_br: Instalar e configurar o nodo de Computação

source: The compute node handles connectivity and <glossterm baseform="security group">security groups</glossterm> for instances.
pt_br: O nodo de Computação trata da conectividade e dos <glossterm baseform="security group">grupos de segurança</glossterm> para as instâncias.

source: Before you install and configure OpenStack Networking, you must configure certain kernel networking parameters.
pt_br: Antes de você instalar e configurar a Rede OpenStack, você deve configurar certos parâmetros de rede do kernel.

source: Edit the <filename>/etc/sysctl.conf</filename> file to contain the following parameters:
pt_br: Edite o arquivo <filename>/etc/sysctl.conf</filename> para conter os seguintes parâmetros:

source: Implement the changes:
pt_br: Implemente as alterações:

source: To install the Networking components
ko_kr: 네트워킹 구성요소 설치
pt_br: Para instalar os componentes de rede

source: SUSE does not use a separate ML2 plug-in package.
ko_kr: SUSE에서는 별도로 ML2 플러그인 패키지를 사용하지 않습니다.
pt_br: O SUSE não utiliza um pacote separado do plug-in ML2.

source: To install and configure the Networking components
pt_br: Para instalar e configurar os componentes de Rede

source: Debian does not use a separate ML2 plug-in package.
pt_br: O Debian não utiliza um pacote separado do plug-in ML2.

source: Select the ML2 plug-in:
pt_br: Selecione o plug-in ML2:

source: Selecting the ML2 plug-in also populates the <placeholder-1/> and <placeholder-2/> options in the <filename>/etc/neutron/neutron.conf</filename> file with the appropriate values.
pt_br: Selecionando o plug-in ML2 também popula as opções <placeholder-1/> e <placeholder-2/> no arquivo <filename>/etc/neutron/neutron.conf</filename> com valores apropriados.

source: To configure the Networking common components
pt_br: Para configurar os componentes comuns de Rede

source: The Networking common component configuration includes the authentication mechanism, message broker, and plug-in.
pt_br: A configuração dos componentes comuns de Rede incluem o mecanismo de autenticação, o intermediador de mensagens, e o plug-in.

source: Edit the <filename>/etc/neutron/neutron.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/neutron/neutron.conf</filename> e complete as seguintes ações:

source: In the <literal>[database]</literal> section, comment out any <literal>connection</literal> options because compute nodes do not directly access the database.
pt_br: Na seção <literal>[database]</literal>, comente quaisquer opções <literal>connection</literal> porque os nodos de Computação não acessam a base de dados diretamente.

source: Replace <replaceable>NEUTRON_PASS</replaceable> with the password you chose or the <literal>neutron</literal> user in the Identity service.
pt_br: Substitua <replaceable>NEUTRON_PASS</replaceable> com a senha que você escolheu para o usuário <literal>neutron</literal> no Serviço de Identidade.

source: In the <literal>[DEFAULT]</literal> section, enable the Modular Layer 2 (ML2) plug-in, router service, and overlapping IP addresses:
pt_br: Na seção <literal>[DEFAULT]</literal>, habilite o plug-in Modular Layer 2 (ML2), o serviço de roteamento, e os endereços IP que se sobrepõem:

source: To configure the Modular Layer 2 (ML2) plug-in
ko_kr: Modular Layer 2 (ML2) 플러그인 구성
pt_br: Para configurar o plug-in Modular Layer 2 (ML2)

source: The ML2 plug-in uses the Open vSwitch (OVS) mechanism (agent) to build the virtual networking framework for instances.
pt_br: O plug-in ML2 utiliza o mecanismo (agente) do Open vSwitch (OVS) para construir a estrutura de rede virtual para instâncias.

source: Edit the <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> e complete as seguintes ações:

source: In the <literal>[ml2]</literal> section, enable the <glossterm baseform="flat network">flat</glossterm> and <glossterm>generic routing encapsulation (GRE)</glossterm> network type drivers, GRE tenant networks, and the OVS mechanism driver:
pt_br: Na seção <literal>[ml2]</literal>, habilite os tipos de drivers <glossterm baseform="flat network">flat</glossterm> e <glossterm>generic routing encapsulation (GRE)</glossterm>, as redes de tenant GRE, e o mecanismo de driver OVS:

source: In the <literal>[ml2_type_gre]</literal> section, configure the tunnel identifier (id) range:
pt_br: Na seção <literal>[ml2_type_gre]</literal>, configure o identificador (id) da faixa do túnel:

source: In the <literal>[securitygroup]</literal> section, enable security groups, enable <glossterm>ipset</glossterm>, and configure the OVS <glossterm>iptables</glossterm> firewall driver:
pt_br: Na seção <literal>[securitygroup]</literal>, habilite os grupos de segurança, habilite <glossterm>ipset</glossterm>, e configure o driver de firewall <glossterm>iptables</glossterm> do OVS:

source: In the <literal>[ovs]</literal> section, enable tunnels and configure the local tunnel endpoint:
pt_br: Na seção <literal>[ovs]</literal>, habilite os túneis e configure o endpoint do túnel local:

source: Replace <replaceable>INSTANCE_TUNNELS_INTERFACE_IP_ADDRESS</replaceable> with the IP address of the instance tunnels network interface on your compute node.
pt_br: Substitua <replaceable>INSTANCE_TUNNELS_INTERFACE_IP_ADDRESS</replaceable> com o endereço IP da interface de rede dos túneis de instâncias no seu nodo de Computação.

source: In the <literal>[agent]</literal> section, enable GRE tunnels:
pt_br: Na seção <literal>[agent]</literal>, habilite os túneis GRE:

source: To configure the Open vSwitch (OVS) service
ko_kr: Open vSwitch (OVS) 서비스 구성
pt_br: Para configurar o serviço Open vSwitch (OVS)

source: The OVS service provides the underlying virtual networking framework for instances.
pt_br: O serviço OVS fornece a estrutura de rede virtual subjacente para as instâncias.

source: Start the OVS service and configure it to start when the system boots:
ko_kr: OVS 서비스를 시작하고 시스템 부팅시 시작하도록 구성:
pt_br: Inicie o serviço OVS e configure-o para iniciar quando o sistema inicializar:

source: Restart the OVS service:
ko_kr: OVS 서비스 재시작:
pt_br: Reinicie o serviço OVS:

source: To configure Compute to use Networking
ko_kr: Compute에서 네트워킹을 사용하도록 구성
pt_br: Para configurar a Computação para utilizar a Rede

source: By default, distribution packages configure Compute to use legacy networking. You must reconfigure Compute to manage networks through Networking.
pt_br: Por padrão, os pacotes de distribuição configuram a Computação para utilizar a rede legada. Você deve reconfigurar a Computação para gerenciar redes através do serviço de Rede.

source: In the <literal>[DEFAULT]</literal> section, configure the <glossterm baseform="API">APIs</glossterm> and drivers:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure as <glossterm baseform="API">APIs</glossterm> e os drivers:

source: By default, Compute uses an internal firewall service. Since Networking includes a firewall service, you must disable the Compute firewall service by using the <literal>nova.virt.firewall.NoopFirewallDriver</literal> firewall driver.
pt_br: Por padrão, a Computação utiliza o serviço de firewall interno. Como o serviço de Rede inclui um serviço de firewall, você deve desabilitar o serviço de firewall da Computação utilizando o driver de firewall <literal>nova.virt.firewall.NoopFirewallDriver</literal>.

source: In the <literal>[neutron]</literal> section, configure access parameters:
pt_br: Na seção <literal>[neutron]</literal>, configure os parâmetros de acesso:

source: Replace <replaceable>NEUTRON_PASS</replaceable> with the password you chose for the <literal>neutron</literal> user in the Identity service.
pt_br: Substitua <replaceable>NEUTRON_PASS</replaceable> com a senha que você escolheu para o usuário <literal>neutron</literal> no Serviço de Identidade.

source: To finalize the installation
ko_kr: 설치가 끝난 후
pt_br: Para finalizar a instalação

source: The Networking service initialization scripts expect a symbolic link <filename>/etc/neutron/plugin.ini</filename> pointing to the ML2 plug-in configuration file, <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename>. If this symbolic link does not exist, create it using the following command:
pt_br: Os scripts de inicialização do serviço de Rede esperam um link simbólico <filename>/etc/neutron/plugin.ini</filename> apontando para o arquivo de configuração do plug-in ML2, <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename>. Se este link simbólico não existir, crie-o utilizando o seguinte comando:

source: Due to a packaging bug, the Open vSwitch agent initialization script explicitly looks for the Open vSwitch plug-in configuration file rather than a symbolic link <filename>/etc/neutron/plugin.ini</filename> pointing to the ML2 plug-in configuration file. Run the following commands to resolve this issue:
pt_br: Devido a um bug de empacotamento, o script de inicialização do agente Open vSwitch olha explicitamente para o arquivo de configuração do plug-in do Open vSwitch em vez de um link simbólico <filename>/etc/neutron/plugin.ini</filename> apontando para o arquivo de configuração do plugin ML2. Execute os seguintes comandos para resolver este problema:

source: The Networking service initialization scripts expect the variable <literal>NEUTRON_PLUGIN_CONF</literal> in the <filename>/etc/sysconfig/neutron</filename> file to reference the ML2 plug-in configuration file. Edit the <filename>/etc/sysconfig/neutron</filename> file and add the following:
pt_br: Os scripts de inicialização do serviço de Rede esperam a variável <literal>NEUTRON_PLUGIN_CONF</literal> no arquivo <filename>/etc/sysconfig/neutron</filename> para referenciar o arquivo de configuração do plug-in ML2. Edite o arquivo <filename>/etc/sysconfig/neutron</filename> e adicione o seguinte:

source: Start the Open vSwitch (OVS) agent and configure it to start when the system boots:
ko_kr: Open vSwitch (OVS) 에이전트를 시작하고 시스템 부팅시 작동하도록 구성:
pt_br: Inicie o agente Open vSwitch (OVS) e configure-o para iniciar quando o sistema inicializar:

source: Restart the Open vSwitch (OVS) agent:
ko_kr: Open vSwitch (OVS) 에이전트 재시작:
pt_br: Reinicie o agente Open vSwitch (OVS):
