Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: The previous section used a combination of environment variables and command options to interact with the Identity service via the <placeholder-1/> client. To increase efficiency of client operations, OpenStack supports simple client environment scripts also known as OpenRC files. These scripts typically contain common options for all clients, but also support unique options. For more information, see the <link href="http://docs.openstack.org/user-guide/content/cli_openrc.html">OpenStack User Guide</link>.
pt_br: A seção anterior usou uma combinação de variáveis de ambiente e opções de comandos para interagir com o Serviço de Identidade, através do <placeholder-1/> cliente. Para aumentar a eficiência das operações de cliente, o OpenStack suporta scripts de ambiente simples de cliente, também conhecidos como arquivos OpenRC. Estes scripts tipicamente contém opções comuns para todos os clientes, mas também suporta opções únicas. Para mais informações consulte o <link href="http://docs.openstack.org/user-guide/content/cli_openrc.html">OpenStack User Guide</link>.

source: To create the scripts
pt_br: Para criar os scripts

source: Create client environment scripts for the <literal>admin</literal> and <literal>demo</literal> tenants and users. Future portions of this guide reference these scripts to load appropriate credentials for client operations.
pt_br: Criar script de ambiente de cliente para os tenants e usuários <literal>admin</literal> e <literal>demo</literal>. Partes futuras deste guia referem-se a esses scripts para carregar apropriadadmente as credenciIas para operações de cliente.

source: Edit the <filename>admin-openrc.sh</filename> file and add the following content:
pt_br: Edite o arquivo <filename>admin-openrc.sh</filename> e adicione o seguinte conteúdo:

source: Replace <literal>ADMIN_PASS</literal> with the password you chose for the <literal>admin</literal> user in the Identity service.
pt_br: Substitua <literal>ADMIN_PASS</literal> com a senha que você escolheu para o usuário <literal>admin</literal> no Serviço de Identidade.

source: Edit the <filename>demo-openrc.sh</filename> file and add the following content:
pt_br: Edite o arquivo <filename>demo-openrc.sh</filename> e adicione o seguinte conteúdo:

source: Replace <literal>DEMO_PASS</literal> with the password you chose for the <literal>demo</literal> user in the Identity service.
pt_br: Substitua <literal>DEMO_PASS</literal> com a senha que você escolheu para o usuário <literal>demo</literal> no Serviço de Identidade.

source: Identity ports
pt_br: Portas de Identidade

source: Note the two different ports used above. Port 35357 is used for administrative functions only. Port 5000 is for normal user functions and is the most commonly used.
pt_br: Observe as duas diferentes portas utilizadas acima. A porta 35357 é utilizada para funcões administrativas somente. A porta 5000 é para funções normais de usuário e é a mais frequentemente utilizada.

source: To load client environment scripts
pt_br: Para carregar scripts de ambiente de cliente

source: To run clients as a certain tenant and user, you can simply load the associated client environment script prior to running them. For example, to load the location of the Identity service and <literal>admin</literal> tenant and user credentials:
pt_br: Para executar clientes como um certo tenant e usuário, você pode simplesmente carregar o script de ambiente de cliente associado, antes de executá-los. Por exempo, para carregar a localização do Serviço de Identidade e do tenant de <literal>admin</literal> e credenciais de usuário:

source: Verify the Data processing service installation
pt_br: Verifique a instalação do serviço de processamento de Dados

source: To verify that the Data processing service (sahara) is installed and configured correctly, try requesting clusters list using sahara client.
pt_br: Para verificar que o serviço de Processamento de Dados (sahara) está instalado e configurado corretamente, tente requisitar uma lista de clusters usando o cliente sahara.

source: Retrieve sahara clusters list:
pt_br: Obter a lista de clusters sahara:

source: You should see output similar to this:
ko_kr: 다음과 유사한 출력을 볼 수 있습니다:
pt_br: Você deve ver uma saída semelhante a esta:

source: Add the Data processing service
pt_br: Adicionar o serviço de Processamento de Dados

source: The Data processing service (sahara) enables users to provide a scalable data processing stack and associated management interfaces. This includes provision and operation of data processing clusters as well as scheduling and operation of data processing jobs.
pt_br: O serviço de Processamento de Dados (sahara) habilita os usuários a fornecer uma pilha escalável de processamento de dados e interfaces de gerenciamento associadas. Isto inclui o provisionamento de clusters de processamento de dados, bem como agendamento e operação de tarefas de processamento de dados.

source: Legacy networking (nova-network)
ko_kr: 레거시 네트워킹 (nova-nework)
pt_br: Rede legada (nova-network)

source: The example architecture with legacy networking (nova-network) requires a controller node and at least one compute node. The controller node contains one network interface on the <glossterm>management network</glossterm>. The compute node contains one network interface on the management network and one on the <glossterm>external network</glossterm>.
pt_br: A arquitetura de exemplo com rede legada (nova-network) requer um nodo controlador e pelo menos um nodo de Computação. O nodo controlador contém uma interface de rede na <glossterm>rede de gerenciamento</glossterm>. O nodo de Computação contém uma interface de rede na rede de gerenciamento e uma na <glossterm>rede externa</glossterm>.

source: Network interface names vary by distribution. Traditionally, interfaces use "eth" followed by a sequential number. To cover all variations, this guide simply refers to the first interface as the interface with the lowest number and the second interface as the interface with the highest number.
pt_br: Os nomes das interfaces de rede variam com a distribuição. Tradicionalmente, as interfaces utilizam "eth" seguido por um número sequencial. Para cobrir todas as variações, este guia simplesmente refere-se à primeira interface como a interface com o menor número e à segunda interface como a interface com o maior número.

source: Minimal architecture example with legacy networking (nova-network)Network layout
pt_br: Layout de Rede de exemplo de arquitetura mínima com rede legada (nova-network)

source: The external interface uses a special configuration without an IP address assigned to it. Configure the second interface as the external interface:
pt_br: A interface externa utiliza uma configuração especial sem endereço IP atribuído a ela. Configure a segunda interface como interface externa:

source: Replace <replaceable>INTERFACE_NAME</replaceable> with the actual interface name. For example, <emphasis>eth1</emphasis> or <emphasis>ens224</emphasis>.
pt_br: Substitua <replaceable>INTERFACE_NAME</replaceable> com o nome real da interface. Por exemplo, <emphasis>eth1</emphasis> ou <emphasis>ens224</emphasis>.

source: Install the Database service
ko_kr: 데이터베이스 서비스 설치
pt_br: Instalar o serviço de Banco de Dados

source: This procedure installs the Database module on the controller node.
pt_br: Este procedimento instala o módulo de Banco de Dados no nodo controlador.

source: Prerequisites
ko_kr: 선행조건
pt_br: Pré-requisitos

source: This chapter assumes that you already have a working OpenStack environment with at least the following components installed: Compute, Image Service, Identity.
pt_br: Este capítulo assume que você já tem um ambiente OpenStack funcionando com pelo menos os seguintes componentes instalados: Computação, Serviço de Imagem, Identidade.

source: If you want to do backup and restore, you also need Object Storage.
pt_br: Se você quiser fazer backup e restauração, você também precisará do Object Storage.

source: If you want to provision datastores on block-storage volumes, you also need Block Storage.
pt_br: Se você quiser provisionar datastores nos volumes de block-storage, você também precisará do Block Storage.

source: To install the Database module on the controller:
ko_kr: 컨트롤러에 데이터베이스 모듈 설치:
pt_br: Para instalar o módulo de Banco de Dados no controlador:

source: Install required packages:
ko_kr: 필수 패키지 설치:
pt_br: Instale os pacotes requeridos:

source: Respond to the prompts for <link linkend="debconf-dbconfig-common">database management</link> and <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> settings</link>, and <link linkend="debconf-api-endpoints">API endpoint</link> registration. The <placeholder-1/> command runs automatically.
pt_br: Responda à questões para <link linkend="debconf-dbconfig-common">gerenciamento de banco de dados</link>, configurações de <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> e registro de <link linkend="debconf-api-endpoints">endpoint de API</link>. O comando <placeholder-1/> executa automaticamente.

source: Prepare OpenStack:
ko_kr: OpenStack 준비:
pt_br: Prepare o OpenStack:

source: Source the <filename>admin-openrc.sh</filename> file.
ko_kr: <filename>admin-openrc.sh</filename> 파일을 source 명령어로 실행합니다.
pt_br: Obtenha o arquivo <filename>admin-openrc.sh</filename>.

source: Create a <literal>trove</literal> user that Compute uses to authenticate with the Identity service. Use the <literal>service</literal> tenant and give the user the <literal>admin</literal> role:
pt_br: Crie um usuário <literal>trove</literal> que a Computação usa para autenticar-se com o Serviço de Identidade. Utilize o tenant de <literal>serviço</literal> e dê ao usuário o papel <literal>admin</literal>:

source: Replace <replaceable>TROVE_PASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>TROVE_PASS</replaceable> com uma senha adequada.

source: All configuration files should be placed at <filename>/etc/trove</filename> directory. Edit the following configuration files, taking the below actions for each file:
pt_br: Todos os arquivos de configuração devem sem colocados no diretório <filename>/etc/trove</filename>. Edite os seguintes arquivos de configuração, tomando as ações abaixo para cada arquivo:

source: You need to take upstream <filename>api-paste.ini</filename> and change content below in it:
pt_br: Você precisa pegar <filename>api-paste.ini</filename> e alterar o conteúdo abaixo nele:

source: Edit the <literal>[DEFAULT]</literal> section of each file (except <filename>api-paste.ini</filename>) and set appropriate values for the OpenStack service URLs (can be handled by Keystone service catalog), logging and messaging configuration, and SQL connections:
pt_br: Edite a seção <literal>[DEFAULT]</literal> de cada arquivo (exceto de <filename>api-paste.ini</filename>) e defina valores apropriados para as URLs de serviço do OpenStack (pode ser manipulado pelo catálogo de serviço Keystone), configurações de log e mensagens, e conexões SQL:

source: Configure the Database module to use the RabbitMQ message broker by setting the following options in the <literal>[DEFAULT]</literal> configuration group of each file:
pt_br: Configure o módulo de Banco de Dados para utilizar o intermediador de mensagens RabbitMQ definindo as seguintes opções na configuração de grupo <literal>[DEFAULT]</literal> de cada arquivo:

source: Edit the <filename>trove.conf</filename> file so it includes appropriate values for the default datastore and network label regex as shown below:
pt_br: Edite o arquivo <filename>trove.conf</filename> para que ele inclua valores apropriados para o datastore e o rótulo de rede regex como mostrado abaixo:

source: Edit the <filename>trove-taskmanager.conf</filename> file so it includes the required settings to connect to the OpenStack Compute service as shown below:
pt_br: Edite o arquivo <filename>trove-taskmanager.conf</filename> para que ele inclua as configurações requeridas para conectar ao serviço de Computação do OpenStack como mostrado abaixo:

source: Prepare the trove admin database:
ko_kr: Trove 관리자 데이트베이스 준비:
pt_br: Prepare o banco de dados de administração do trove:

source: Prepare the Database service:
ko_kr: 데이터베이스 서비스 준비:
pt_br: Prepare o serviço de banco de dados:

source: Initialize the database:
ko_kr: 데이터베이스 초기화:
pt_br: Inicialize o banco de dados:

source: Create a datastore. You need to create a separate datastore for each type of database you want to use, for example, MySQL, MongoDB, Cassandra. This example shows you how to create a datastore for a MySQL database:
pt_br: Crie um datastore. Você precisa criar um datastore separado para cada tipo de banco de dados que você quiser utilizar, por exemplo, MySQL, MongoDB, Cassandra. Este exemplo lhe mostra como criar um datastore para um banco de dados MySQL:

source: Create a trove image.
ko_kr: Trove 이미지 생성
pt_br: Crie uma imagem do trove.

source: Create an image for the type of database you want to use, for example, MySQL, MongoDB, Cassandra.
pt_br: Crie uma imagem para o tipo de banco de dados que você quiser utilizar, por exemplo, MySQL, MongoDB, Cassandra.

source: This image must have the trove guest agent installed, and it must have the <filename>trove-guestagent.conf</filename> file configured to connect to your OpenStack environment. To correctly configure the <filename>trove-guestagent.conf</filename> file, follow these steps on the guest instance you are using to build your image:
pt_br: Esta imagem deve ter o agente trove instalado, e deve ter o arquivo <filename>trove-guestagent.conf</filename> configurado para conectar-se ao seu ambiente OpenStack. Para configurar corretamente o arquivo <filename>trove-guestagent.conf</filename> , siga estes passos na instância guest que você está usando para contruir sua imagem:

source: Add the following lines to <filename>trove-guestagent.conf</filename>:
ko_kr: <filename>trove-guestagent.conf</filename>에 라인따라 추가합니다:
pt_br: Adicione as seguintes linha ao arquivo <filename>trove-guestagent.conf</filename>:

source: Update the datastore and version to use the specific image with the <placeholder-1/> command.
pt_br: Atualize o datastore e a versão para utilizar a imagem específica com o comando <placeholder-1/>.

source: This example shows you how to create a MySQL datastore with version 5.5:
pt_br: Este exemplo mostra a você como criar um datastore MySQL com versão 5.5:

source: Upload post-provisioning configuration validation rules:
pt_br: Carregue as regras de validação de configuração de pós-provisionamento:

source: Example for uploading rules for MySQL datastore:
pt_br: Exemplo para carregar regras para o datastore MySQL:

source: You must register the Database module with the Identity service so that other OpenStack services can locate it. Register the service and specify the endpoint:
pt_br: Você deve registrar o módulo de Banco de Dados com o Serviço de Identidade para que outros serviços OpenStack possam localizá-lo. Registre o serviço e especifique o endpoint:

source: Restart the Database services:
pt_br: Reinicie os serviços de Banco de Dados:

source: Start the Database services and configure them to start when the system boots:
pt_br: Inicie os serviços de Banco de Dados e configure-os para iniciar quendo o sistema inicializar:

source: Add the Block Storage service
ko_kr: 블록 스토리지 서비스 추가
pt_br: Adicionar o serviço de Block Storage

source: The OpenStack Block Storage service provides block storage devices to instances using various backends. The Block Storage API and scheduler services run on the controller node and the volume service runs on one or more storage nodes. Storage nodes provide volumes to instances using local block storage devices or SAN/NAS backends with the appropriate drivers. For more information, see the <link href="http://docs.openstack.org/juno/config-reference/content/section_volume-drivers.html"><citetitle>Configuration Reference</citetitle></link>.
pt_br: O serviço OpenStack Block Storage fornece dispositivos de armazenamento de blocos para instâncias utilizando várias infraestruturas. A API dos serviços Block Storage e agendador roda no nodo controlador e o serviço de volumes roda em um ou mais nodos de armazenamento. Nodos de armazenamento fornece volumes para instâncias utilizando dispositivos de armazenamento de blocos locais ou infraestruturas de SAN/NAS com os drivers apropriados. Para mais informações, consulte a <link href="http://docs.openstack.org/juno/config-reference/content/section_volume-drivers.html"><citetitle>Referência de Configuração</citetitle></link>.

source: This chapter omits the backup manager because it depends on the Object Storage service.
pt_br: Este capítulo omite o gerenciador de backup porque ele depende do serviço de Object Storage.

source: Your OpenStack environment now includes Block Storage. You can <link linkend="launch-instance">launch an instance</link> or add more services to your environment in the following chapters.
pt_br: Seu ambiente OpenStack agora inclui o Block Storage. Você pode <link linkend="launch-instance">lançar uma instância</link> ou adicionar mais serviços ao seu ambiente nos capítulos seguintes.

source: RabbitMQ credentials parameters
ko_kr: RabbitMQ credentials 매개변수
pt_br: Parâmetros das credenciais do RabbitMQ.

source: For every package that must connect to a Messaging Server, the Debian package enables you to configure the IP address for that server and the user name and password that is used to connect. The following example shows configuration with the <systemitem class="service">ceilometer-common</systemitem> package:
ko_kr: 메시징 서버에 연결해야하는 모든 패키지 중 Debian 패키지는 해당 서버의 IP 주소를 연결하는데 사용할 사용자 이름과 암호를 설정할 수 있습니다. 다음 예제는 <systemitem class="service">ceilometer-common</systemitem> 패키지를 이용하여 설정하는 것을 보여줍니다:
pt_br: Para cada pacote que deve se conectar a um servidor de mensagens, o pacote Debian permite que você configure o endereço IP para esse servidor, além do nome de usuário e senha que é usada para se conectar. O exemplo a seguir mostra a configuração com o pacote <systemitem class="service">ceilometer-common</ systemitem>:

source: These debconf screens appear in: <systemitem class="service">ceilometer-common</systemitem>, <systemitem class="service">cinder-common</systemitem>, <systemitem class="service">glance-common</systemitem>, <systemitem class="service">heat-common</systemitem>, <systemitem class="service">neutron-common</systemitem> and <systemitem class="service">nova-common</systemitem>.
ko_kr: 다음 debconf 화면에서 확인할 수 있습니다: <systemitem class="service">ceilometer-common</systemitem>, <systemitem class="service">cinder-common</systemitem>, <systemitem class="service">glance-common</systemitem>, <systemitem class="service">heat-common</systemitem>, <systemitem class="service">neutron-common</systemitem>, <systemitem class="service">nova-common</systemitem>.
pt_br: Estas telas do debconf aparecem em: <systemitem class="service">ceilometer-common</systemitem>, <systemitem class="service">cinder-common</systemitem>, <systemitem class="service">glance-common</systemitem>, <systemitem class="service">heat-common</systemitem>, <systemitem class="service">neutron-common</systemitem> and <systemitem class="service">nova-common</systemitem>.

source: This will configure the below directives (example from <filename>nova.conf</filename>):
pt_br: Isto irá configurar as diretivas abaixo (exemplo de <filename>nova.conf</filename>):

source: The other directives concerning RabbitMQ will stay untouched.
pt_br: As outras diretivas relacionadas ao RabbitMQ permanecerão intactas.

source: debconf concepts
ko_kr: debconf 개념
pt_br: Conceitos do debconf

source: This chapter explains how to use the Debian <systemitem class="library">debconf</systemitem> and <systemitem class="library">dbconfig-common</systemitem> packages to configure OpenStack services. These packages enable users to perform configuration tasks. When users install OpenStack packages, <package>debconf</package> prompts the user for responses, which seed the contents of configuration files associated with that package. After package installation, users can update the configuration of a package by using the <placeholder-1/> program.
ko_kr: 이 장에서는 오픈스택 서비스를 구성하는데 사용하는 데비안 <systemitem class="library">debconf</systemitem>과 <systemitem class="library">dbconfig-common</systemitem> 꾸러미 사용법을 설명합니다. 이 꾸러미를 이용하여 구성 작업을 진행할 수 있습니다. 사용자가 OpenStack 꾸러미를 설치할 때, <package>debconf</package> 질문을 이용하여 사용자와 응답하며, 꾸러미와 관련된 설정 파일 내용을 구성합니다. 꾸러미 설치 후, <placeholder-1/> 프로그램을 사용하여 꾸러미의 구성을 업데이트 할 수 있습니다.
pt_br: Este capítulo explica como utilizar os pacotes <systemitem class="library">debconf</systemitem> e <systemitem class="library">dbconfig-common</systemitem> do Debian para configurar os serviços do OpenStack. Estes pacotes permitem aos usuários realizar tarefas de configuração. Quando os usuários instalam os pacotes do OpenStack, o <package>debconf</package> solicita ao usuário as respostas, as quais alimentam o conteúdo dos arquivos de configuração associados ao pacote. Depois da instalação do pacote, os usuários podem atualizar a configuração do pacote usando o programa <placeholder-1/>.

source: If you are familiar with these packages and pre-seeding, you can proceed to <xref linkend="ch_keystone"/>.
ko_kr: 꾸러미와 선배포에 익숙하다면, <xref linkend="ch_keystone"/>을(를) 진행할 수 있습니다.
pt_br: Se você estiver familiarizado com estes pacotes e pré-configurações, pode avançar para <xref linkend="ch_keystone"/>.

source: The Debian packages
ko_kr: Debian 페키지
pt_br: Os pacotes Debian

source: The rules described here are from the <link href="http://www.debian.org/doc/debian-policy/"><citetitle>Debian Policy Manual</citetitle></link>. If any rule described in this chapter is not respected, you have found a serious bug that must be fixed.
ko_kr: 규칙은 <link href="http://www.debian.org/doc/debian-policy/"><citetitle>데비안 정책 설명서</citetitle></link>에 적혀있습니다. 이 장에 설명한 어떤 규칙이 제대로 주어지지 않았다면, 고쳐야 할 심각한 버그를 발견한 것입니다.
pt_br: As regras aqui descritas estão em <link href="http://www.debian.org/doc/debian-policy/"><citetitle>Debian Policy Manual</citetitle></link>. Se qualquer regra descrita nesse capítulo não for respeitada, você encontrou um bug grave que deve ser corrigido.

source: When you install or upgrade a Debian package, all configuration file values are preserved. Using the <systemitem class="library">debconf</systemitem> database as a registry is considered a bug in Debian. If you edit something in any OpenStack configuration file, the <systemitem class="library">debconf</systemitem> package reads that value when it prepares to prompt the user. For example, to change the log in name for the RabbitMQ messaging queue for a service, you can edit its value in the corresponding configuration file.
ko_kr: 데비안 꾸러미를 설치하거나 업그레이드 할 때, 모든 설정 값은 변경되지 않습니다. 레지스트리로 <systemitem class="library">debconf</systemitem> 데이터베이스를 사용하는 것은 데비안 버그로 간주합니다. 어떤 오픈스택 구성 파일을 편집해야 한다면, <systemitem class="library">debconf</systemitem> 꾸러미를 읽어 사용자에게 값을 표시합니다. 예를 들어, 서비스에 대한 RabbitMQ의 메시지 큐 이름에서 로그 내용을 바꾸려 한다면, 해당 설정 파일에서 편집할 수 있습니다.
pt_br: Quando você instala ou atualiza um pacote Debian, todos os valores nos arquivos de configuração são preservados. Usar o banco de dados do <systemitem class="library">debconf</systemitem> como um registro é considerado um bug no Debian. Se você editar algo em qualquer arquivo de configuração do OpenStack, o pacote <systemitem class="library">debconf</systemitem> lê esse valor quando se prepara para avisar ao usuário. Por exemplo, para alterar o nome de login para a fila de mensagens RabbitMQ para um serviço, você pode editar o seu valor no arquivo de configuração correspondente.
