Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: Add the system user <literal>swift</literal> to the system group <literal>ceilometer</literal> to give Object Storage access to the <filename>ceilometer.conf</filename> file.
pt_br: Adicione o usuário do sistema <literal>swift</literal> ao grupo de sistema <literal>ceilometer</literal> para dar acesso para o Object Storage ao arquivo <filename>ceilometer.conf</filename>.

source: Add <literal>ResellerAdmin</literal> to the <literal>operator_roles</literal> parameter of that same file:
pt_br: Adicione <literal>ResellerAdmin</literal> ao parâmetro <literal>operator_roles</literal> do mesmo arquivo:

source: Restart the service with its new settings:
ko_kr: 새로운 설정을 반영하기 위해 다시 시작 하십시오:
pt_br: Reinicie o serviço com as novas configurações:

source: Create tenants, users, and roles
pt_br: Criar tenants, usuários e papéis

source: After you install the Identity service, create <glossterm baseform="tenant">tenants</glossterm> (projects), <glossterm baseform="user">users</glossterm>, and <glossterm baseform="role">roles</glossterm> for your environment. You must use the temporary administration token that you created in <xref linkend="keystone-install"/> and manually configure the location (endpoint) of the Identity service before you run <placeholder-1/> commands.
pt_br: Após instalar o serviço de Identidade, crie (projetos) <glossterm baseform="tenant">tenants</glossterm>, <glossterm baseform="user">usuários</glossterm>, e <glossterm baseform="role">papéis</glossterm> para o seu ambiente. Você deve utilizar o token administrativo temporário que você criou em <xref linkend="keystone-install"/> e configurar manualmente a localização (endpoint) do serviço de Identidade antes de executar comandos <placeholder-1/> .

source: You can pass the value of the administration token to the <placeholder-1/> command with the <parameter>--os-token</parameter> option or set the temporary <envar>OS_SERVICE_TOKEN</envar> environment variable. Similarly, you can pass the location of the Identity service to the <placeholder-2/> command with the <parameter>--os-endpoint</parameter> option or set the temporary <envar>OS_SERVICE_ENDPOINT</envar> environment variable. This guide uses environment variables to reduce command length.
pt_br: Você pode passar o valor do token de administração para o comando <placeholder-1/> com a opção <parameter>--os-token</parameter> ou definir a variável de ambiente temporária <envar>OS_SERVICE_TOKEN</envar>. Da mesma forma, você pode passar a localização do sistema de Identidade para o comando <placeholder-2/> com a opção <placeholder-2/> ou definir a variável de ambiente temporária <envar>OS_SERVICE_ENDPOINT</envar>. Este guia utiliza variáveis de ambiente para reduzir o comprimento do comando.

source: For more information, see the <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Project and Users</link>.
pt_br: Para mais informações, consulte <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Project and Users</link>.

source: In Debian, the admin tenant, user and roles can be created automatically when installing the Keystone package. You must manually create the demo tenant and user however.
pt_br: No Debian, os tenants de admin, usuário e papéis podem ser criados automaticamente ao se instalar o pacote Keystone. Contudo, você deve criar manualmente o tenant e o usuário demo.

source: Configure the administration token:
pt_br: Configure o token de administração:

source: Replace <replaceable>ADMIN_TOKEN</replaceable> with the administration token that you generated in <xref linkend="keystone-install"/>. For example:
pt_br: Substitua <package>cinder-common</package> com o token de administração que você gerou em <xref linkend="keystone-install"/>. Por exemplo

source: Configure the endpoint:
pt_br: Configure o endpoint:

source: To create tenants, users, and roles
pt_br: Para criar tenants, usuários, e papéis

source: Create an administrative tenant, user, and role for administrative operations in your environment:
pt_br: Crie um tenant administrativo, um usuário, e um papel para operações administrativas em seu ambiente:

source: Create the <literal>admin</literal> tenant:
ko_kr: <literal>admin</literal> tenant 생성:
pt_br: Crie o tenant <literal>admin</literal>:

source: OpenStack generates IDs dynamically, so you will see different values from the example command output.
pt_br: O OpenStack gera IDs dinâmicamente, portanto você deve ver diferentes valores a partir da saída de comandos.

source: Create the <literal>admin</literal> user:
ko_kr: <literal>admin</literal> 사용자 생성:
pt_br: Crie o usuário <literal>admin</literal>:

source: Replace <replaceable>ADMIN_PASS</replaceable> with a suitable password and <replaceable>EMAIL_ADDRESS</replaceable> with a suitable e-mail address.
pt_br: Substitua <replaceable>ADMIN_PASS</replaceable> com uma senha adequada e <replaceable>EMAIL_ADDRESS</replaceable> com um endereço de e-mail adequado.

source: Create the <literal>admin</literal> role:
ko_kr: <literal>admin</literal> 룰 생성:
pt_br: Crie o papel <literal>admin</literal>:

source: Add the <literal>admin</literal> role to the <literal>admin</literal> tenant and user:
pt_br: Adicione o papel <literal>admin</literal> ao tenant e usuário <literal>admin</literal>:

source: This command provides no output.
pt_br: Este comando não retorna resultados.

source: Any roles that you create must map to roles specified in the <filename>policy.json</filename> file included with each OpenStack service. The default policy for most services grants administrative access to the <literal>admin</literal> role. For more information, see the <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Projects and Users</link>.
pt_br: Qualquer papel que você criar deve ser mapeado para papéis especificados no arquivo <filename>policy.json</filename> incluído com cada serviço OpenStack. A política default para a maioria dos serviços concede acesso administrativo ao papel <literal>admin</literal>. Para mais informações, consulte o <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Projects and Users</link>.

source: Create a demo tenant and user for typical operations in your environment:
pt_br: Crie um usuário e um tenant de demonstração para operações típicas em seu ambiente:

source: Create the <literal>demo</literal> tenant:
ko_kr: <literal>demo</literal> tenant 생성:
pt_br: Crie o tenant <literal>demo</literal>:

source: Do not repeat this step when creating additional users for this tenant.
pt_br: Não repita este passo quando estiver criando usuários adicionais para este tenant.

source: Create the <literal>demo</literal> user under the <literal>demo</literal> tenant:
pt_br: Crie o usuário <literal>demo</literal> sob o tenant <literal>demo</literal>:

source: Replace <replaceable>DEMO_PASS</replaceable> with a suitable password and <replaceable>EMAIL_ADDRESS</replaceable> with a suitable e-mail address.
pt_br: Substitua <replaceable>DEMO_PASS</replaceable> com uma senha adequada e <replaceable>EMAIL_ADDRESS</replaceable> com um endereço de e-mail adequado.

source: Using the <literal>--tenant</literal> option automatically assigns the <literal>_member_</literal> role to a user. This option will also create the <literal>_member_</literal> role if it does not exist.
pt_br: Utilizando a opção <literal>--tenant</literal> automaticamente atribuirá o papel <literal>_member_</literal> a um usuário. Esta opção também irá criar o papel <literal>_member_</literal> se ele não existir.

source: You can repeat this procedure to create additional tenants and users.
pt_br: Você pode repetir este procedimento para criar tenants e usuários adicionais.

source: OpenStack services also require a tenant, user, and role to interact with other services. Each service typically requires creating one or more unique users with the <literal>admin</literal> role under the <literal>service</literal> tenant.
pt_br: Os serviços OpenStack também requerem um tenant, usuário, e papel para interagir com outros serviços. Cada serviço requer tipicamente a criação de um ou mais usuários únicos com o papel <literal>admin</literal> sob o tenant de <literal>serviço</literal>.

source: Create the <literal>service</literal> tenant:
ko_kr: <literal>service</literal> tenant를 생성합니다:
pt_br: Crie o tenant <literal>service</literal>:

source: Install the Compute agent for Telemetry
ko_kr: Telemetry Compute 에이전트 설치
pt_br: Instale o agente de Computação para Telemetria

source: Telemetry is composed of an API service, a collector and a range of disparate agents. This section explains how to install and configure the agent that runs on the compute node.
pt_br: A Telemetria é composta de um serviço de API, um coletor e uma variedade de agentes diferentes. Esta seção explica como instalar e configurar o agente que roda no nodo de Computação.

source: Install the package:
pt_br: Instalar o pacote:

source: Edit the <filename>/etc/nova/nova.conf</filename> file and configure notifications in the <literal>[DEFAULT]</literal> section:
pt_br: Edite o arquivo <filename>/etc/nova/nova.conf</filename> e configure as notificações na seção <literal>[DEFAULT]</literal>:

source: Restart the Compute service:
ko_kr: Compute 서비스를 재시작하십시오:
pt_br: Reinicie o serviço de Computação:

source: To configure the Compute agent for Telemetry
pt_br: Para configurar o agente de Computação para Telemetria

source: Edit the <filename>/etc/ceilometer/ceilometer.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/ceilometer/ceilometer.conf</filename> e complete as seguintes ações:

source: In the <literal>[publisher]</literal> section, configure the metering secret:
pt_br: Na seção <literal>[publisher]</literal>, configure o secret de medição:

source: Replace <replaceable>METERING_SECRET</replaceable> with the metering secret you chose for the Telemetry module.
pt_br: Substitua <replaceable>METERING_SECRET</replaceable> com o segredo de medição que você escolheu para o módulo de Telemetria.

source: In the <literal>[DEFAULT]</literal> section, configure <application>RabbitMQ</application> message broker access:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure o acesso ao intermediador <application>RabbitMQ</application>:

source: Replace <replaceable>RABBIT_PASS</replaceable> with the password you chose for the guest account in RabbitMQ.
pt_br: Substitua <replaceable>RABBIT_PASS</replaceable> com a senha que você escolheu para a conta guest no RabbitMQ.

source: In the <literal>[keystone_authtoken]</literal> section, configure Identity service access:
pt_br: Na seção <literal>[keystone_authtoken]</literal> , configure o acesso ao serviço de Identidade:

source: Replace <replaceable>CEILOMETER_PASS</replaceable> with the password you chose for the Telemetry module database.
pt_br: Substitua <replaceable>CEILOMETER_PASS</replaceable> com a senha que você escolheu para a base de dados do módulo de Telemetria.

source: Comment out the <literal>auth_host</literal>, <literal>auth_port</literal>, and <literal>auth_protocol</literal> keys, since they are replaced by the <literal>identity_uri</literal> and <literal>auth_uri</literal> keys.
pt_br: Comente as chaves <literal>auth_host</literal>, <literal>auth_port</literal>, e <literal>auth_protocol</literal>, uma vez que elas foram substituídas pelas chaves <literal>identity_uri</literal> e <literal>auth_uri</literal>.

source: In the <literal>[service_credentials]</literal> section, configure service credentials:
pt_br: Na seção <literal>[service_credentials]</literal>, configure as credenciais de serviço:

source: Replace <replaceable>CEILOMETER_PASS</replaceable> with the password you chose for the <literal>ceilometer</literal> user in the Identity service.
pt_br: Substitua <replaceable>CEILOMETER_PASS</replaceable> com a senha que você escolheu para o usuário <literal>ceilometer</literal> no Serviço de Identidade.

source: Restart the Telemetry service:
pt_br: Reiniciar o serviço de Telemetria:

source: Start the Telemetry service and configure it to start when the system boots:
pt_br: Iniciar o serviço de Telemetria e configure-os para iniciar quando o sistema inicializar:

source: Install the Data processing service
pt_br: Instale o serviço de processamento de Dados.

source: This procedure installs the Data processing service (sahara) on the controller node.
pt_br: Este procedimento instala o serviço de processamento de Dados (sahara) no nodo controlador.

source: To install the Data processing service on the controller:
pt_br: Para instalar o serviço de processamento de dados no controlador:

source: Install the required packages:
pt_br: Instale os pacotes requeridos:

source: Respond to prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken">Identity service credentials</link>, <link linkend="debconf-api-endpoints">service endpoint registration</link>, and <link linkend="debconf-rabbitmq">message broker credentials</link>.
pt_br: Responda às questões para <link linkend="debconf-dbconfig-common">gerenciamento de banco de dados</link>, <link linkend="debconf-keystone_authtoken">Credenciais do serviço de Identidade</link>, <link linkend="debconf-api-endpoints">serviço de registro de endpoint</link>, e <link linkend="debconf-rabbitmq">credenciais do intermediador de mensagens</link>.

source: You need to install the required packages. For now, sahara doesn't have packages for Ubuntu. Documentation will be updated once the packages are available. The rest of this document assumes that you have the sahara service packages installed on the system.
pt_br: Você precisa instalar os pacotes requeridos. No momento, o sahara não tem pacotes para Ubuntu. A Documentação será atualizada tão logo os pacotes estejam disponíveis. O restante deste documento assume que você tem os pacotes do serviço sahara instalados no sistema.

source: Edit <filename>/etc/sahara/sahara.conf</filename> configuration file
pt_br: Edite o arquivo de configuração <filename>/etc/sahara/sahara.conf</filename>

source: First, edit <placeholder-1/> parameter in the <literal>[database]</literal> section. The URL provided here should point to an empty database. For instance, connection string for MySQL database will be: <placeholder-2/>
pt_br: Primeiro, edite o parâmetro <placeholder-1/> na seção <literal>[database]</literal>. A URL fornecida aqui deve apontar para uma base de dados vazia. Por exemplo, a string de conexão para a base de dados MySQL será: <placeholder-2/>

source: Switch to the <literal>[keystone_authtoken]</literal> section. The <placeholder-1/> parameter should point to the public Identity API endpoint. <placeholder-2/> should point to the admin Identity API endpoint. For example: <placeholder-3/>
pt_br: Alterne para a seção <literal>[keystone_authtoken]</literal>. O parâmetro <placeholder-1/> deve apontar para o endpoint público da API de Identidade. <placeholder-2/> deve apontar para o endpoint da API de Identidade de admin. Por exemplo: <placeholder-3/>

source: Next specify <literal>admin_user</literal>, <literal>admin_password</literal> and <literal>admin_tenant_name</literal>. These parameters must specify a keystone user which has the <literal>admin</literal> role in the given tenant. These credentials allow sahara to authenticate and authorize its users.
pt_br: A seguir, especifique <literal>admin_user</literal>, <literal>admin_password</literal> e <literal>admin_tenant_name</literal>. Esses parâmetros devem especificar um usuário de keystone que tem o papel de <literal>admin</literal> no tenant fornecido. Essas credenciais permitem o sahara autenticar e autorizar seus usuários.

source: Switch to the <literal>[DEFAULT]</literal> section. Proceed to the networking parameters. If you are using Neutron for networking, then set <literal>use_neutron=true</literal>. Otherwise if you are using <systemitem>nova-network</systemitem> set the given parameter to <literal>false</literal>.
pt_br: Alterne para a seção <literal>[DEFAULT]</literal>. Vá até os parâmetros de rede. Se você estiver usando Neutron para rede, então defina <literal>use_neutron=true</literal>. Do contrário, se você estiver usando <systemitem>nova-network</systemitem>, defina o parâmetro dado para <literal>false</literal>.

source: That should be enough for the first run. If you want to increase logging level for troubleshooting, there are two parameters in the config: <literal>verbose</literal> and <literal>debug</literal>. If the former is set to <literal>true</literal>, sahara will start to write logs of <literal>INFO</literal> level and above. If <literal>debug</literal> is set to <literal>true</literal>, sahara will write all the logs, including the <literal>DEBUG</literal> ones.
pt_br: Isso deveria ser suficiente para a primeira execução. Se você quiser aumentar o nível de log para solução de problemas, existem dois parâmetros na configuração: <literal>verbose</literal> e <literal>debug</literal>. Se o primeiro está definido para <literal>true</literal>, o sahara irá iniciar a escrever logs de nível <literal>INFO</literal> e acima. Se <literal>debug</literal> está definido para <literal>true</literal>, o sahara irá escrever todos os logs, incluindo aqueles de <literal>DEBUG</literal>.

source: If you use the Data processing service with a MySQL or MariaDB database, you must configure the maximum number of allowed packets for storing big job binaries in the service internal database.
pt_br: Se você utiliza o serviço de Processamento de Dados com os bancos de dados MySQL ou MariaDB, você deve configurar o número máximo de pacotes permitidos para armazenar grandes binários de trabalho no banco de dados interno de serviços.

source: Edit the <filename os="ubuntu;debian">/etc/mysql/my.cnf</filename><filename os="rhel;centos;fedora;sles;opensuse">/etc/my.cnf</filename> file and change the <literal>max_allowed_packet</literal> option:
pt_br: Edite o arquivo <filename os="ubuntu;debian">/etc/mysql/my.cnf</filename><filename os="rhel;centos;fedora;sles;opensuse">/etc/my.cnf</filename> e altere a opção <literal>max_allowed_packet</literal>:

source: Create the <literal>sahara</literal> database:
pt_br: Crie a base de dados do <literal>sahara</literal> :

source: Grant proper access to the <literal>sahara</literal> database:
pt_br: Conceda acesso adequado à base de dados do <literal>sahara</literal>:

source: Replace <replaceable>SAHARA_DBPASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>SAHARA_DBPASS</replaceable> com uma senha adequada:

source: Create database schema: <placeholder-1/>
pt_br: Crie o esquema da base de dados: <placeholder-1/>

source: You must register the Data processing service with the Identity service so that other OpenStack services can locate it. Register the service and specify the endpoint: <placeholder-1/>
pt_br: Você deve registrar o serviço de processamento de Dados com o serviço de Identidade para que outros serviços OpenStack possam localizá-lo. Registre o serviço e especifique o endpoint: <placeholder-1/>

source: Start the sahara service: <placeholder-1/><placeholder-2/>
pt_br: Inicie o serviço sahara: <placeholder-1/><placeholder-2/>

source: (Optional) Enable the Data processing service to start on boot <placeholder-1/><placeholder-2/>
pt_br: (Opcional) Habilite o serviço de processamento de Dados para iniciar no boot <placeholder-1/><placeholder-2/>

source: Add the Block Storage service agent for Telemetry
ko_kr: Telemetry에위한 블록 스토리지 서비스 에이전트 추가
pt_br: Adicionar o agente do serviço de Block Storage para Telemetria

source: To retrieve volume samples, you must configure the Block Storage service to send notifications to the bus.
pt_br: Para recuperar exemplos de volume, você deve configurar o serviço de Block Storage para enviar notificações para o baramento.

source: Edit <filename>/etc/cinder/cinder.conf</filename> and add in the <literal>[DEFAULT]</literal> section on the controller and volume nodes:
ko_kr: 컨트롤러 노드와 볼륨 노드의 <filename>/etc/cinder/cinder.conf</filename> 에 <literal>[DEFAULT]</literal> 세션을 추가하십시오:
pt_br: Edite <filename>/etc/cinder/cinder.conf</filename> e adicione na seção <literal>[DEFAULT]</literal> nos nodos controlador e volume:

source: Restart the Block Storage services with their new settings.
ko_kr: 새로운 설정을 적용하기 위해 블록 스토리지 서비스를 재시작합니다.
pt_br: Reinicie os serviços de Block Storage com suas novas configurações.

source: On the controller node:
ko_kr: 컨트롤러 노드에서:
pt_br: No nodo do controlador:

source: On the storage node:
pt_br: No nodo de armazenamento:

source: If you want to collect OpenStack Block Storage notification on demand, you can use <placeholder-1/> from OpenStack Block Storage. For more information, <link href="http://docs.openstack.org/admin-guide-cloud/content/section_telemetry-cinder-audit-script.html"><citetitle>Block Storage audit script setup to get notifications</citetitle></link>.
pt_br: Se você quer coletar notificações por demanda do OpenStack Block Storage, você pode usar <placeholder-1/> do OpenStack Block Storage. Para maiores informações, <link href="http://docs.openstack.org/admin-guide-cloud/content/section_telemetry-cinder-audit-script.html"><citetitle>Block Storage audit script setup to get notifications</citetitle></link>.

source: Verify operation
pt_br: Verifique a operação

source: This section describes how to verify operation of the dashboard.
pt_br: Esta seção descreve como verificar a operação do dashboard.

source: Access the dashboard using a web browser: <uri os="ubuntu">http://controller/horizon</uri><uri os="debian">https://controller/</uri><uri os="rhel;centos;fedora">http://controller/dashboard</uri><uri os="sles;opensuse">http://controller</uri>.
pt_br: Acesse o dashboard usando um navegador web: <uri os="ubuntu">http://controller/horizon</uri><uri os="debian">https://controller/</uri><uri os="rhel;centos;fedora">http://controller/dashboard</uri><uri os="sles;opensuse">http://controller</uri>.

source: Authenticate using <literal>admin</literal> or <literal>demo</literal> user credentials.
pt_br: Autentique-se usando as credenciais de usuário <literal>admin</literal> ou <literal>demo</literal>.

source: This section describes how to verify operation of the Image Service using <link href="http://launchpad.net/cirros">CirrOS</link>, a small Linux image that helps you test your OpenStack deployment.
pt_br: Esta seção descreve como verificar a operação do Serviço de Imagem utilizando <link href="http://launchpad.net/cirros">CirrOS</link>, uma pequena imagem Linux que o ajuda a testar sua implantação de OpenStack.
