Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: The proxy server takes each request and looks up locations for the account, container, or object and routes the requests correctly. The proxy server also handles API requests. You enable account management by configuring it in the <filename>/etc/swift/proxy-server.conf</filename> file.
ko_kr: 프록시 서버는 각각의 요청을 받아들이고 계정, 컨테이너 또는 오브젝트의 위치를 찾아 요청 경로를 올바른 경로로 유도합니다. 프록시 서버는 API 요청도 처리합니다. <filename>/etc/swift/proxy-server.conf</filename> 파일을 설정하여 계정 관리를 활성화할 수 있습니다.

source: Install swift-proxy service:
ko_kr: swift-proxy 서비스를 설치하십시오:

source: Modify memcached to listen on the default interface on a local, non-public network. Edit this line in the <filename>/etc/memcached.conf</filename> file:
ko_kr: 로컬, 비공개 네트워크에서 기본 인터페이스로 응답을 대기할 수 있게 memcached를 수정하십시오. <filename>/etc/memcached.conf</filename> 파일에서 다음 줄을 편집하십시오:

source: Change it to:
ko_kr: 다음과 같이 바꾸십시오:

source: Modify memcached to listen on the default interface on a local, non-public network. Edit the <filename>/etc/sysconfig/memcached</filename> file:
ko_kr: 로컬, 비공개 네트워크에서 기본 인터페이스로 응답을 대기할 수 있게 memcached를 수정하십시오. <filename>/etc/sysconfig/memcached</filename> 파일을 편집하십시오:

source: Restart the memcached service:
ko_kr: Memcached 서비스 재시작:

source: Start the memcached service and configure it to start when the system boots:
ko_kr: memcached 서비스를 시작하고 시스템을 부팅할 때 시작하도록 설정하십시오:

source: <phrase os="ubuntu;debian">Create</phrase><phrase os="rhel;centos;fedora;opensuse;sles">Edit</phrase><filename>/etc/swift/proxy-server.conf</filename>:
ko_kr: <filename>/etc/swift/proxy-server.conf</filename>를 <phrase os="ubuntu;debian">만드십시오</phrase><phrase os="rhel;centos;fedora;opensuse;sles">편집하십시오</phrase>:

source: If you run multiple memcache servers, put the multiple IP:port listings in the [filter:cache] section of the <filename>/etc/swift/proxy-server.conf</filename> file:
ko_kr: 여러 대의 memcache 서버를 운용중이라면, <filename>/etc/swift/proxy-server.conf</filename> 파일의 [filter:cache] 섹션에서 다중 IP:포트 목록을 설정하십시오:

source: Only the proxy server uses memcache.
ko_kr: 프록시 서버만 memcache를 사용합니다.

source: Create the account, container, and object rings. The builder command creates a builder file with a few parameters. The parameter with the value of 18 represents 2 ^ 18th, the value that the partition is sized to. Set this “partition power” value based on the total amount of storage you expect your entire ring to use. The value 3 represents the number of replicas of each object, with the last value being the number of hours to restrict moving a partition more than once.
ko_kr: 계정, 컨테이너, 오브젝트 링을 만드십시오. 빌더 명령은 몇가지 매개 변수를 사용하여 빌더 파일을 만듭니다. 매개 변수에 18이라는 값이 들어가면 2의 18승을 의미하는데, 파티션 크기를 의미합니다. 사용할 전체 링에서 필요로 하는 전체 저장소 용량을 기반으로 하여 “partition power” 값을 설정하십시오. 3이라는 값은 각 오브젝트의 복제 갯수를 의미하며, 마지막 값은 하나 이상의 파티션 이동 동작에 대한 제한 시간을 의미합니다.

source: For every storage device on each node add entries to each ring:
ko_kr: 모든 노드의 저장 장치의 각각 링에 항목을 추가하십시오:

source: You must omit the optional <parameter>STORAGE_REPLICATION_NET_IP</parameter> parameter if you do not want to use dedicated network for replication.
ko_kr: 기존에 마련한 네트워크에서 리플리케이션을 활용하지 않으려면 추가 <parameter>STORAGE_REPLICATION_NET_IP</parameter> 매개 변수 값을 생략해야합니다.

source: For example, if a storage node has a partition in Zone 1 on IP 10.0.0.1, the storage node has address 10.0.1.1 from replication network. The mount point of this partition is <filename>/srv/node/sdb1</filename>, and the path in <filename>/etc/rsyncd.conf</filename> is <filename>/srv/node/</filename>, the DEVICE would be sdb1 and the commands are:
ko_kr: 저장소 노드에서 IP 10.0.0.1에 대해 Zone 1의 파티션을 보유하고 있고 리플리케이션 네트워크에 대해 저장소 노드가 10.0.1.1 주소를 보유하고 있다는 상황을 가정해봅니다. 이 파티션의 마운트 위치는 <filename>/srv/node/sdb1</filename>이고, <filename>/etc/rsyncd.conf</filename>의 경로는 <filename>/srv/node/</filename>이며, 장치는 sdb1이 됩니다. 이에 대한 명령은 다음과 같습니다:

source: If you assume five zones with one node for each zone, start ZONE at 1. For each additional node, increment ZONE by 1.
ko_kr: 다섯개 각각의 존에 대해 하나의 노드를 할당했다고 가정한다면 ZONE 은 1번 부터 시작합니다. 각각의 추가 노드에서 ZONE 번호는 1씩 증가합니다.

source: Verify the ring contents for each ring:
ko_kr: 각 링별 링 컨텐츠 확인:

source: Rebalance the rings:
ko_kr: 링 재조정:

source: Rebalancing rings can take some time.
ko_kr: 재조정중인 링은 시간이 걸릴 수 있습니다.

source: Copy the <filename>account.ring.gz</filename>, <filename>container.ring.gz</filename>, and <filename>object.ring.gz</filename> files to each of the Proxy and Storage nodes in <filename>/etc/swift</filename>.
ko_kr: <filename>/etc/swift</filename>에 있는 각각의 프록시 노드와 저장소 노드에 <filename>account.ring.gz</filename>, <filename>container.ring.gz</filename>, <filename>object.ring.gz</filename> 파일을 복사하십시오.

source: Make sure the swift user owns all configuration files:
ko_kr: 스위프트 사용자가 모든 설정 파일을 보유했는지 확인하십시오:

source: Restart the Proxy service:
ko_kr: 프록시 서비스를 재시작:

source: Start the Proxy service and configure it to start when the system boots:
ko_kr: 프록시 서비스를 시작하고 시스템을 부팅할 때 시작하도록 설정하십시오:

source: Add another proxy server
ko_kr: 다른 프록시 서버 추가

source: Update the list of memcache servers in the <filename>/etc/swift/proxy-server.conf</filename> file for added proxy servers. If you run multiple memcache servers, use this pattern for the multiple IP:port listings in each proxy server configuration file:
ko_kr: 추가한 프록시 서버에 대해 <filename>/etc/swift/proxy-server.conf</filename> 파일의 memcache 서버 목록을 업데이트하십시오. 여러 대의 memcache 서버를 구동중이라면 각각의 프록시 서버 설정 파일에 다음과 같은 다중 IP:포트 목록 패턴을 사용하십시오:

source: Copy ring information to all nodes, including new proxy nodes. Also, ensure that the ring information gets to all storage nodes.
ko_kr: 모든 노드에 새 프록시 노드를 포함하여 링 정보를 복사하십시오. 링 정보를 모든 저장소 노드에 넣었는지도 확인하십시오.

source: After you sync all nodes, make sure that the admin has keys in <filename>/etc/swift</filename> and the ownership for the ring file is correct.
ko_kr: 모든 노드를 동기화 하고 난 후, <filename>/etc/swift</filename> 에 어드민 키가 있는지, 링 파일에 대한 소유 권한이 올바른지 확인하십시오.

source: Plan networking for Object Storage
ko_kr: 오브젝트 스토리지의 네트워크 계획

source: For both conserving network resources and ensuring that network administrators understand the needs for networks and public IP addresses for providing access to the APIs and storage network as necessary, this section offers recommendations and required minimum sizes. Throughput of at least 1000 Mbps is suggested.
ko_kr: 네트워크 리소스을 적절하게 사용하고, 네트워크 관리자가 보증하는 필요한 스토리지 네트워크와 API에 접근할 수 있도록 제공되는 공인 IP 주소와 네트워크의 필요를 알려줍니다. 이 부분에서는 추천하는 사양과 사용하는데 있어서 필요한 최소한의 크기를 알려줍니다. 대역폭은 최소 1000Mbps를 권장합니다.

source: A mandatory storage network. Not accessible from outside the cluster. All nodes connect to this network.
ko_kr: 필수적인 저장소 네트워크입니다. 클러스터 외부에서는 접근할 수 없습니다. 모든 노드는 이 네트워크로 연결합니다.

source: This guide describes the following networks:<placeholder-1/>
ko_kr: 이 안내서에서는 다음 네트워크를 설명합니다:<placeholder-1/>

source: If you configure a replication network in the Ring, the Account, Container and Object servers listen on both the <literal>STORAGE_LOCAL_NET</literal> and <literal>STORAGE_REPLICATION_NET</literal> IP addresses. The rsync daemon only listens on the <literal>STORAGE_REPLICATION_NET</literal> IP address.
ko_kr: 링에서 리플리케이션 네트워크를 설정하면 계정 서버, 컨테이너 서버, 오브젝트 서버는 <literal>STORAGE_LOCAL_NET</literal> 과 <literal>STORAGE_REPLICATION_NET</literal>에 있는 IP 주소로 요청을 기다립니다. rsync 데몬은 <literal>STORAGE_REPLICATION_NET</literal> IP 주소를 통해 요청을 기다립니다.

source: Public Network (Publicly routable IP range)
ko_kr: 공개 네트워크(공개적인 라우팅이 가능한 IP 범위)

source: Provides public IP accessibility to the API endpoints within the cloud infrastructure.
ko_kr: 클라우드 인프라스트럭처에 있는 API 엔드 포인트에 공용 IP로의 접근 가능성을 제공합니다.

source: Minimum size: one IP address for each proxy server.
ko_kr: 최소 크기: 각 프록시 서버당 하나의 IP 주소.

source: Storage Network (RFC1918 IP Range, not publicly routable)
ko_kr: 저장장치 네트워크 (RFC1918 IP 범위, 내부 라우팅)

source: Manages all inter-server communications within the Object Storage infrastructure.
ko_kr: 오브젝트 스토리지 인프라 내의 모든 서버간 통신을 관리합니다.

source: Minimum size: one IP address for each storage node and proxy server.
ko_kr: 최소 크기: 스토리지 노드와 프록시 서버당 하나의 IP 주소.

source: Recommended size: as above, with room for expansion to the largest your cluster size. For example, 255 or CIDR /24.
ko_kr: 권장 크기: 상기와 같이, 최대 클러스터 크기를 확장하기 위한 공간. 예를 들어, 255 또는 CIDR /24.

source: Replication Network (RFC1918 IP Range, not publicly routable)
ko_kr: 네트워크 리플리케이션 (RFC1918 IP 범위, 내부 라우팅)

source: Manages replication-related communications among storage servers within the Object Storage infrastructure.
ko_kr: 오브젝트 저장소 인프라스트럭처의 저장소 서버사이에 리플리케이션 관련 통신을 관리합니다.

source: Recommended size: as for <literal>STORAGE_LOCAL_NET</literal>.
ko_kr: 권장 크기: <literal>STORAGE_LOCAL_NET</literal> 만큼.

source: Example of Object Storage installation architecture
ko_kr: 오브젝트 스토리지 설치 아키텍처 예제

source: Node: A host machine that runs one or more OpenStack Object Storage services.
ko_kr: 노드: 하나 이상의 OpenStack 오브젝트 스토리지 서비를 실행하는 호스트 머신.

source: Proxy node: Runs proxy services.
ko_kr: 프록시 노드: 프록시 서비스를 실행합니다.

source: Storage node: Runs account, container, and object services. Contains the SQLite databases.
ko_kr: 스토리지 노드: 계정, 컨테이너, 오브젝트 서비스를 실행합니다. SQLite 데이터베이스가 기본입니다.

source: To increase reliability and performance, you can add additional proxy servers.
ko_kr: 신뢰성과 성능을 끌어올리기 위해 프록시 서버를 더 추가할 수 있습니다.

source: Install Object Storage
ko_kr: 오브젝트 스토리지 설치

source: Though you can install OpenStack Object Storage for development or testing purposes on one server, a multiple-server installation enables the high availability and redundancy you want in a production distributed object storage system.
ko_kr: 개발 및 시험 목적으로 하나의 서버에 오픈스택 오브젝트 저장소를 설치할 수 있지만 여러대의 서버를 설치하면 분산 오브젝트 저장소 시스템 상용화에 있어 원하는 만큼의 고가용성과 중복성을 가능케 할 수 있습니다.

source: Have a copy of the operating system installation media available if you are installing on a new server.
ko_kr: 새로운 서버에 설치하는 경우에는 설치 미디어 사본을 준비하십시오.

source: These steps assume you have set up repositories for packages for your operating system as shown in <link linkend="basics-packages">OpenStack Packages</link>.
ko_kr: 이 단계는 <link linkend="basics-packages">OpenStack 패키지</link>와 같이 OS 패키지에 대한 저장소를 설정했다고 가정합니다.

source: This document demonstrates how to install a cluster by using the following types of nodes:
ko_kr: 이 문서는 다음 형태의 노드를 이용해서 클러스터를 설치하는 법을 보여줍니다.

source: Fewer storage nodes can be used initially, but a minimum of five is recommended for a production cluster.
ko_kr: 처음에는 적은 수의 스토리지를 사용할 수 있으나 상용 클러스터에서는 최소 5개를 권장합니다.

source: General installation steps
ko_kr: 일반적인 설치 과정

source: Create a <literal>swift</literal> user that the Object Storage Service can use to authenticate with the Identity Service. Choose a password and specify an email address for the <literal>swift</literal> user. Use the <literal>service</literal> tenant and give the user the <literal>admin</literal> role:
ko_kr: 오브젝트 저장소 서비스가 인증 서비스에 인증할 때 사용할 <literal>swift</literal> 사용자를 만들고 <literal>swift</literal> 사용자의 이메일 주소를 지정하십시오. <literal>service</literal> 테넌트를 사용하고 <literal>admin</literal> 역할을 부여하십시오:

source: Create a service entry for the Object Storage Service:
ko_kr: 오브젝트 스토리지 서비스 항목을 작성하십시오:

source: Specify an API endpoint for the Object Storage Service by using the returned service ID. When you specify an endpoint, you provide URLs for the public API, internal API, and admin API. In this guide, the <literal>controller</literal> host name is used:
ko_kr: 돌려 받은 서비스 ID로 오브젝트 저장소 서비스용 API 엔드 포인트를 지정하십시오. 엔드 포인트를 지정할 때 공용 API, 내부 API, 관리 API에 대한 URL을 제공하십시오. 이 안내서에서는 호스트 이름으로 <literal>controller</literal>를 사용합니다:

source: Create the configuration directory on all nodes:
ko_kr: 모든 노드에 구성 디렉터리를 만드십시오:

source: Create <filename>/etc/swift/swift.conf</filename> on all nodes:
ko_kr: 모든 노드에 <filename>/etc/swift/swift.conf</filename> 파일을 만드십시오:

source: The suffix value in <filename>/etc/swift/swift.conf</filename> should be set to some random string of text to be used as a salt when hashing to determine mappings in the ring. This file must be the same on every node in the cluster!
ko_kr: <filename>/etc/swift/swift.conf</filename>의 접미사 값은 해싱 펑션에서 링 매핑을 결정할 때 salt 처럼 사용할 임의의 텍스트 문자열 값으로 설정해야 합니다. 이 파일은 클러스터의 모든 노드에 동일하게 들어가야 합니다.

source: Next, set up your storage nodes and proxy node. This example uses the Identity Service for the common authentication piece.
ko_kr: 다음, 저장소 노드와 프록시 노드를 설정하십시오. 이 예제는 일반 인증 단편에 인증 서비스를 사용합니다.

source: Start services on the storage nodes
ko_kr: 저장소 노드에서 서비스 시작

source: Now that the ring files are on each storage node, you can start the services. On each storage node, run the following command:
ko_kr: 이제 링 파일을 각각의 저장소 노드에 놓았으므로 서비스를 시작할 수 있습니다. 각각의 저장소 노드에서 다음 명령을 실행하십시오:

source: To start all swift services at once, run the command:
ko_kr: 스위프트 서비스를 한번에 시작하려면 다음 명령을 실행하십시오:

source: To know more about <literal>swift-init</literal> command, run:
ko_kr: <literal>swift-init</literal> 명령에 대해 더 알아보려면 다음 명령을 실행하십시오:

source: Install and configure storage nodes
ko_kr: 저장소 노드 설치 및 구성

source: Install storage node packages:
ko_kr: 스토리지 노드 패키지 설치:

source: For each device on the node that you want to use for storage, set up the XFS volume (<literal>/dev/sdb</literal> is used as an example). Use a single partition per drive. For example, in a server with 12 disks you may use one or two disks for the operating system which should not be touched in this step. The other 10 or 11 disks should be partitioned with a single partition, then formatted in XFS.
ko_kr: 노드에서 저장소로 사용할 각각의 장치에 대해, XFS 볼륨을 설정하십시오(<literal>/dev/sdb</literal>를 예로 사용합니다). 드라이브당 단일 파티션을 사용하십시오. 예를 들어, 12개의 디스크를 탑재한 서버에서 하나 혹은 두 개의 디스크를 이 과정에서 건드려서는 안될 운영체제용으로 사용합니다. 나머지 10개 또는 11개의 디스크는 단일 파티션으로 나누어야 하며, 그 다음 XFS로 포맷합니다.

source: Create <filename>/etc/rsyncd.conf</filename>:
ko_kr: <filename>/etc/rsyncd.conf</filename> 파일을 만드십시오:

source: Replace the content of <filename>/etc/rsyncd.conf</filename> with:
ko_kr: <filename>/etc/rsyncd.conf</filename> 파일의 내용을 다음으로 바꾸십시오:

source: (Optional) If you want to separate rsync and replication traffic to replication network, set <literal>STORAGE_REPLICATION_NET_IP</literal> instead of <literal>STORAGE_LOCAL_NET_IP</literal>:
ko_kr: (선택 사항) rsync와 복제 트래픽을 복제 네트워크로 분할하고 싶다면, <literal>STORAGE_LOCAL_NET_IP</literal>대신 <literal>STORAGE_REPLICATION_NET_IP</literal>로 설정하십시오:

source: Edit the following line in <filename>/etc/default/rsync</filename>:
ko_kr: <filename>/etc/default/rsync</filename>을 다음과 같이 편집하십시오:

source: Edit the following line in <filename>/etc/xinetd.d/rsync</filename>:
ko_kr: <filename>/etc/xinetd.d/rsync</filename> 파일의 다음 줄을 편집하십시오:

source: Start the <systemitem class="service">xinetd</systemitem> service:
ko_kr: <systemitem class="service">xinetd</systemitem> 서비스를 시작하십시오:

source: The rsync service requires no authentication, so run it on a local, private network.
ko_kr: rsync 서비스는 인증이 필요하지 않으므로, 로컬 비공개 네트워크에서 실행하십시오.

source: Create the swift recon cache directory and set its permissions:
ko_kr: 스위프트 리콘 캐시 디렉터리를 만들고 퍼미션을 지정하십시오:

source: System requirements for Object Storage
ko_kr: 오브젝트 스토리지에 대한 시스템 요구사항

source: <emphasis role="bold">Hardware</emphasis>: OpenStack Object Storage is designed to run on commodity hardware.
ko_kr: <emphasis role="bold">하드웨어</emphasis>: 오픈스택 오브젝트 저장소는 상용 하드웨어에서 실행하도록 설계했습니다.

source: When you install only the Object Storage and Identity Service, you cannot use the dashboard unless you also install Compute and the Image Service.
ko_kr: 오픈스택 저장소와 인증 서비스만을 설치할 경우 처리 서비스와 이미지 서비스를 설치하기 전까지는 대시보드를 사용할 수 없습니다.

source: Hardware recommendations
ko_kr: 추천 하드웨어

source: Server
ko_kr: 서버

source: Recommended Hardware
ko_kr: 추천 하드웨어

source: Object Storage object servers
ko_kr: 오브젝트 스토리지 오브젝트 서버

source: Processor: dual quad core
ko_kr: 프로세서: 듀얼, 쿼드 코어

source: Memory: 8 or 12GB RAM
ko_kr: 메모리: 8 또는 12GB RAM

source: Disk space: optimized for cost per GB
ko_kr: 디스크 공간: GB당 비용에 맞도록 최적화

source: Network: one 1GB Network Interface Card (NIC)
ko_kr: 네트워크: 1GB 네트워크 인터페이스 카드 (NIC) x 1

source: The amount of disk space depends on how much you can fit into the rack efficiently. You want to optimize these for best cost per GB while still getting industry-standard failure rates. At Rackspace, our storage servers are currently running fairly generic 4U servers with 24 2T SATA drives and 8 cores of processing power. RAID on the storage drives is not required and not recommended. Swift's disk usage pattern is the worst case possible for RAID, and performance degrades very quickly using RAID 5 or 6.
ko_kr: 디스크 용량의 크기는 당신이 얼마나 효율적으로 랙에 맞출수 있는지에 따라 달라집니다. 그리고 당신은 업계 수준의 실패율을 얻으면서 가장 좋은 가격으로 디스크 용량을 최적화하기를 원합니다. Rackspace에서는 스토리지 서버가 4U서버를 현재 적절하게 구동하고 있습니다. 서버의 사양은 일반적인 서버이고, 24개의 2T SATA 드라이버가 장착되었으며, 프로세싱 파워가 8코어로 구성되어있습니다. 스토리지 드라이버에서 RAID가 요구되지 않으며, 권고되지도 않습니다. Swift의 디스크 사용 패턴중 RAID를 사용하였을때가 가장 최악의 경우였습니다. RAID 5나 6을 사용하였을때는 성능이 매우 빠르게 떨어졌습니다.

source: As an example, Rackspace runs Cloud Files storage servers with 24 2T SATA drives and 8 cores of processing power. Most services support either a worker or concurrency value in the settings. This allows the services to make effective use of the cores available.
ko_kr: 한 예로, Rackspace에서는 클라우드 파일스토리지 서버를 구동하고 있으며, 사양은 24개 2T SATA 드라이버와 프로세싱 파워가 8코어로 구성되어 있습니다. 대부분의 서비스는 설정에서 worker이든 동일한 값이든 어느 한쪽을 지원합니다. 이를 통해서 서비스가 코어 사용성을 더욱 효과적으로 사용할 수 있도록 해줍니다.

source: Object Storage container/account servers
ko_kr: 오브젝트 저장소 컨테이너/계정 서버

source: Optimized for IOPS due to tracking with SQLite databases.
ko_kr: SQLite 데이터베이스와 트레킹을 위한 IOPS에 최적화되었습니다.

source: Object Storage proxy server
ko_kr: 오브젝트 저장소 프록시 서버

source: Network: one 1 GB Network Interface Card (NIC)
ko_kr: 네트워크: 1기가비트 네트워크 인터페이스 카드(NIC) 하나

source: Higher network throughput offers better performance for supporting many API requests.
ko_kr: 높은 네트워크 처리량은 많은 API 요청을 지원함에 있어 더 좋은 성능을 보여줍니다.

source: Optimize your proxy servers for best CPU performance. The Proxy Services are more CPU and network I/O intensive. If you are using 10 GB networking to the proxy, or are terminating SSL traffic at the proxy, greater CPU power is required.
ko_kr: 최상의 CPU 성능을 발휘하려면 프록시 서버를 최적화하십시오. 프록시 서비스는 더 많은 CPU와 네트워크 I/O 집중이 걸립니다. 10기가비트 네트워크를 프록시에 사용하거나 프록시에서 SSL 트래픽을 처리한다면 더 높은 CPU 성능이 필요합니다.

source: <emphasis role="bold">Operating system</emphasis>: OpenStack Object Storage currently runs on Ubuntu, RHEL, CentOS, Fedora, openSUSE, or SLES.
ko_kr: <emphasis role="bold">운영체제</emphasis>: 오픈스택 오브젝트 저장소는 현재 우분투, RHEL, 센트OS, 페도라, 오픈수세, SLES에서 동작합니다.

source: <emphasis role="bold">Networking</emphasis>: 1 Gbps or 10 Gbps is suggested internally. For OpenStack Object Storage, an external network should connect the outside world to the proxy servers, and the storage network is intended to be isolated on a private network or multiple private networks.
ko_kr: <emphasis role="bold">네트워킹</emphasis>: 내부적으로 1 Gbps 또는 10 Gbps의 속도를 권장합니다. 오픈스택 오브젝트 저장소에서 외부 네트워크는 프록시 서버를 통해 외부 영역으로 연결해야 하며, 저장소 네트워크는 비공개 네트워크 또는 다중 비공개 네트워크로의 범위 제한을 목표로 합니다.

source: <emphasis role="bold">Database</emphasis>: For OpenStack Object Storage, a SQLite database is part of the OpenStack Object Storage container and account management process.
ko_kr: <emphasis role="bold">데이터베이스</emphasis>: OpenStack 오브젝트 스토리지에서 SQLite 데이터베이스는 OpenStack 오브젝트 저장소 컨테이너와 계정 관리 프로세스의 일부입니다.

source: <emphasis role="bold">Permissions</emphasis>: You can install OpenStack Object Storage either as root or as a user with sudo permissions if you configure the sudoers file to enable all the permissions.
ko_kr: <emphasis role="bold">권한</emphasis>: OpenStack 오브젝트 스토리지를 root 이거나 sudoers 파일에서 모든 권한이 가능하도록 설정한 sudo 사용자든 둘중 하나를 이용하여 설치할 수 있습니다.
