Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: Replace <replaceable>NOVA_PASS</replaceable> with the password you chose for the <literal>nova</literal> user in the Identity service.
pt_br: Substitua <replaceable>NOVA_PASS</replaceable> com a senha que você escolheu para o usuário <literal>nova</literal> no serviço de Identidade.

source: In the <literal>[DEFAULT]</literal> section, configure the VNC proxy to use the management interface IP address of the controller node:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure o proxy VNC para utilizar o endereço IP da interface de gerenciamento do nodo controlador:

source: In the <literal>[glance]</literal> section, configure the location of the Image Service:
pt_br: Na seção <literal>[glance]</literal>, configure a localização do Serviço de Imagem:

source: Populate the Compute database:
pt_br: Popule a base de dados da Computação:

source: To install and configure the Compute controller components
pt_br: Para instalar e configurar os componentes do controlador de Computação

source: Restart the Compute services:
ko_kr: Compute 서비스를 재시작합니다:
pt_br: Reinicie o serviços de Computação:

source: Start the Compute services and configure them to start when the system boots:
pt_br: Inicie os serviços de Computação e configure-os para iniciar quando o sistema inicializar:

source: System requirements
ko_kr: 시스템 요구사항
pt_br: Requisitos de sistema

source: Before you install the OpenStack dashboard, you must meet the following system requirements:
ko_kr: OpenStack 대시보드를 설치하기 전, 다음 시스템 요구사항을 만족해야 합니다:
pt_br: Antes de instalar o OpenStack dashboard, você deve satisfazer os seguintes requisitos de sistema:

source: OpenStack Compute installation. Enable the Identity Service for user and project management.
ko_kr: OpenStack Compute 설치합니다. 사용자와 프로젝트 관리자에 대한 Identity 서비스를 활성화하십시오.
pt_br: Instalação do OpenStack Compute. Habilite o serviço de Identidade para gerenciamento de usuário e projeto.

source: Note the URLs of the Identity Service and Compute endpoints.
ko_kr: Identity 서비스와 Compute 엔드 포인트의 URL을 어디에든 적어두십시오.
pt_br: Note as URLs do Serviço de Identidade e endpoints de Computação.

source: Identity Service user with sudo privileges. Because Apache does not serve content from a root user, users must run the dashboard as an Identity Service user with sudo privileges.
ko_kr: Sudo 권한을 가진 Identity 서비스 사용자를 사용하십시오. 아파치 웹 서버는 root 사용자의 컨텐츠를 전달하지 못하기 때문에 사용자들은 반드시 sudo 권한을 가진 Identity 서비스 사용자로 대시보드를 실행해야 합니다.
pt_br: Usuário do serviço de identidade com privilégios sudo. Como o Apache não serve o conteúdo via usuário root, os usuários devem executar o dashboard como um usuário do serviço de identidade com privilégios sudo.

source: Python 2.7. The Python version must support Django. The Python version should run on any system, including Mac OS X. Installation prerequisites might differ by platform.
pt_br: Python 2.7. A versão do Python deve suportar Django. A versão do Python deve rodar em qualquer sistema, incluindo Mac OS X. Os requisitos de instalação podem variar por plataforma.

source: Then, install and configure the dashboard on a node that can contact the Identity Service.
ko_kr: 그 다음, Identity 서비스에 접속할 수 있는 노드에 대시보드를 설치하고 설정하십시오.
pt_br: Então, instale e configure a dashboard em um nodo que pode contactar o Identity Service.

source: Provide users with the following information so that they can access the dashboard through a web browser on their local machine:
ko_kr: 로컬 컴퓨터의 웹 브라우저를 통해 대시보드에 접근하여 다음과 같은 정보를 사용자에게 제공합니다:
pt_br: Fornece aos usuários as seguintes informações para que eles possam acessar o dashboard por meio de um browser em sua máquina local:

source: The public IP address from which they can access the dashboard
ko_kr: 대쉬보드에 접근할 수 있는 공인 IP 주소
pt_br: O endereço IP público a partir do qual eles podem acessar o dashboard.

source: The user name and password with which they can access the dashboard
ko_kr: 대시보드에 접근할 수 있는 사용자 이름과 암호
pt_br: O usuário e a senha com os quais eles podem acessar o dashboard

source: Your web browser, and that of your users, must support HTML5 and have cookies and JavaScript enabled.
ko_kr: 당신과 사용자의 웹브라우저에 HTML5를 지원하고 쿠키와 JavaScript가 활성화되어 있어야합니다.
pt_br: O seu navegador e os de seus usuarios devem suportar HTML5 e ter cookies e o JavaScript habilitados

source: To use the VNC client with the dashboard, the browser must support HTML5 Canvas and HTML5 WebSockets.
ko_kr: 대시보드에서 VNC 클라이언트를 사용하려면, HTML5 Cnavas와 HTML5 WebSocket을 브라우저에서 지원해야합니다.
pt_br: Para usar o cliente VNC com o dashboard, o browser deve suportar HTML5 Canvas e HTML5 WebSockets.

source: For details about browsers that support noVNC, see <link href="https://github.com/kanaka/noVNC/blob/master/README.md">https://github.com/kanaka/noVNC/blob/master/README.md</link>, and <link href="https://github.com/kanaka/noVNC/wiki/Browser-support">https://github.com/kanaka/noVNC/wiki/Browser-support</link>, respectively.
ko_kr: noVNC를 지원하는 브라우저 정보는 <link href="https://github.com/kanaka/noVNC/blob/master/README.md">https://github.com/kanaka/noVNC/blob/master/README.md</link>와 <link href="https://github.com/kanaka/noVNC/wiki/Browser-support">https://github.com/kanaka/noVNC/wiki/Browser-support</link>를 각각 참고하십시오.
pt_br: Para detalhes sobre os navegadores que que suportam noVNC, acesse <link href="https://github.com/kanaka/noVNC/blob/master/README.md">https://github.com/kanaka/noVNC/blob/master/README.md</link> e <link href="https://github.com/kanaka/noVNC/wiki/Browser-support">https://github.com/kanaka/noVNC/wiki/Browser-support</link>, respectivamente.

source: Launch an instance with legacy networking (nova-network)
ko_kr: 레거시 네트워킹 (nova-network)에서 인스턴스 시작
pt_br: Lance uma instância com rede legada (nova-network)

source: To generate a key pair
pt_br: Para gerar um par de chaves

source: Most cloud images support <glossterm>public key authentication</glossterm> rather than conventional user name/password authentication. Before launching an instance, you must generate a public/private key pair using <placeholder-1/> and add the public key to your OpenStack environment.
pt_br: A maioria da imagens de nuvem suportam <glossterm>autenticação de chave pública</glossterm> em vez de autenticação por usuário/senha. Antes de lançar uma instância, você deve gerar um par de chaves pública/privada utilizando <placeholder-1/> e adicionar a chave pública no seu ambiente OpenStack.

source: Generate a key pair:
pt_br: Gere um par de chaves:

source: Add the public key to your OpenStack environment:
pt_br: Adicione a chave pública ao seu ambiente OpenStack:

source: Verify addition of the public key:
ko_kr: 공개 키가 등록되었는지 확인:
pt_br: Verifique a adição da chave pública:

source: To launch an instance
ko_kr: 인스턴스 실행
pt_br: Para lançar uma instância

source: To launch an instance, you must at least specify the flavor, image name, network, security group, key, and instance name.
pt_br: Para lançar uma instância, você deve ao menos especificar o sabor, nome da imagem, grupo de segurança, chave, e o nome da instância.

source: A flavor specifies a virtual resource allocation profile which includes processor, memory, and storage.
pt_br: Um sabor especifica um perfil de alocação de recurso virtual que inclui processador, memória, e armazenamento.

source: List available flavors:
ko_kr: 사용 가능한 flavor 목록:
pt_br: Listar sabores disponíveis:

source: Your first instance uses the <literal>m1.tiny</literal> flavor.
pt_br: Sua primeira instância utiliza o sabor <literal>m1.tiny</literal>.

source: You can also reference a flavor by ID.
pt_br: Você também pode referenciar um sabor pelo ID.

source: List available images:
ko_kr: 사용가능한 이미지 목록:
pt_br: Listar imagens disponíveis:

source: Your first instance uses the <literal>cirros-0.3.3-x86_64</literal> image.
pt_br: Sua primeira instância utiliza a imagem <literal>cirros-0.3.3-x86_64</literal>.

source: List available networks:
ko_kr: 사용 가능한 네트워크 목록:
pt_br: Listar redes disponíveis:

source: You must source the <literal>admin</literal> tenant credentials for this step and then source the <literal>demo</literal> tenant credentials for the remaining steps.
pt_br: Você deve obter as credenciais do tenant <literal>admin</literal> para este passo e então, obter as credenciais do tenant <literal>demo</literal> para os passos restantes.

source: Your first instance uses the <literal>demo-net</literal> tenant network. However, you must reference this network using the ID instead of the name.
pt_br: Sua primeira instância utiliza a rede tenant <literal>demo-net</literal>. Contudo, você deve referenciar esta rede utilizando o ID em vez do nome.

source: List available security groups:
pt_br: Listar grupos de segurança disponíveis:

source: Your first instance uses the <literal>default</literal> security group. By default, this security group implements a firewall that blocks remote access to instances. If you would like to permit remote access to your instance, launch it and then <link linkend="launch-instance-nova-remoteaccess"> configure remote access</link>.
pt_br: Sua primeira instância utiliza o grupo de segurança <literal>default</literal>. Por padrão, este grupo de segurança implementa um firewall que bloqueia o acesso remoto às instâncias. Se você gostaria de permitir acesso remoto à sua instância, lance-a e então <link linkend="launch-instance-nova-remoteaccess"> configure o acesso remoto</link>.

source: Launch the instance:
ko_kr: 인스턴스를 실행하십시오:
pt_br: Lançar uma instância:

source: Replace <replaceable>DEMO_NET_ID</replaceable> with the ID of the <literal>demo-net</literal> tenant network.
pt_br: Substitua <replaceable>DEMO_NET_ID</replaceable> com o ID na rede tenant <literal>demo-net</literal>.

source: Check the status of your instance:
pt_br: Verifique o estado de sua instância:

source: The status changes from <literal>BUILD</literal> to <literal>ACTIVE</literal> when your instance finishes the build process.
pt_br: O estado muda de <literal>BUILD</literal> para <literal>ACTIVE</literal> quando sua instância termina o processo de construção.

source: To access your instance using a virtual console
pt_br: Para acessar sua instância utilizando um console virtual

source: Obtain a <glossterm>Virtual Network Computing (VNC)</glossterm> session URL for your instance and access it from a web browser:
pt_br: Obtenha uma URL de sessão <glossterm>Virtual Network Computing (VNC)</glossterm> para sua instância e acesse-a a partir de um navegador web:

source: If your web browser runs on a host that cannot resolve the <replaceable>controller</replaceable> host name, you can replace <replaceable>controller</replaceable> with the IP address of the management interface on your controller node.
pt_br: Se seu navegador web roda em um host que não pode resolver o nome de host do <replaceable>controlador</replaceable> , você pode substituir o <replaceable>controlador</replaceable> com o endereço IP da interface de gerenciamento no seu nodo controlador.

source: The CirrOS image includes conventional user name/password authentication and provides these credentials at the login prompt. After logging into CirrOS, we recommend that you verify network connectivity using <placeholder-1/>.
pt_br: A imagem CirrOS inclui autenticação convencional de usuário/senha e fornece estas credenciais no prompt de login. Depois de fazer login na CirrOS, recomendamos que você verifique a conectividade de rede utilizando <placeholder-1/>.

source: Verify the <literal>demo-net</literal> network:
ko_kr: <literal>demo-net</literal> 네트워크 확인:
pt_br: Verifique a rede <literal>demo-net</literal>:

source: To access your instance remotely
pt_br: Para acessar sua instância remotamente

source: Add rules to the <literal>default</literal> security group:
ko_kr: <literal>default</literal> 시큐리티 그룹에 룰 추가:
pt_br: Adicione regras ao grupo de segurança <literal>default</literal>:

source: Permit <glossterm>ICMP</glossterm> (ping):
ko_kr: <glossterm>ICMP</glossterm> (ping) 허가:
pt_br: Permita <glossterm>ICMP</glossterm> (ping):

source: Permit secure shell (SSH) access:
ko_kr: 시큐리티 쉘 (SSH) 접근 허가:
pt_br: Permita acesso ao shell seguro (SSH):

source: Verify network connectivity using <placeholder-1/> from the controller node or any host on the external network:
pt_br: Verifique a conectividade de rede utilizando <placeholder-1/> a partir do nodo controlador ou qualquer host na rede externa:

source: Access your instance using SSH from the controller node or any host on the external network:
pt_br: Acesse sua instância utilizando SSH a partir do nodo controlador ou qualquer host na rede externa:

source: If your host does not contain the public/private key pair created in an earlier step, SSH prompts for the default password associated with the <literal>cirros</literal> user.
pt_br: Se seu host não contém o par de chave pública/privada criado no passo anterior, o SSH irá solicitar a senha padrão associada com o usuário <literal>cirros</literal>.

source: To attach a Block Storage volume to your instance
pt_br: Para conectar um volume do Block Storage à sua instância

source: If your environment includes the Block Storage service, you can attach a volume to the instance.
pt_br: Se seu ambiente inclui o serviço Block Storage, você pode conectar um volume à instância.

source: List volumes:
pt_br: Listar volumes:

source: Attach the <literal>demo-volume1</literal> volume to the <literal>demo-instance1</literal> instance:
pt_br: Conectar o volume <literal>demo-volume1</literal> à instância <literal>demo-instance1</literal>:

source: You must reference volumes using the IDs instead of names.
pt_br: Você deve referenciar volumes utilizando os IDs em vez de nomes.

source: The <literal>demo-volume1</literal> volume status should indicate <literal>in-use</literal> by the ID of the <literal>demo-instance1</literal> instance.
pt_br: O estado do volume <literal>demo-volume1</literal> deve indicar <literal>in-use</literal> pelo ID da instância <literal>demo-instance1</literal>.

source: Access your instance using SSH from the controller node or any host on the external network and use the <placeholder-1/> command to verify presence of the volume as the <literal>/dev/vdb</literal> block storage device:
pt_br: Acesse sua instância utilizando SSH a partir do nodo controlador ou qualquer host na rede externa e utilize o comando <placeholder-1/> para verificar a presença do volume como um dispositivo de armazenamento de blocos <literal>/dev/vdb</literal>:

source: You must create a partition table and file system to use the volume.
pt_br: Você deve criar uma tabela de partição e um sistema de arquivos para utilizar o volume.

source: If your instance does not launch or seem to work as you expect, see the <link href="http://docs.openstack.org/ops"><citetitle>OpenStack Operations Guide</citetitle></link> for more information or use one of the <link linkend="app_community_support">many other options</link> to seek assistance. We want your environment to work!
pt_br: Se sua instância não inicia ou parece não funcionar como esperado, consulte <link href="http://docs.openstack.org/ops"><citetitle>OpenStack Operations Guide</citetitle></link> para mais informações ou utilize um das <link linkend="app_community_support">muitas outras opções</link> para buscar assistência. Queremos que seu ambiente funcione!

source: Add the Database service
ko_kr: 데이터베이스 서비스 추가
pt_br: Adicionar o serviço de Banco de Dados

source: Use the <glossterm baseform="Database Service">Database module</glossterm> to create cloud database resources. The integrated project name is <glossterm>trove</glossterm>.
pt_br: Utilize o <glossterm baseform="Database Service">módulo de Banco de Dados</glossterm> para criar recursos de bases de dados na nuvem. O nome do projeto integrado é <glossterm>trove</glossterm>.

source: This chapter is a work in progress. It may contain incorrect information, and will be updated frequently.
pt_br: Este capítulo é um trabalho em progresso. Ele pode conter informações incorretas, e será atualizado frequentemente.

source: Configure compute node
ko_kr: Compute 노드 구성
pt_br: Configure o nodo de Computação

source: This section covers deployment of a simple <glossterm>flat network</glossterm> that provides IP addresses to your instances via <glossterm>DHCP</glossterm>. If your environment includes multiple compute nodes, the <glossterm>multi-host</glossterm> feature provides redundancy by spreading network functions across compute nodes.
pt_br: Esta seção cobre a implantação de uma simples <glossterm>rede fixa</glossterm> que fornece endereços IP para suas instâncias via <glossterm>DHCP</glossterm>. Se seu ambiente inclui múltiplos nodos de Computação, a característica de <glossterm>multi-host</glossterm> fornece redundância distribuindo funções de rede pelos nodos de Computação.

source: To install legacy networking components
pt_br: Para instalar componentes de rede legados

source: To configure legacy networking
ko_kr: 레거시 네트워킹을 구성하려면
pt_br: Para configurar a rede legada

source: In the <literal>[DEFAULT]</literal> section, configure the network parameters:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure os parâmetros de rede:

source: Replace <replaceable>INTERFACE_NAME</replaceable> with the actual interface name for the external network. For example, <emphasis>eth1</emphasis> or <emphasis>ens224</emphasis>. You can also leave these two parameters undefined if you are serving multiple networks with individual bridges for each.
pt_br: Substitua <replaceable>INTERFACE_NAME</replaceable> com o nome de interface atual para a rede externa. Por exemplo, <emphasis>eth1</emphasis> ou <emphasis>ens224</emphasis>. Você também pode deixar estes dois parâmetros indefinidos, se você estiver servindo múltiplas redes com bridges individuais para cada uma.

source: Restart the services:
ko_kr: 서비스 재시작:
pt_br: Reinicie os serviços:

source: Start the services and configure them to start when the system boots:
pt_br: Inicie os serviços e configure-os para iniciar quando o sistema inicializar:

source: This section describes how to verify operation of the Compute service.
pt_br: Esta seção descreve como verificar a operação do serviço de Computação.

source: List service components to verify successful launch of each process:
pt_br: Liste os componentes de serviço para verificar o lançamento com sucesso de cada processo:

source: This output should indicate four components enabled on the controller node one component enabled on the compute node.
pt_br: Esta saída deve indicar quatro componentes habilitados no nodo controlador e um componente habilitado no nodo de Computação.

source: List images in the Image Service catalog to verify connectivity with the Identity service and Image Service:
pt_br: Liste imagens no catálogo do Serviço de Imagem para verificar a conectividade com o serviço de Identidade e o serviço de Imagem:

source: This section describes how to install and configure the Image Service, code-named glance, on the controller node. For simplicity, this configuration stores images on the local file system.
pt_br: Esta seção descreve como instalar e configurar o Serviço de Imagem, apelidado de glance, no nodo controlador. Para simplificar, esta configuração armazena imagens no sistema de arquivo local.

source: This section assumes proper installation, configuration, and operation of the Identity service as described in <xref linkend="keystone-install"/> and <xref linkend="keystone-verify"/>.
pt_br: Esta seção assume a instalação, configuração e operação correta do serviço de Identidade como descrito em <xref linkend="keystone-install"/> e <xref linkend="keystone-verify"/>.

source: Before you install and configure the Image Service, you must create a database, service credentials, and API endpoints.
pt_br: Antes de instalar e configurar o Serviço de Imagem, voce deve criar uma base de dados, credenciais de serviço, e endpoints de API.

source: Create the <literal>glance</literal> database:
pt_br: Crie a base dados do <literal>glance</literal>:

source: Grant proper access to the <literal>glance</literal> database:
pt_br: Conceda acessos apropriados à base de dados do <literal>glance</literal>:

source: Replace <replaceable>GLANCE_DBPASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>GLANCE_DBPASS</replaceable> com uma senha adequada.

source: Create the <literal>glance</literal> user:
pt_br: Crie o usuário <literal>glance</literal>:

source: Replace <replaceable>GLANCE_PASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>GLANCE_PASS</replaceable> com uma senha adequada.

source: Add the <literal>admin</literal> role to the <literal>glance</literal> user:
pt_br: Adicione o papel <literal>admin</literal> ao usuário <literal>glance</literal>:

source: Create the <literal>glance</literal> service entity:
pt_br: Crie a entidade de serviço <literal>glance</literal>:

source: Create the Image Service API endpoints:
pt_br: Crie os endpoints de API do Serviço de Imagem:

source: To install and configure the Image Service components
pt_br: Para instalar e configurar os componentes do Serviço de Imagem

source: Edit the <filename>/etc/glance/glance-api.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/glance/glance-api.conf</filename> e complete as seguintes ações:

source: Replace <replaceable>GLANCE_DBPASS</replaceable> with the password you chose for the Image Service database.
pt_br: Substitua <replaceable>GLANCE_DBPASS</replaceable> com a senha que você escolheu para a base de dados do Serviço de Imagem.

source: In the <literal>[keystone_authtoken]</literal> and <literal>[paste_deploy]</literal> sections, configure Identity service access:
pt_br: Nas seções <literal>[keystone_authtoken]</literal> e <literal>[paste_deploy]</literal>, configure o acesso ao serviço de Identidade:

source: Replace <replaceable>GLANCE_PASS</replaceable> with the password you chose for the <literal>glance</literal> user in the Identity service.
pt_br: Substitua <replaceable>GLANCE_PASS</replaceable> com a senha que você escolheu para o usuário <literal>glance</literal> no serviço de Identidade.

source: In the <literal>[glance_store]</literal> section, configure the local file system store and location of image files:
pt_br: Na seção <literal>[glance_store]</literal>, configure o sistema de arquivo local de armazenamento e localização dos arquivos de Imagem:

source: In the <literal>[DEFAULT]</literal> section, configure the <literal>noop</literal> notification driver to disable notifications because they only pertain to the optional Telemetry service:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure o driver de notificação <literal>noop</literal> para desabilitar notificações porque elas só dizem respeito ao serviço de telemetria opcional:

source: The Telemetry chapter provides an Image Service configuration that enables notifications.
pt_br: O capítulo de Telemetria prover uma configuração do Serviço de Imagem que ativam notificações.

source: Edit the <filename>/etc/glance/glance-registry.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/glance/glance-registry.conf</filename> e complete as seguintes ações:

source: Populate the Image Service database:
pt_br: Popule a base de dados do Serviço de Imagem:

source: Select the <literal>keystone</literal> pipeline to configure the Image Service to use the Identity service:
pt_br: Selecione o duto do <literal>keystone</literal> para configurar o Serviço de Imagem para utilizar o serviço de Identidade:

source: Restart the Image Service services:
pt_br: Reinicie os serviços do Serviço de Imagem:
