Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: Create a test template in the <filename>test-stack.yml</filename> file with the following content:
pt_br: Crie um modelo de teste no arquivo <filename>test-stack.yml</filename> com o seguinte conteúdo:

source: Use the <placeholder-1/> command to create a stack from the template:
pt_br: Utilize o comando <placeholder-1/> para criar a pilha através do modelo:

source: Use the <placeholder-1/> command to verify successful creation of the stack:
pt_br: Utilize o comando <placeholder-1/> para verificar a criação com sucesso da pilha:

source: Install and configure controller node
pt_br: Instalar e configurar o nodo controlador

source: This section describes how to install and configure the Block Storage service, code-named cinder, on the controller node. This service requires at least one additional storage node that provides volumes to instances.
pt_br: Esta seção descreve como instalar e configurar o serviço de Block Storage, apelidado de cinder, no nodo controlador. Este serviço requer pelo menos um nodo de storage adicional que fornecerá volumes às instâncias.

source: Before you install and configure the Block Storage service, you must create a database, service credentials, and API endpoints.
pt_br: Antes de instalar e configurar o serviço de Block Storage, você deve criar uma base de dados, credenciais de serviço, e endpoints de API.

source: Create the <literal>cinder</literal> database:
pt_br: Crie a base de dados <literal>cinder</literal> :

source: Grant proper access to the <literal>cinder</literal> database:
pt_br: Conceda os acessos adequados à base de dados <literal>cinder</literal>:

source: Replace <replaceable>CINDER_DBPASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>CINDER_DBPASS</replaceable> com uma senha adequada:

source: To create the service credentials, complete these steps:
pt_br: Para criar as credenciais de serviço, complete estes passos:

source: Create a <literal>cinder</literal> user:
pt_br: Crie um usuário <literal>cinder</literal>:

source: Replace <replaceable>CINDER_PASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>CINDER_PASS</replaceable> com uma senha adequada.

source: Add the <literal>admin</literal> role to the <literal>cinder</literal> user:
pt_br: Adicione o papel <literal>admin</literal> ao usuário <literal>cinder</literal>:

source: Create the <literal>cinder</literal> service entities:
pt_br: Crie as entidades de serviço <literal>cinder</literal>:

source: Create the Block Storage service API endpoints:
pt_br: Crie os endpoints de API do serviço Block Storage:

source: To install and configure Block Storage controller components
pt_br: Para instalar e configurar os componentes de controlador do Block Storage

source: Replace <replaceable>RABBIT_PASS</replaceable> with the password you chose for the <literal>guest</literal> account in <application>RabbitMQ</application>.
pt_br: Substitua <replaceable>RABBIT_PASS</replaceable> com a senha que você escolheu para a conta <literal>guest</literal> no <application>RabbitMQ</application>.

source: In the <literal>[DEFAULT]</literal> section, configure the <literal>my_ip</literal> option to use the management interface IP address of the controller node:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure a opção <literal>my_ip</literal> para utilizar o endereço IP da interface de gerenciamento do nodo controlador:

source: Populate the Block Storage database:
pt_br: Popule a base de dados do Block Storage:

source: Respond to the prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken">Identity service credentials</link>, <link linkend="debconf-api-endpoints">service endpoint registration</link>, and <link linkend="debconf-rabbitmq">message broker credentials</link>.
pt_br: Responda às questões para <link linkend="debconf-dbconfig-common">gerenciamento de banco de dados</link>, <link linkend="debconf-keystone_authtoken">credenciais do Serviço de Identidade</link>, <link linkend="debconf-api-endpoints">registro de endpoints de serviço</link>, e <link linkend="debconf-rabbitmq"> credenciais do intermediador de mensagens</link>.

source: Restart the Block Storage services:
pt_br: Reinicie os serviços de Block Storage:

source: Start the Block Storage services and configure them to start when the system boots:
pt_br: Inicie os serviços de Block Storage e configure-os para iniciar quando o sistema inicializar:

source: By default, the Ubuntu packages create an SQLite database.
pt_br: Por padrão, os pacotes do Ubuntu criam uma base de dados SQLite.

source: Add the Orchestration module
pt_br: Adicionar o módulo de Orquestração

source: The Orchestration module (heat) uses a heat orchestration template (HOT) to create and manage cloud resources.
pt_br: O módulo de Orquestração (heat) utiliza o modelo heat orchestration (HOT) para criar e gerenciar recursos de nuvem.

source: Your OpenStack environment now includes Orchestration. You can <link linkend="launch-instance">launch an instance</link> or add more services to your environment in the following chapters.
pt_br: Seu ambiente OpenStack agora inclui Orquestração. Você pode <link linkend="launch-instance">lançar uma instância</link> ou adicionar mais serviços ao seu ambiente nos capítulos seguintes.

source: You must install <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm> to properly synchronize services among nodes. We recommend that you configure the controller node to reference more accurate (lower stratum) servers and other nodes to reference the controller node.
pt_br: Você deve instalar o <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm> para sincronizar adequadamente os serviços entre os nodos. recomendamos que você configure o nodo controlador para referenciar os servidores mais precisos (lower stratum) e os outros nodos para referenciarem o nodo controlador.

source: To install the NTP service
pt_br: Para instalar o serviço NTP

source: To configure the NTP service
pt_br: Para configurar o serviço NTP

source: By default, the controller node synchronizes the time via a pool of public servers. However, you can optionally edit the <filename>/etc/ntp.conf</filename> file to configure alternative servers such as those provided by your organization.
pt_br: Por padrão o nodo controlador sincroniza o tempo através de um conjunto de servidores públicos. Contudo, você pode opcionalmente editar o arquivo <filename>/etc/ntp.conf</filename> para configurar servidores alternativos tais como aqueles fornecidos por sua organização.

source: Edit the <filename>/etc/ntp.conf</filename> file and add, change, or remove the following keys as necessary for your environment:
pt_br: Edite o arquivo <filename>/etc/ntp.conf</filename> e adicione, altere ou remova as seguintes chaves conforme necessário para seu ambiente:

source: Replace <replaceable>NTP_SERVER</replaceable> with the hostname or IP address of a suitable more accurate (lower stratum) NTP server. The configuration supports multiple <literal>server</literal> keys.
pt_br: Substitua <replaceable>NTP_SERVER</replaceable> com um hostname ou um endereço IP de um servidor NTP apropriado mais preciso (lower stratum). A configuração suporta múltiplas chaves <literal>server</literal>.

source: For the <literal>restrict</literal> keys, you essentially remove the <literal>nopeer</literal> and <literal>noquery</literal> options.
pt_br: Para as chaves <literal>restrict</literal> , você essencialmente remove as opções <literal>nopeer</literal> e <literal>noquery</literal>.

source: Remove the <filename>/var/lib/ntp/ntp.conf.dhcp</filename> file if it exists.
pt_br: Remova o arquivo <filename>/var/lib/ntp/ntp.conf.dhcp</filename> se ele existir.

source: Restart the NTP service:
pt_br: Reinicie o serviço NTP:

source: Start the NTP service and configure it to start when the system boots:
pt_br: Inicie o serviço NTP e configure-o para iniciar quando o sistema inicializar:

source: Other nodes
pt_br: Outros nodos

source: Configure the network and compute nodes to reference the controller node.
pt_br: Configure os nodos de computação e de rede para referenciar o nodo controlador.

source: Edit the <filename>/etc/ntp.conf</filename> file:
pt_br: Edite o arquivo <filename>/etc/ntp.conf</filename>:

source: Comment out or remove all but one <literal>server</literal> key and change it to reference the controller node.
pt_br: Comente ou remova todas as chaves exceto a chave <literal>server</literal> e altere-a para referenciar o nodo controlador.

source: We recommend that you verify NTP synchronization before proceeding further. Some nodes, particularly those that reference the controller node, can take several minutes to synchronize.
pt_br: Recomendamos que você verifique a sincronização NTP antes de prosseguir. Alguns nodos, particularmente aqueles que referenciam o nodo controlador, podem levar vários minutos para sincronizar.

source: Run this command on the <emphasis>controller</emphasis> node:
pt_br: Execute esse comando no nodo <emphasis>controlador</emphasis>:

source: Contents in the <emphasis>remote</emphasis> column should indicate the hostname or IP address of one or more NTP servers.
pt_br: O conteúdo na coluna <emphasis>remote</emphasis> deve indicar o hostname ou o endereço IP de um ou mais servidores NTP.

source: Contents in the <emphasis>refid</emphasis> column typically reference IP addresses of upstream servers.
pt_br: O conteúdo na coluna <emphasis>refid</emphasis> tipicamente referencia endereços IP de servidores upstream.

source: Contents in the <emphasis>condition</emphasis> column should indicate <literal>sys.peer</literal> for at least one server.
pt_br: O conteúdo na coluna <emphasis>condition</emphasis> deve indicar o <literal>sys.peer</literal> para pelo menos um servidor.

source: Run this command on <emphasis>all other</emphasis> nodes:
pt_br: Execute esse comando em <emphasis>todos os outros</emphasis> nodos:

source: Contents in the <emphasis>remote</emphasis> column should indicate the hostname of the controller node.
pt_br: O conteúdo na coluna <emphasis>remote</emphasis> deve indicar o hostname do nodo controlador.

source: Contents in the <emphasis>condition</emphasis> column should indicate <literal>sys.peer</literal>.
pt_br: O conteúdo na coluna <emphasis>condition</emphasis> deve indicar o <literal>sys.peer</literal>.

source: Create initial networks
ko_kr: 초기 네트워크 구성
pt_br: Crie as redes iniciais

source: Before launching your first instance, you must create the necessary virtual network infrastructure to which the instance will connect, including the <link linkend="neutron_initial-external-network">external network</link> and <link linkend="neutron_initial-tenant-network">tenant network</link>. See <xref linkend="neutron_figure-neutron-initial-networks"/>. After creating this infrastructure, we recommend that you <link linkend="neutron_initial-networks-verify">verify connectivity</link> and resolve any issues before proceeding further. <xref linkend="neutron_figure-neutron-initial-networks"/> provides a basic architectural overview of the components that Networking implements for the initial networks and shows how network traffic flows from the instance to the external network or Internet.
pt_br: Antes de lançar sua primeira instância, você deve criar a estrutura de rede virtual necessária na qual a instância irá se conectar, incluindo a <link linkend="neutron_initial-external-network">rede externa</link> e a <link linkend="neutron_initial-tenant-network">rede de tenant</link>. Consulte <xref linkend="neutron_figure-neutron-initial-networks"/>. Após criar esta infraestrutura, recomendamos que você <link linkend="neutron_initial-networks-verify">verifique a conectividade</link> e resolva quaisquer problemas antes de prosseguir. <xref linkend="neutron_figure-neutron-initial-networks"/> fornece uma visão geral da arquitetura básica dos componentes que a Rede implementa para as redes iniciais e mostra como o tráfego de rede flui da instância para a rede externa ou a Internet.

source: Initial networks
ko_kr: 초기 네트워크
pt_br: Redes iniciais

source: External network
ko_kr: 외부 네트워크
pt_br: Rede externa

source: The external network typically provides Internet access for your instances. By default, this network only allows Internet access <emphasis>from</emphasis> instances using <glossterm>Network Address Translation (NAT)</glossterm>. You can enable Internet access <emphasis>to</emphasis> individual instances using a <glossterm>floating IP address</glossterm> and suitable <glossterm>security group</glossterm> rules. The <literal>admin</literal> tenant owns this network because it provides external network access for multiple tenants.
pt_br: A rede externa tipicamente fornece acesso à Internet para suas instâncias. Por padrão, esta rede somente permite acesso à Internet <emphasis>a partir</emphasis> das instâncias utilizando <glossterm>Network Address Translation (NAT)</glossterm>. Você pode habilitar o acesso à Internet <emphasis>para</emphasis> instâncias individuais utilizando um <glossterm>endereço IP flutuante</glossterm> e regras adequadas de <glossterm>grupo de segurança</glossterm>. O tenant <literal>admin</literal> detém esta rede porque ele fornece acesso de rede externa para múltiplos tenants.

source: To create the external network
ko_kr: 외부 네트워크 생성
pt_br: Para criar a rede externa

source: Like a physical network, a virtual network requires a <glossterm>subnet</glossterm> assigned to it. The external network shares the same subnet and <glossterm>gateway</glossterm> associated with the physical network connected to the external interface on the network node. You should specify an exclusive slice of this subnet for <glossterm>router</glossterm> and floating IP addresses to prevent interference with other devices on the external network.
pt_br: Assim como uma rede física, uma rede virtual requer uma <glossterm>subrede</glossterm> atribuída a ela. A rede externa compartilha a mesma subrede e <glossterm>gateway</glossterm> associados com a rede física conectada à interface externa no nodo de rede. Você deve especificar uma faixa exclusiva desta subrede para o <glossterm>roteador</glossterm> e endereços IP flutuantes para evitar interferência com outros dispositivos na rede externa.

source: To create a subnet on the external network
ko_kr: 외부 네트워크에 서브넷 생성
pt_br: Para criar uma subrede na rede externa

source: Create the subnet:
ko_kr: 서브넷 생성:
pt_br: Crie a subrede:

source: Replace <replaceable>FLOATING_IP_START</replaceable> and <replaceable>FLOATING_IP_END</replaceable> with the first and last IP addresses of the range that you want to allocate for floating IP addresses. Replace <replaceable>EXTERNAL_NETWORK_CIDR</replaceable> with the subnet associated with the physical network. Replace <replaceable>EXTERNAL_NETWORK_GATEWAY</replaceable> with the gateway associated with the physical network, typically the ".1" IP address. You should disable <glossterm>DHCP</glossterm> on this subnet because instances do not connect directly to the external network and floating IP addresses require manual assignment.
pt_br: Substitua<replaceable>FLOATING_IP_START</replaceable> e <replaceable>FLOATING_IP_END</replaceable> com o primeiro e o último endereço IP da faixa que você quer alocar para os endereços IP flutuantes. Substitua <replaceable>EXTERNAL_NETWORK_CIDR</replaceable> com a subrede associada com a rede física. Substitua <replaceable>EXTERNAL_NETWORK_GATEWAY</replaceable> com o gateway associado com a rede física, tipicamente o endereço IP ".1" . Você deve desabilitar o <glossterm>DHCP</glossterm> nesta subrede porque as intâncias não se conectam diretamente à rede externa e os IPs flutuantes requerem atribuição manual.

source: For example, using <literal>203.0.113.0/24</literal> with floating IP address range <literal>203.0.113.101</literal> to <literal>203.0.113.200</literal>:
pt_br: Por exemplo, utilizando <literal>203.0.113.0/24</literal> com a faixa de IP flutuante de <literal>203.0.113.101</literal> até <literal>203.0.113.200</literal>:

source: Tenant network
ko_kr: Tenant 네트워크
pt_br: Rede de tenant

source: The tenant network provides internal network access for instances. The architecture isolates this type of network from other tenants. The <literal>demo</literal> tenant owns this network because it only provides network access for instances within it.
pt_br: A rede de tenant fornece acesso de rede interna para instâncias. A arquitetura isola esse tipo de rede dos outros tenants. O tenant <literal>demo</literal> detém essa rede porque ele fornece somente acesso de rede para instâncias dentro dele.

source: To create the tenant network
ko_kr: Tenant 네트워크 생성
pt_br: Para criar a rede de tenant

source: Source the <literal>demo</literal> credentials to gain access to user-only CLI commands:
pt_br: Obtenha as credenciais <literal>demo</literal> para ter acesso aos comandos user-only CLI:

source: Like the external network, your tenant network also requires a subnet attached to it. You can specify any valid subnet because the architecture isolates tenant networks. By default, this subnet will use DHCP so your instances can obtain IP addresses.
pt_br: Assim como a rede externa, sua rede de tenant também requer uma subrede anexada a ela. Você pode especificar qualquer subrede válida porque a arquitetura isola as redes de tenants. Por padrão, esta subrede irá utilizar DHCP para que suas instâncias possam obter endereços IP.

source: To create a subnet on the tenant network
ko_kr: Tenant 네트워크에서 서브넷 생성
pt_br: Para criar uma subrede na rede de tenant

source: Replace <replaceable>TENANT_NETWORK_CIDR</replaceable> with the subnet you want to associate with the tenant network and <replaceable>TENANT_NETWORK_GATEWAY</replaceable> with the gateway you want to associate with it, typically the ".1" IP address.
pt_br: Substitua <replaceable>TENANT_NETWORK_CIDR</replaceable> com a subrede que você quer associar com a rede de tenant e <replaceable>TENANT_NETWORK_GATEWAY</replaceable> com o gateway que você quer associar com ela, tipicamente o endereço IP ".1".

source: Example using <literal>192.168.1.0/24</literal>:
ko_kr: 예제에서는 <literal>192.168.1.0/24</literal>를 사용합니다:
pt_br: Exemplo utilizando <literal>192.168.1.0/24</literal>:

source: A virtual router passes network traffic between two or more virtual networks. Each router requires one or more <glossterm baseform="interface">interfaces</glossterm> and/or gateways that provide access to specific networks. In this case, you will create a router and attach your tenant and external networks to it.
pt_br: Um roteador virtual passa o tráfego de rede entre duas ou mais redes virtuais. Cada roteador requer uma ou mais <glossterm baseform="interface">interfaces</glossterm> e/ou gateway que fornece acesso a redes específicas. Neste caso, você irá criar um roteador e conectar seu tenant e sua rede externa a ele.

source: To create a router on the tenant network and attach the external and tenant networks to it
ko_kr: Tenant 네트워크에 라우터를 생성하고 외부 네트워크와 tenant 네트워크 연결
pt_br: Para criar um roteador na rede de tenant e conectar as redes externa e de tenant a ele

source: Create the router:
ko_kr: 라우터 생성
pt_br: Criar o roteador:

source: Attach the router to the <literal>demo</literal> tenant subnet:
ko_kr: <literal>demo</literal> tenant 서브넷에 라우터를 연결합니다:
pt_br: Conecte o roteador à subrede de tenant <literal>demo</literal>:

source: Attach the router to the external network by setting it as the gateway:
pt_br: Conecte o roteador à rede externa configurando-o como o gateway:

source: We recommend that you verify network connectivity and resolve any issues before proceeding further. Following the external network subnet example using <literal>203.0.113.0/24</literal>, the tenant router gateway should occupy the lowest IP address in the floating IP address range, <literal>203.0.113.101</literal>. If you configured your external physical network and virtual networks correctly, you should be able to <placeholder-1/> this IP address from any host on your external physical network.
pt_br: Recomendamos que você verifique a conectividade de rede e resolva quaisquer problemas antes de prosseguir. Seguindo o exemplo da subrede externa utilizando <literal>203.0.113.0/24</literal>, o roteador de tenant deve ocupar o endereço IP mais baixo na faixa de endereços IP flutuantes, <literal>203.0.113.101</literal>. Se você configurou sua rede física externa e as redes virtuais, você deve ser capaz de <placeholder-1/> este endereço IP de qualquer host em sua rede física externa.

source: If you are building your OpenStack nodes as virtual machines, you must configure the hypervisor to permit promiscuous mode on the external network.
pt_br: Se você está construindo seus nodos OpenStack como máquinas virtuais, você deve configurar o hypervisor para permitir o modo promíscuo na rede externa.

source: To verify network connectivity
ko_kr: 네트워크 connectivity 확인
pt_br: Para verificar a conectividade de rede

source: Ping the tenant router gateway:
ko_kr: tenant 라우터 게이트웨이에 ping을 확인합니다:
pt_br: Ping o roteador gateway do tenant:

source: This section describes how to install and configure the Compute service, code-named nova, on the controller node.
pt_br: Esta seção descreve como instalar e configurar o serviço de Computação, apelidado de nova, no nodo controlador.

source: Before you install and configure the Compute service, you must create a database, service credentials, and API endpoints.
pt_br: Antes de instalar e configurar o serviço de Computação, você deve criar uma base de dados, credenciais de serviço e endpoints de API.

source: Create the <literal>nova</literal> database:
pt_br: Crie a base de dados do <literal>nova</literal>:

source: Grant proper access to the <literal>nova</literal> database:
pt_br: Conceda acesso apropriado à base de dados do <literal>nova</literal>:

source: Replace <replaceable>NOVA_DBPASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>NOVA_DBPASS</replaceable> com uma senha adequada.

source: Create the <literal>nova</literal> user:
pt_br: Crie o usuário <literal>nova</literal>:

source: Replace <replaceable>NOVA_PASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>NOVA_PASS</replaceable> com uma senha adequada.

source: Add the <literal>admin</literal> role to the <literal>nova</literal> user:
pt_br: Adicione o papel <literal>admin</literal> ao usuário <literal>nova</literal>:

source: Create the <literal>nova</literal> service entity:
pt_br: Crie a entidade de serviço <literal>nova</literal>:

source: Create the Compute service API endpoints:
pt_br: Crie os endpoints de API do serviço de Computação:

source: To install and configure Compute controller components
pt_br: Para instalar e configurar os componentes do controlador de Computação

source: Edit the <filename>/etc/nova/nova.conf</filename> file and complete the following actions:
pt_br: Edite o aqruivo <filename>/etc/nova/nova.conf</filename> e complete as seguintes ações:

source: Add a <literal>[database]</literal> section, and configure database access:
pt_br: Adicione uma seção <literal>[database]</literal>, e configure o acesso a banco de dados:

source: Replace <replaceable>NOVA_DBPASS</replaceable> with the password you chose for the Compute database.
pt_br: Substitua <replaceable>NOVA_DBPASS</replaceable> com a senha que você escolheu para a base de dados da Computação.
