Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: For more information about how to download and build images, see <link href="http://docs.openstack.org/image-guide/content/index.html"><citetitle>OpenStack Virtual Machine Image Guide</citetitle></link>. For information about how to manage images, see the <link href="http://docs.openstack.org/user-guide/content/index.html"><citetitle>OpenStack User Guide</citetitle></link>.
ko_kr: 이미지를 다운로드하고 빌드하는 방법에 대한 정보는 <link href="http://docs.openstack.org/image-guide/content/index.html"><citetitle>오픈스택 가상 머신 이미지 안내서</citetitle></link>를 확인하십시오. 이미지를 관리하는 방법에 대해서는 <link href="http://docs.openstack.org/user-guide/content/index.html"><citetitle>오픈스택 사용자 안내서</citetitle></link>를 참조하십시오.
pt_br: Para mais informações sobre como baixar e criar imagens, consulte <link href="http://docs.openstack.org/image-guide/content/index.html"><citetitle>OpenStack Virtual Machine Image Guide</citetitle></link>. Para obter informações sobre como gerenciar imagens, consulte o <link href="http://docs.openstack.org/user-guide/content/index.html"><citetitle>OpenStack User Guide</citetitle></link>.

source: Create and change into a temporary local directory:
pt_br: Crie e altere para um diretório local temporário:

source: Download the image to the temporary local directory:
pt_br: Baixe a imagem para o diretório temporário local:

source: Source the <literal>admin</literal> credentials to gain access to admin-only CLI commands:
pt_br: Execute um source nas credenciais de <literal>admin</literal> para obter acesso aos comandos CLI admin-only.

source: Upload the image to the Image Service:
ko_kr: 이미지 서비스로 이미지를 업로드 하십시오:
pt_br: Envie a imagem para o Serviço de Imagem:

source: For information about the parameters for the <placeholder-1/> command, see <link href="http://docs.openstack.org/cli-reference/content/glanceclient_commands.html#glanceclient_subcommand_image-create">Image Service command-line client</link> in the <citetitle>OpenStack Command-Line Interface Reference</citetitle>.
pt_br: Para informações sobre os parâmetros para o comando <placeholder-1/>, consulte <link href="http://docs.openstack.org/cli-reference/content/glanceclient_commands.html#glanceclient_subcommand_image-create">Image Service command-line client</link> no <citetitle>OpenStack Command-Line Interface Reference</citetitle>.

source: For information about disk and container formats for images, see <link href="http://docs.openstack.org/image-guide/content/image-formats.html">Disk and container formats for images</link> in the <citetitle>OpenStack Virtual Machine Image Guide</citetitle>.
pt_br: Para informações sobre formatos de disco e contêiner para imagens, consulte <link href="http://docs.openstack.org/image-guide/content/image-formats.html">Disk and container formats for images</link> no <citetitle>OpenStack Virtual Machine Image Guide</citetitle>.

source: Because the returned image ID is generated dynamically, your deployment generates a different ID than the one shown in this example.
ko_kr: 반환한 이미지 ID는 자동으로 만들어지므로 이 예제에 보여주는 ID와는 다른 ID가 만들어집니다.
pt_br: Como o ID de imagem retornado é gerado dinamicamente, sua implantação gera um ID diferente daquele mostrado neste exemplo.

source: Confirm upload of the image and validate attributes:
pt_br: Confirme o upload da imagem e valide os atributos:

source: Remove the temporary local directory:
pt_br: Remova o diretório local temporário:

source: Configure OpenStack with debconf
ko_kr: debconf로 오픈스택 구성
pt_br: Configurar o OpenStack com o debconf

source: OpenStack Networking (neutron)
pt_br: Rede OpenStack (neutron)

source: The example architecture with OpenStack Networking (neutron) requires one controller node, one network node, and at least one compute node. The controller node contains one network interface on the <glossterm>management network</glossterm>. The network node contains one network interface on the management network, one on the <glossterm>instance tunnels network</glossterm>, and one on the <glossterm>external network</glossterm>. The compute node contains one network interface on the management network and one on the instance tunnels network.
pt_br: A arquitetura de exemplo com Rede OpenStack (neutron) requer um nodo controlador, um nodo de rede, e pelo menos um nodo de computação. O nodo controlador contém uma interface de rede na <glossterm>rede de gerenciamento</glossterm>. O nodo de rede contém uma interface de rede na rede de gerenciamento, uma na <glossterm>rede de túneis de instância</glossterm>, e uma na <glossterm>rede externa</glossterm>. o nodo de computação contém uma interface de rede na rede de gerenciamento e uma na rede de túneis de instância.

source: The example architecture assumes use of the following networks:
pt_br: A arquitetura de exemplo assume a utilização das seguintes redes:

source: Management on 10.0.0.0/24 with gateway 10.0.0.1
pt_br: Gerenciamento na 10.0.0.0/24 com gateway 10.0.0.1

source: This network requires a gateway to provide Internet access to all nodes for administrative purposes such as package installation, security updates, <glossterm>DNS</glossterm>, and <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>.
pt_br: Esta rede requer um gateway para fornecer acesso à Internet para todos os nodos, para propósitos administrativos, tais como instalação de pacotes, atualizações de segurança, <glossterm>DNS</glossterm>, e <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>.

source: Instance tunnels on 10.0.1.0/24 without a gateway
pt_br: Túneis de instância na 10.0.1.0/24 sem um gateway

source: This network does not require a gateway because communication only occurs among network and compute nodes in your OpenStack environment.
pt_br: Esta rede não requer um gateway porque a comunicação ocorre somente entre os nodos de Rede e Computação em seu ambiente OpenStack.

source: External on 203.0.113.0/24 with gateway 203.0.113.1
pt_br: Externa na 203.0.113.0/24 com gateway 203.0.113.1

source: This network requires a gateway to provide Internet access to instances in your OpenStack environment.
pt_br: Esta rede requer um gateway para fornecer acesso à Internet para as instâncias em seu ambiente OpenStack.

source: You can modify these ranges and gateways to work with your particular network infrastructure.
pt_br: Você pode modificar estas faixas e gateways para trabalharem com sua estrutura particular de rede.

source: Network interface names vary by distribution. Traditionally, interfaces use "eth" followed by a sequential number. To cover all variations, this guide simply refers to the first interface as the interface with the lowest number, the second interface as the interface with the middle number, and the third interface as the interface with the highest number.
pt_br: Os nomes das interfaces de rede variam por distribuição. Tradicionalmente, a interfaces utilizam "eth" seguido de um número sequencial. Para cobrir todas as variações, este guia simplesmente refere-se à primeira interface como a interface com o menor número, à segunda interface como a interface de número médio, e à terceira interface como a interface de número maior.

source: Minimal architecture example with OpenStack Networking (neutron)Network layout
pt_br: Exemplo de arquitetura mínima com o layout de Rede do OpenStack (neutron)

source: Unless you intend to use the exact configuration provided in this example architecture, you must modify the networks in this procedure to match your environment. Also, each node must resolve the other nodes by name in addition to IP address. For example, the <replaceable>controller</replaceable> name must resolve to <literal>10.0.0.11</literal>, the IP address of the management interface on the controller node.
pt_br: A menos que você pretenda utilizar a configuração exata fornecida nesta arquitetura de exemplo, você deve modificar as redes neste procedimento para corresponder ao seu ambiente. Também, cada nodo deve resolver os outros nodos pelo nome adicionalmente ao endereço IP. Por exemplo, o nome de <replaceable>controlador</replaceable> deve resolver para <literal>10.0.0.11</literal>, o endereço IP da interface de gerenciamento no nodo controlador.

source: Reconfiguring network interfaces will interrupt network connectivity. We recommend using a local terminal session for these procedures.
pt_br: A reconfiguração das intefaces de rede irá interromper a conectividade de rede. Recomendamos utilizar uma sessão de terminal local para estes procedimentos.

source: Controller node
ko_kr: 컨트롤러 노드
pt_br: Nodo controlador

source: To configure networking:
ko_kr: 네트워킹 구성:
pt_br: Para configurar a rede:

source: Configure the first interface as the management interface:
pt_br: Configure a primeira interface como interface de gerenciamento:

source: IP address: 10.0.0.11
ko_kr: IP 주소: 10.0.0.11
pt_br: Endereço IP: 10.0.0.11

source: Network mask: 255.255.255.0 (or /24)
ko_kr: 네트워크 마스크: 255.255.255.0 (또는 /24)
pt_br: Máscara de rede: 255.255.255.0 (ou /24)

source: Default gateway: 10.0.0.1
ko_kr: 기본 게이트웨이: 10.0.0.1
pt_br: Gateway padrão: 10.0.0.1

source: Reboot the system to activate the changes.
pt_br: Reinicialize o sistema para ativar as alterações.

source: To configure name resolution:
pt_br: Para configurar a resolução de nomes:

source: Set the hostname of the node to <code><replaceable>controller</replaceable></code>.
pt_br: defina o hostname do nodo para <code><replaceable>controller</replaceable></code>.

source: Edit the <filename>/etc/hosts</filename> file to contain the following:
pt_br: Edite o arquivo <filename>/etc/hosts</filename> para conter o seguinte:

source: You must remove or comment the line beginning with <literal>127.0.1.1</literal>.
pt_br: Você deve remover ou comentar a linha começando com <literal>127.0.1.1</literal>.

source: Network node
ko_kr: 네트워크 노드
pt_br: Nodo de rede

source: IP address: 10.0.0.21
ko_kr: IP 주소: 10.0.0.21
pt_br: Endereço IP: 10.0.0.21

source: Configure the second interface as the instance tunnels interface:
pt_br: Configure a segunda interface com interface de instância de túneis:

source: IP address: 10.0.1.21
ko_kr: IP 주소: 10.0.1.21
pt_br: Endereço IP: 10.0.1..21

source: The external interface uses a special configuration without an IP address assigned to it. Configure the third interface as the external interface:
pt_br: A interface externa utiliza uma configuração especial sem um endereço IP atribuído a ela. Configure a terceira interface como interface externa.

source: Replace <replaceable>INTERFACE_NAME</replaceable> with the actual interface name. For example, <emphasis>eth2</emphasis> or <emphasis>ens256</emphasis>.
pt_br: Substitua <replaceable>INTERFACE_NAME</replaceable> com o nome atual da interface. Por exempo, <emphasis>eth2</emphasis> ou <emphasis>ens256</emphasis>.

source: Edit the <filename>/etc/network/interfaces</filename> file to contain the following:
pt_br: Edite o arquivo <filename>/etc/network/interfaces</filename> para conter o seguinte:

source: Edit the <filename>/etc/sysconfig/network-scripts/ifcfg-<replaceable>INTERFACE_NAME</replaceable></filename> file to contain the following:
pt_br: Edite o arquivo <filename>/etc/sysconfig/network-scripts/ifcfg-<replaceable>INTERFACE_NAME</replaceable></filename> para conter o seguinte:

source: Do not change the <literal>HWADDR</literal> and <literal>UUID</literal> keys.
pt_br: Não altere as chaves <literal>HWADDR</literal> and <literal>UUID</literal> .

source: Edit the <filename>/etc/sysconfig/network/ifcfg-<replaceable>INTERFACE_NAME</replaceable></filename> file to contain the following:
pt_br: Edite o arquivo <filename>/etc/sysconfig/network/ifcfg-<replaceable>INTERFACE_NAME</replaceable></filename> para conter o seguinte:

source: Set the hostname of the node to <code>network</code>.
pt_br: defina o hostname do nodo para <code>network</code>.

source: Compute node
ko_kr: Compute 노드
pt_br: Nodo de computação

source: IP address: 10.0.0.31
ko_kr: IP 주소: 10.0.0.31
pt_br: Endereço IP: 10.0.0.31

source: Additional compute nodes should use 10.0.0.32, 10.0.0.33, and so on.
pt_br: Nodos de Computação adicionais devem utilizar 10.0.0.32, 10.0.0.33, e assim por diante.

source: IP address: 10.0.1.31
ko_kr: IP 주소: 10.0.1.31
pt_br: Endereço IP: 10.0.1.31

source: Additional compute nodes should use 10.0.1.32, 10.0.1.33, and so on.
pt_br: Nodos de computação adicionais devem utilizar 10.0.1.32, 10.0.1.33, e assim por diante.

source: Set the hostname of the node to <code>compute1</code>.
pt_br: Defina o hostname do nodo para <code>compute1</code>.

source: Verify connectivity
ko_kr: 접속성 확인
pt_br: Verifique a conectividade

source: We recommend that you verify network connectivity to the Internet and among the nodes before proceeding further.
pt_br: Recomendamos que você verifique a conectividade de rede à Internet e entre os nodos antes de prosseguir adiante.

source: From the <emphasis>controller</emphasis> node, <placeholder-1/> a site on the Internet:
pt_br: Do nodo <emphasis>controlador</emphasis>, <placeholder-1/> um site na Internet:

source: From the <emphasis>controller</emphasis> node, <placeholder-1/> the management interface on the <emphasis>network</emphasis> node:
pt_br: Do nodo <emphasis>controlador</emphasis>, <placeholder-1/>a interface de gerenciamento no nodo de <emphasis>rede</emphasis>:

source: network
ko_kr: 네트워크
pt_br: rede

source: From the <emphasis>controller</emphasis> node, <placeholder-1/> the management interface on the <emphasis>compute</emphasis> node:
pt_br: A partir do nodo <emphasis>controlador</emphasis>, <placeholder-1/> a interface de gerenciamento no nodo de <emphasis>computação</emphasis>:

source: From the <emphasis>network</emphasis> node, <placeholder-1/> a site on the Internet:
pt_br: A partir do nodo de <emphasis>rede</emphasis>, <placeholder-1/> um site na Internet:

source: From the <emphasis>network</emphasis> node, <placeholder-1/> the management interface on the <emphasis>controller</emphasis> node:
pt_br: A partir do nodo de <emphasis>rede</emphasis>, <placeholder-1/> a interface de gerenciamento no nodo <emphasis>controlador</emphasis>:

source: From the <emphasis>network</emphasis> node, <placeholder-1/> the instance tunnels interface on the <emphasis>compute</emphasis> node:
pt_br: A partir do nodo de <emphasis>rede</emphasis>, <placeholder-1/> a interface de instâncias de túneis no nodo de <emphasis>computação</emphasis>:

source: From the <emphasis>compute</emphasis> node, <placeholder-1/> a site on the Internet:
pt_br: A partir do nodo de <emphasis>computação</emphasis>, <placeholder-1/> um site na Internet:

source: From the <emphasis>compute</emphasis> node, <placeholder-1/> the management interface on the <emphasis>controller</emphasis> node:
pt_br: A partir do nodo de <emphasis>computação</emphasis>, <placeholder-1/> a interface de gerenciamento no nodo <emphasis>controlador</emphasis>:

source: From the <emphasis>compute</emphasis> node, <placeholder-1/> the instance tunnels interface on the <emphasis>network</emphasis> node:
pt_br: A partir do nodo de <emphasis>computação</emphasis>, <placeholder-1/> a interface de instâncias de túneis no nodo de <emphasis>rede</emphasis>:

source: Add the Identity service
pt_br: Adicionar o serviço de Identidade

source: Add Object Storage
ko_kr: 오브젝트 스토리지 추가
pt_br: Adicionar Object Storage

source: The OpenStack Object Storage services (swift) work together to provide object storage and retrieval through a <glossterm baseform="RESTful">REST</glossterm> API. Your environment must at least include the Identity service (keystone) prior to deploying Object Storage.
pt_br: O serviços OpenStack de Object Storage (swift) trabalham em conjunto para fornecer armazenamento e recuperação de objeto através de uma API <glossterm baseform="RESTful">REST</glossterm>. Seu ambiente deve incluir, pelo menos, o serviço de Identidade (keystone) antes da implantação do Object Storage.

source: Next steps
ko_kr: 다음 단계
pt_br: Próximos passos

source: Your OpenStack environment now includes Object Storage. You can <link linkend="launch-instance">launch an instance</link> or add more services to your environment in the following chapters.
pt_br: Seu ambiente OpenStack inclui agora o Block Storage. Você pode <link linkend="launch-instance">lançar uma instância</link> ou adicionar mais serviços ao seu ambiente nos capítulos seguintes.

source: Networking concepts
ko_kr: 네트워킹 컨셉
pt_br: Conceitos de rede

source: OpenStack Networking (neutron) manages all networking facets for the Virtual Networking Infrastructure (VNI) and the access layer aspects of the Physical Networking Infrastructure (PNI) in your OpenStack environment. OpenStack Networking enables tenants to create advanced virtual network topologies including services such as <glossterm baseform="firewall">firewalls</glossterm>, <glossterm baseform="load balancer">load balancers</glossterm>, and <glossterm baseform="virtual private network (VPN)">virtual private networks (VPNs)</glossterm>.
pt_br: O OpenStack Networking (neutron) gerencia todas as facetas de rede para a Infraestrutura Virtual de Rede (VNI) e os aspectos da camada de acesso da Infraestrutura Física de Rede (PNI) no seu ambiente OpenStack. O OpenStack Networking permite os tenants criar topologias avançadas de rede virtual, incluindo serviços como <glossterm baseform="firewall">firewalls</glossterm>, <glossterm baseform="load balancer">load balancers</glossterm>, e <glossterm baseform="virtual private network (VPN)">virtual private networks (VPNs)</glossterm>.

source: Networking provides the networks, subnets, and routers object abstractions. Each abstraction has functionality that mimics its physical counterpart: networks contain subnets, and routers route traffic between different subnet and networks.
pt_br: Networking fornece as abstrações de objetos de redes, sub-redes, e roteadores. Cada abstração possui funcionalidades que imitam o objeto físico equivalente: redes contém sub-redes, e roteadores roteiam o tráfego entre diferentes sub-redes e redes.

source: Each router has one gateway that connects to a network, and many interfaces connected to subnets. Subnets can access machines on other subnets connected to the same router.
pt_br: Cada roteador tem um gateway que conecta à rede, e várias interfaces conectadas a sub-redes. Sub-redes podem acessar máquinas em outras sub-redes conectadas ao mesmo roteador.

source: Any given Networking set up has at least one external network. Unlike the other networks, the external network is not merely a virtually defined network. Instead, it represents a view into a slice of the physical, external network accessible outside the OpenStack installation. IP addresses on the external network are accessible by anybody physically on the outside network. Because the external network merely represents a view into the outside network, DHCP is disabled on this network.
pt_br: Qualquer configuração de rede dada tem ao menos uma rede externa. Diferente de outras redes, a rede externa não é meramente uma rede virtualmente definida. Em vez disso, ela representa uma visão dentro de uma fatia da rede física externa, acessível de fora da instalação do OpenStack. Os endereços IP na rede externa são acessíveis por qualquer um na rede de fora. Devido a rede externa meramente representar uma visão na rede de fora, o DHCP é desabilitado nessa rede.

source: In addition to external networks, any Networking set up has one or more internal networks. These software-defined networks connect directly to the VMs. Only the VMs on any given internal network, or those on subnets connected through interfaces to a similar router, can access VMs connected to that network directly.
pt_br: Adicionalmente às redes externas, qualquer configuração de Rede tem uma ou mais redes internas. Essas redes definidas por software conectam diretamente às VMs. Somente as VMs em qualquer rede interna dada, ou aquelas em sub-redes conectadas através de interfaces para um roteador similar, podem acessar VMs conectadas à essa rede diretamente.

source: For the outside network to access VMs, and vice versa, routers between the networks are needed. Each router has one gateway that is connected to a network and many interfaces that are connected to subnets. Like a physical router, subnets can access machines on other subnets that are connected to the same router, and machines can access the outside network through the gateway for the router.
ko_kr: 외부 네트워크에서 VM에 접근하거나, 그 반대의 경우에도 네트워크 사이의 라우터가 필요합니다. 각 라우터는 네트워크에 연결된 하나의 게이트웨이와 많은 인터페이스에 연결된 서브넷으로 되어있습니다. 물리적 라우터와 같이 동일한 라우터에 연결된 다른 서브넷의 머신에 접근할 수 있고, 머신에서 라우터의 게이트웨이를 통하여 외부 네트워크에 접근할 수 있습니다.
pt_br: Para a rede externa acessar as VMs, e vice versa, são necessários roteadores entre as redes. Cada roteador tem um gateway conectado a uma rede e muitas interfaces que são conectadas a sub-redes. Como um roteador físico, as sub-redes podem acessar máquinas em outras sub-redes que estão conectadas ao mesmo roteador, e máquinas podem acessar a rede do lado de fora através do gateway para o roteador.

source: Additionally, you can allocate IP addresses on external networks to ports on the internal network. Whenever something is connected to a subnet, that connection is called a port.You can associate external network IP addresses with ports to VMs. This way, entities on the outside network can access VMs.
pt_br: Adicionalmente, você pode alocar endereços IP nas redes externas para portas na rede interna. Quando algo está conectado a uma sub-rede, essa conexão é chamada uma porta. Você pode associar endereços IP de redes externas com portas para VMs. Desta forma, as entidades da rede do lado de fora podem acessar VMs.

source: Networking also supports <emphasis role="italic">security groups</emphasis>. Security groups enable administrators to define firewall rules in groups. A VM can belong to one or more security groups, and Networking applies the rules in those security groups to block or unblock ports, port ranges, or traffic types for that VM.
pt_br: Networking também suporta <emphasis role="italic">grupos de segurança</emphasis>. Grupos de segurança habilitam os administradores definir regras de firewall em grupos. Uma VM pode pertencer a um ou mais grupos de segurança, e o Networking aplica as regras nesses grupos de segurança para bloquear e desbloquear portas, intervalos de portas, ou tipos de tráfego para essa VM.

source: Each plug-in that Networking uses has its own concepts. While not vital to operating the VNI and OpenStack environment, understanding these concepts can help you set up Networking. All Networking installations use a core plug-in and a security group plug-in (or just the No-Op security group plug-in). Additionally, Firewall-as-a-Service (FWaaS) and Load-Balancer-as-a-Service (LBaaS) plug-ins are available.
pt_br: Cada plug-in que o Networking utiliza, tem seus próprios conceitos. Embora não seja vital para operar o VNI e o ambiente OpenStack, entender estes conceitos pode ajudá-lo a configurar o Networking. Todas as instalações do Networking utilizam um plug-in central e um plug-in de grupo de segurança (ou simplesmente plug-in de grupo de segurança No-Op). Adicionalmente, os plug-ins de Firewall-as-a-Service (FWaaS) e Load-Balancer-as-a-Service (LBaaS) estão disponíveis.

source: Create initial network
ko_kr: 초기 네트워크 생성
pt_br: Crie a rede inicial
