Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: Before launching your first instance, you must create the necessary virtual network infrastructure to which the instance will connect. This network typically provides Internet access <emphasis>from</emphasis> instances. You can enable Internet access <emphasis>to</emphasis> individual instances using a <glossterm>floating IP address</glossterm> and suitable <glossterm>security group</glossterm> rules. The <literal>admin</literal> tenant owns this network because it provides external network access for multiple tenants.
pt_br: Antes de lançar sua primeira instância, você deve criar a infraestrutura virtual de rede necessária, à qual a instância irá se conectar. Esta rede tipicamente fornece acesso Internet <emphasis>a partir das</emphasis>instâncias. Você pode habilitar o acesso Internet <emphasis>para</emphasis> instâncias individuais usando um <glossterm>endereço IP flutuante</glossterm> e regras adequadas de <glossterm>grupo de segurança</glossterm>. O tenant <literal>admin</literal> detém esta rede porque ele fornece acesso de rede externo para múltiplos tenants.

source: This network shares the same <glossterm>subnet</glossterm> associated with the physical network connected to the external <glossterm>interface</glossterm> on the compute node. You should specify an exclusive slice of this subnet to prevent interference with other devices on the external network.
pt_br: Esta rede compartilha a mesma <glossterm>sub-rede</glossterm> associada com a rede física conectada à <glossterm>interface</glossterm> no nodo de computação. Você deve especificar uma fatia exclusiva dessa sub-rede para prevenir interferência com outros dispositivos na rede externa.

source: Perform these commands on the controller node.
pt_br: Execute estes comandos no nodo controlador.

source: To create the network
ko_kr: 네트워크 생성
pt_br: Para criar a rede

source: Source the <literal>admin</literal> tenant credentials:
ko_kr: <literal>admin</literal> tenant credentials 소스:
pt_br: Adquira as credenciais do tenant <literal>admin</literal>:

source: Create the network:
ko_kr: 네트워크 생성:
pt_br: Crie a rede

source: Replace <replaceable>NETWORK_CIDR</replaceable> with the subnet associated with the physical network.
ko_kr: 물리 네트워크와 연동된 서브넷에 대한 <replaceable>NETWORK_CIDR</replaceable> 수정.
pt_br: Substitua <replaceable>NETWORK_CIDR</replaceable com a sub-rede associada com a rede física.

source: For example, using an exclusive slice of <literal>203.0.113.0/24</literal> with IP address range <literal>203.0.113.24</literal> to <literal>203.0.113.32</literal>:
ko_kr: 예를 들어, IP 주소 범위 <literal>203.0.113.24</literal>에서 <literal>203.0.113.32</literal>까지는 <literal>203.0.113.0/24</literal>의 전용 슬라이스를 사용합니다:
pt_br: Por exemplo, utilizando uma fatia exclusiva <literal>203.0.113.0/24</literal> com intervalo de endereços IP de <literal>203.0.113.24</literal> a <literal>203.0.113.32</literal>:

source: Verify creation of the network:
ko_kr: 네트워크 생성 확인:
pt_br: Verifique a criação da rede:

source: Add the dashboard
ko_kr: 대시보드 추가
pt_br: Adicionar o dashboard

source: The dashboard enables web-based interactions with the OpenStack Compute cloud controller through the OpenStack APIs.
ko_kr: 대시보드를 이용하여 OpenStack API를 통해 OpenStack Compute 클라우드 컨트롤러에 대한 웹 기반 상호작용이 가능합니다.
pt_br: O dashboard permite interações na web com o controlador de nuvem OpenStack Compute através das APIs do OpenStack.

source: Horizon enables you to customize the brand of the dashboard.
pt_br: O Horizon permite que você personalize a marca do painel.

source: Horizon provides a set of core classes and reusable templates and tools.
pt_br: O Horizon provê um conjunto de classes básicas, modelos reutilizáveis e ferramentas.

source: This example deployment uses an Apache web server.
pt_br: Este exemplo de implantação utiliza um servidor web Apache.

source: Your OpenStack environment now includes the dashboard. You can <link linkend="launch-instance">launch an instance</link> or add more services to your environment in the following chapters.
pt_br: Seu ambiente OpenStack agora inclui o painel. Você pode <link linkend="launch-instance">lançar uma instância</link> ou adicionar mais serviços ao seu ambiente nos capítulos seguintes.

source: After you install and configure the dashboard, you can complete the following tasks:
pt_br: Depois de instalar e configurar o painel, você pode completar as seguintes tarefas.

source: Customize your dashboard. See section <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_install-dashboard.html#dashboard-custom-brand">Customize the dashboard</link> in the <link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>OpenStack Cloud Administrator Guide</citetitle></link> for information on setting up colors, logos, and site titles.
pt_br: Personalize seu painel. Consulte a seção <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_install-dashboard.html#dashboard-custom-brand">Personalize seu painel</link> no <link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>Guia do Administrador do OpenStack Cloud</citetitle></link> para informações sobre como definir cores, logos, e títulos de sites.

source: Set up session storage. See section <link href="http://docs.openstack.org/admin-guide-cloud/content/dashboard-sessions.html#dashboard-sessions">Set up session storage for the dashboard</link> in the <link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>OpenStack Cloud Administrator Guide</citetitle></link> for information on user session data.
pt_br: Configure o armazenamento de sessão. Consulte a seção <link href="http://docs.openstack.org/admin-guide-cloud/content/dashboard-sessions.html#dashboard-sessions">Configurar o armazenamento de sessão para o painel</link> no <link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>Guia do Administrador do OpenStack Cloud</citetitle></link> para mais informações sobre dados de sessão de usuário.

source: This section describes how to verify operation of the Identity service.
pt_br: Esta seção descreve como verificar a operação do serviço de Identidade.

source: Unset the temporary <envar>OS_SERVICE_TOKEN</envar> and <envar>OS_SERVICE_ENDPOINT</envar> environment variables:
pt_br: Limpe as variáveis temporárias de ambiente <envar>OS_SERVICE_TOKEN</envar> e<envar>OS_SERVICE_ENDPOINT</envar>:

source: As the <literal>admin</literal> tenant and user, request an authentication token:
pt_br: Como usuário e tenant <literal>admin</literal>, requisite o token de autenticação:

source: Replace <replaceable>ADMIN_PASS</replaceable> with the password you chose for the <literal>admin</literal> user in the Identity service. You might need to use single quotes (') around your password if it includes special characters.
pt_br: Substitua <replaceable>ADMIN_PASS</replaceable> com a senha que você escolheu para o usuário <literal>admin</literal> no serviço de Identidade. Você pode precisar utilizar aspas simples (') em torno de sua senha se ela incluir caracteres especiais.

source: As the <literal>admin</literal> tenant and user, list tenants to verify that the <literal>admin</literal> tenant and user can execute admin-only CLI commands and that the Identity service contains the tenants that you created in <xref linkend="keystone-users"/>:
pt_br: Como tenant e usuário <literal>admin</literal>, liste os tenants para verificar que o tenant e usuário <literal>admin</literal> pode executar comandos CLI admin-only e que o serviço de Identidade contém os tenants que você criou em <xref linkend="keystone-users"/>:

source: As the <literal>admin</literal> tenant and user, list tenants to verify that the <literal>admin</literal> tenant and user can execute admin-only CLI commands and that the Identity service contains the tenants created by the configuration tool:
pt_br: Como tenant e usuário <literal>admin</literal>, liste os tenants para verificar que o tenant e usuário <literal>admin</literal> pode executar comandos CLI admin-only e que o Serviço de Identidade contém os tenants criados pela ferramenta de configuração:

source: Because OpenStack generates IDs dynamically, you will see different values from this example command output.
pt_br: Devido ao OpenStack gerar IDs dinamicamente, você verá valores diferentes para a saída de comando deste exemplo.

source: As the <literal>admin</literal> tenant and user, list users to verify that the Identity service contains the users that you created in <xref linkend="keystone-users"/>:
pt_br: Como usuário e tenant <literal>admin</literal>, liste os usuários para identificar que o Serviço de Identidade contém os usuários que você criou em <xref linkend="keystone-users"/>:

source: As the <literal>admin</literal> tenant and user, list users to verify that the Identity service contains the users created by the configuration tool:
pt_br: Como usuário e tenant <literal>admin</literal> , liste os usuários para verificar que o Serviço de Identidade contém os usuários criados pela ferramenta de configuração:

source: As the <literal>admin</literal> tenant and user, list roles to verify that the Identity service contains the role that you created in <xref linkend="keystone-users"/>:
pt_br: Como usuário e tenant <literal>admin</literal>, liste os papéis para verificar que o Serviço de Identidade contém o papel que você criou em <xref linkend="keystone-users"/>:

source: As the <literal>admin</literal> tenant and user, list roles to verify that the Identity service contains the role created by the configuration tool:
pt_br: Como usuário e tenant <literal>admin</literal>, liste os papéis para verificar que o Serviço de Identidade contém o papel criado pela ferramenta de configuração:

source: As the <literal>demo</literal> tenant and user, request an authentication token:
pt_br: Como usuário e tenant <literal>demo</literal>, solicite um token de autenticação:

source: Replace <replaceable>DEMO_PASS</replaceable> with the password you chose for the <literal>demo</literal> user in the Identity service.
pt_br: Substitua <replaceable>DEMO_PASS</replaceable> com a senha que você escolheu para o usuário <literal>demo</literal> no Serviço de Identidade.

source: As the <literal>demo</literal> tenant and user, attempt to list users to verify that you cannot execute admin-only CLI commands:
pt_br: Como usuário e tenant literal>demo</literal>, tente lista usuários para verificar que você não pode executar comandos CLI somente para administradores:

source: Each OpenStack service references a <filename>policy.json</filename> file to determine the operations available to a particular tenant, user, or role. For more information, see the <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Projects and Users</link>.
pt_br: Cada serviço OpenStack referencia um aquivo <filename>policy.json</filename> para determinar as operações disponíveis para um tenant, usuário ou papel particular. Para mais informações, consulte o link <link href="http://docs.openstack.org/openstack-ops/content/projects_users.html">Operations Guide - Managing Projects and Users</link>.

source: OpenStack packages
ko_kr: 오픈스택 꾸러미
pt_br: Pacotes OpenStack

source: Distributions release OpenStack packages as part of the distribution or using other methods because of differing release schedules. Perform these procedures on all nodes.
pt_br: As distribuições lançam pacotes OPenStack como parte da distribuição ou utilizando outros métodos, por causa dos diferentes calendários de lançamentos. Execute esses procedimentos em todos os nodos.

source: Disable or remove any automatic update services because they can impact your OpenStack environment.
pt_br: Desabilite ou remova quaisquer serviços de atualização automática porque eles podem impactar seu ambiente OpenStack.

source: To enable the OpenStack repository
pt_br: Habilitar o repositório OpenStack

source: Install the Ubuntu Cloud archive keyring and repository:
pt_br: Instale o repositório e o arquivos de chaves do Ubuntu:

source: Install the <package>yum-plugin-priorities</package> package to enable assignment of relative priorities within repositories:
pt_br: Instale o pacote <package>yum-plugin-priorities</package> para habilitar a atribuição de prioridades relativas dentro dos repositórios:

source: On RHEL and CentOS, enable the <link href="http://download.fedoraproject.org/pub/epel/7/x86_64/repoview/epel-release.html">EPEL</link> repository:
pt_br: No RHEL e CentOS ative o repositório <link href="http://download.fedoraproject.org/pub/epel/7/x86_64/repoview/epel-release.html">EPEL</link>:

source: Fedora does not require this repository.
pt_br: Fedora não requer esse repositório.

source: On RHEL, enable the extras repository using the subscription manager:
pt_br: Em RHEÇ, ative os repositórios extras utilizando o gerenciador de subscrição:

source: CentOS and Fedora do not require this repository.
pt_br: CentOS e Fedora não requerem esse repositório.

source: Install the <package>rdo-release-juno</package> package to enable the RDO repository:
pt_br: Instale o pacote <package>rdo-release-juno</package> para habilitar o repositório RDO:

source: Enable the Open Build Service repositories based on your openSUSE or SLES version:
pt_br: Habilite os repositórios de Open Build Service baseado na sua versão de openSUSE ou SLES:

source: On openSUSE 13.1:
pt_br: No openSUSE 13.1:

source: On SLES 11 SP3:
pt_br: No SLES 11 SP3:

source: The packages are signed by GPG key 893A90DAD85F9316. You should verify the fingerprint of the imported GPG key before using it.
pt_br: Os pacotes são assinados por chave GPG 893A90DAD85F9316. Você deve verificar a impressão digital da chave GPG importada antes de utilizá-la.

source: To use the Debian Wheezy backports archive for Juno
pt_br: Utilizar arquivos Debian Wheezy portados para o Juno

source: The <glossterm>Juno</glossterm> release is available only in Debian Experimental (otherwise called rc-buggy), as Jessie is frozen soon, and will contain Icehouse. However, the Debian maintainers of OpenStack also maintain a non-official Debian repository for OpenStack containing Wheezy backports.
pt_br: A versão <glossterm>Juno</glossterm> está disponível somente no Debian Experimental (chamado também de rc-buggy), como Jessie será congelado em breve, e irá conter o IceHouse. Contudo, os mantenedores do OpenStack no Debian também mantêm um repositório Debian não oficial para OpenStack, contendo os portes retroativos para Wheezy.

source: On all nodes, install the Debian Wheezy backport repository Juno:
pt_br: Em todos os nodos, instale o repositório Juno portado para Debian Wheezy:

source: Install the Debian Wheezy OpenStack repository for Juno:
pt_br: Instale o repositório OpenStack Debian Wheezy para Juno:

source: Update the repository database and install the key:
ko_kr: 저장소 데이터베이스를 업데이트하고 키를 설치하십시오:
pt_br: Atualize o banco de dados do repositório e instale a chave:

source: Update the package database, upgrade your system, and reboot for all changes to take effect:
ko_kr: 꾸러미 데이터베이스를 업데이트하고, 시스템을 업그레이드한 다음, 모든 바뀐 내용대로 동작하도록 하기 위해 다시 부팅하십시오:
pt_br: Atualize o banco de dados de pacotes, atualize seu sistema, e reinicialize para que todas as alterações tenham efeito:

source: Numerous archive.gplhost.com mirrors are available around the world. All are available with both FTP and HTTP protocols (you should use the closest mirror). The list of mirrors is available at <link href="http://archive.gplhost.com/readme.mirrors">http://archive.gplhost.com/readme.mirrors</link>.
ko_kr: 전세계에 다양한 archive.gplhost.com 미러가 있습니다. 모든 미러가 FTP 프로토콜 방식과 HTTP 프로토콜 방식 둘 다 제공합니다(가장 가까운 미러를 선택하십시오). 미러 목록은 <link href="http://archive.gplhost.com/readme.mirrors">http://archive.gplhost.com/readme.mirrors</link>에 있습니다.
pt_br: Inúmeros espelhos do site archive.gplhost.com estão disponíveis no mundo. Todos estão disponíveis através de protocolos, tanto via FTP quanto por HTTP (você deve utilizar o espelho mais próximo). A lista de espelhos está disponível em <link href="http://archive.gplhost.com/readme.mirrors">http://archive.gplhost.com/readme.mirrors</link>.

source: Manually install python-argparse
ko_kr: python-argparse 직접 설치
pt_br: Instalação manual do python-argparse

source: The Debian OpenStack packages are maintained on Debian Sid (also known as Debian Unstable) - the current development version. Backported packages run correctly on Debian Wheezy with one caveat:
ko_kr: 데비안 오픈스택 꾸러미는 데비안 시드(a.k.a 데비안 언스테이블) - 현재 개발중인 버전에서 관리합니다. 데비안 휘지(Wheezy) 백포트에 있는 패키는 명령 한번에 올바르게 동작합니다:
pt_br: Os pacotes do Debian OpenStack são mantidos no Debian Sid (também conhecido como Debian instável) - a versãoatual de desenvolvimento. Pacotes portados rodam corretamente no Debian Wheezy com uma ressalva:

source: All OpenStack packages are written in Python. All packages support version 2.7; porting to Python version 3 is ongoing. Note that Debian Wheezy uses Python 2.6 and 2.7, with Python 2.7 as the default interpreter; Sid has only Python 2.7. There is one packaging change between these two. In Python 2.6, you installed the <package>python-argparse</package> package separately. In Python 2.7, this package is installed by default. Unfortunately, in Python 2.7, this package does not include <code>Provides: python-argparse</code> directive.
pt_br: Todos os pacotes do OpenStack são escritos em Python. Todos os pacotes suportam a versão 7; a portabilidade para versão 3 está em andamento. Observe que o Debian Wheezy utiliza o Python versão 2.6 e 2.7, com Python 2.7 como o interpretador padrão; Sid tem somente Python 2.7. Não há mudanças significativas entre esses pacotes. No Python 2.7 este pacote é instalado por padrão. Infelizmente no Python 2.7, este pacote não inclui a diretiva <code>Provides: python-argparse</code>.

source: Because the packages are maintained in Sid where the <code>Provides: python-argparse</code> directive causes an error, and the Debian OpenStack maintainer wants to maintain one version of the OpenStack packages, you must manually install the <package>python-argparse</package> on each OpenStack system that runs Debian Wheezy before you install the other OpenStack packages. Use the following command to install the package:
ko_kr: 시드에서 <code>Provides: python-argparse</code> 지시어가 오류를 유발하고, 데비안 오픈스택 관리자가 오픈스택 꾸러미의 버전 한개만을 관리하려고 하기 때문에, 데비안 Wheezy를 구동하는 각각의 오픈스택 시스템에서는 다른 오픈스택 꾸러미를 설치하기 전에 <package>python-argparse</package>를 직접 설치해야 합니다. 꾸러미를 설치하려면 다음 명령을 사용하십시오:
pt_br: Como os pacotes são mantidos na Sid onde a diretiva <code>Provides: python-argparse</code> causa um erro, e o mantenedor do Debian OpenStack quer manter uma versão dos pacotes OpenStack, você deve instalar manualmente o <package>python-argparse</package> em cada sistema OpenStack que roda Debian Wheezy antes de instalar outros pacotes OpenStack. Utilize os seguintes comandos para instalar o pacote:

source: This caveat applies to most OpenStack packages in Wheezy.
ko_kr: 이 명령은 휘지에서 대부분의 오픈스택 꾸러미에 적용합니다.
pt_br: Esta ressalva se aplica à maioria dos pacotes OpenStack no Wheezy.

source: Upgrade the packages on your system:
pt_br: Atualize os pacotes em seu sistema:

source: If the upgrade process includes a new kernel, reboot your system to activate it.
pt_br: Se o processo de atualização inclui um novo kernel, reinicialize seu sistema para ativá-lo.

source: RHEL and CentOS enable <glossterm>SELinux</glossterm> by default. Install the <package>openstack-selinux</package> package to automatically manage security policies for OpenStack services:
pt_br: O RHEL e o CentOS habilitam o <glossterm>SELinux</glossterm> por padrão. Instale o pacote <package>openstack-selinux</package> para gerenciar automaticamente as políticas de segurança para os serviços OpenStack:

source: Fedora does not require this package.
pt_br: O Fedora não requer este pacote.

source: The installation process for this package can take a while.
pt_br: O processo de instalação para esse pacote pode demorar um pouco.

source: Security
pt_br: Segurança

source: OpenStack services support various security methods including password, policy, and encryption. Additionally, supporting services including the database server and message broker support at least password security.
pt_br: Os serviços OpenStack suportam vários métodos de segurança, incluindo senha, políticas e criptografia. Adicionalmente, os serviços de suporte, incluindo o servidor de banco de dados e o intermediador de mensagens suportam pelo menos segurança de senha.

source: To ease the installation process, this guide only covers password security where applicable. You can create secure passwords manually, generate them using a tool such as <link href="http://sourceforge.net/projects/pwgen/">pwgen</link>, or by running the following command:
pt_br: Para facilitar o processo de instalação, este guia somente cobre segurança de senhas quando aplicável. Você pode criar senhas seguras manualmente. Gere-as utilizando uma ferramenta como <link href="http://sourceforge.net/projects/pwgen/">pwgen</link>, ou executando o seguinte comando:

source: For OpenStack services, this guide uses <replaceable>SERVICE_PASS</replaceable> to reference service account passwords and <replaceable>SERVICE_DBPASS</replaceable> to reference database passwords.
pt_br: Para os serviços OpenStack, este guia utiliza <replaceable>SERVICE_PASS</replaceable> para referenciar volume de serviços, senhas e replaceable>SERVICE_DBPASS</replaceable> para referenciar as senhas no banco de dados.
