Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: To opt out of using the <systemitem class="library">debconf</systemitem> package, run the <placeholder-1/> command and select non-interactive mode:
ko_kr: <systemitem class="library">debconf</systemitem> 꾸러미를 사용하지 않고 <placeholder-1/> 명령어로 실행하거나 비 대화형 모드를 선택하려면:
pt_br: Para optar por usar o pacote <systemitem class="library">debconf</systemitem>, execute o comando <placeholder-1/> e selecione o modo não-interativo:

source: Then, <systemitem class="library">debconf</systemitem> does not prompt you.
ko_kr: 다음으로 <systemitem class="library">debconf</systemitem>는 질문을 보여주지 않습니다.
pt_br: Então, <systemitem class="library">debconf</systemitem> não fará qualquer solicitação a você.

source: Another way to disable the <systemitem class="library">debconf</systemitem> package is to prefix the <placeholder-1/> command with <literal>DEBIAN_FRONTEND=noninteractive</literal>, as follows:
ko_kr: 다른 방법으로 <systemitem class="library">debconf</systemitem> 꾸러미를 활용하지 않으려면, 명령 앞에 <placeholder-1/> <literal>DEBIAN_FRONTEND=noninteractive</literal>를 붙이십시오:
pt_br: Outra maneira de desabilitar o pacote <systemitem class="library">debconf</systemitem> é prefixar o comando <placeholder-1/> com <literal>DEBIAN_FRONTEND=noninteractive</literal>, como segue:

source: If you configure a package with <systemitem class="library">debconf</systemitem> incorrectly, you can re-configure it, as follows:
ko_kr: <systemitem class="library">debconf</systemitem>에서 꾸러미를 올바르게 설정하지 못했다면, 다시 설정할 수 있습니다:
pt_br: Se você configurar um pacote com <systemitem class="library">debconf</systemitem> incorretamente, você pode reconfigurá-lo, como segue:

source: This calls the post-installation script for the <replaceable>PACKAGE-NAME</replaceable> package after the user responds to all prompts. If you cannot install a Debian package in a non-interactive way, you have found a release-critical bug in Debian. Report it to the Debian bug tracking system.
ko_kr: 사용자가 모든 프롬프트에 응답하면 <replaceable>PACKAGE-NAME</replaceable> 꾸러미 설치후 스크립트를 호출합니다. 비 대화형 방식으로 데비안 꾸러미를 설치할 수 없다면 데비안에서 심각한 릴리즈 버그를 발견한 것입니다. 데비안 버그 추적 시스템에 보고 해주십시오.
pt_br: Isso chama o script de pós-instalação para o pacote <replaceable>PACKAGE-NAME</replaceable> depois que o usuário responde a todas as perguntas. Se você não pode instalar um pacote Debian de uma forma não interativa, você encontrou um bug crítico de release no Debian. Relate isso para o sistema de rastreamento de bugs do Debian.

source: Generally, the <systemitem class="library">-common</systemitem> packages install the configuration files. For example, the <literal>glance-common</literal> package installs the <filename>glance-api.conf</filename> and <filename>glance-registry.conf</filename> files. So, for the Image Service, you must re-configure the <literal>glance-common</literal> package. The same applies for <literal>cinder-common</literal>, <literal>nova-common</literal>, and <literal>heat-common</literal> packages.
ko_kr: 보통 <systemitem class="library">-common</systemitem> 꾸러미에서 설정 파일을 설치합니다. 예를 들어 <literal>glance-common</literal> 꾸러미는 <filename>glance-api.conf</filename> 와 <filename>glance-registry.conf</filename> 파일을 설치합니다. 그래서 이미지 서비스에 대해 <literal>glance-common</literal> 꾸러미를 다시 설정해야 합니다. <literal>cinder-common</literal>, <literal>nova-common</literal>, <literal>heat-common</literal> 꾸러미에 대해 같은 방식이 적용됩니다.
pt_br: Geralmente, os pacotes <systemitem class="library">-common</systemitem> instalam os arquivos de configuração. Por exemplo, o pacote <literal>glance-common</literal> instala os arquivos <filename>glance-api.conf</filename> e <filename>glance-registry.conf</filename>. Assim, para o serviço de Imagem, você deve reconfigurar o pacote <literal>glance-common</literal>. O mesmo se aplica aos pacotes <literal>cinder-common</literal>, <literal>nova-common</literal>, e <literal>heat-common</literal>.

source: In <systemitem class="library">debconf</systemitem>, the higher the priority for a screen, the greater the chance that the user sees that screen. If a <systemitem class="library">debconf</systemitem> screen has <literal>medium</literal> priority and you configure the Debian system to show only <literal>critical</literal> prompts, which is the default in Debian, the user does not see that <systemitem class="library">debconf</systemitem> screen. Instead, the default for the related package is used. In the Debian OpenStack packages, a number of <systemitem class="library">debconf</systemitem> screens are set with <literal>medium</literal> priority. Consequently, if you want to respond to all <systemitem class="library">debconf</systemitem> screens from the Debian OpenStack packages, you must run the following command and select the <literal>medium</literal> priority before you install any packages:
ko_kr: <systemitem class="library">debconf</systemitem>에서, 화면에 대해 가장 높은 우선권을 가지며, 이 화면을 보는 사용자가 더 많은 기회를 가집니다. <systemitem class="library">debconf</systemitem> 화면에 <literal>medium</literal> 우선권을 부여하였고, 데비안 시스템에서 데비안 시스템 기본으로 <literal>critical</literal> 프롬프트에 대해서만 보여주는 걸로 설정했다면 사용자는 <systemitem class="library">debconf</systemitem> 화면을 볼 수 없습니다. 대신 관련 꾸러미를 사용합니다. 데비안 오픈스택 꾸러미에서 대부분의 많은 <systemitem class="library">debconf</systemitem> 화면은 <literal>medium</literal> 우선권으로 설정합니다. 결과적으로 데비안 오픈스택 꾸러미에서 모든 <systemitem class="library">debconf</systemitem> 화면에 응답하려 한다면, 어떤 꾸러미를 설치하기 전에 다음 명령을 실행하여 <literal>medium</literal> 우선권을 선택하십시오:
pt_br: No <systemitem class="library">debconf</systemitem>, quanto mais alta a prioridade para uma tela, maior a chance de o usuário ver aquela tela. Se uma tela <systemitem class="library">debconf</systemitem> tem prioridade <literal>medium</literal> e você configura o sistema Debian para mostrar somente solicitações <literal>critical</literal>, que é um padrão no Debian, o usuário não vê a tela <systemitem class="library">debconf</systemitem>. Em vez disso, o padrão relativo ao pacote é usado. Nos pacotes de OpenStack do Debian, uma série de telas do <systemitem class="library">debconf</systemitem> são definidas com prioridade <literal>medium</literal>. Consequentemente, se você quiser responder a todas as telas do <systemitem class="library">debconf</systemitem> dos pacotes OpenStack do Debian, você deve executar o seguinte comando e selecionar a prioridade <literal>medium</literal> antes de instalar qualquer pacote.

source: The packages do not require pre-depends. If <systemitem class="library">dbconfig-common</systemitem> is already installed on the system, the user sees all prompts. However, you cannot define the order in which the <systemitem class="library">debconf</systemitem> screens appear. The user must make sense of it even if the prompts appear in an illogical order.
ko_kr: 꾸러미는 이전 의존성을 필요로 하지 않습니다. 시스템에 <systemitem class="library">dbconfig-common</systemitem>를 이미 설치했다면, 사용자 입장에서 모든 질문을 봅니다. 그러나 <systemitem class="library">debconf</systemitem> 화면이 나타나는 것에 대한 순서는 정의할 수 없습니다. 프롬프트가 나타나는 순서가 논리적이지 않더라도 그냥 이해해야만 합니다.
pt_br: Os pacotes não exigem pré-dependências. Se o <systemitem class="library">dbconfig-common</systemitem> já está configurado no sistema, o usuário vê todas as perguntas. Contudo, você não define a ordem na qual as telas do <systemitem class="library">debconf</systemitem> aparecem. As perguntas devem fazer sentido para o usuário, mesmo que apareçam em uma ordem ilógica.

source: Basic environment
pt_br: Ambiente básico

source: The trunk version of this guide focuses on the future Kilo release and will not work for the current Juno release. If you want to install Juno, you must use the <link href="http://docs.openstack.org">Juno version</link> of this guide instead.
pt_br: A versão base deste guia foca na futura versão Kilo e não funcionará para a versão atual Juno. Se você quiser instalar a Juno, você deve utilizar a <link href="http://docs.openstack.org">Versão Juno</link> deste guia.

source: This chapter explains how to configure each node in the <link linkend="architecture_example-architectures">example architectures</link> including the <link linkend="example-architecture-with-legacy-networking-hw"> two-node architecture with legacy networking</link> and <link linkend="example-architecture-with-neutron-networking-hw">three-node architecture with OpenStack Networking (neutron)</link>.
pt_br: Este capítulo explica como configurar cada nodo nas <link linkend="architecture_example-architectures">arquiteturas de exemplo</link>, incluindo a <link linkend="example-architecture-with-legacy-networking-hw"> arquitetura de dois nodos com rede legada</link> e a <link linkend="example-architecture-with-neutron-networking-hw">arquitetura de três nodos com OpenStack Networking (neutron)</link>.

source: Although most environments include Identity, Image Service, Compute, at least one networking service, and the dashboard, the Object Storage service can operate independently. If your use case only involves Object Storage, you can skip to <xref linkend="ch_swift"/> after configuring the appropriate nodes for it. However, the dashboard requires at least the Image Service and Compute.
pt_br: Embora a maioria dos ambientes incluem Identidade, Serviço de Imagem, Computação, pelo menos um serviço de rede e o dashboard, o serviço Object Storage pode operar independentemente. Se seu caso de uso envolve somente o Object Storage, você pode pular para <xref linkend="ch_swift"/> depois de configurar os nodos apropriados para ele. Contudo, o dashboard requer pelo menos o Serviço de Imagem e Computação.

source: You must use an account with administrative privileges to configure each node. Either run the commands as the <literal>root</literal> user or configure the <literal>sudo</literal> utility.
pt_br: Você deve utilizar uma conta com privilégios administrativos para configurar cada nodo. Ou você executa os comandos como usuário <literal>root</literal> ou configura o utilitário <literal>sudo</literal>.

source: The <placeholder-1/> call on openSUSE outputs a warning message when the service uses SysV Init scripts instead of native systemd files. This warning can be ignored.
pt_br: A <placeholder-1/> chamada no openSUSE emite uma mensagem de aviso quando o serviço utiliza scripts init SysV em vez de arquivos nativos do systemd. Este aviso pode ser ignorado.

source: Configure controller node
ko_kr: 컨트롤러 노드 구성
pt_br: Configure o nodo controlador

source: Legacy networking primarily involves compute nodes. However, you must configure the controller node to use legacy networking.
pt_br: A rede legada envolve primeiramente nodos de Computação. Contudo, você deve configurar o nodo controlador para utilizar a rede legada.

source: In the <literal>[DEFAULT]</literal> section, configure the network and security group APIs:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure as APIs de rede e de grupo de segurança:

source: Add the Compute service
pt_br: Adicionar o serviço de Computação

source: Add a networking component
pt_br: Adicionar o componente de rede

source: This chapter explains how to install and configure either OpenStack Networking (neutron), or the legacy <systemitem class="service">nova-network</systemitem> component. The <systemitem class="service">nova-network</systemitem> service enables you to deploy one network type per instance and is suitable for basic network functionality. OpenStack Networking enables you to deploy multiple network types per instance and includes <glossterm baseform="plug-in">plug-ins</glossterm> for a variety of products that support <glossterm>virtual networking</glossterm>.
pt_br: Este capítulo explica como instalar e configurar a Rede OpenStack (neutron), ou o componente legado <systemitem class="service">nova-network</systemitem>. O serviço <systemitem class="service">nova-network</systemitem> permite a você implantar um tipo de rede por instância e é adequado para funcionalidade básica de rede. A Rede OpenStack permite a você implantar múltiplos tipos de rede por instância e inclui <glossterm baseform="plug-in">plug-ins</glossterm> para uma variedade de produtos que suportam <glossterm>virtual networking</glossterm>.

source: For more information, see the <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_networking.html">Networking</link> chapter of the <citetitle>OpenStack Cloud Administrator Guide</citetitle>.
pt_br: Para mais informações, consulte o capítulo de <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_networking.html">Rede</link> do <citetitle>OpenStack Cloud Administrator Guide</citetitle>.

source: Your OpenStack environment now includes the core components necessary to launch a basic instance. You can <link linkend="launch-instance">launch an instance</link> or add more OpenStack services to your environment.
pt_br: Seu ambiente OpenStack agora inclui os componentes centrais necessários ao lançamento de uma instância básica. Você pode <link linkend="launch-instance">lançar uma instância</link> ou adicionar mais serviços OpenStack ao seu ambiente.

source: Launch an instance with OpenStack Networking (neutron)
ko_kr: OpenStack Networking (neutron)에서 인스턴스 실행
pt_br: Lance uma instância com a Rede OpenStack (neutron)

source: Your first instance uses the <literal>default</literal> security group. By default, this security group implements a firewall that blocks remote access to instances. If you would like to permit remote access to your instance, launch it and then <link linkend="launch-instance-neutron-remoteaccess"> configure remote access</link>.
pt_br: Sua primeira instância utiliza o grupo de segurança <literal>default</literal>. Por padrão, este grupo de segurança implementa um firewall que bloqueia o acesso remoto para as instâncias. Se você gostaria de permitir o acesso remoto para sua instância, lance-a e então <link linkend="launch-instance-neutron-remoteaccess"> configure o acesso remoto</link>.

source: Verify the <literal>demo-net</literal> tenant network gateway:
ko_kr: <literal>demo-net</literal> tenant 네트워크 게이트웨이 확인:
pt_br: Verifique o gateway de rede do tenant <literal>demo-net</literal>:

source: Verify the <literal>ext-net</literal> external network:
ko_kr: <literal>ext-net</literal> 외부 네트워크 확인:
pt_br: Verifique a rede externa <literal>ext-net</literal>:

source: Create a <glossterm>floating IP address</glossterm> on the <literal>ext-net</literal> external network:
ko_kr: <literal>ext-net</literal> 외부 네트워크에 <glossterm>유동 IP 주소</glossterm> 생성:
pt_br: Crie um <glossterm>endereço IP flutuante</glossterm> na rede externa <literal>ext-net</literal>:

source: Associate the floating IP address with your instance:
pt_br: Associe o endereço IP flutuante com a sua instância:

source: Check the status of your floating IP address:
pt_br: Verifique o estado de seus endereços IP flutuantes:

source: Install and configure a compute node
pt_br: Instale e configure um nodo de Computação

source: This section describes how to install and configure the Compute service on a compute node. The service supports several <glossterm baseform="hypervisor">hypervisors</glossterm> to deploy <glossterm baseform="instance">instances</glossterm> or <glossterm baseform="virtual machine (VM)">VMs</glossterm>. For simplicity, this configuration uses the <glossterm baseform="Quick EMUlator (QEMU)">QEMU</glossterm> hypervisor with the <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> extension on compute nodes that support hardware acceleration for virtual machines. On legacy hardware, this configuration uses the generic QEMU hypervisor. You can follow these instructions with minor modifications to horizontally scale your environment with additional compute nodes.
pt_br: Esta seção descreve como instalar e configurar o serviço de Computação no nodo de computação. O serviço suporta diversos <glossterm baseform="hypervisor">hypervisors</glossterm> para implantar <glossterm baseform="instance">instâncias</glossterm> ou <glossterm baseform="virtual machine (VM)">VMs</glossterm>. Para simplificar, esta configuração utiliza o hypervisor <glossterm baseform="Quick EMUlator (QEMU)">QEMU</glossterm> com a extensão <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> nos nodos de computação que suportam aceleração de hardware para máquinas virtuais. Em hardwares antigos, esta configuração utiliza o hypervisor QEMU genérico. Você pode seguir estas instruções com pequenas modificações para escalar horizontalmente seu ambiente com nodos de computação adicionais.

source: This section assumes that you are following the instructions in this guide step-by-step to configure the first compute node. If you want to configure additional compute nodes, prepare them in a similar fashion to the first compute node in the <link linkend="architecture_example-architectures">example architectures </link> section using the same networking service as your existing environment. For either networking service, follow the <link linkend="basics-ntp-other-nodes">NTP configuration</link> and <link linkend="basics-packages">OpenStack packages</link> instructions. For OpenStack Networking (neutron), also follow the <link linkend="basics-networking-neutron">OpenStack Networking compute node</link> instructions. For legacy networking (nova-network), also follow the <link linkend="basics-networking-nova">legacy networking compute node</link> instructions. Each additional compute node requires unique IP addresses.
pt_br: Esta seção supõe que você está seguindo as instruções neste guia passo a passo para configurar o nodo de computação. Se você quiser configurar nodos de computação adicionais, prepare-os de maneira similar ao primeiro nodo de computação na seção <link linkend="architecture_example-architectures">arquiteturas de exemplo</link> utilizando o mesmo serviço de rede que já existe em seu ambiente. Para qualquer outro serviço de rede, siga as instruções de <link linkend="basics-ntp-other-nodes">configuração NTP</link> e <link linkend="basics-packages">pacotes OpenStack</link>. Para Rede OpenStack (neutron), siga também as instruções <link linkend="basics-networking-neutron">nodo de computação de Rede OpenStack</link>. Para rede legada (nova-network), siga também as instruções <link linkend="basics-networking-nova">nodo de computação de rede legada</link>. Cada nodo de computação adicional requer endereços IP únicos.

source: To install and configure the Compute hypervisor components
pt_br: Instalar e configurar os componentes de hypervisor de Computação

source: Replace <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> with the IP address of the management network interface on your compute node, typically 10.0.0.31 for the first node in the <link linkend="architecture_example-architectures">example architecture</link>.
pt_br: Substitua <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> com o endereço IP da interface de gerenciamento de rede no seu nodo de Computação, tipicamente 10.0.0.31 para o primeiro nodo na <link linkend="architecture_example-architectures">arquitetura de exemplo</link>.

source: In the <literal>[DEFAULT]</literal> section, enable and configure remote console access:
pt_br: Na seção <literal>[DEFAULT]</literal>, habilite e configure o acesso de console remoto:

source: The server component listens on all IP addresses and the proxy component only listens on the management interface IP address of the compute node. The base URL indicates the location where you can use a web browser to access remote consoles of instances on this compute node.
pt_br: O componente servidor escuta em todos os endereços IP e o componente de proxy somente escuta no endereço IP da interface de gerenciamento no nodo de Computação. A URL base indica a localização onde você pode utilizar um navegador web para acessar consoles remotos de instâncias nesse nodo de Computação.

source: If the web browser to access remote consoles resides on a host that cannot resolve the <replaceable>controller</replaceable> hostname, you must replace <replaceable>controller</replaceable> with the management interface IP address of the controller node.
pt_br: Se o navegador web para acessar consoles remotos está em um host que não pode resolver o hostname do <replaceable>controlador</replaceable>, você deve substituir o <replaceable>controlador</replaceable> pelo endereço IP da interface de gerenciamento do nodo controlador.

source: Ensure the kernel module <literal>nbd</literal> is loaded.
pt_br: Certifique-se de que o módulo de kernel <literal>nbd</literal> está carregado.

source: Ensure the module will be loaded on every boot.
pt_br: Certifique-se de que o módulo será carregado em toda inicialização.

source: On openSUSE by adding <literal>nbd</literal> in the <filename>/etc/modules-load.d/nbd.conf</filename> file.
pt_br: No openSUSE através da adição do <literal>nbd</literal> no arquivo filename>/etc/modules-load.d/nbd.conf</filename>.

source: On SLES by adding or modifying the following line in the <filename>/etc/sysconfig/kernel</filename> file.
pt_br: No SLES através da adição ou modificação da seguinte linha no arquivo <filename>/etc/sysconfig/kernel</filename>.

source: Determine whether your compute node supports hardware acceleration for virtual machines:
pt_br: Determine se seu nodo de Computação suporta aceleração de hardware para máquinas viruais:

source: If this command returns a value of <emphasis>one or greater</emphasis>, your compute node supports hardware acceleration which typically requires no additional configuration.
pt_br: Se este comando retorna um valor de <emphasis>um ou maior</emphasis>, seu nodo de Computação suporta aceleração de hardware a qual, tipicamente não requer configuração adicional.

source: If this command returns a value of <emphasis>zero</emphasis>, your compute node does not support hardware acceleration and you must configure <literal>libvirt</literal> to use QEMU instead of KVM.
pt_br: Se este comando retorna um valor de <emphasis>zero</emphasis>, seu nodo de Computação não suporta aceleração de hardware e você deve configurar <literal>libvirt</literal> para utilizar QEMU em vez de KVM.

source: Edit the <literal>[libvirt]</literal> section in the <filename os="ubuntu;debian">/etc/nova/nova-compute.conf</filename><filename os="rhel;centos;fedora;sles;opensuse">/etc/nova/nova.conf</filename> file as follows:
pt_br: Edite a seção <literal>[libvirt]</literal> nos arquivos <filename os="ubuntu;debian">/etc/nova/nova-compute.conf</filename>,<filename os="rhel;centos;fedora;sles;opensuse">/etc/nova/nova.conf</filename> como segue:

source: Start the Compute service including its dependencies and configure them to start automatically when the system boots:
pt_br: Inicie o serviço de Computação incluindo suas dependências e configure-o para iniciar automaticamente quando o sistema inicializar:

source: Add the Image Service
pt_br: Adicionar o Serviço de Imagem

source: The OpenStack Image Service (glance) enables users to discover, register, and retrieve virtual machine images. It offers a <glossterm baseform="RESTful">REST</glossterm> API that enables you to query virtual machine image metadata and retrieve an actual image. You can store virtual machine images made available through the Image Service in a variety of locations, from simple file systems to object-storage systems like OpenStack Object Storage.
pt_br: O Serviço de Imagem do OpenStack (glance) habilita os usuários a descobrirem, registrarem, e recuperarem imagens de máquinas virtuais. Ele oferece uma API <glossterm baseform="RESTful">REST</glossterm> que habilita você a consultar o metadado da máquina virtual e recuperar uma imagem real. Você pode armazenar imagens de máquinas virtuais disponibilizadas através do Serviço de Imagem em várias localizações, a partir de um simples arquivo até sistemas de armazenamento de objetos como o OpenStack Object Storage.
