Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: You must use at least the No-Op firewall. Otherwise, Horizon and other OpenStack services cannot get and set required VM boot options.
ko_kr: 최소한 No-Op 방화벽 하나는 사용해야 합니다. 그렇지 않으면, Horizon과 다른 OpenStack 서비스가 필요한 VM 부트 옵션을 설정하거나 가져올 수 없습니다.

source: Configure the <acronym>OVS</acronym> plug-in to start on boot.
ko_kr: <acronym>OVS</acronym> 플러그인을 부팅시 시작하도록 설정하십시오.

source: Tell the <acronym>OVS</acronym> plug-in to use GRE tunneling with a <literal>br-int</literal> integration bridge, a <literal>br-tun</literal> tunneling bridge, and a local IP for the tunnel of <replaceable>DATA_INTERFACE</replaceable>'s IP Edit the <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file:
ko_kr: <literal>br-int</literal> 통합 브릿지에 GRE 터널링, <literal>br-tun</literal> 터널링 브릿지, <replaceable>DATA_INTERFACE</replaceable>의 IP 터널용 로컬 IP를 사용할 수 있도록 <acronym>OVS</acronym> 플러그인에 설정해야합니다. <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> 파일을 편집합니다:

source: Configure common components
ko_kr: 일반적인 구성 요소를 구성

source: Configure Networking to use <systemitem class="service">keystone</systemitem> for authentication:
ko_kr: 인증시 <systemitem class="service">keystone</systemitem>을 사용하도록 네트워킹을 구성하십시오:

source: Set the <literal>auth_strategy</literal> configuration key to <literal>keystone</literal> in the <literal>[DEFAULT]</literal> section of the file:
ko_kr: 파일의 <literal>[DEFAULT]</literal> 섹션에서 <literal>keystone</literal>에 사용할 <literal>auth_strategy</literal> 구성 키를 설정합니다:

source: Set the <systemitem class="service">neutron</systemitem> configuration for <systemitem class="service">keystone</systemitem> authentication:
ko_kr: <systemitem class="service">키스톤</systemitem> 인증에 대해 <systemitem class="service">neutron</systemitem> 구성을 설정하십시오:

source: To configure <systemitem class="service">neutron</systemitem> to use <systemitem class="service">keystone</systemitem> for authentication, edit the <filename>/etc/neutron/neutron.conf</filename> file.
ko_kr: <systemitem class="service">keystone</systemitem>를 사용하여 <systemitem class="service">neutron</systemitem> 인증을 구성하려면, <filename>/etc/nova/nova.conf</filename> 파일을 편집하십시오.

source: Add these lines to the <literal>[keystone_authtoken]</literal> section of the file:
ko_kr: 파일에서 <literal>[keystone_authtoken]</literal> 섹션에 다음 줄을 추가하십시오:

source: Configure access to the <application>RabbitMQ</application> service:
ko_kr: <application>RabbitMQ</application> 서비스로의 접근을 설정하십시오:

source: Configure the <application>RabbitMQ</application> access. Edit the <filename>/etc/neutron/neutron.conf</filename> file to modify the following parameters in the <literal>[DEFAULT]</literal> section.
ko_kr: <application>RabbitMQ</application> 접근을 구성합니다. <filename>/etc/neutron/neutron.conf</filename> 파일의 <literal>[DEFAULT]</literal> 섹션에 있는 매개 변수 값을 다음과 같이 편집하십시오.

source: Configure access to the <application>Qpid</application> message queue:
ko_kr: <application>Qpid</application> 메시지 큐 접근을 설정하십시오:

source: guest
ko_kr: 게스트

source: Configure Compute services for Networking
ko_kr: 네트워킹에 대한 Compute 서비스 구성

source: Configure OpenStack Compute to use OpenStack Networking services. Configure the <filename>/etc/nova/nova.conf</filename> file as per instructions below:
ko_kr: 오픈스택 네트워킹 서비스를 사용하도록 오픈스택 처리부를 설정하십시오. 다음 절차를 따라 <filename>/etc/nova/nova.conf</filename> 파일을 설정하십시오:

source: Configure OpenStack Compute to use OpenStack Networking services. Edit the <filename>/etc/nova/nova.conf</filename> file:
ko_kr: 오픈스택 네트워킹 서비스를 사용하려면 오픈스택 처리부를 설정하십시오. <filename>/etc/nova/nova.conf</filename> 파일을 편집하십시오:

source: No matter which firewall driver you chose when you configured the network and compute nodes, you must edit the <filename>/etc/nova/nova.conf</filename> file to set the firewall driver to <literal>nova.virt.firewall.NoopFirewallDriver</literal>. Because OpenStack Networking handles the firewall, this statement instructs Compute to not use a firewall.
ko_kr: 어떤 방화벽 드라이버를 선택하든지, 네트워크와 처리 노드를 설정하면 <filename>/etc/nova/nova.conf</filename> 파일을 편집하여 방화벽 드라이버를 <literal>nova.virt.firewall.NoopFirewallDriver</literal>로 설정해야 합니다. 오픈스택 네트워킹에서 방화벽을 다루기 때문에, 이 구문을 통해 처리부에서 방화벽을 사용하지 못하게 합니다.

source: If you want Networking to handle the firewall, edit the <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file to set the <code>firewall_driver</code> option to the firewall for the plug-in. For example, with <acronym>OVS</acronym>, edit the file as follows:
ko_kr: 네트워킹에서 방화벽을 처리하도록 하려면 <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> 파일을 편집하여 <code>firewall_driver</code> 옵션 값을 플러그인용 방화벽으로 설정하십시오. 예를 들자 <acronym>OVS</acronym>의 경우 다음과 같이 파일을 편집하십시오:

source: If you do not want to use a firewall in Compute or Networking, edit both configuration files and set <code>firewall_driver=nova.virt.firewall.NoopFirewallDriver</code>. Also, edit the <filename>/etc/nova/nova.conf</filename> file and comment out or remove the <code>security_group_api=neutron</code> statement.
ko_kr: 처리부 또는 네트워킹에서 방화벽을 사용하지 않게 하려면, 두 부분의 설정 파일을 편집하여 <code>firewall_driver=nova.virt.firewall.NoopFirewallDriver</code> 값을 설정하십시오. 또한 <filename>/etc/nova/nova.conf</filename> 파일을 편집하여 <code>security_group_api=neutron</code> 구분을 주석 처리하거나 제거하십시오.

source: Otherwise, when you issue <placeholder-1/> commands, the <errortext>ERROR: The server has either erred or is incapable of performing the requested operation. (HTTP 500)</errortext> error might be returned.
ko_kr: 그렇지 않으면 <placeholder-1/> 명령을 실행할 때 <errortext>ERROR: The server has either erred or is incapable of performing the requested operation. (HTTP 500)</errortext> 오류를 반환합니다.

source: The <systemitem class="service">neutron-server</systemitem> initialization script expects a symbolic link <filename>/etc/neutron/plugin.ini</filename> pointing to the configuration file associated with your chosen plug-in. Using Open vSwitch, for example, the symbolic link must point to <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename>. If this symbolic link does not exist, create it using the following commands:
ko_kr: <systemitem class="service">neutron-server</systemitem> 초기화 스크립트는 여러분이 선택한 플러그인이 들어간 설정 파일을 가리키는 <filename>/etc/neutron/plugin.ini</filename> 심볼릭 링크를 찾습니다. 예를 들어 Open vSwitch를 활용할 때 심볼릭 링크는 <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> 파일을 가리켜야 합니다. 이 심볼릭 링크가 없다면 다음 명령을 사용하여 만드십시오:

source: The <systemitem class="service">openstack-neutron</systemitem> initialization script expects the variable <literal>NEUTRON_PLUGIN_CONF</literal> in file <filename>/etc/sysconfig/neutron</filename> to reference the configuration file associated with your chosen plug-in. Using Open vSwitch, for example, edit the <filename>/etc/sysconfig/neutron</filename> file and add the following:
ko_kr: <systemitem class="service">openstack-neutron</systemitem> 초기화 스크립트는 여러분이 선택한 플러그인이 들어간 설정 파일을 참조하는 <filename>/etc/sysconfig/neutron</filename> 파일의 <literal>NEUTRON_PLUGIN_CONF</literal> 변수를 찾습니다. 예를 들어 Open vSwitch를 활용할 때 <filename>/etc/sysconfig/neutron</filename> 파일을 편집하고 다음 내용을 추가하십시오:

source: Restart Networking services.
ko_kr: 네트워킹 서비스를 다시 시작하십시오:

source: Restart the Compute service.
ko_kr: Compute 서비스를 재시작 하십시오.

source: Python 2.6 or 2.7. The Python version must support Django. The Python version should run on any system, including Mac OS X. Installation prerequisites might differ by platform.
ko_kr: 파이썬은 2.6이나 2.7 버전을 사용하십시오. Django에서 지원하는 파이썬 버전이어야 합니다. 파이썬 버전은 맥 OS X을 포함한 어떤 시스템에서든 동작해야 합니다. 사전 설치 조건은 플랫폼마다 다릅니다.

source: Create Identity service credentials for Networking:
ko_kr: 네트워킹에서 사용할 Identity 서비스 credentials 생성:

source: Replace <replaceable>NEUTRON_PASS</replaceable> with a suitable password and <replaceable>neutron@example.com</replaceable> with a suitable e-mail address.
ko_kr: 적당한 암호로 <replaceable>NEUTRON_PASS</replaceable>를 변경하고, 이메일을 <replaceable>neutron@example.com</replaceable>를 변경합니다.

source: Link the <literal>neutron</literal> user to the <literal>service</literal> tenant and <literal>admin</literal> role:
ko_kr: <literal>service</literal> tenant와 <literal>admin</literal> 롤에서 <literal>neutron</literal> 사용자를 연결합니다:

source: Create the <literal>neutron</literal> service:
ko_kr: <literal>neutron</literal> 서비스 생성:

source: Create the service endpoint:
ko_kr: 서비스 endpoint 생성:

source: Configure Networking to use the database:
ko_kr: 테이터베이스를 사용하는 네트워킹 구성:

source: Edit the <filename>/etc/neutron/neutron.conf</filename> file and add the following key to the <literal>[DEFAULT]</literal> section:
ko_kr: <filename>/etc/neutron/neutron.conf</filename> 파일의 <literal>[DEFAULT]</literal> 섹션에서 다음 키를 추가하십시오:

source: Add the following keys to the <literal>[keystone_authtoken]</literal> section:
ko_kr: <literal>[keystone_authtoken]</literal> 섹션에 다음 키를 추가합니다:

source: Configure Networking to use the message broker:
ko_kr: 네트워킹에서 메시지 브로커를 사용하도록 구성:

source: Edit the <filename>/etc/neutron/neutron.conf</filename> file and add the following keys to the <literal>[DEFAULT]</literal> section:
ko_kr: <filename>/etc/neutron/neutron.conf</filename> 파일을 편집하고, <literal>[DEFAULT]</literal> 섹션에 다음 키를 추가합니다:

source: Edit the <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> file:
ko_kr: <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> 파일 편집:

source: Add the following keys to the <literal>[ml2]</literal> section:
ko_kr: <literal>[ml2]</literal> 섹션에 다음 키를 추가합니다:

source: Add the following key to the <literal>[ml2_type_gre]</literal> section:
ko_kr: <literal>[ml2_type_gre]</literal> 섹션에 다음 키를 추가합니다:

source: Define services and API endpoints
ko_kr: 서비스와 API 엔드 포인트 정의

source: So that the Identity Service can track which OpenStack services are installed and where they are located on the network, you must register each service in your OpenStack installation. To register a service, run these commands:
ko_kr: 인증 서비스에서 어떤 오픈스택 서비스가 설치되었는지 네트워크 어딘가에 위치했는지 추적할 수 있으므로, 오픈스택 설치 기반에 각 서비스를 등록해야 합니다. 서비스를 등록하려면 다음 명령을 실행하십시오:

source: <placeholder-1/>. Describes the service.
ko_kr: <placeholder-1/>. 서비스를 설명합니다.

source: <placeholder-1/>. Associates <glossterm baseform="API endpoint">API endpoints</glossterm> with the service.
ko_kr: <placeholder-1/>. 서비스에 <glossterm baseform="API endpoint">API 엔드 포인트</glossterm>를 연결합니다.

source: You must also register the Identity Service itself. Use the <code>OS_SERVICE_TOKEN</code> environment variable, as set previously, for authentication.
ko_kr: 인증 서비스 자체도 등록해야 합니다. 인증을 위해 앞에서 설정한 바와 같이 <code>OS_SERVICE_TOKEN</code> 환경 변수를 사용하십시오.

source: Create a service entry for the Identity Service:
ko_kr: 인증 서비스에 대한 서비스 항목을 만드십시오:

source: The service ID is randomly generated and is different from the one shown here.
ko_kr: 서비스 ID는 임의로 만들어지며 앞서 보신바와는 다릅니다.

source: Specify an API endpoint for the Identity Service by using the returned service ID. When you specify an endpoint, you provide URLs for the public API, internal API, and admin API. In this guide, the <literal>controller</literal> host name is used. Note that the Identity Service uses a different port for the admin API.
ko_kr: 반환 받은 서비스 ID를 사용하여 인증 서비스에 대한 API 엔드 포인트를 지정하십시오. 엔드 포인트를 지정하면 공용 API, 내부 API, 관리자 API의 URL을 제공하십시오. 이 안내서에서는 <literal>controller</literal> 호스트 이름을 사용합니다. 참고로 관리자 API에 대해 인증 서비스에서는 다른 포트 번호를 사용합니다.

source: You will need to create an additional endpoint for each service added to your OpenStack environment. The sections of this guide associated with the installation of each service include the endpoint creation step specific to the service.
ko_kr: 오픈스택 환경에 추가한 각각의 서비스에 대해 추가 엔드 포인트를 만들어야 합ㅈ니다. 이 안내서의 섹션은 서비스와 관련된 엔드 포인트 생성 단계를 포함한 각 서비스 설치 과정과 관련이 있습니다.

source: Verify the Identity Service installation
ko_kr: 인증 서비스 설치 검증하기

source: To verify that the Identity Service is installed and configured correctly, clear the values in the <envar>OS_SERVICE_TOKEN</envar> and <envar>OS_SERVICE_ENDPOINT</envar> environment variables:
ko_kr: 인증 서비스를 올바르게 설치했고 설정했는지 확인하려면 <envar>OS_SERVICE_TOKEN</envar>과<envar>OS_SERVICE_ENDPOINT</envar> 환경 변수의 값을 지우십시오:

source: These variables, which were used to bootstrap the administrative user and register the Identity Service, are no longer needed.
ko_kr: 관리 사용자를 준비하고 인증 서비스를 등록하는데 사용하는 이들 변수는 더이상 필요치 않습니다.

source: You can now use regular user name-based authentication.
ko_kr: 이제 이름 기반 일반 사용자 인증을 활용할 수 있습니다.

source: Request a authentication token by using the <literal>admin</literal> user and the password you chose for that user:
ko_kr: <literal>admin</literal> 사용자와 이 사용자에 대해 지정한 암호를 사용하여 인증 토큰을 요청하십시오:

source: In response, you receive a token paired with your user ID. This verifies that the Identity Service is running on the expected endpoint and that your user account is established with the expected credentials.
ko_kr: 응답으로, 여러분의 사용자 ID에 딸려오는 토큰을 받습니다. 예상했던 엔드포인드에서 실행하는 인증 서비스를 검증하며 여러분의 사용자 계정을 예상했던 인증 정보로 구성했음을 확인합니다.

source: Verify that authorization behaves as expected. To do so, request authorization on a tenant:
ko_kr: 인증 처리가 예상대로 되는지 확인하십시오. 이 동작을 수행하려면 테넌트에서 인증을 요청하십시오:

source: In response, you receive a token that includes the ID of the tenant that you specified. This verifies that your user account has an explicitly defined role on the specified tenant and the tenant exists as expected.
ko_kr: 이에 대한 응답으로 지정한 테넌트의 ID가 들어간 토큰을 받게 됩니다. 이 절차를 통해 여러분의 사용자 계정이 지정한 테넌트에 지정한 역할로 분명히 정의가 되었고 예상대로 테넌트가 존재함을 확인합니다.

source: Source this file to read in the environment variables:
ko_kr: 환경 변수를 읽어들이려면 이 파일에 source 명령을 적용하십시오:

source: The command returns a token and the ID of the specified tenant. This verifies that you have configured your environment variables correctly.
ko_kr: 지정한 tenant 그룹의 토큰과 ID를 반환하는 명령입니다. 이 명령은 환경 변수를 올바르게 설정하였는지 확인합니다.

source: Verify that your admin account has authorization to perform administrative commands:
ko_kr: admin 계정을 통해 관리자 명령을 수행하도록 인증을 획득했는지 확인하십시오:

source: As long as you define your credentials and the Identity Service endpoint through the command line or environment variables, you can run all OpenStack client commands from any machine. For details, see <xref linkend="ch_clients"/>.
ko_kr: 명령과 환경 변수를 통해 credential와 Identity 서비스 엔드 포인트를 정의한만큼, 어떤 머신에서든 모든 OpenStack 클라이언트 명령을 실행할 수 있습니다. 자세한 내용은 <xref linkend="ch_clients"/>를 보십시오.

source: Per-tenant routers with private networks
ko_kr: 사설 네트워크에서 tenant당 라우터 구성

source: This section describes how to install the OpenStack Networking service and its components for a use case that has per-tenant routers with private networks.
ko_kr: 이 섹션에서는 오픈스택 네트워킹 서비스와 구성 요소의 설치 방법을 테넌트별 라우터를 갖춘 비공개 네트워크의 활용 사례를 통해 설명합니다.

source: The following figure shows the setup:
ko_kr: 다음 그림에서 설정 방법을 보여줍니다:

source: As shown in the figure, the setup includes:
ko_kr: 그림에서 보이는 바와 같이 다음 설정을 포함합니다:

source: An interface for management traffic on each node.
ko_kr: 각 노드의 관리 트래픽 인터페이스입니다.

source: Use of the Open vSwitch plug-in.
ko_kr: Open vSwitch 플러그인을 사용합니다.

source: GRE tunnels for data transport on all agents.
ko_kr: 모든 에이전트에서 데이터 전송위해 GRE 터널을 사용합니다.

source: Floating IPs and router gateway ports that are configured in an external network, and a physical router that connects the floating IPs and router gateway ports to the outside world.
ko_kr: 유동 IP와 라우터 게이트웨이 포트는 외부 네트워크에 구성되고, 물리 라우터는 외부 세계에 유동 IP 와 라우터를 연결합니다.

source: Because this example runs a DHCP agent and L3 agent on one node, you must set the <literal>use_namespace</literal> option to <literal>True</literal> in the configuration file for each agent. The default is <literal>True</literal>.
ko_kr: 이 예제에서는 노드에서 DHCP 에이전트와 L3 에이전트를 실행하기 때문에 각 에이전트의 설정 파일에서 <literal>use_namespace</literal> 옵션 값을 <literal>True</literal>로 설정해야 합니다. 기본값은 <literal>True</literal> 입니다.

source: This table describes the nodes:
ko_kr: 다음 표는 각 노드에 대해 설명합니다:

source: Node
ko_kr: 노드

source: Controller Node
ko_kr: 컨트롤러 노드

source: Runs Networking, Identity Service, and all Compute services that are required to deploy VMs (<systemitem class="service">nova-api</systemitem>, <systemitem class="service">nova-scheduler</systemitem>, for example). The node must have at least one network interface, which connects to the Management Network. The host name is <literal>controlnode</literal>, which other nodes resolve to the IP of the controller node.
ko_kr: 가상 머신을 배포하는데 필요한 네트워킹, 인증 서비스, 모든 처리부 서비스를 실행하십시오(예를 들어 <systemitem class="service">nova-api</systemitem>, <systemitem class="service">nova-scheduler</systemitem>가 있습니다). 노드는 최소한 관리 네트워크에 연결하는 하나의 네트워크 인터페이스를 지니고 있어야 합니다. 제어 노드의 IP를 다른 노드가 해석하는데 사용할 호스트 이름은 <literal>controlnode</literal> 입니다.

source: The <systemitem class="service">nova-network</systemitem> service should not be running. This is replaced by Networking.
ko_kr: <systemitem class="service">nova-network</systemitem> 서비스에서 실행할 수 없으며. 네트워킹에서 대체합니다.

source: Compute Node
ko_kr: Compute 노드

source: Runs the Networking L2 agent and the Compute services that run VMs (<placeholder-1/> specifically, and optionally other <placeholder-2/> services depending on configuration). The node must have at least two network interfaces. One interface communicates with the controller node through the management network. The other node is used for the VM traffic on the data network. The VM receives its IP address from the DHCP agent on this network.
ko_kr: 네트워킹 L2 에전트와 VM을 작동시킬 Compute 서비스를 실행합니다 (특히 <placeholder-1/>, 그리고 선택적으로 <placeholder-2/> 서비스를 구성한다면). 노드는 적어도 두개의 네트워크 인터페이스를 가지고 있어야합니다. 하나는 관리 네트워크를 통해 컨트롤러 노드와 통신을 하고, 다른 하나는 데이터 네트워크상의 VM 트래픽으로 사용됩니다. VM이 네트워크 상의 DHCP 에이전트로 부터 IP 주소를 할당받습니다.

source: Network Node
ko_kr: 네트워크 노드

source: Runs Networking L2 agent, DHCP agent and L3 agent. This node has access to the external network. The DHCP agent allocates IP addresses to the VMs on data network. (Technically, the addresses are allocated by the Networking server, and distributed by the dhcp agent.) The node must have at least two network interfaces. One interface communicates with the controller node through the management network. The other interface is used as external network. GRE tunnels are set up as data networks.
ko_kr: 네트워팅 L2 에이전트, DHCP 에이전트, L3 에이전트를 실행합니다. 이 노드에서는 외부 네트워크에 접근할 수 있습니다. DHCP 에이전트느 데이터 네이트워크에서 VM에 IP주소를 할당합니다. (기술적으로 IP 주소는 네트워킹 서버에서 할당하고 DHCP 에지너트는 그냥 분배만 합니다.) 노드는 최소한 두 개의 네트워크 인터페이스가 있어야 합니다. 하나는 관리 네트워크를 통해 컨트롤러 노드와 통신을 하고, 다른 하나는 외부 네트워크를 사용합니다. GRE 터널을 데이터 네트워크에 설정합니다.

source: Router
ko_kr: 라우터

source: Router has IP 30.0.0.1, which is the default gateway for all VMs. The router must be able to access public networks.
ko_kr: 라우터는 모든 VM의 기본 개이트웨이는 IP 30.0.0.1를 가집니다. 라우터는 공인 네트워크로 접근이 가능해야합니다.

source: The use case assumes the following:
ko_kr: 사용 사례에서는 다음을 가정합니다:

source: Relevant Compute services are installed, configured, and running.
ko_kr: 관련된 Compute 서비스를 설치하고, 설정후 작동중입니다.

source: Glance is installed, configured, and running. In addition, an image named <literal>tty</literal> must be present.
ko_kr: 글랜스가 설치/설정되어 실행중입니다. tty 라는 이름의 이미지가 반드시 있어야 합니다.

source: Identity is installed, configured, and running. A Networking user named <emphasis role="bold">neutron</emphasis> should be created on tenant <emphasis role="bold">service</emphasis> with password <replaceable>NEUTRON_PASS</replaceable>.
ko_kr: 아이덴티티를 설치, 설정했고, 실행중입니다. <emphasis role="bold">neutron</emphasis> 네트워킹 사용자를 <emphasis role="bold">service</emphasis> 테넌트에 만들고 암호는 <replaceable>NEUTRON_PASS</replaceable>로 사용해야 합니다.

source: RabbitMQ is running with default guest and password <replaceable>RABBIT_PASS</replaceable>.
ko_kr: RabbitMQ는 기본적으로 guest 사용자와 <replaceable>RABBIT_PASS</replaceable> 암호로 실행합니다.

source: MySQL server (user is <emphasis role="bold">root</emphasis>).
ko_kr: MySQL 서버입니다(사용자는 <emphasis role="bold">root</emphasis>).

source: Additional services: <placeholder-1/>
ko_kr: 추가 서비스: <placeholder-1/>

source: Install and configure Compute.
ko_kr: Compute를 설치하고 구성합니다.

source: Install
ko_kr: 설치

source: Controller node - Networking server
ko_kr: Controller 노드 - 네트워킹 서버

source: Install the Networking server.
ko_kr: 네트워킹 서버를 설치하십시오.

source: Create database <emphasis role="bold">ovs_neutron</emphasis>.
ko_kr: <emphasis role="bold">ovs_neutron</emphasis> 데이터베이스를 만드십시오.

source: Update the Networking configuration file, <filename> /etc/neutron/neutron.conf</filename>, with plug-in choice and Identity Service user as necessary:
ko_kr: 플러그인을 선택하고, 필요한 Identity 서비스 사용자를 <filename> /etc/neutron/neutron.conf</filename> 네트워킹 구성 파일에 업데이트하십시오:

source: Update the plug-in configuration file, <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename>:
ko_kr: 플러그인 설정 파일인 <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename>를 업데이트 하십시오:

source: Start the Networking server.
ko_kr: 네트워킹 서버를 시작하십시오.

source: The Networking server can be a service of the operating system. The command to start the service depends on your operating system. The following command runs the Networking server directly:
ko_kr: 네트워킹 서버는 OS의 서비스일 수 있습니다. 서비스를 시작하는 명령어는 OS에 따라 다릅니다. 다음 명령을 이용하여 직접 네트워크 서버를 실행합니다:

source: Compute node - Compute
ko_kr: Compute 노드 - Compute

source: Install Compute services.
ko_kr: Compute 서비스를 설치하십시오.

source: Update the Compute <filename> /etc/nova/nova.conf</filename> configuration file. Make sure the following line appears at the end of this file:
ko_kr: 처리부의 <filename> /etc/nova/nova.conf</filename> 설정 파일을 업데이트하십시오. 다음 줄을 파일 마지막 부분에 추가했는지 확인하십시오:

source: Restart relevant Compute services.
ko_kr: 연관된 Compute 서비스를 다시 시작하십시오.

source: Compute and Networking node - L2 agent
ko_kr: Compute와 네트워킹 노드 - L2 에이전트

source: Install and start Open vSwitch.
ko_kr: Open vSwitch를 설치하고 시작하십시오.

source: Install the L2 agent (Neutron Open vSwitch agent).
ko_kr: L2 에이전트를 설치하십시오(Neutron Open vSwitch 에이전트).

source: Add the integration bridge to the Open vSwitch:
ko_kr: Open vSwitch에 통합 브릿지를 추가하십시오:

source: Update the Networking configuration file, <filename> /etc/neutron/neutron.conf</filename>:
ko_kr: 네트워킹 구성 파일 <filename> /etc/neutron/neutron.conf</filename>을 업데이트 하십시오:

source: Update the plug-in configuration file, <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename>.
ko_kr: 플러그인 설정 파일인 <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename>를 업데이트 하십시오:

source: Compute node:
ko_kr: Compute 노드:

source: Network node:
ko_kr: 네트워크 노드:

source: Create the integration bridge <emphasis role="bold">br-int</emphasis>:
ko_kr: 통합 브릿지 <emphasis role="bold">br-int</emphasis>를 만드십시오:

source: Start the Networking L2 agent
ko_kr: 네트워킹 L2 에이전트를 시작하십시오

source: The Networking Open vSwitch L2 agent can be a service of the operating system. The command to start depends on your operating system. The following command runs the service directly:
ko_kr: Open vSwitch L2 네트워킹 에이전트는 운영체제의 서비스가 될 수 있습니다. 시작 명령은 운영체제에 따라 다릅니다. 다음 명령은 서비스를 직접 실행합니다:

source: Network node - DHCP agent
ko_kr: 네트워크 노드 - DHCP 에이전트

source: Install the DHCP agent.
ko_kr: DHCP 에이전트를 설치하십시오.

source: Update the Networking configuration file, <filename> /etc/neutron/neutron.conf</filename>
ko_kr: 네트워킹 설정 파일 <filename> /etc/neutron/neutron.conf</filename>을 업데이트하십시오

source: Set <placeholder-1/> because TenantA and TenantC use overlapping subnets.
ko_kr: TenantA와 TenantC가 중복 서브넷을 사용하므로 <placeholder-1/>를 설정하십시오.

source: Update the DHCP <filename> /etc/neutron/dhcp_agent.ini</filename> configuration file:
ko_kr: <filename> /etc/neutron/dhcp_agent.ini</filename> DHCP 설정 파일을 업데이트하십시오:

source: Start the DHCP agent.
ko_kr: DHCP 에이전트를 시작하십시오.

source: The Networking DHCP agent can be a service of operating system. The command to start the service depends on your operating system. The following command runs the service directly:
ko_kr: 네트워킹 DHCP 에이전트는 OS의 서비스일 수 있습니다. 서비스를 시작하는 명령은 OS에 따라 다릅니다. 다음 명령으로 직접 서비스를 실행하십시오:

source: Network node - L3 agent
ko_kr: 네트워크 노드 - L3 에이전트
