Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: The router provides L3 connectivity among private networks. Tenants can reach instances for other tenants (unless you use additional filtering, such as, security groups). With a single router, tenant networks cannot use overlapping IPs. To resolve this issue, the administrator can create private networks on behalf of the tenants.
ko_kr: 라우터는 비공개 네트워크 상에서 L3 연결을 제공합니다. 테넌트는(보안 그룹같은 추가 필터링을 사용하지 않는다면) 다른 테넌트의 인스턴스에 접근할 수 있습니다. 단일 라우터에서는 테넌트 네트워크에서 IP를 중복 적용할 수 없습니다. 이 문제를 해결하기 위해, 관리자는 테넌트의 일부로서 비공개 네트워크를 만들 수 있습니다.

source: Configure Compute services
ko_kr: Compute 서비스 구성

source: Run the following commands on the controller and volume nodes:
ko_kr: 컨트롤러 노드와 볼륨 노드에서 다음 명령어를 실행합니다:

source: On the volume node:
ko_kr: 볼륨 노드에서:

source: In OpenStack, certain user IDs are reserved and used to run specific OpenStack services and own specific OpenStack files. These users are set up according to the distribution packages. The following table gives an overview.
ko_kr: OpenStack에서는 몇 개의 사용자 ID를 확보하여 특정 OpenStack 서비스를 실행하고 특정 OpenStack 파일을 소유하는데 사용합니다. ㅇ 사용자는 배포 패키지에 따라 다르게 설정됩니다. 다음 표에서 그에대한 개요를 보여줍니다.

source: OpenStack Trove Daemons
ko_kr: OpenStack Trove 데몬

source: Unknown FIXME
ko_kr: 알 수 없는 FIXME

source: By default, the <literal>system-config-firewall</literal> automated firewall configuration tool is in place on RHEL. This graphical interface (and a curses-style interface with <literal>-tui</literal> on the end of the name) enables you to configure IP tables as a basic firewall. You should disable it when you work with Neutron unless you are familiar with the underlying network technologies, as, by default, it blocks various types of network traffic that are important to Neutron. To disable it, simple launch the program and clear the <guilabel>Enabled</guilabel> check box.
ko_kr: 기본적으로 <literal>system-config-firewall</literal> 자동화된 방화벽 구성 도구는 RHEL에 들어가 있습니다. 이 그래픽 인터페이스 (와 이름 끝에 <literal>-tui</literal>라 적혀있는 curses 형식의 인터페이스)를 이용하여 기본 방화벽에 대한 IP 테이블를 구성할 수 있습니다. 기본적인 네트워크 기술에 익숙하지 않다면 Neutron으로 작업할때 이 기능을 해제하여 진행하십시오. 방화벽이 Neutron의 중요하고 다양한 유형의 네트워크 트래픽을 차단하기 때문입니다. 비활성화는 쉽습니다. 프로그램 실행하고 <guilabel>Enabled</guilabel> 체크 박스의 표시를 해제해주면 됩니다.

source: After you successfully set up OpenStack with Neutron, you can re-enable and configure the tool. However, during Neutron set up, disable the tool to make it easier to debug network issues.
ko_kr: 뉴트론으로 오픈스택 설정이 완전히 끝나면, 도구를 재활성화하고 설정할 수 있습니다. 그러나, 뉴트론 설정 과정에서 도구를 비활성화 하면 네트워크 문제 디버깅을 쉽게 할 수 있습니다.

source: Before you configure individual nodes for Networking, you must create the required OpenStack components: user, service, database, and one or more endpoints. After you complete these steps on the controller node, follow the instructions in this guide to set up OpenStack Networking nodes.
ko_kr: 각각의 노드에서 네트워킹을 설정하기 전에 사용자, 서비스, 데이터베이스, 하나 이상의 엔드 포인트로 이루어진 오픈스택 구성 요소를 만들어야 합니다. 이 과정을 제어 노드에서 끝내고 나면, 이 안내서의 다음 과정을 따라 오픈스택 네트워킹 노드를 설정하십시오.

source: Create the required user, service, and endpoint so that Networking can interface with the Identity Service.
ko_kr: 필요한 사용자, 서비스 엔드 포인트를 만들어 신원인증 서비스에 네트워킹이 잘 연결되도록 하십시오.

source: Create a <literal>neutron</literal> user:
ko_kr: <literal>neutron</literal> 사용자를 만드십시오:

source: Add the user role to the neutron user:
ko_kr: Neutron 사용자에게 유저 롤 추가:

source: Create the neutron service:
ko_kr: Neutron 서비스 생성:

source: Create a Networking endpoint:
ko_kr: 네트워킹 엔드 포인트를 만드십시오:

source: Install and configure server component
ko_kr: 서버 구성요소를 구성 및 설치

source: Install the server component of Networking and any dependencies.
ko_kr: 네트워킹 서버 구성 요소와 의존하는 요소를 설치하십시오.

source: Configure Networking to connect to the database:
ko_kr: 데이터베이스에 연결하도록 네트워킹을 설정하십시오:

source: Configure Networking to use your MySQL database. Edit the <filename>/etc/neutron/neutron.conf</filename> file and add the following key under the <literal>[database]</literal> section. Replace <replaceable>NEUTRON_DBPASS</replaceable> with the password you chose for the Neutron database.
ko_kr: MySQL 데이터베이스를 사용하도록 네트워킹을 설정하십시오. <filename>/etc/neutron/neutron.conf</filename> 파일을 설정하여 <literal>[database]</literal> 섹션에서 다음 키를 추가하십시오. <replaceable>NEUTRON_DBPASS</replaceable> 값을 뉴트론 데이터베이스에 대해 설정한 암호로 바꾸십시오.

source: Set the <literal>auth_strategy</literal> configuration key to <literal>keystone</literal> in the <literal>DEFAULT</literal> section of the file:
ko_kr: 파일의 <literal>DEFAULT</literal> 섹션에서 <literal>auth_strategy</literal> 설정 키를 <literal>keystone</literal>으로 설정하십시오:

source: Configure Networking to use <systemitem class="service">keystone</systemitem> as the Identity Service for authentication.
ko_kr: 인증 단계에서 <systemitem class="service">keystone</systemitem>을 인증 서비스로 사용하도록 네트워킹을 설정하십시오.

source: Edit the <filename>/etc/neutron/neutron.conf</filename> file and add the file and add the following key under the <literal>[DEFAULT]</literal> section.
ko_kr: <filename>/etc/neutron/neutron.conf</filename> 파일을 편집하고, 파일 추가한 뒤, <literal>[DEFAULT]</literal> 섹션에 다음에 나오는 키를 추가합니다.

source: Add the following keys under the <literal>[keystone_authtoken]</literal> section. Replace <replaceable>NEUTRON_PASS</replaceable> with the password you chose for the Neutron user in Keystone.
ko_kr: <literal>[keystone_authtoken]</literal> 섹션에 다음 키를 추가하십시오. <replaceable>NEUTRON_PASS</replaceable> 값을 키스톤에서 뉴트론 사용자에 대해 설정한 암호로 바꾸십시오.

source: Configure Networking to use your message broker. Edit the <filename>/etc/neutron/neutron.conf</filename> file and add the following keys under the <literal>[DEFAULT]</literal> section.
ko_kr: 여러분이 선택한 메시지 브로커를 사용하도록 네트워킹을 설정하십시오. <filename>/etc/neutron/neutron.conf</filename> 파일을 편집하여 <literal>[DEFAULT]</literal> 섹션에 다음 키를 추가하십시오.

source: Replace <replaceable>RABBIT_PASS</replaceable> with the password you chose for RabbitMQ.
ko_kr: <replaceable>RABBIT_PASS</replaceable> 값을 RabbitMQ에서 지정한 암호로 바꾸십시오.

source: Install and configure Open vSwitch (OVS) plug-in
ko_kr: Open vSwitch (OVS) 플러그인 구성 및 설치

source: Install the Open vSwitch plug-in:
ko_kr: Open vSwitch 플러그인 설치:

source: You must set some common configuration options no matter which networking technology you choose to use with Open vSwitch. You must configure Networking core to use <acronym>OVS</acronym>. Edit the <filename>/etc/neutron/neutron.conf</filename> file:
ko_kr: Open vSwitch와 사용하도록 설정한 네트워크 기술이 어떻게 되든 일반 구성 옵션을 설정해야 합니다. 네트워킹 핵심부에서 <acronym>OVS</acronym>를 사용하도록 설정해야 합니다. <filename>/etc/neutron/neutron.conf</filename> 파일을 편집하십시오:

source: The dedicated controller node does not need to run Open vSwitch or the Open vSwitch agent.
ko_kr: 기존에 구성한 제어 노드에서는 Open vSwitch나 Open vSwitch 에이전트의 실행이 필요하지 않습니다.

source: Configure Compute to use OpenStack Networking services. Configure the <filename>/etc/nova/nova.conf</filename> file as per instructions below:
ko_kr: OpenStack 네트워킹 서비스를 사용하여 Compute를 구성합니다. 다음과 같이 <filename>/etc/nova/nova.conf</filename> 파일을 구성하십시오:

source: Configure Compute to use OpenStack Networking services. Edit the <filename>/etc/nova/nova.conf</filename> file:
ko_kr: OpenStack 네트워킹을 사용하도록 Compute를 구성합니다. <filename>/etc/nova/nova.conf</filename> 파일을 편집하십시오:

source: Regardless of which firewall driver you chose when you configured the network and compute nodes, set this driver as the No-Op firewall. This firewall is a <systemitem class="service">nova</systemitem> firewall, and because <systemitem class="service">neutron</systemitem> handles the Firewall, you must tell <systemitem class="service">nova</systemitem> not to use one.
ko_kr: 네트워크와 처리 노드를 설정하였을 경우 어떤 방화벽 드라이버를 선택했는지와는 상관 없이 이 드라이버를 No-Op 방화벽으로 설정하십시오. 이 방화벽은 <systemitem class="service">nova</systemitem> 방화벽이며, <systemitem class="service">neutron</systemitem>이 방화벽을 다루므로 <systemitem class="service">nova</systemitem> 가 방화벽을 사용하지 않도록 알려야합니다.

source: When Networking handles the firewall, the option <code>firewall_driver</code> should be set according to the specified plug-in. For example with <acronym>OVS</acronym>, edit the <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file:
ko_kr: 네트워킹이 방화벽을 다룰때, 지정한 플러그인에 따라 <code>firewall_driver</code> 옵션을 설정해야 합니다. 예를 들어 <acronym>OVS</acronym>에 대해서라면 <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> 파일을 편집하십시오:

source: If you do not want to use a firewall in Compute or Networking, set <code>firewall_driver=nova.virt.firewall.NoopFirewallDriver</code> in both config files, and comment out or remove <code>security_group_api=neutron</code> in the <filename>/etc/nova/nova.conf</filename> file, otherwise you may encounter <errortext>ERROR: The server has either erred or is incapable of performing the requested operation. (HTTP 500)</errortext> when issuing <placeholder-1/> commands.
ko_kr: 처리부와 네트워킹에서 방화벽을 사용하지 않는다면 각 부분의 설정 파일에서 <code>firewall_driver=nova.virt.firewall.NoopFirewallDriver</code>를 설정하고, <filename>/etc/nova/nova.conf</filename> 파일에서 <code>security_group_api=neutron</code> 항목을 주석처리하거나 제거하십시오. 그렇지 않으면 <placeholder-1/> 명령을 실행할 때 <errortext>ERROR: The server has either erred or is incapable of performing the requested operation. (HTTP 500)</errortext> 오류를 만납니다.

source: Restart the Compute and Networking services:
ko_kr: Compute 서비스와 네트워킹 서비스를 재시작합니다:

source: Network Time Protocol (NTP)
ko_kr: Newtork Time Protocol (NTP)

source: To synchronize services across multiple machines, you must install <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>. The examples in this guide configure the controller node as the reference server and any additional nodes to set their time from the controller node.
ko_kr: 여러대의 머신에 걸쳐 서비스를 동기화 하려면 <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm>를 설치해야 합니다. 이 안내서의 예제에서는 제어 노드를 참조 서버로 설정하며, 다른 어떤 노드의 경우는 제어 노드를 통해 자체 시간을 설정합니다.

source: To retrieve image samples, you must configure the Image Service to send notifications to the bus.
ko_kr: 이미지 샘플을 가져오려면 버스에 알림을 보내기 위해 이미지 서비스를 설정해야합니다.

source: Edit <filename>/etc/glance/glance-api.conf</filename> and modify the <literal>[DEFAULT]</literal> section:
ko_kr: <filename>/etc/glance/glance-api.conf</filename> 파일을 편집하여 <literal>[DEFAULT]</literal> 섹션을 수정하십시오:

source: Restart the Image Services with their new settings:
ko_kr: 새로운 설정을 반영하기 위해서 이미지 서비스 재시작:

source: Two-node architecture with legacy networking (nova-network)
ko_kr: 레거시 네트워킹 (nova-network)을 이용한 두 노드간 아키텍처

source: Restart networking:
ko_kr: 네트워크 재시작:

source: Three-node architecture with OpenStack Networking (neutron)
ko_kr: OpenStack 네트워킹 (Neutron)을 사용하는 세가지 노드 아키텍처

source: Configure network node
ko_kr: 네트워크 노드 구성

source: The management network handles communication among nodes. The data network handles communication coming to and from VMs. The external NIC connects the network node, and optionally to the controller node, so your VMs can connect to the outside world.
ko_kr: 관리 네트워크는 노드간 통신을 다룹니다. 데이터 네트워크에서는 가상 머신에서 트래픽이 오가는 통신을 처리합니다. 외부 NIC에는 네트워크 노드를 연결하며, 추가적으로 제어 노드를 연결하기도 하므로, 가상 머신을 외부 세계로 연결할 수 있습니다.

source: After you successfully set up OpenStack Networking, you can re-enable and configure the tool. However, during Networking set up, disable the tool to make it easier to debug network issues.
ko_kr: 오픈스택 네트워킹 설정이 제대로 끝나면, 도구를 다시 활성화하고 설정할 수 있습니다. 그러나 네트워킹 설정 도중에는 네트워크 문제를 쉽게 파악하기 위해 도구를 비활성화 하십시오.

source: Install agents and configure common components
ko_kr: 에이전트 설치 및 공통 구성요소 구성

source: Install the Networking packages and any dependencies.
ko_kr: 네트워킹 패키지와 의존하는 패키지를 설치하십시오.

source: Respond to prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> settings</link>, <link linkend="debconf-rabbitqm">RabbitMQ credentials</link> and <link linkend="debconf-api-endpoints">API endpoint</link> registration.
ko_kr: <link linkend="debconf-dbconfig-common">데이터베이스 관리</link>, <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> 설정</link>, <link linkend="debconf-rabbitqm">RabbitMQ 인증 정보</link>, <link linkend="debconf-api-endpoints">API 엔드 포인트</link> 등록에 대한 질문에 답하십시오.

source: Configure Networking agents to start at boot time:
ko_kr: 부팅할때 네트워킹 에이전트가 작동할 수 있도록 구성하십시오:

source: Enable packet forwarding and disable packet destination filtering so that the network node can coordinate traffic for the VMs. Edit the <filename>/etc/sysctl.conf</filename> file, as follows:
ko_kr: 패킷 포워딩과 패킷 전달 대상 필터링을 활성화 하여 네트워크 노드가 가상 머신에 대해 트래픽 흐름에 일조하게 할 수 있습니다. 다음과 같이 <filename>/etc/sysctl.conf</filename> 파일을 편집하십시오:

source: Use the <placeholder-1/> command to ensure the changes made to the <filename>/etc/sysctl.conf</filename> file take effect:
ko_kr: <placeholder-1/> 명령을 사용하여 <filename>/etc/sysctl.conf</filename> 파일에 바뀐 내용이 적용되었는지 확인하십시오:

source: It is recommended that the networking service is restarted after changing values related to the networking configuration. This ensures that all modified values take effect immediately:
ko_kr: 네트워크 설정에서 관련 값을 바꾼 후 네트워킹 서비스의 다시 시작을 권장합니다. 이 동작을 통해 바뀐 모든 값의 효과를 바로 확인합니다:

source: Configure the <application>RabbitMQ</application> access. Edit the <filename>/etc/neutron/neutron.conf</filename> file to modify the following parameters in the <literal>DEFAULT</literal> section.
ko_kr: <application>RabbitMQ</application> 접근을 설정하십시오. <literal>DEFAULT</literal> 섹션의 다음 매개 변수를 수정하려면 <filename>/etc/neutron/neutron.conf</filename> 파일을 편집하십시오.

source: Install and configure the Open vSwitch (OVS) plug-in
ko_kr: Open vSwitch (OVS) 플러그인 구성 및 설치

source: Start Open vSwitch:
ko_kr: Open vSwitch를 시작하십시오:

source: And configure it to start when the system boots:
ko_kr: 그리고 시스템을 부팅할 때 시작하도혹 설정하십시오:

source: No matter which networking technology you use, you must add the <literal>br-int</literal> integration bridge, which connects to the VMs, and the <literal>br-ex</literal> external bridge, which connects to the outside world.
ko_kr: 어떤 네트워크 기술을 사용하든지간에, 가상 머신을 연결하는 <literal>br-int</literal> 통합 브릿지와 외부 네트워크를 연결하는 <literal>br-ex</literal> 외부 브릿지를 추가해야 합니다.

source: Add a <glossterm>port</glossterm> (connection) from the <replaceable>EXTERNAL_INTERFACE</replaceable> interface to <literal>br-ex</literal> interface:
ko_kr: <replaceable>EXTERNAL_INTERFACE</replaceable>에서 <literal>br-ex</literal> 인터페이스에 <glossterm>포트</glossterm>(연결)을 추가하십시오:

source: The host must have an IP address associated with an interface other than <replaceable>EXTERNAL_INTERFACE</replaceable>, and your remote terminal session must be associated with this other IP address.
ko_kr: 호스트에는 다른 <replaceable>EXTERNAL_INTERFACE</replaceable> 보다는 인터페이스와 관련된 IP 주소를 가지고 있어야 하며, 원격 터미널 세션에는 여기서 언급한 기타 IP 주소와 연결해야 합니다.

source: If you associate an IP address with <replaceable>EXTERNAL_INTERFACE</replaceable>, that IP address stops working after you issue the <placeholder-1/> command. If you associate a remote terminal session with that IP address, you lose connectivity with the host.
ko_kr: <replaceable>EXTERNAL_INTERFACE</replaceable> 와 IP 주소를 연결하면 해당 IP 주소는 <placeholder-1/> 명령을 실행 후 동작을 멈춥니다. 원격 터미널 세션에 해당 IP 주소를 연결하면 호스트와의 연결을 잃습니다.

source: For more details about this behavior, see the <emphasis>Configuration Problems</emphasis> section of the <link href="http://git.openvswitch.org/cgi-bin/gitweb.cgi?p=openvswitch;a=blob_plain;f=FAQ;hb=HEAD">Open vSwitch FAQ</link>.
ko_kr: 이 상태에 대한 자세한 설명을 원하면, <link href="http://git.openvswitch.org/cgi-bin/gitweb.cgi?p=openvswitch;a=blob_plain;f=FAQ;hb=HEAD">Open vSwitch FAQ</link>에서 <emphasis>Configuration Problems</emphasis> 섹션을 확인하십시오.

source: Configure the <replaceable>EXTERNAL_INTERFACE</replaceable> without an IP address and in promiscuous mode. Additionally, you must set the newly created <literal>br-ex</literal> interface to have the IP address that formerly belonged to <replaceable>EXTERNAL_INTERFACE</replaceable>.
ko_kr: <replaceable>EXTERNAL_INTERFACE</replaceable>를 IP 주소를 포함하지 말고 혼용 모드로 설정하십시오. 또한 표면적으로 <replaceable>EXTERNAL_INTERFACE</replaceable>의 소유가 되도록 새로 만든 <literal>br-ex</literal> 인터페이스에 IP 주소를 설정해야 합니다.

source: Generic Receive Offload (GRO) should not be enabled on this interface as it can cause severe performance problems. It can be disabled with the ethtool utility.
ko_kr: 일반 수신 오프로드(GRO)는 여러가지 성능 문제를 야기하므로 인터페이스 상에서 활성화 하면 안됩니다. ethtool 유틸리티에서 비활성화 할 수 있습니다.

source: Edit the <filename>/etc/sysconfig/network-scripts/ifcfg-EXTERNAL_INTERFACE</filename> file:
ko_kr: <filename>/etc/sysconfig/network-scripts/ifcfg-EXTERNAL_INTERFACE</filename> 파일을 편집하십시오:

source: Create and edit the <filename>/etc/sysconfig/network-scripts/ifcfg-br-ex</filename> file:
ko_kr: <filename>/etc/sysconfig/network-scripts/ifcfg-br-ex</filename> 파일을 만들고 편집하십시오:

source: You must set some common configuration options no matter which networking technology you choose to use with Open vSwitch. Configure the L3 and DHCP agents to use <acronym>OVS</acronym> and namespaces. Edit the <filename>/etc/neutron/l3_agent.ini</filename> and <filename>/etc/neutron/dhcp_agent.ini</filename> files, respectively:
ko_kr: Open vSwitch에서 어떤 네트워크 기술을 사용하든지간에 일반 설정 옵션을 설정해야 합니다. L3와 DHCP 에이전트를 설정하여 <acronym>OVS</acronym>와 이름 공간을 사용하도록 하십시오. <filename>/etc/neutron/l3_agent.ini</filename>와 <filename>/etc/neutron/dhcp_agent.ini</filename> 파일을 각각 편집하십시오:

source: While the examples in this guide enable network namespaces by default, you can disable them if issues occur or your kernel does not support them. Edit the <filename>/etc/neutron/l3_agent.ini</filename> and <filename>/etc/neutron/dhcp_agent.ini</filename> files, respectively:
ko_kr: 이 안내서의 예제에서는 네트워크 이름 공간을 기본적으로 활성화 했지만서도, 문제가 발생했거나 커널에서 네트워크 이름 공간을 지원하지 않는다면 비활성화 할 수 있습니다. <filename>/etc/neutron/l3_agent.ini</filename>, <filename>/etc/neutron/dhcp_agent.ini</filename> 파일을 각각 편집하십시오:

source: Edit the <filename>/etc/neutron/neutron.conf</filename> file to disable overlapping IP addresses:
ko_kr: IP 주소 덮어쓰기를 막기 위해 <filename>/etc/neutron/neutron.conf</filename> 파일을 편집하십시오:

source: Note that when network namespaces are disabled, you can have only one router for each network node and overlapping IP addresses are not supported.
ko_kr: 네트워크 이름공간을 비활성화 했다면 각각의 네트워크 노드에 하나의 라우터만 보유할 수 있으며 IP 주소 중복은 지원하지 않습니다.

source: You must complete additional steps after you create the initial Neutron virtual networks and router.
ko_kr: 처음 Neutron 가상 네트워크와 라우터를 생성한후 추가로 작업을 진행해야 합니다.

source: Similarly, you must also tell Neutron core to use <acronym>OVS</acronym>. Edit the <filename>/etc/neutron/neutron.conf</filename> file:
ko_kr: 이와 비슷하게 <acronym>OVS</acronym>를 사용하려면 뉴트론 핵심부도 호출해야 합니다. <filename>/etc/neutron/neutron.conf</filename> 파일을 편집하십시오:

source: Configure a firewall plug-in. If you do not wish to enforce firewall rules, called <glossterm baseform="security group">security groups</glossterm> by OpenStack, you can use <literal>neutron.agent.firewall.NoopFirewall</literal>. Otherwise, you can choose one of the Networking firewall plug-ins. The most common choice is the Hybrid OVS-IPTables driver, but you can also use the Firewall-as-a-Service driver. Edit the <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file:
ko_kr: 방화벽 플러그인을 설정하십시오. 오픈스택에서 <glossterm baseform="security group">보안 그룹</glossterm>이라고 하는 방화벽 규칙을 강제하지 않으면, <literal>neutron.agent.firewall.NoopFirewall</literal>을 사용할 수 있습니다. 그렇지 않다면, 네트워킹 방화벽 플러그인중 하나를 선택할 수 있습니다. 대부분의 일반적 선택은 Hybrid OVS-IPTables 드라이버의 사용이지만, Firewall-as-a-Service 드라이버도 사용할 수 있습니다. <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> 파일을 편집하십시오:

source: Configure the <acronym>OVS</acronym> plug-in to use GRE tunneling, the <literal>br-int</literal> integration bridge, the <literal>br-tun</literal> tunneling bridge, and a local IP for the <replaceable>DATA_INTERFACE</replaceable> tunnel IP. Edit the <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file:
ko_kr: GRE 터널링, <literal>br-int</literal> 통합 브릿지, <literal>br-tun</literal> 터널링 브릿지, <replaceable>DATA_INTERFACE</replaceable> 터널 IP에 대한 로컬 IP를 사용하기 위해 <acronym>OVS</acronym> 플러그인을 설정하십시오. <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> 파일을 편집하십시오:

source: Configure the agents
ko_kr: 에이전트 구성

source: To perform DHCP on the software-defined networks, Networking supports several different plug-ins. However, in general, you use the <application>dnsmasq</application> plug-in.
ko_kr: 소프트웨어로 정의한 네트워크에서 DHCP 동작을 수행하려는 목적으로, 네트워킹에서는 여러가지 각기 다른 플러그인을 지원합니다. 그러나 일반적으로 <application>dnsmasq</application> 플러그인을 사용합니다.

source: Configure the <filename>/etc/neutron/dhcp_agent.ini</filename> file:
ko_kr: <filename>/etc/neutron/dhcp_agent.ini</filename> 파일을 설정하십시오:

source: To allow virtual machines to access the Compute metadata information, the Networking metadata agent must be enabled and configured. The agent will act as a proxy for the Compute metadata service.
ko_kr: 가상 머신이 처리부 메타데이터 정보에 접근할 수 있도록 하려면 네트워킹 메타데이터 에이전트를 활성화 한 후 설정해야 합니다. 처리부 메타데이터 서비스에 대해 에이전트는 프록시처럼 동작합니다.

source: On the controller, edit the <filename>/etc/nova/nova.conf</filename> file to define a secret key that will be shared between the Compute service and the Networking metadata agent.
ko_kr: Controller에서 <literal>bind-address</literal> 파일을 편집하여, Compute 서비스와 네트워킹 메타데이터 에이전트간에서 사용할 시큐리티 키 정의하십시오.

source: Add to the <literal>[DEFAULT]</literal> section:
ko_kr: <literal>[DEFAULT]</literal> 섹션에 추가하십시오:

source: Set the <literal>neutron_metadata_proxy_shared_secret</literal> key:
ko_kr: <literal>neutron_metadata_proxy_shared_secret</literal> 키 값을 설정하십시오:

source: Restart the <systemitem class="service">nova-api</systemitem> service:
ko_kr: <systemitem class="service">nova-api</systemitem> 서비스를 다시 시작하십시오:

source: On the network node, modify the metadata agent configuration.
ko_kr: 네트워크 노드에서 메타데이터 에이전트 설정을 수정하십시오.

source: Edit the <filename>/etc/neutron/metadata_agent.ini</filename> file and modify the <literal>[DEFAULT]</literal> section:
ko_kr: <filename>/etc/neutron/metadata_agent.ini</filename> 파일을 편집하여 <literal>[DEFAULT]</literal> 섹션을 수정하십시오:

source: Set the required keys:
ko_kr: 필요한 키를 설정하십시오:

source: The value of <literal>auth_region</literal> is case-sensitive and must match the endpoint region defined in Keystone.
ko_kr: <literal>auth_region</literal> 값은 대소문자 구분이 있으며 키스톤에 적용한 엔드 포인트 구역과 일치해야 합니다:

source: If you serve the OpenStack Networking API over HTTPS with self-signed certificates, you must perform additional configuration for the metadata agent because Networking cannot validate the SSL certificates from the service catalog.
ko_kr: 자체 서명 인증서로 HTTPS를 통해 오픈스택 네트워킹 API를 제공받으면, 네트워킹이 서비스 카탈로그에서 SSL 인증서를 검증할 수 없으므로 메타데이터 에이전트에 대한 추가 설정을 수행해야 합니다.

source: Add this statement to the <literal>[DEFAULT]</literal> section:
ko_kr: 아래 구문을 <literal>[DEFAULT]</literal> 섹션에 추가하십시오:

source: Single flat network
ko_kr: 단일 플랫 네트워크

source: This section describes how to install the OpenStack Networking service and its components for a single flat network use case.
ko_kr: 이번 섹션에서는 단일 플랫 네트워크를 사용할 경우, OpenStack 네트워킹 서비스와 그 구성 요소를 설치하는 방법을 설명합니다.

source: The following diagram shows the set up. For simplicity, all nodes should have one interface for management traffic and one or more interfaces for traffic to and from VMs. The management network is 100.1.1.0/24 with controller node at 100.1.1.2. The example uses the Open vSwitch plug-in and agent.
ko_kr: 다음 다이어그램은 설치 과정을 보여줍니다. 간단하게, 모든 노드는 트래픽 관리를 위해 하나의 인터페이스를 지니고 있고 가상 머신과의 오고가는 트래픽을 위해 하나 이상의 인터페이스를 추가로 지니고 있어야 합니다. 관리 네트워크는 100.1.1.2에 제어 노드를 둔 100.1.1.0/24입니다. 예제에서는 오픈 vSwitch 플러그인과 에이전트를 사용합니다.

source: You can modify this set up to make use of another supported plug-in and its agent.
ko_kr: 이 설정을 수정하여 다른 지원 플러그인과 에이전트를 사용할 수 있습니다.

source: The following table describes some nodes in the set up:
ko_kr: 다음 표는 설치상 일부 노드에 대해 설명합니다:
