Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: OpenStack uses a <glossterm>message broker</glossterm> to coordinate operations and status information among services. The message broker service typically runs on the controller node. OpenStack supports several message brokers including <application>RabbitMQ</application>, <application>Qpid</application>, and <application>ZeroMQ</application>. However, most distributions that package OpenStack support a particular message broker. This guide covers the RabbitMQ message broker which is supported by each distribution. If you prefer to implement a different message broker, consult the documentation associated with it.
pt_br: O OpenStack utiliza um <glossterm>intermediador de mensagens</glossterm> para coordenar operações e informações de status entre serviços. O serviço de intermediador de mensagens roda no nodo controlador. O OpenStack suporta vários intermediadores de mensagens, incluindo <application>RabbitMQ</application>, <application>Qpid</application>, e <application>ZeroMQ</application>. Contudo, a maioria das distribuições que empacotam o OpenStack suportam um intermediador de mensagens particular. Este guia cobre o intermediador de mensagens RabbitMQ que é suportado por cada distribuição. Se você preferir implementar um intermediador de mensagens diferente, consulte a documentação associada a ele.

source: To install the <application>RabbitMQ</application> message broker service
pt_br: Para instalar o serviço de intermediador de mensagem <application>RabbitMQ</application>

source: To configure the message broker service
ko_kr: 메시지 브로커 서비스 구성
pt_br: Par configurar o serviço de intermediador de mensagem

source: Start the message broker service and configure it to start when the system boots:
pt_br: Inicie o serviço de intermediador de mensagem e configure-o para iniciar quando o sistema inicializar:

source: The message broker creates a default account that uses <literal>guest</literal> for the username and password. To simplify installation of your test environment, we recommend that you use this account, but change the password for it.
pt_br: O intermediador de mensagens cria uma conta padrão que utiliza <literal>guest</literal> para nome de usuário e senha. Para simplificar a instalação do seu ambiente de teste, recomendamos que você utilize esta conta, mas altere a senha para ela.

source: Run the following command:
ko_kr: 다음 명령을 실행하십시오:
pt_br: Execute o seguinte comando:

source: Replace <replaceable>RABBIT_PASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>RABBIT_PASS</replaceable> com uma senha adequada.

source: You must configure the <literal>rabbit_password</literal> key in the configuration file for each OpenStack service that uses the message broker.
pt_br: Você deve configurar a chave do <literal>rabbit_password</literal> no arquivo de configuração para cada serviço OpenStack que utiliza o intermediador de mensagem.

source: For production environments, you should create a unique account with a suitable password. For more information on securing the message broker, see the <link href="https://www.rabbitmq.com/man/rabbitmqctl.1.man.html">documentation</link>.
pt_br: Para ambientes de produção, você deve criar uma conta única com uma senha adequada. Para mais informações sobre como proteger o intermediador de mensagens, consulte a <link href="https://www.rabbitmq.com/man/rabbitmqctl.1.man.html">documentação</link>.

source: If you decide to create a unique account with a suitable password for your test environment, you must configure the <literal>rabbit_userid</literal> and <literal>rabbit_password</literal> keys in the configuration file of each OpenStack service that uses the message broker.
pt_br: Se você decidir criar uma conta única com uma senha adequada para seu ambiente de teste, você deve configurar as chaves <literal>rabbit_userid</literal> e <literal>rabbit_password</literal> no arquivo de configuração de cada serviço OpenStack que utilize o intermediador de mensagens.

source: Restart the message broker service:
pt_br: Reinicie o serviço de intermediador de mensagens:

source: This section describes how to install and configure the Telemetry module, code-named ceilometer, on the controller node. The Telemetry module uses separate agents to collect measurements from each OpenStack service in your environment.
pt_br: Esta seção descreve como instalar e configurar o módulo de Telemetria, apelidado de ceilometer, no nodo controlador. O módulo de Telemetria utiliza agentes separados para coletar medições a partir de cada serviço OpenStack em seu ambiente.

source: Before you install and configure Telemetry, you must install <application>MongoDB</application>, create a MongoDB database, service credentials, and API endpoints.
pt_br: Antes de instalar e configurar a Telemetria, você deve instalar o <application>MongoDB</application>, criar uma base de dados MongoDB, credenciais de serviço, e endpoints de API.

source: Enable the Open Build Service repositories for MongoDB based on your openSUSE or SLES version:
pt_br: Habilite os repositórios Open Build Service para MongoDB baseado em sua versão openSUSE ou SLES:

source: The packages are signed by GPG key <literal>562111AC05905EA8</literal>. You should verify the fingerprint of the imported GPG key before using it.
pt_br: Os pacotes são assinados por chave GPG <literal>562111AC05905EA8</literal>. Você deve verificar a impressão digital das chaves GPG importadas antes de utilizá-las.

source: Install the MongoDB package:
pt_br: Instale o pacote MongoDB:

source: Edit the <filename>/etc/mongodb.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/mongodb.conf</filename> e complete as seguintes ações:

source: Configure the <literal>bind_ip</literal> key to use the management interface IP address of the controller node.
pt_br: Configure a chave <literal>bind_ip</literal> para utilizar o endereço IP da interface de gerenciamento do nodo controlador.

source: By default, MongoDB creates several 1GB journal files in the /var/lib/mongodb/journal directory. If you want to reduce the size of each journal file to 128MB and limit total journal space consumption to 512MB, assert the smallfiles key:
pt_br: Por padrão, o MongoDB cria vários arquivos journal de 1GB no diretório /var/lib/mongodb/journal. Se você quiser reduzir o tamanho de cada arquivo de journal para 128MB e limitar o consumo toral de espaço de journal para 512MB, marque a chave smallfiles:

source: If you change the journaling configuration, stop the MongoDB service, remove the initial journal files, and start the service:
pt_br: Se você alterar a configuração de journaling, pare o serviço MongoDB, remova os arquivos iniciais de journal e inicie o serviço:

source: You can also disable journaling. For more information, see the <link href="http://docs.mongodb.org/manual/">MongoDB manual</link>.
pt_br: Você pode também desabilitar o journaling. Para mais informações, consulte o <link href="http://docs.mongodb.org/manual/">manual do MongoDB</link>.

source: Restart the MongoDB service:
pt_br: Reinicie o serviço do MongoDB:

source: Start the MongoDB services and configure them to start when the system boots:
pt_br: Inicie os serviços do MongoDB e configure-os para iniciar quando o sistema inicializar:

source: Create the <literal>ceilometer</literal> database:
pt_br: Crie a base de dados do <literal>ceilometer</literal>:

source: Replace <replaceable>CEILOMETER_DBPASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>CEILOMETER_DBPASS</replaceable> com uma senha adequada.

source: Create the <literal>ceilometer</literal> user:
pt_br: Crie o usuário <literal>ceilometer</literal>:

source: Replace <replaceable>CEILOMETER_PASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>CEILOMETER_PASS</replaceable> com uma senha adequada.

source: Add the <literal>admin</literal> role to the <literal>ceilometer</literal> user.
pt_br: Adicione o papel <literal>admin</literal> ao usuário <literal>ceilometer</literal>.

source: Create the <literal>ceilometer</literal> service entity:
pt_br: Crie a entidade de serviço <literal>ceilometer</literal>:

source: Create the Telemetry module API endpoints:
pt_br: Criar os endpoints de API do módulo de Telemetria:

source: Before you install and configure Telemetry, you must install <application>MongoDB</application>.
pt_br: Antes de você instalar e configurar a Telemetria, você deve instalar o <application>MongoDB</application>.

source: To install and configure the Telemetry module components
pt_br: Para instalar e configurar os componentes do módulo de Telemetria

source: Generate a random value to use as the metering secret:
pt_br: Gere valores randômicos para utilizar como secret de medição:

source: Replace <replaceable>CEILOMETER_DBPASS</replaceable> with the password you chose for the Telemetry module database. You must escape special characters such as ':', '/', '+', and '@' in the connection string in accordance with RFC2396.
pt_br: Substitua <replaceable>CEILOMETER_DBPASS</replaceable> com a senha que você escolheu para a base de dados do módulo de Telemetria. Você deve evitar caracteres especiais tais como ':', '/', '+', e '@' na string de conexão de acordo com a RFC2396.

source: Replace <replaceable>CEILOMETER_PASS</replaceable> with the password you chose for the <literal>celiometer</literal> user in the Identity service.
pt_br: Substitua <replaceable>CEILOMETER_PASS</replaceable> com a senha que você escolheu para o usuário <literal>celiometer</literal> no Serviço de Identidade.

source: Replace <replaceable>METERING_SECRET</replaceable> with the metering secret that you generated in a previous step.
pt_br: Substitua <replaceable>METERING_SECRET</replaceable> com o segredo de medição que você gerou no passo anterior.

source: In the <literal>[collector]</literal> section, configure the dispatcher:
pt_br: Na seção <literal>[collector]</literal>, configure o disparador:

source: Restart the Telemetry services:
pt_br: Reinicie os serviços de Telemetria:

source: Start the Telemetry services and configure them to start when the system boots:
pt_br: Inicie os serviços de Telemetria e configure-os para iniciar quando o sistema inicializar:

source: Create the service entity and API endpoint
pt_br: Criar a entidade de serviço e o endpoint de API

source: After you create tenants, users, and roles, you must create the <glossterm>service</glossterm> entity and <glossterm baseform="API endpoint">API endpoints</glossterm> for the Identity service.
pt_br: Depois de criar tenants, usuários, e papéis, você deve criar a entidade de <glossterm>serviço</glossterm> e <glossterm baseform="API endpoint">os endpoints de API</glossterm> para o Serviço de Identidade.

source: Set the <envar>OS_SERVICE_TOKEN</envar> and <envar>OS_SERVICE_ENDPOINT</envar> environment variables, as described in <xref linkend="keystone-users"/>.
pt_br: Defina as variáveis de ambiente <envar>OS_SERVICE_TOKEN</envar> e <envar>OS_SERVICE_ENDPOINT</envar>, como descrito em <xref linkend="keystone-users"/>.

source: To create the service entity and API endpoints
pt_br: Para criar a entidade de serviço e os endpoints de API

source: The Identity service manages a catalog of services in your OpenStack environment. Services use this catalog to locate other services in your environment.
pt_br: O Serviço de Identidade gerencia um catálogo de serviços em seu ambiente OpenStack. Os serviços utilizam este catálogo para localizar outros serviços em seu ambiente.

source: Create the service entity for the Identity service:
pt_br: Criar a entidade de serviço para o Serviço de Identidade:

source: The Identity service manages a catalog of API endpoints associated with the services in your OpenStack environment. Services use this catalog to determine how to communicate with other services in your environment.
pt_br: O Serviço de Identidade gerencia um catálogo de endpoints de API associados com os serviços em seu ambiente OpenStack. Os serviços utilizam este catálogo para determinar como se comunicar com outros serviços em seu ambiente.

source: OpenStack provides three API endpoint variations for each service: admin, internal, and public. In a production environment, the variants might reside on separate networks that service different types of users for security reasons. Also, OpenStack supports multiple regions for scalability. For simplicity, this configuration uses the management network for all endpoint variations and the <literal>regionOne</literal> region.
pt_br: O OpenStack fornece três variações de endpoints de API para cada serviço: admin, internal, e public. Em um ambiente de produção, as variantes podem residir em redes separadas que servem diferentes tipos de usuários por razões de segurança. Adicionalmente, o OpenStack suporta múltiplas regiões para escalabilidade. Para simplificar, esta configuração utiliza a rede de gerenciamento para todas as variações de endpoints e a região <literal>regionOne</literal>.

source: Create the Identity service API endpoints:
pt_br: Crie os endpoints de API do Serviço de Identidade:

source: This command references the ID of the service that you created in the previous step.
pt_br: Este comando referencia o ID do serviço que você criou no passo anterior.

source: Each service that you add to your OpenStack environment requires adding information such as API endpoints to the Identity service. The sections of this guide that cover service installation include steps to add the appropriate information to the Identity service.
pt_br: Cada serviço que você adiciona ao seu ambiente OpenStack requer a adição de informações tais como endpoints de API para o Serviço de Identidade. As seções deste guia que cobrem a instalação de serviços, incluem passos para adicionar a informação apropriada para o serviço de Identidade.

source: Register API endpoints
ko_kr: API 엔드 포인트 등록
pt_br: Registre os endpoints da API

source: All Debian packages for API services, except the <package>heat-api</package> package, register the service in the Identity Service catalog. This feature is helpful because API endpoints are difficult to remember.
ko_kr: <package>heat-api</package> 꾸러미를 제외한 API 서비스에 대한 모든 데비안 꾸러미는 인증 서비스 카탈로그에 서비스를 등록합니다. 이 기능은 API 엔드 포인트를 기억해놓기 어렵기 때문에 유용합니다.
pt_br: Todos os pacotes Debian para serviços de API, exceto o pacote <package>heat-api</package>, registram o serviço no catálogo do Serviço de Identidade. Essa característica é útil porque os endpoints da API são difíceis de lembrar.

source: The <package>heat-common</package> package and not the <package>heat-api</package> package configures the Orchestration service.
ko_kr: <package>heat-api</package> 꾸러미가 아닌 <package>heat-common</package> 꾸러미로 오케스트레이션 서비스를 설정하십시오.
pt_br: O pacote <package>heat-common</package> e não o pacote <package>heat-api</package> configura o serviço de orquestração.

source: When you install a package for an API service, you are prompted to register that service. However, after you install or upgrade the package for an API service, Debian immediately removes your response to this prompt from the <package>debconf</package> database. Consequently, you are prompted to re-register the service with the Identity Service. If you already registered the API service, respond <literal>no</literal> when you upgrade.
ko_kr: API 서비스에 대한 꾸러미를 설치할 때 서비스를 등록할지 여부를 확인합니다. 그러나 API 서비스에 대한 꾸러미를 설치하거나 업그레이드를 하고 나면 데비안에서는 이 프롬프트에 대한 응답을 <package>debconf</package> 데이터베이스에서 제거합니다. 결과적으로 인증 서비스로 서비스를 다시 등록할지 여부를 묻게 됩니다. API 서비스에 이미 등록했다면 업그레이드시 <literal>no</literal>로 답하십시오.
pt_br: Quando você instala um pacote para um serviço de API, você será solicitado a registrar esse serviço. No entanto, depois que você instala ou atualiza um pacote para um serviço de API, o Debian imediatamente remove sua resposta à essa solicitação do banco de dados <package>debconf</package>. Consequentemente, você será solicitado a registrar novamente o serviço com o Serviço de Identidade. Se você já registrou o serviço de API, responda <literal>no</literal> quando você atualizar.

source: This screen registers packages in the Identity Service catalog:
ko_kr: 이 화면에서는 인증 서비스 카탈로그에 꾸러미를 등록합니다:
pt_br: Essa tela registra pacotes no catálogo do Serviço de Identidade:

source: You are prompted for the Identity Service <literal>admin_token</literal> value. The Identity Service uses this value to register the API service. When you set up the <package>keystone</package> package, this value is configured automatically.
ko_kr: 인증 서비스의 <literal>admin_token</literal> 값을 물어봅니다. 인증 서비스는 API 서비스에 등록하는데 이 값을 사용합니다. <package>keystone</package> 꾸러미를 설정할 때 이 값을 자동으로 설정합니다.
pt_br: Você será solicitado pelo Serviço de Identidade a fornecer o valor <literal>admin_token</literal>. O Serviço de Identidade usa esse valor para registrar o serviço de API. Quando você configura o pacote <package>keystone</package>, esse valor é configurado automaticamente.

source: This screen configures the IP addresses for the service. The configuration script automatically detects the IP address used by the interface that is connected to the default route (<code>/sbin/route</code> and <code>/sbin/ip</code>).
ko_kr: 이 화면에서는 서비스의 IP 주소를 설정합니다. 설정 스크립트에서는 기본 라우트에 연결한 인터페이스에서 사용하는 IP 주소(<code>/sbin/route</code>와 <code>/sbin/ip</code> 사용)를 감지합니다.
pt_br: Essa tela configura o endereço IP para o serviço. O script de configuração automaticamente detecta o endereço IP usado pela interface que está conectada à rota default (<code>/sbin/route</code> e <code>/sbin/ip</code>).

source: Unless you have a unique set up for your network, press <keycap>ENTER</keycap>.
ko_kr: 네트워크에 유일한 설정 내용을 보유하고 있지 않다면 <keycap>ENTER</keycap>를 누르십시오.
pt_br: A menos que você tenha uma configuração única para sua rede, pressione <keycap>ENTER</keycap>.

source: This screen configures the region name for the service. For example, <code>us-east-coast</code> or <code>europe-paris</code>.
ko_kr: 이 화면에서는 서비스 지역 이름을 설정합니다. 예를 들어 <code>us-east-coast</code> 또는 <code>europe-paris</code>입니다.
pt_br: Essa tela configura o nome da região para o serviço. Por exemplo, <code>us-east-coast</code> ou <code>europe-paris</code>.

source: The Debian package post installation scripts will then perform the below commands for you:
pt_br: Os scripts do pacote de pós-instalação do Debian irão, então, realizar os comandos abaixo para você:

source: The values of <literal>AUTH_TOKEN</literal>, <literal>KEYSTONE_ENDPOINT_IP</literal>, <literal>PKG_ENDPOINT_IP</literal> and <literal>REGION_NAME</literal> depend on the answer you will provide to the debconf prompts. But the values of <literal>SERVICE_NAME</literal>, <literal>SERVICE_TYPE</literal>, <literal>SERVICE_DESC</literal> and <literal>SERVICE_URL</literal> are already pre-wired in each package, so you don't have to remember them.
pt_br: Os valores de <literal>AUTH_TOKEN</literal>, <literal>KEYSTONE_ENDPOINT_IP</literal>, <literal>PKG_ENDPOINT_IP</literal> e <literal>REGION_NAME</literal> dependem da resposta que você irá fornecer para as perguntas do debconf. Mas os valores de <literal>SERVICE_NAME</literal>, <literal>SERVICE_TYPE</literal>, <literal>SERVICE_DESC</literal> e <literal>SERVICE_URL</literal> já são pré-fixados em cada pacote, portanto você não tem que se lembrar deles.

source: Architecture
ko_kr: 아키텍처
pt_br: Arquitetura

source: Overview
ko_kr: 개요
pt_br: Visão Geral

source: The <glossterm>OpenStack</glossterm> project is an open source cloud computing platform that supports all types of cloud environments. The project aims for simple implementation, massive scalability, and a rich set of features. Cloud computing experts from around the world contribute to the project.
pt_br: O projeto <glossterm>OpenStack</glossterm> é uma plataforma de computação em nuvem de código aberto que suporta todos os tipos de ambientes de nuvem. O projeto visa à uma implementação simples, escalabilidade massiva, e um rico conjunto de características. Especialistas em computação em nuvem em todo o mundo contribuem para o projeto.

source: OpenStack provides an Infrastructure-as-a-Service (<glossterm>IaaS</glossterm>) solution through a variety of complemental services. Each service offers an application programming interface (<glossterm>API</glossterm>) that facilitates this integration. The following table provides a list of OpenStack services:
pt_br: O OpenStack fornece uma solução de Infraestrutura como Serviço (<glossterm>IaaS</glossterm>) através de uma variedade de serviços complementares. Cada serviço oferece uma interface de programação de aplicativo (<glossterm>API</glossterm>) que facilita esta integração. A seguinte tabela fornece uma lista de serviços OpenStack:

source: This guide describes how to deploy these services in a functional test environment and, by example, teaches you how to build a production environment. Realistically, you would use automation tools such as Ansible, Chef, and Puppet to deploy and manage a production environment.
pt_br: Este guia descreve como implantar estes serviços em um ambiente de teste funcional, através de exemplos, o ensina como construir um ambiente de produção. Realisticamente, você usaria ferramentas de automação como o Ansible, Chef, e Puppet para implantar e gerenciar um ambiente de produção.

source: Conceptual architecture
ko_kr: 개념의 아키텍처
pt_br: Arquitetura conceitual

source: Launching a virtual machine or instance involves many interactions among several services. The following diagram provides the conceptual architecture of a typical OpenStack environment.
pt_br: O lançamento de uma máquina virtual ou instância envolve muitas interações entre diversos serviços. O diagrama seguinte fornece a arquitetura conceitual de um ambiente OpenStack típico.

source: Example architectures
ko_kr: 예제 아키텍처
pt_br: Arquiteturas de exemplo

source: OpenStack is highly configurable to meet different needs with various compute, networking, and storage options. This guide enables you to choose your own OpenStack adventure using a combination of core and optional services. This guide uses the following example architectures:
pt_br: O OpenStack é altamente configurável para atender a diferentes necessidades com várias opções de computação, rede, e armazenamento. Este guia o habilita a escolher sua própria aventura OpenStack, utilizando uma combinação de serviços principais e opcionais. Este guia utiliza as seguintes arquiteturas de exemplo:

source: Three-node architecture with OpenStack Networking (neutron) and optional nodes for Block Storage and Object Storage services.
pt_br: Arquitetura de três nodos com nodo OpenStack Networking (neutron) e nodos opcionais para serviços Block Storage e Object Storage.

source: The <glossterm baseform="cloud controller node">controller node</glossterm> runs the Identity service, Image Service, management portions of Compute and Networking, Networking plug-in, and the dashboard. It also includes supporting services such as a SQL database, <glossterm>message queue</glossterm>, and <glossterm>Network Time Protocol (NTP)</glossterm>.
pt_br: O <glossterm baseform="cloud controller node">nodo controlador</glossterm> executa o Serviço de Identidade, Serviço de Imagem, partes do gerenciamento da Computação e da Rede, plug-in de Rede, e o dashboard. Ele inclui também, serviços como um banco de dados SQL, <glossterm>fila de mensagens</glossterm>, e <glossterm>Network Time Protocol (NTP)</glossterm>.
