Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: By default, the <systemitem>openstack-dashboard</systemitem> package enables a database as session store. Before you continue, either change the session store set up as described in <xref linkend="dashboard-sessions"/> or finish the setup of the database session store as explained in <xref linkend="dashboard-session-database"/>.
ko_kr: 기본적으로 <systemitem>openstack-dashboard</systemitem> 꾸러미에서는 데이터베이스를 세션 저장소롤 활성화 했습니다. <xref linkend="dashboard-sessions"/> 에서 설명한대로 세션 저장소 설정을 바꾸거나 <xref linkend="dashboard-session-database"/>에서 설명한 대로 데이터베이스 세션 저장소의 설정을 마무리 하십시오.

source: Ensure that the SELinux policy of the system is configured to allow network connections to the HTTP server.
ko_kr: 시스템의 SELinux 정책에서 HTTP 서버로의 네트워크 연결을 허용했는지 확인하십시오.

source: Start the Apache web server and memcached:
ko_kr: 아파치 웹 서버와 memcached를 시작하십시오:

source: You can now access the dashboard at <uri os="ubuntu">http://controller/horizon</uri><uri os="debian">https://controller/</uri><uri os="centos;fedora;rhel">http://controller/dashboard</uri><uri os="opensuse;sles">http://controller</uri>.
ko_kr: 이제 <uri os="ubuntu">http://controller/horizon</uri><uri os="debian">https://controller/</uri><uri os="centos;fedora;rhel">http://controller/dashboard</uri><uri os="opensuse;sles">http://controller</uri>의 대시보드에 접근할 수 있습니다.

source: Login with credentials for any user that you created with the OpenStack Identity Service.
ko_kr: OpenStack Identity 서비스에서 만든 임의의 사용자의 인증 정보를 사용하여 로그인하십시오.

source: To install the message broker service
ko_kr: 메시지 브로커 서비스 설치

source: Ubuntu and Debian use <application>RabbitMQ</application>.
ko_kr: Ubuntu와 Debian에서는 <application>RabbitMQ</application>를 사용합니다.

source: Red Hat Enterprise Linux (RHEL), CentOS, Scientific Linux, and Fedora use <application>Qpid</application>.
ko_kr: Red Hat Enterprise Linux (RHEL), CentOS, Scientific Linux, Fedora에서는 <application>Qpid</application>를 사용합니다.

source: SUSE Linux Enterprise Server (SLES) and openSUSE use <application>RabbitMQ</application>.
ko_kr: SUSE Linux Enterprise Server (SLES)와 openSUSE에서는 <application>RabbitMQ</application>를 사용합니다.

source: Start the message broker service:
ko_kr: 메시지 브로커 서비스 시작:

source: Configure the message broker service to start when the system boots:
ko_kr: 시스템 부팅할 때 메시지 브로커 서비스가 시작하도록 구성:

source: Congratulations, now you are ready to install OpenStack services!
ko_kr: 고생하셨습니다. 이제 오픈스택 서비스를 설치할 차례가 되었습니다.

source: EXTERNAL_NETWORK_CIDR
ko_kr: EXTERNAL_NETWORK_GATEWAY

source: Install the Orchestration service
ko_kr: Orchestration 서비스 설치

source: Install the Orchestration module on the controller node:
ko_kr: 컨트롤러 노드에 Orchestration 모듈을 설치하십시오:

source: Respond to prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken"><systemitem>[keystone_authtoken]</systemitem> settings</link>, <link linkend="debconf-rabbitqm">RabbitMQ credentials</link> and <link linkend="debconf-api-endpoints">API endpoint</link> registration.
ko_kr: <link linkend="debconf-dbconfig-common">데이터베이스 관리</link>, <link linkend="debconf-keystone_authtoken"><systemitem>[keystone_authtoken]</systemitem> 설정</link>, <link linkend="debconf-rabbitqm">RabbitMQ 인증 정보</link>와 <link linkend="debconf-api-endpoints">API 엔드 포인트</link> 등록에 대한 물음에 답하십시오.

source: In the configuration file, specify the location of the database where the Orchestration service stores data. These examples use a MySQL database with a <literal>heat</literal> user on the controller node. Replace <replaceable>HEAT_DBPASS</replaceable> with the password for the database user:
ko_kr: 설정 파일에서 오케스트레이션 서비스가 데이터를 어디에 저장할지 데이터베이스 위치를 지정하십시오. 이 예제에서는 제어 노드에서 MySQL 데이터베이스, <literal>heat</literal> 사용자를 활용합니다. <replaceable>HEAT_DBPASS</replaceable> 값을 데이터베이스 사용자 암호로 바꾸십시오:

source: Edit <filename>/etc/heat/heat.conf</filename> and modify the <literal>[database]</literal> section:
ko_kr: <filename>/etc/heat/heat.conf</filename>에서 <literal>[database]</literal> 섹션을 수정하십시오:

source: By default, the Ubuntu packages create an SQLite database. Delete the <filename>heat.sqlite</filename> file that was created in the <filename>/var/lib/heat/</filename> directory so that it does not get used by mistake:
ko_kr: 기본 Ubuntu 패키지는 SQLite 데이터베이스를 사용하여 생성합니다. <filename>/var/lib/heat/</filename>에 있는 <filename>heat.sqlite</filename> 파일을 삭제하여 실수로 사용하는 일이 없도록 하십시오:

source: Use the password that you set previously to log in as <literal>root</literal> and create a <literal>heat</literal> database user:
ko_kr: 앞서 <literal>root</literal>로 로그인할 때 설정한 암호를 사용하고 <literal>heat</literal> 데이터베이스 사용자를 만드십시오:

source: Create the heat service tables:
ko_kr: Heat 서비스 테이블을 생성하십시오:

source: Ignore <errortext>DeprecationWarning</errortext> errors.
ko_kr: <errortext>DeprecationWarning</errortext> 오류는 무시하십시오.

source: The Ubuntu packages do not correctly set up logging. Edit the <filename>/etc/heat/heat.conf</filename> file and change the <literal>[DEFAULT]</literal> section:
ko_kr: Ubuntu 패키지는 로깅에 대한 설정이 정확하게 되어있지 않습니다. <filename>/etc/heat/heat.conf</filename>파일의 <literal>[DEFAULT]</literal> 세션을 수정하십시오:

source: Configure the Orchestration Service to use the RabbitMQ message broker.
ko_kr: RabbitMQ 메시지 브로커를 사용하려면 오케스트레이션 서비스를 설정하십시오.

source: Edit <filename>/etc/heat/heat.conf</filename> and modify the <literal>[DEFAULT]</literal> section:
ko_kr: <filename>/etc/heat/heat.conf</filename>를 편집하여 <literal>[DEFAULT]</literal> 섹션을 수정하십시오:

source: Create a <literal>heat</literal> user that the Orchestration service can use to authenticate with the Identity Service. Use the <literal>service</literal> tenant and give the user the <literal>admin</literal> role:
ko_kr: 오케스트레이션 서비스에서 인증 서비스에 인증하는데 사용할 수 있도록 <literal>heat</literal> 사용자를 만드십시오. <literal>service</literal> 테넌트를 사용하고 <literal>admin</literal> 역할을 부여하십시오:

source: Register the Heat and CloudFormation APIs with the Identity Service so that other OpenStack services can locate these APIs. Register the services and specify the endpoints:
ko_kr: 다른 OpenStack 서비스에서 이들 API를 찾을 수 있도록 Identity 서비스에 대한 Heat와 CloudFormation API를 등록합니다. 서비스에 등록하고 endpoint를 작성합니다:

source: Start the <systemitem class="service">heat-api</systemitem>, <systemitem class="service">heat-api-cfn</systemitem> and <systemitem class="service">heat-engine</systemitem> services and configure them to start when the system boots:
ko_kr: <systemitem class="service">heat-api</systemitem>, <systemitem class="service">heat-api-cfn</systemitem>, <systemitem class="service">heat-engine</systemitem> 서비스를 시작하고 시스템을 부팅할 때 시작하도록 설정하십시오:

source: Telemetry provides an API service that provides a collector and a range of disparate agents. This procedure details how to install the agent that runs on the compute node.
ko_kr: 텔레메트리는 다양한 종류의 에이전트와 수집기를 제공하는 API 서비스가 있습니다. 이 프로시저는 처리 노드에서 실행하는 에이전트를 어떻게 설치하는지 세세히 다룹니다.

source: Install the Telemetry service on the compute node:
ko_kr: Compute 노드에 Telemetry 서비스 설치:

source: Set the following options in the <filename>/etc/nova/nova.conf</filename> file:
ko_kr: <filename>/etc/nova/nova.conf</filename> 파일의 옵션을 다음과 같이 설정하십시오:

source: The <option>notification_driver</option> option is a multi valued option, which <application>openstack-config</application> cannot set properly. See <xref linkend="basics-packages"/>.
ko_kr: <option>notification_driver</option> 옵션은 <application>openstack-config</application>가 적절하게 설정할 수 없는 값을 여러개 갖는 옵션입니다. <xref linkend="basics-packages"/>를 보십시오.

source: Edit the <filename>/etc/nova/nova.conf</filename> file and add the following lines to the <literal>[DEFAULT]</literal> section:
ko_kr: <filename>/etc/nova/nova.conf</filename> 파일의 <literal>[DEFAULT]</literal> 섹션에 다음 내용을 추가하십시오:

source: You must set the secret key that you defined previously. The Telemetry service nodes share this key as a shared secret:
ko_kr: 이전에 정의한 비밀키를 설정해야 합니다. 텔레메트리 서비스 노드는 공유 비밀로서의 키를 공유합니다:

source: Edit the <filename>/etc/ceilometer/ceilometer.conf</filename> file and change these lines in the <literal>[publisher]</literal> section. Replace <replaceable>CEILOMETER_TOKEN</replaceable> with the ceilometer token that you created previously:
ko_kr: <filename>/etc/ceilometer/ceilometer.conf</filename> 파일에서 <literal>[publisher]</literal> 세션을 편집합니다. <replaceable>CEILOMETER_TOKEN</replaceable>의 값을 앞어 만든 ceilometer token으로 변경합니다:

source: Configure the QPid access:
ko_kr: QPid 접근을 구성합니다:

source: Add the Identity service credentials:
ko_kr: Identity 서비스에 credential를 추가합니다:

source: Start the service and configure it to start when the system boots:
ko_kr: 서비스를 시작하고 시스템 부팅시 시작하도록 설정하십시오:

source: Neutron deployment use cases
ko_kr: Neutron 구성 사용 사례

source: This section describes how to configure the Networking service and its components for some typical use cases.
ko_kr: 이번 섹션에서는 몇 가지 일반적인 사용 사례에 대한 네트워킹 서비스와 그 구성요소를 구성하는 방법을 설명합니다.

source: Configure a compute node
ko_kr: Compute 노드 구성

source: The Compute service relies on a hypervisor to run virtual machine instances. OpenStack can use various hypervisors, but this guide uses KVM.
ko_kr: Compute 서비스에서 가상 머신 인스턴스를 구동하기 위해서는 하이퍼바이저가 필요합니다. OpenStack에서는 다양한 하이퍼바이저를 사용할 수 있으나, 이 가이드에서는 KVM을 사용합니다.

source: When prompted to create a <literal>supermin</literal> appliance, respond <placeholder-1/>.
ko_kr: <literal>supermin</literal> appliance를 만들겠느냐는 질문을 만나면, <placeholder-1/>라고 답하십시오.

source: The controller node has the <package>openstack-proxy-node</package> and <package>openstack-toaster</package> meta-packages that install <package>openstack-proxy-node</package> and <package>openstack-toaster</package> at the same time.
ko_kr: 제어 노드에는 <package>openstack-proxy-node</package>와 <package>openstack-toaster</package>를 동시에 설치하는 <package>openstack-proxy-node</package>와 <package>openstack-toaster</package> 메타 꾸러미가 있습니다.

source: Respond to the prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> settings</link>, <link linkend="debconf-rabbitqm">RabbitMQ credentials</link>, and <link linkend="debconf-api-endpoints">API endpoint</link> registration.
ko_kr: <link linkend="debconf-dbconfig-common">데이터베이스 관리</link>, <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> 설정</link>, <link linkend="debconf-rabbitqm">RabbitMQ 인증 정보</link>, <link linkend="debconf-api-endpoints">API 엔드 포인트</link> 등록에 대한 질문에 답하십시오

source: For security reasons, the Linux kernel is not readable by normal users which restricts hypervisor services such as qemu and libguestfs. For details, see <link href="https://bugs.launchpad.net/ubuntu/+source/linux/+bug/759725">this bug</link>. To make the current kernel readable, run: <placeholder-1/> To also enable this override for all future kernel updates, create the file <filename>/etc/kernel/postinst.d/statoverride</filename> containing:<placeholder-2/> Remember to make the file executable: <placeholder-3/>
ko_kr: 보안상의 이유로, 리눅스 커널은 qemu와 libguestfs같은 하이퍼바이저 서비스를 제한하는 일반 사용자들이 접근할 수 없습니다. 자세한 내용은 <link href="https://bugs.launchpad.net/ubuntu/+source/linux/+bug/759725">이 문제</link>를 살펴보십시오. 현재 커널을 볼 수 있게 하려면 <placeholder-1/> 을(를) 실행하십시오. 또한 앞으로의 최신 커널에도 적용할 수 있게 하려면 <placeholder-2/> 내용이 들어있는 <filename>/etc/kernel/postinst.d/statoverride</filename> 파일을 만드십시오. 파일을 실행 가능하게 만드는것 또한 잊지 마십시오: <placeholder-3/>

source: Edit the <filename>/etc/nova/nova.conf</filename> configuration file:
ko_kr: <filename>/etc/nova/nova.conf</filename> 구성 파일을 편집하십시오:

source: Edit the <filename>/etc/nova/nova.conf</filename> configuration file and add these lines to the appropriate sections:
ko_kr: <filename>/etc/nova/nova.conf</filename>를 수정하여 적당한 섹션에 다음 내용을 추가하십시오:

source: Configure Compute to provide remote console access to instances.
ko_kr: 인스턴스에 접근할 원격 콘솔을 제공하도록 처리부를 설정하십시오.

source: Edit <filename>/etc/nova/nova.conf</filename> and add the following keys under the <literal>[DEFAULT]</literal> section:
ko_kr: <filename>/etc/nova/nova.conf</filename> 파일을 수정하여 <literal>[DEFAULT]</literal> 섹션에 다음 키를 추가하십시오:

source: Specify the host that runs the Image Service.<phrase os="ubuntu;debian"> Edit <filename>/etc/nova/nova.conf</filename> file and add these lines to the <literal>[DEFAULT]</literal> section:</phrase>
ko_kr: 이미지 서비스를 실행할 호스트를 지정하십시오. <phrase os="ubuntu;debian"><filename>/etc/nova/nova.conf</filename> 파일을 편집하여 다음 줄을 <literal>[DEFAULT]</literal> 섹션에 추가하십시오:</phrase>

source: Remove the SQLite database created by the packages:
ko_kr: 꾸러미가 만든 SQLite 데이터베이스를 제거하십시오:

source: Start the Compute service and configure it to start when the system boots:
ko_kr: Compute 서비스를 시작하고 시스템 부팅할 때 시작하도록 설정합니다:

source: Install the Image Service
ko_kr: 이미지 서비스 설치

source: The OpenStack Image Service acts as a registry for virtual disk images. Users can add new images or take a snapshot of an image from an existing server for immediate storage. Use snapshots for back up and as templates to launch new servers. You can store registered images in Object Storage or in other locations. For example, you can store images in simple file systems or external web servers.
ko_kr: 오픈스택 이미지 서비스는 가상 디스크 이미지 레지스트리 처럼 동작합니다. 사용자는 새 이미지를 추가하거나 순간의 저장소에 대해 기존의 서버에 스냅샷을 취할 수 있습니다. 새 서버를 실행할 템플릿으로서 또한 백업용도로서 스냅샷을 사용하십시오. 오브젝트 저장소또는 다른 위치에 등록한 이미지를 저장할 수 있습니다. 예를 들어, 단순 파일 시스템 또는 외부 웹 서버에 이미지를 저장할 수 있습니다.

source: This procedure assumes you set the appropriate environment variables to your credentials as described in <xref linkend="keystone-verify"/>.
ko_kr: 이 절차에서는 <xref linkend="keystone-verify"/>에서 설명한 바와 같이 인증정보에 환경 변수를 이미 설정했음을 가정합니다.

source: Install the Image Service on the controller node:
ko_kr: 제어 노드에 이미지 서비스를 설치하십시오:

source: Respond to prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> settings</link>, <link linkend="debconf-rabbitqm">RabbitMQ credentials</link> and <link linkend="debconf-api-endpoints">API endpoint</link> registration. You must also select the caching type:
ko_kr: <link linkend="debconf-dbconfig-common">데이터베이스 관리</link>, <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> 설정</link>, <link linkend="debconf-rabbitqm">RabbitMQ 인증 정보</link>, <link linkend="debconf-api-endpoints">API 엔드 포인트</link> 등록에 대한 질문에 답하십시오. 캐싱 형식도 반드시 선택해야 합니다:

source: The Image Service stores information about images in a database. The examples in this guide use the MySQL database that is used by other OpenStack services.
ko_kr: 이미지 서비스는 이미지 정보를 데이터베이스에 저장합니다. 이 안내서의 예제에서는 다른 오픈스택 서비스에서 사용하는 MySQL 데이터베이스를 사용합니다.

source: Configure the location of the database. The Image Service provides the <systemitem class="service">glance-api</systemitem> and <systemitem class="service">glance-registry</systemitem> services, each with its own configuration file. You must update both configuration files throughout this section. Replace <replaceable>GLANCE_DBPASS</replaceable> with your Image Service database password.
ko_kr: 데이터베이스 위치를 설정하십시오. 이미지 서비스에서는 <systemitem class="service">glance-api</systemitem>서비스와 <systemitem class="service">glance-registry</systemitem>서비스를 제공하는데 각각의 서비스에는 자체 설정 파일이 있습니다. 이 장에서 언급한 두 파일을 업데이트 해야 합니다. <replaceable>GLANCE_DBPASS</replaceable>의 값을 이미지 서비스 데이터베이스 암호로 바꾸십시오.

source: By default, the Ubuntu packages create an SQLite database. Delete the <filename>glance.sqlite</filename> file created in the <filename>/var/lib/glance/</filename> directory so that it does not get used by mistake:
ko_kr: 기본적으로 Ubuntu 패키지는 SQLite 데이터베이스를 생성합니다. <filename>/var/lib/glance/</filename> 디렉토리에 <filename>glance.sqlite</filename> 파일이 생성되니 삭제하여, 실수로 사용하는 일이 없도록 하십시오:

source: Use the password you created to log in as root and create a <literal>glance</literal> database user:
ko_kr: 루트로 로그인하려고 만든 암호를 사용하여 <literal>glance</literal> 데이터베이스 사용자를 만드십시오:

source: Create the database tables for the Image Service:
ko_kr: 이미지 서비스에 데이터베이스 테이블을 만드십시오:

source: Configure the Image Service to use the Identity Service for authentication.
ko_kr: 인증 절차에 인증 서비스를 사용하기 위해 이미지 서비스를 설정하십시오.

source: Run the following commands and replace <replaceable>GLANCE_PASS</replaceable> with the password you chose for the <literal>glance</literal> user in the Identity Service:
ko_kr: 다음 명령을 실행하여 <replaceable>GLANCE_PASS</replaceable> 값은 인증 서비스에서 <literal>glance</literal> 사용자가 사용할 암호로 바꾸십시오:

source: Start the <systemitem class="service">glance-api</systemitem> and <systemitem class="service">glance-registry</systemitem> services and configure them to start when the system boots:
ko_kr: <systemitem class="service">glance-api</systemitem>서비스와 <systemitem class="service">glance-registry</systemitem>서비스를 시작하고 시스템을 부팅할 때 이 서비스를 시작하도록 설정하십시오:

source: The <package>dbconfig-common</package> package provides a standard Debian interface that enables you to configure Debian database parameters. It includes localized prompts for many languages and it supports the OpenStack database back ends: SQLite, MySQL, and PostgreSQL.
ko_kr: <package>dbconfig-common</package> 꾸러미에서는 데비안 데이터베이스 매개 변수를 설정할 수 있도록 표준 데비안 인터페이스를 제공합니다. 다양한 언어로 번역한 프롬프트가 들어있으며 오픈스택 데이터베이스 백엔드 SQLite, MySQL, PostgreSQL을 지원합니다.

source: By default, the <package>dbconfig-common</package> package configures the OpenStack services to use SQLite3. So if you use <package>debconf</package> in non-interactive mode and without pre-seeding, the OpenStack services that you install use SQLite3.
ko_kr: 기본적으로 <package>dbconfig-common</package> 꾸러미는 SQLite3를 사용하도록 오픈스택 서비스를 설정합니다. 비 대화식 방식으로 <package>debconf</package>를 사용하여 데이터베이스를 먼저 준비하지 않는다면, 설치한 오픈스택 서비스에서 SQLite3를 사용합니다.

source: The Identity Service is installed with MySQL as the database back end, <literal>keystonedb</literal> as database name, and the localhost socket file.
ko_kr: 인증 서비스는 MySQL을 백엔드 데이터베이스로 하여 설치하며, <literal>keystonedb</literal>를 데이터베이스 이름으로 하고 로컬 호스트 소켓 파일을 만듭니다.

source: The <package>cinder-common</package> package displays these screens:
ko_kr: <package>cinder-common</package> 꾸러미는 다음 화면을 보여줍니다:

source: To access a MySQL server remotely, you must make it accessible as root from a remote server. To do so, run the <package>openstack-proxy-node</package> package command:
ko_kr: MySQL 서버를 원격으로 접근하려면 원격 서버에서 루트 계정으로 접근할 수 있게 해야 합니다. 이렇게 하려면 <package>openstack-proxy-node</package> 꾸러미 명령을 실행하십시오:

source: You must enable remote access before you install OpenStack services.
ko_kr: 오픈스택 서비스를 설치하기 전에 원격 접근을 활성화해야 합니다.

source: Install the Identity Service
ko_kr: 인증 서비스 설치

source: Install the OpenStack Identity Service on the controller node, together with <application>python-keystoneclient</application> (which is a dependency):
ko_kr: <application>python-keystoneclient</application> (Identity 서비스에 의존성이 있습니다.) 와 함께, 컨트롤러 노드에 OpenStack Identity 서비스를 설치합니다:

source: Answer to the <systemitem class="library">debconf</systemitem> and <systemitem class="library">dbconfig-common</systemitem> questions for setting-up the database.
ko_kr: 데이터베이스 설정에 대한 <systemitem class="library">debconf</systemitem>와 <systemitem class="library">dbconfig-common</systemitem> 질문에 답하십시오.

source: The Identity Service uses a database to store information. Specify the location of the database in the configuration file. In this guide, we use a MySQL database on the controller node with the username <literal>keystone</literal>. Replace <literal><replaceable>KEYSTONE_DBPASS</replaceable></literal> with a suitable password for the database user.
ko_kr: Identity 서비스는 정보 저장을 위해 데이터베이스를 사용합니다. 설정 파일에서 데이터베이스 위치를 지정합니다. 이 가이드에서는 사용자 이름이 <literal>keystone</literal>인 컨트롤러 노드에 있는 MySQL 데이터베이스를 사용합니다. <literal><replaceable>KEYSTONE_DBPASS</replaceable></literal> 값을 데이터베이스 사용자 암호로 변경하십시오.

source: By default, the Ubuntu packages create a SQLite database. Delete the <filename>keystone.db</filename> file created in the <filename>/var/lib/keystone/</filename> directory so that it does not get used by mistake:
ko_kr: 기본적으로 우분투 패키지는 SQLite 데이터베이스를 생성합니다. <filename>/var/lib/keystone/</filename> 디렉토리에 <filename>keystone.db</filename> 파일이 생성되니 삭제하여, 실수로 사용하는 일이 없도록 하십시오:

source: Use the password that you set previously to log in as root. Create a <literal>keystone</literal> database user:
ko_kr: 루트 사용자로 로그인 하기 위해 이전에 설정했던 암호를 사용하십시오. <literal>keystone</literal> 데이터베이스 사용자를 만드십시오:

source: Create the database tables for the Identity Service:
ko_kr: Identity 서비스에 대한 데이터베이스 테이블을 만드십시오:

source: Define an authorization token to use as a shared secret between the Identity Service and other OpenStack services. Respond to the <package>debconf</package> prompt with the value in the <code>admin_token</code> directive in the <filename>keystone.conf</filename> file. Use the <placeholder-1/> command to generate this password.
ko_kr: 인증 서비스와 기타 오픈스택 서비스에서 공유 비밀로 사용할 인증 토큰을 지정하십시오. <filename>keystone.conf</filename> 파일에서 <code>admin_token</code> 지시어의 값을 <package>debconf</package> 질문에 응답하십시오. 이 암호를 만들려면 <placeholder-1/> 명령을 사용하십시오.

source: Later, you can verify that the <filename>/etc/keystone/keystone.conf</filename> file contains the password you have set using <package>debconf</package>: <placeholder-1/>
ko_kr: <filename>/etc/keystone/keystone.conf</filename> 파일에 <package>debconf</package>를 사용하여 설정한 암호가 들어있는지 확인할 수 있습니다: <placeholder-1/>

source: If you omit a password (for example by pressing Enter at the <package>debconf</package> prompt, or installing Keystone using the Debconf non-interactive mode) the package generates a random <literal>ADMIN_TOKEN</literal> value.
ko_kr: 암호를 생략하면 (예를 들어 <package>debconf</package> 프롬프트에서 엔터키를 누르거나, debconf 비대화식 모드를 통해 키스톤을 설치할 경우) 꾸러미는 설치과정에서 임의의 <literal>ADMIN_TOKEN</literal> 값을 만듭니다.

source: Respond to the prompts to create an administrative tenant:
ko_kr: 관리 테넌트를 만들기 위한 질문에 답하십시오:

source: If this is the first time you have installed the Identity Service, register the Identity Service in the service catalog:
ko_kr: 인증 서비스를 설치한 이후로 처음이라면 서비스 카탈로그에 인증 서비스를 등록하십시오:

source: Define an authorization token to use as a shared secret between the Identity Service and other OpenStack services. Use <placeholder-1/> to generate a random token and store it in the configuration file:
ko_kr: 인증 서비스와 기타 오픈스택 서비스에서 공유 비밀로 사용할 인증 토큰을 지정하십시오. 임의 토큰을 만들려면 <placeholder-1/>을(를) 사용하고 설정 파일에 넣으십시오:

source: For SUSE Linux Enterprise use instead as first command:
ko_kr: SUSE Linux Enterprise에서는 다음 명령으로 처음 사용하십시오:

source: Restart the Identity Service:
ko_kr: 인증 서비스 다시 시작:

source: Start the Identity Service and enable it to start when the system boots:
ko_kr: 인증 서비스를 시작하고 시스템 부팅시 시작하도록 설정하십시오:

source: Verify the installation
ko_kr: 설치 확인

source: You can run these commands from the proxy server or any server that has access to the Identity Service.
ko_kr: 프록시 서버나 Identity 서비스에 접근할 수 있는 서버에서 이 명령을 실행할 수 있습니다.

source: Run the following <placeholder-1/> command:
ko_kr: 다음 <placeholder-1/> 명령을 실행하십시오:

source: Run the following <placeholder-1/> commands to upload files to a container. Create the <filename>test.txt</filename> and <filename>test2.txt</filename> test files locally if needed.
ko_kr: 컨테이너에 파일을 업로드하도록 다음 <placeholder-1/> 명령을 실행하십시오. 필요한 경우 로컬에 <filename>test.txt</filename>, <filename>test2.txt</filename> 테스트 파일을 만들어두십시오.

source: Run the following <placeholder-1/> command to download all files from the <literal>myfiles</literal> container:
ko_kr: <literal>myfiles</literal> 컨테이너에서 모든 파일을 다운로드하도록 다음 <placeholder-1/> 명령을 실행하십시오:

source: Install and configure the proxy node
ko_kr: 프록시 노드 설치 및 구성
