Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: The following table provides a list of services that require passwords and their associated references in the guide: <table rules="all"><caption>Passwords</caption><thead><tr><th>Password name</th><th>Description</th></tr></thead><tbody><tr><td>Database password (no variable used)</td><td>Root password for the database</td></tr><tr><td><literal><replaceable>RABBIT_PASS</replaceable></literal></td><td>Password of user guest of RabbitMQ</td></tr><tr><td><literal><replaceable>KEYSTONE_DBPASS</replaceable></literal></td><td>Database password of Identity service</td></tr><tr><td><literal><replaceable>DEMO_PASS</replaceable></literal></td><td>Password of user <literal>demo</literal></td></tr><tr><td><literal><replaceable>ADMIN_PASS</replaceable></literal></td><td>Password of user <literal>admin</literal></td></tr><tr><td><literal><replaceable>GLANCE_DBPASS</replaceable></literal></td><td>Database password for Image Service</td></tr><tr><td><literal><replaceable>GLANCE_PASS</replaceable></literal></td><td>Password of Image Service user <literal>glance</literal></td></tr><tr><td><literal><replaceable>NOVA_DBPASS</replaceable></literal></td><td>Database password for Compute service</td></tr><tr><td><literal><replaceable>NOVA_PASS</replaceable></literal></td><td>Password of Compute service user <literal>nova</literal></td></tr><tr><td><literal><replaceable>DASH_DBPASS</replaceable></literal></td><td>Database password for the dashboard</td></tr><tr><td><literal><replaceable>CINDER_DBPASS</replaceable></literal></td><td>Database password for the Block Storage service</td></tr><tr><td><literal><replaceable>CINDER_PASS</replaceable></literal></td><td>Password of Block Storage service user <literal>cinder</literal></td></tr><tr><td><literal><replaceable>NEUTRON_DBPASS</replaceable></literal></td><td>Database password for the Networking service</td></tr><tr><td><literal><replaceable>NEUTRON_PASS</replaceable></literal></td><td>Password of Networking service user <literal>neutron</literal></td></tr><tr><td><literal><replaceable>HEAT_DBPASS</replaceable></literal></td><td>Database password for the Orchestration service</td></tr><tr><td><literal><replaceable>HEAT_PASS</replaceable></literal></td><td>Password of Orchestration service user <literal>heat</literal></td></tr><tr><td><literal><replaceable>CEILOMETER_DBPASS</replaceable></literal></td><td>Database password for the Telemetry service</td></tr><tr><td><literal><replaceable>CEILOMETER_PASS</replaceable></literal></td><td>Password of Telemetry service user <literal>ceilometer</literal></td></tr><tr><td><literal><replaceable>TROVE_DBPASS</replaceable></literal></td><td>Database password of Database service</td></tr><tr><td><literal><replaceable>TROVE_PASS</replaceable></literal></td><td>Password of Database Service user <literal>trove</literal></td></tr></tbody></table>
pt_br: A seguinte tabela fornece uma lista de serviços que requerem senhas e suas referências associadas no guia: <table rules="all"><caption>Senhas</caption><thead><tr><th>nome da Senha</th><th>Descrição</th></tr></thead><tbody><tr><td>Senha de Banco de Dados (não usa variável)</td><td> Senha de root para o banco de dados</td></tr><tr><td><literal><replaceable>RABBIT_PASS</replaceable></literal></td><td>Senha de visitante para o RabbitMQ</td></tr><tr><td><literal><replaceable>KEYSTONE_DBPASS</replaceable></literal></td><td>Senha de banco de dados para o Serviço de Identificação</td></tr><tr><td><literal><replaceable>DEMO_PASS</replaceable></literal></td><td>Senha do usuário <literal>demo</literal></td></tr><tr><td><literal><replaceable>ADMIN_PASS</replaceable></literal></td><td>Senha do usuário <literal>admin</literal></td></tr><tr><td><literal><replaceable>GLANCE_DBPASS</replaceable></literal></td><td>Senha de Banco de Dados para o serviço de Imagem</td></tr><tr><td><literal><replaceable>GLANCE_PASS</replaceable></literal></td><td>Senha para o usuário do serviço de Imagem <literal>glance</literal></td></tr><tr><td><literal><replaceable>NOVA_DBPASS</replaceable></literal></td><td>Senha de Banco de Dados para o serviço e Computação</td></tr><tr><td><literal><replaceable>NOVA_PASS</replaceable></literal></td><td>Senha para o serviço de Computação <literal>nova</literal></td></tr><tr><td><literal><replaceable>DASH_DBPASS</replaceable></literal></td><td>Senha de Banco de Dados para o Dashboard</td></tr><tr><td><literal><replaceable>CINDER_DBPASS</replaceable></literal></td><td>Senha de Banco de Dados para o serviço de Block Storage </td></tr><tr><td><literal><replaceable>CINDER_PASS</replaceable></literal></td><td>Senha para o usuário de Block Storage <literal>cinder</literal></td></tr><tr><td><literal><replaceable>NEUTRON_DBPASS</replaceable></literal></td><td>Senha de Banco de Dados para o serviço de Rede</td></tr><tr><td><literal><replaceable>NEUTRON_PASS</replaceable></literal></td><td>Senha para o usuário do serviço Neutron <literal>neutron</literal></td></tr><tr><td><literal><replaceable>HEAT_DBPASS</replaceable></literal></td><td>Senha de Banco de Dados para o serviço de Orquestração</td></tr><tr><td><literal><replaceable>HEAT_PASS</replaceable></literal></td><td>Senha para o usuário do serviço de Orquestração<literal>heat</literal></td></tr><tr><td><literal><replaceable>CEILOMETER_DBPASS</replaceable></literal></td><td>Senha de Banco de Dados para o serviço de Telemetria</td></tr><tr><td><literal><replaceable>CEILOMETER_PASS</replaceable></literal></td><td>Senha para o usuário do serviço de Telemetria<literal>ceilometer</literal></td></tr><tr><td><literal><replaceable>TROVE_DBPASS</replaceable></literal></td><td>Senha de Banco de Dados para o serviço de Banco de Dados</td></tr><tr><td><literal><replaceable>TROVE_PASS</replaceable></literal></td><td>Senha para o usuário do serviço de Banco de Dados<literal>trove</literal></td></tr></tbody></table>

source: OpenStack and supporting services require administrative privileges during installation and operation. In some cases, services perform modifications to the host that can interfere with deployment automation tools such as Ansible, Chef, and Puppet. For example, some OpenStack services add a root wrapper to <literal>sudo</literal> that can interfere with security policies. See the <link href="http://docs.openstack.org/admin-guide-cloud/content/root-wrap-reference.html">Cloud Administrator Guide</link> for more information. Also, the Networking service assumes default values for kernel network parameters and modifies firewall rules. To avoid most issues during your initial installation, we recommend using a stock deployment of a supported distribution on your hosts. However, if you choose to automate deployment of your hosts, review the configuration and policies applied to them before proceeding further.
pt_br: O OpenStack e os serviços de apoio requerem privilégios administrativos durante as instalação e a operação. Em alguns casos, os serviços realizam modificações para o host que podem interferir com ferramentas de automação de implantação tais como o Ansible, Chef e Puppet. Por exemplo, alguns serviços OpenStack adicionam um encapsulamento de root para o <literal>sudo</literal> que pode interferir com as políticas de segurança. Consulte o <link href="http://docs.openstack.org/admin-guide-cloud/content/root-wrap-reference.html">Cloud Administrator Guide</link> para mais informações. Também, o serviço de Rede assume valores padrão para parâmetros de rede do kernel e modifica regras de firewall. Para evitar a maioria dos problemas durante a sua instalação inicial, recomendamos utilizar uma implantação de ações de uma distribuição suportada em seus hosts. Contudo, se você preferir automatizar a implantação em seus hosts, revise as configurações e políticas aplicadas a ela, antes de seguir em frente.

source: Install and configure a storage node
pt_br: Instalar e configurar um nodo de storage

source: This section describes how to install and configure storage nodes for the Block Storage service. For simplicity, this configuration references one storage node with an empty local block storage device <literal>/dev/sdb</literal> that contains a suitable partition table with one partition <literal>/dev/sdb1</literal> occupying the entire device. The service provisions logical volumes on this device using the <glossterm>LVM</glossterm> driver and provides them to instances via <glossterm baseform="Internet Small Computer Systems Interface (iSCSI)">iSCSI</glossterm> transport. You can follow these instructions with minor modifications to horizontally scale your environment with additional storage nodes.
pt_br: Esta seção descreve como instalar e configurar nodos de storage para o serviço de Block Storage. Para simplificar, esta configuração referencia um nodo de storage com um dispositivo vazio de armazenamento em bloco <literal>/dev/sdb</literal>, que contém uma tabela de partição adequada, com uma partição <literal>/dev/sdb1</literal> ocupando o dispositivo inteiro. O serviço provisiona volumes lógicos neste dispositivo utilizando o driver <glossterm>LVM</glossterm> e os fornece às instâncias via transporte <glossterm baseform="Internet Small Computer Systems Interface (iSCSI)">iSCSI</glossterm>. Você pode seguir estas instruções com pequenas modificações para escalar horizontalmente seu ambiente com nodos de storage adicionais.

source: You must configure the storage node before you install and configure the volume service on it. Similar to the controller node, the storage node contains one network interface on the <glossterm>management network</glossterm>. The storage node also needs an empty block storage device of suitable size for your environment. For more information, see <xref linkend="ch_basic_environment"/>.
pt_br: Você deve configurar o nodo de storage antes de instalar e configurar o serviço de volume nele. Similar ao nodo de computação, o nodo de storage contém uma interface de rede na <glossterm>rede de gerenciamento</glossterm>. O nodo de storage também precisa de um dispositivo de blocos vazio de tamanho adequado para seu ambiente. Para mais informações, consulte <xref linkend="ch_basic_environment"/>.

source: Configure the management interface:
pt_br: Configurar a interface de gerenciamento:

source: IP address: 10.0.0.41
pt_br: Endereço IP: 10.0.0.41

source: Set the hostname of the node to <replaceable>block1</replaceable>.
pt_br: Defina o hostname do nodo para <replaceable>block1</replaceable>.

source: Copy the contents of the <filename>/etc/hosts</filename> file from the controller node to the storage node and add the following to it:
pt_br: Copie o conteúdo do arquivo <filename>/etc/hosts</filename> do nodo controlador para o nodo de storage e adicione o seguinte a ele:

source: Also add this content to the <filename>/etc/hosts</filename> file on all other nodes in your environment.
pt_br: Adicione também este conteúdo ao arquivo <filename>/etc/hosts</filename> em todos os outros nodos em seu ambiente.

source: Install and configure <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm> using the instructions in <xref linkend="basics-ntp-other-nodes"/>.
pt_br: Instale e configure o <glossterm baseform="Network Time Protocol (NTP)">NTP</glossterm> utilizando as instruções em <xref linkend="basics-ntp-other-nodes"/>.

source: Install the LVM packages:
pt_br: Instalar os pacotes LVM:

source: Some distributions include LVM by default.
pt_br: Algumas distribuições incluem o LVM por padrão.

source: Start the LVM metadata service and configure it to start when the system boots:
pt_br: Inicie o serviço de metadados LVM e configure-o para iniciar quando o sistema inicializar:

source: Create the LVM physical volume <literal>/dev/sdb1</literal>:
pt_br: Crie o volume LVM físico <literal>/dev/sdb1</literal>:

source: If your system uses a different device name, adjust these steps accordingly.
pt_br: Se seu sistema utiliza um nome de dispositivo diferente, ajuste esses passos de acordo.

source: Create the LVM volume group <literal>cinder-volumes</literal>:
pt_br: Crie o grupo de volume LVM <literal>cinder-volumes</literal>:

source: The Block Storage service creates logical volumes in this volume group.
pt_br: O serviço de Block Storage cria volumes lógicos neste grupo de volume.

source: Only instances can access Block Storage volumes. However, the underlying operating system manages the devices associated with the volumes. By default, the LVM volume scanning tool scans the <literal>/dev</literal> directory for block storage devices that contain volumes. If tenants use LVM on their volumes, the scanning tool detects these volumes and attempts to cache them which can cause a variety of problems with both the underlying operating system and tenant volumes. You must reconfigure LVM to scan only the devices that contain the <literal>cinder-volume</literal> volume group. Edit the <filename>/etc/lvm/lvm.conf</filename> file and complete the following actions:
pt_br: Somente instâncias podem acessar os volumes do Block Storage. Contudo, o sistema operacional subjacente gerencia os dispositivos associados a estes volumes. Por padrão, a ferramenta de varredura de volume LVM varre o diretório <literal>/dev</literal> por dispositivos de armazenamento em blocos que contêm volumes. Se os tenants utilizam LVM em seus volumes, a ferramenta de varredura detecta estes volumes e tenta fazer cache deles, o que pode causar uma variedade de problemas com ambos, o sistema operacional subjacente e os volumes dos tenants. Você deve reconfigurar o LVM para varrer somente os dispositivos que contêm o grupo de volume <literal>cinder-volume</literal>. Edite o arquivo <filename>/etc/lvm/lvm.conf</filename> e complete as seguintes ações:

source: In the <literal>devices</literal> section, add a filter that accepts the <literal>/dev/sdb</literal> device and rejects all other devices:
pt_br: Na seção <literal>devices</literal>, adicione um filtro que aceite o dispositivo <literal>/dev/sdb</literal> e rejeite todos os outros dispositivos:

source: Each item in the filter array begins with <literal>a</literal> for <emphasis>accept</emphasis> or <literal>r</literal> for <emphasis>reject</emphasis> and includes a regular expression for the device name. The array must end with <literal>r/.*/</literal> to reject any remaining devices. You can use the <placeholder-1/> command to test filters.
pt_br: Cada item na matriz de filtro começa com <literal>a</literal> para <emphasis>aceitar</emphasis> ou <literal>r</literal> para <emphasis>rejeitar</emphasis> e inclui uma expressão regular para o nome do dispositivo. A matriz deve finalizar com <literal>r/.*/</literal> para rejeitar qualquer dispositivo restante. Você pode escolher utilizar os comandos <placeholder-1/> para testar os filtros.

source: If your storage nodes use LVM on the operating system disk, you must also add the associated device to the filter. For example, if the <literal>/dev/sda</literal> device contains the operating system:
pt_br: Se seus nodos de storage utilizam LVM no disco do sistema operacional, você deve também adicionar o dispositivo associado ao filtro. Por exemplo, se o dispositivo <literal>/dev/sda</literal> contém o sistema operacional:

source: Similarly, if your compute nodes use LVM on the operating system disk, you must also modify the filter in the <literal>/etc/lvm/lvm.conf</literal> file on those nodes to include only the operating system disk. For example, if the <literal>/dev/sda</literal> device contains the operating system:
pt_br: Da mesma forma, se seus nodos de computação utilizam LVM no disco do sistema operacional, você deve também modificar o filtro no arquivo <literal>/etc/lvm/lvm.conf</literal> nesses nodos para incluir somente o disco do sistema operacional. Por exemplo, se o dispositivo <literal>/dev/sda</literal> contém o sistema operacional:

source: Install and configure Block Storage volume components
pt_br: Instalar e configurar os componentes de volume do Block Storage

source: Edit the <filename>/etc/cinder/cinder.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/cinder/cinder.conf</filename> e complete as seguintes ações:

source: Replace <replaceable>CINDER_DBPASS</replaceable> with the password you chose for the Block Storage database.
pt_br: Substitua <replaceable>CINDER_DBPASS</replaceable> com a senha que você escolheu para a base de dados do Block Storage.

source: Replace <replaceable>RABBIT_PASS</replaceable> with the password you chose for the <literal>guest</literal> account in RabbitMQ.
pt_br: Substitua <replaceable>RABBIT_PASS</replaceable> com a senha que você escolheu para a conta <literal>guest</literal> no RabbitMQ.

source: In the <literal>[DEFAULT]</literal> and <literal>[keystone_authtoken]</literal> sections, configure Identity service access:
pt_br: Nas seções <literal>[DEFAULT]</literal> e <literal>[keystone_authtoken]</literal>, configure o acesso do Serviço de Identidade:

source: Replace <replaceable>CINDER_PASS</replaceable> with the password you chose for the <literal>cinder</literal> user in the Identity service.
pt_br: Substitua <replaceable>CINDER_PASS</replaceable> com a senha que você escolheu para o usuário <literal>cinder</literal> no serviço de Identidade.

source: Comment out any <literal>auth_host</literal>, <literal>auth_port</literal>, and <literal>auth_protocol</literal> options because the <literal>identity_uri</literal> option replaces them.
pt_br: Comente quaisquer opções <literal>auth_host</literal>, <literal>auth_port</literal>, e <literal>auth_protocol</literal>, porque a opção <literal>identity_uri</literal> as substitui.

source: In the <literal>[DEFAULT]</literal> section, configure the <literal>my_ip</literal> option:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure a opção <literal>my_ip</literal>:

source: Replace <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> with the IP address of the management network interface on your storage node, typically 10.0.0.41 for the first node in the <link linkend="architecture_example-architectures">example architecture</link>.
pt_br: Substitua <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> com o endereço IP da interface de gerenciamento de rede no seu nodo de storage, tipicamente 10.0.0.41 para o primeiro nodo na <link linkend="architecture_example-architectures">arquitetura de exemplo</link>.

source: In the <literal>[DEFAULT]</literal> section, configure the location of the Image Service:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure a localização do Serviço de Imagem:

source: In the <literal>[DEFAULT]</literal> section, configure Block Storage to use the <placeholder-1/> iSCSI service:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure o Block Storage para utilizar o serviço <placeholder-1/> iSCSI:

source: Respond to the prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken">Identity service credentials</link>, <link linkend="debconf-api-endpoints">service endpoint registration</link>, and <link linkend="debconf-rabbitmq">message broker credentials.</link>.
pt_br: Responda às perguntas para <link linkend="debconf-dbconfig-common">gerenciamento de banco de dados</link>, <link linkend="debconf-keystone_authtoken">credenciais do Serviço de Identidade</link>, <link linkend="debconf-api-endpoints">serviço de registro de endpoint</link>, e <link linkend="debconf-rabbitmq">credenciais do intermediador de mensagens.</link>.

source: Respond to prompts for the volume group to associate with the Block Storage service. The script scans for volume groups and attempts to use the first one. If your system only contains the <literal>cinder-volumes</literal> volume group, the script should automatically choose it.
pt_br: Responda às perguntas para o grupo de volume para associar com o serviço de Block Storage. O script varre por grupos de volume e tenta usar o primeiro. Se seu sistema contém somente o grupo de volume <literal>cinder-volumes</literal>, o script deve utilizá-lo automaticamente.

source: Restart the Block Storage volume service including its dependencies:
pt_br: Reinicie o serviço de volume do Block Storage incluindo suas dependências:

source: Start the Block Storage volume service including its dependencies and configure them to start when the system boots:
pt_br: Inicie o serviço de volume do Block Storage incluindo suas dependências e configure-os para iniciar quando os sistema inicializar:

source: By default, the Ubuntu packages create an SQLite database. Because this configuration uses a SQL database server, remove the SQLite database file:
pt_br: Por padrão, os pacotes do Ubuntu criam uma base de dados SQLite. Como esta configuração utiliza um servidor de banco de dados SQL, remova o arquivo de base de dados SQLite.

source: Pre-seed debconf prompts
ko_kr: 미리 설정한 debconf 프롬프트
pt_br: Solicitações debconf pré-respondidas

source: You can pre-seed all <systemitem class="library">debconf</systemitem> prompts. To pre-seed means to store responses in the <package>debconf</package> database so that <package>debconf</package> does not prompt the user for responses. Pre-seeding enables a hands-free installation for users. The package maintainer creates scripts that automatically configure the services.
ko_kr: <systemitem class="library">debconf</systemitem> 질문에 대한 답을 미리 설정할 수 있습니다. 미리 설정한다는 것은 <package>debconf</package> 데이터베이스에 답을 저장하여 <package>debconf</package>가 사용자의 답을 요구하는 질문을 하지 않도록 하는 것입니다. 미리 설정을 통해 사용자에게 손이 가지 않는 설치(무인 설치)를 가능하게 합니다. 꾸러미 관리자는 서비스를 자동으로 설정하도록 스크립트를 만듭니다.
pt_br: Você pode pré-preencher todas as solicitações do <systemitem class="library">debconf</systemitem>. Pré-preencher significa armazenar respostas no banco de dados do <package>debconf</package> de forma que o <package>debconf</package> não solicite respostas ao usuário. O pré-preenchimento habilita um instalação sem interação para os usuários. O mantenedor do pacote cria scripts que configuram automaticamente os serviços.

source: The following example shows how to pre-seed an automated MySQL Server installation:
ko_kr: 다음 예제에서는 MySQL 서버 설치를 어떻게 미리 설정하여 설치 과정을 자동화하는지 보여줍니다:
pt_br: O exemplo a seguir mostra como pré-configurar uma instalação automatizada do Servidor MySQL.

source: The <code>seen true</code> option tells <package>debconf</package> that a specified screen was already seen by the user so do not show it again. This option is useful for upgrades.
ko_kr: <code>seen true</code> 옵션은 사용자가 본 지정 화면을 더이상 보여주지 말라고 <package>debconf</package>에 알려줍니다. 이 옵션은 업그레이드 할 때 쓸만합니다.
pt_br: A opção <code>seen true</code> diz ao <package>debconf</package> que a tela especificada já foi vista pelo usuário e não deve ser mostrada novamente. Esta opção é útil para atualizações.

source: This section describes how to verify operation of the Orchestration module (heat).
pt_br: Esta seção descreve como verificar a operação do módulo de Orquestração (heat).

source: Source the <literal>demo</literal> tenant credentials:
pt_br: Obtenha as credenciais do tenant <literal>demo</literal> :

source: The Orchestration module uses templates to describe stacks. To learn about the template language, see <link href="http://docs.openstack.org/developer/heat/template_guide/index.html">the Template Guide</link> in the <link href="http://docs.openstack.org/developer/heat/">Heat developer documentation</link>.
pt_br: O módulo de Orquestração utiliza templates para descrever as pilhas. Para aprender sobre a linguagem de template, consulte <link href="http://docs.openstack.org/developer/heat/template_guide/index.html">the Template Guide</link> na documentação <link href="http://docs.openstack.org/developer/heat/">Heat developer documentation</link>.
