Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: Optionally, the controller node runs portions of Block Storage, Object Storage, Orchestration, Telemetry, Database, and Data Processing services. These components provide additional features for your environment.
pt_br: Opcionalmente, o nodo controlador executa partes dos serviços de Block Storage, Object Storage, Orquestração, Telemetria, Banco de Dados, e Processamento de Dados. Este componentes fornecem características adicionais ao seu ambiente.

source: The network node runs the Networking plug-in and several agents that provision tenant networks and provide switching, routing, <glossterm baseform="Network Address Translation (NAT)">NAT</glossterm>, and <glossterm>DHCP</glossterm> services. This node also handles external (Internet) connectivity for tenant virtual machine instances.
pt_br: O nodo de Rede executa o plug-in de Rede e diversos agentes que provisionam redes de tenants e fornecem serviços de switching, roteamento, <glossterm baseform="Network Address Translation (NAT)">NAT</glossterm>, e <glossterm>DHCP</glossterm>. Este nodo também manipula a conectividade externa (Internet) para instâncias de máquinas virtuais hospedadas.

source: The <glossterm>compute node</glossterm> runs the <glossterm>hypervisor</glossterm> portion of Compute that operates <glossterm>tenant</glossterm><glossterm baseform="virtual machine (VM)">virtual machines</glossterm> or instances. By default, Compute uses <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> as the <glossterm>hypervisor</glossterm>. The compute node also runs the Networking plug-in and an agent that connect tenant networks to instances and provide firewalling (<glossterm baseform="security group">security groups</glossterm>) services. You can run more than one compute node.
pt_br: O <glossterm>nodo de computação</glossterm> executa a parte de <glossterm>hypervisor</glossterm> da Computação que opera as <glossterm baseform="virtual machine (VM)">máquinas virtuais</glossterm><glossterm>hospedadas</glossterm> ou instâncias. Por padrão, a Computação utiliza o <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> como <glossterm>hypervisor</glossterm>. o nodo de computação também executa o plug-in de Rede e um agente que conecta as redes de tenants às instâncias e fornece serviços de firewall (<glossterm baseform="security group">grupos de segurança</glossterm>). Você pode executar mais de um nodo de computação.

source: Optionally, the compute node runs a Telemetry agent to collect metrics. Also, it can contain a third network interface on a separate storage network to improve performance of storage services.
pt_br: Opcionalmente, o nodo de Computação executa um agente de Telemetria para coletar medições. Adicionalmente, ele pode conter uma terceira interface em uma rede de armazenamento separada para aumentar o desempenho dos serviços de armazenamento.

source: The optional Block Storage node contains the disks that the Block Storage service provisions for tenant virtual machine instances. You can run more than one of these nodes.
pt_br: O nodo opcional de Block Storage contém os discos que o serviço de Block Storage provisiona para as instâncias de máquinas virtuais hospedadas. Você pode executar mais de um desses nodos.

source: Optionally, the Block Storage node runs a Telemetry agent to collect metrics. Also, it can contain a second network interface on a separate storage network to improve performance of storage services.
pt_br: Opcionalmente, o nodo de Block Storage executa um agente de Telemetria para coletar medições. Adicionalmente, ele pode conter uma segunda interface de rede em uma rede de armazenamento separada para aumentar o desempenho dos serviços de armazenamento.

source: The optional Object Storage nodes contain the disks that the Object Storage service uses for storing accounts, containers, and objects. You can run more than two of these nodes. However, the minimal architecture example requires two nodes.
pt_br: Os nodos opcionais de Object Storage contém os discos que o serviço Object Storage utiliza para armazenamento de contas, contêineres, e objetos. Você pode executar mais de dois destes nodos. Contudo, a arquitetura mínima de exemplo requer dois nodos.

source: Optionally, these nodes can contain a second network interface on a separate storage network to improve performance of storage services.
pt_br: Opcionalmente, estes nodos podem conter uma segunda interface de rede em uma rede de armazenamento separada para aumentar o desempenho dos serviços de armazenamento.

source: When you implement this architecture, skip <xref linkend="section_nova-networking"/> in <xref linkend="ch_networking"/>. Optional services might require additional nodes or additional resources on existing nodes.
pt_br: Quando você implementa esta arquitetura, salte a <xref linkend="section_nova-networking"/> em <xref linkend="ch_networking"/>. Serviços opcionais podem requerer nodos adicionais ou recursos adicionais nos nodos existentes.

source: Minimal architecture example with OpenStack Networking (neutron)Hardware requirements
pt_br: Requisitos de Hardware para arquitetura mínima de exemplo com OpenStack Networking (neutron)

source: Minimal architecture example with OpenStack Networking (neutron)Service layout
pt_br: Layout de serviço para arquitetura mínima de exemplo com OpenStack Networking (neutron)

source: Two-node architecture with legacy networking (nova-network) and optional nodes for Block Storage and Object Storage services.
pt_br: Arquitetura de dois nodos com rede legada (nova-network) e nodos opcionais para serviços de Block Storage e Object Storage.

source: The <glossterm baseform="cloud controller node">controller node</glossterm> runs the Identity service, Image Service, management portion of Compute, and the dashboard. It also includes supporting services such as a SQL database, <glossterm>message queue</glossterm>, and <glossterm>Network Time Protocol (NTP)</glossterm>.
pt_br: O <glossterm baseform="cloud controller node">nodo controlador</glossterm> executa o Serviço de Identidade, Serviço de Imagem, parte do gerenciamento da Computação, e o dashboard. Ele também inclui serviços de suporte tais como um banco de dados SQL, <glossterm>fila de mensagens</glossterm>, e <glossterm>Network Time Protocol (NTP)</glossterm>.

source: The <glossterm>compute node</glossterm> runs the <glossterm>hypervisor</glossterm> portion of Compute that operates <glossterm>tenant</glossterm><glossterm baseform="virtual machine (VM)">virtual machines</glossterm> or instances. By default, Compute uses <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> as the <glossterm>hypervisor</glossterm>. Compute also provisions tenant networks and provides firewalling (<glossterm baseform="security group">security groups</glossterm>) services. You can run more than one compute node.
pt_br: O <glossterm>nodo de computação</glossterm> executa a parte de <glossterm>hypervisor</glossterm> da Computação que opera as <glossterm baseform="virtual machine (VM)">máquinas virtuais</glossterm><glossterm>hospedadas</glossterm> ou instâncias. Por padrão, a Computação utiliza o <glossterm baseform="kernel-based VM (KVM)">KVM</glossterm> como <glossterm>hypervisor</glossterm>. o nodo de computação também executa o plug-in de Rede e um agente que conecta as redes de tenants às instâncias e fornece serviços de firewall (<glossterm baseform="security group">grupos de segurança</glossterm>). Você pode executar mais de um nodo de computação.

source: When you implement this architecture, skip <xref linkend="section_neutron-networking"/> in <xref linkend="ch_networking"/>. To use optional services, you might need to build additional nodes, as described in subsequent chapters.
pt_br: Quando você implementa esta arquitetura, salte a seção <xref linkend="section_neutron-networking"/> em <xref linkend="ch_networking"/>. Para utilizar serviços opcionais, você precisaria construir nodos adicionais, como descrito nos capítulos subsequentes.

source: Minimal architecture example with legacy networking (nova-network)Hardware requirements
pt_br: Requerimentos de hardware para exemplo de arquitetura mínima com rede legada (nova-network)

source: Minimal architecture example with legacy networking (nova-network)Service layout
pt_br: Layout de serviço para exemplo de arquitetura mínima com rede legada (nova-network)

source: Verify the Database service installation
ko_kr: 데이터베이스 서비스 설치 확인
pt_br: Verifique a instalação do serviço de Banco de Dados

source: To verify that the Database service is installed and configured correctly, try executing a Trove command:
ko_kr: 다음 Trove 명령어를 실행하여 데이터베이스 서비스 설치 및 구성 상태를 확인 합니다:
pt_br: Para verificar que o serviço de Banco de Dados está instalado e configurado corretamente, tente executar um comando Trove:

source: Source the <filename>demo-openrc.sh</filename> file.
ko_kr: <filename>demo-openrc.sh</filename> 파일을 source 명령으로 실행.
pt_br: Obtenha o arquivo <filename>demo-openrc.sh</filename>.

source: Retrieve the Trove instances list:
ko_kr: Trove 인스턴스 목록 검색:
pt_br: Obtenha a lista de instâncias Trove:

source: Assuming you have created an image for the type of database you want, and have updated the datastore to use that image, you can now create a Trove instance (database). To do this, use the trove <placeholder-1/> command.
pt_br: Supondo que você criou uma imagem para o tipo de banco de dados que você quer, e atualizou o datastore para utilizar esta imagem, você pode criar uma instância Trove (banco de dados). Para fazer isto, utilize o comando <placeholder-1/> trove.

source: This example shows you how to create a MySQL 5.5 database:
ko_kr: 예제는 MySQL 5.5 데이터베이스를 생성하는 방법에 대해서 보여줍니다:
pt_br: Este exemplo mostra a você como criar uma base de dados MySQL 5.5:

source: name
pt_br: nome

source: Finalize installation
ko_kr: 설치 마무리
pt_br: Finalizar a instalação

source: Configure hashes and default storage policy
pt_br: Configure hashes e a política padrão de armazenamento

source: Obtain the <filename>/etc/swift/swift.conf</filename> file from the Object Storage source repository:
pt_br: Obtenha o arquivo <filename>/etc/swift/swift.conf</filename> do repositório fonte do Object Storage:

source: Edit the <filename>/etc/swift/swift.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/swift/swift.conf</filename> e complete as seguintes ações:

source: In the <literal>[swift-hash]</literal> section, configure the hash path prefix and suffix for your environment.
pt_br: Na seção <literal>[swift-hash]</literal>, configure o caminho do prefixo e sufixo do hash para seu ambiente.

source: Replace <replaceable>HASH_PATH_PREFIX</replaceable> and <replaceable>HASH_PATH_SUFFIX</replaceable> with unique values.
pt_br: Substitua <replaceable>HASH_PATH_PREFIX</replaceable> e <replaceable>HASH_PATH_SUFFIX</replaceable> com valores únicos.

source: Keep these values secret and do not change or lose them.
pt_br: Mantenha estes valores em segurança e não os altere ou os perca.

source: In the <literal>[storage-policy:0]</literal> section, configure the default storage policy:
pt_br: Na seção <literal>[storage-policy:0]</literal>, configure a política padrão de armazenamento:

source: Copy the <filename>swift.conf</filename> file to the <literal>/etc/swift</literal> directory on each storage node and any additional nodes running the proxy service.
pt_br: Copie o arquivo <filename>swift.conf</filename> para o diretório <literal>/etc/swift</literal> em cada nodo de armazenamento e quaisquer nodos adicionais que estejam executando o serviço de proxy.

source: On all nodes, ensure proper ownership of the configuration directory:
pt_br: Em todos os nodos, assegure a propriedade adequada do diretório de configuração:

source: On the controller node and any other nodes running the proxy service, restart the Object Storage proxy service including its dependencies:
pt_br: No nodo controlador e em quaisquer outros nodos executando o serviço de proxy, reinicie o serviço de proxy do Object Storage, incluindo suas dependências:

source: On the controller node and any other nodes running the proxy service, start the Object Storage proxy service including its dependencies and configure them to start when the system boots:
pt_br: No nodo controlador e em quaisquer outros nodos executando o serviço de proxy, inicie o serviço de proxy do Object Storage, incluindo suas dependências e configure-o para iniciar quando o sistema inicializar:

source: On the storage nodes, start the Object Storage services:
pt_br: Nos nodos de armazenamento, inicie os serviços de Object Storage:

source: The storage node runs many Object Storage services and the <placeholder-1/> command makes them easier to manage. You can ignore errors from services not running on the storage node.
pt_br: O nodo de armazenamento executa muitos serviços de Object Storage e o comando <placeholder-1/> torna-os fáceis de se gerenciar. Você pode ignorar erros de serviços que não estejam rodando no nodo de armazenamento.

source: On the storage nodes, start the Object Storage services and configure them to start when the system boots:
pt_br: Nos nodos de armazenamento, inicie os serviços de Object Storage e configure-os para iniciar quando o sistema inicializar:

source: Install and configure the storage nodes
pt_br: Instalar e configurar os nodos de armazenamento

source: This section describes how to install and configure storage nodes that operate the account, container, and object services. For simplicity, this configuration references two storage nodes, each containing two empty local block storage devices. Each of the devices, <literal>/dev/sdb</literal> and <literal>/dev/sdc</literal>, must contain a suitable partition table with one partition occupying the entire device. Although the Object Storage service supports any file system with <glossterm>extended attributes (xattr)</glossterm>, testing and benchmarking indicate the best performance and reliability on <glossterm>XFS</glossterm>. For more information on horizontally scaling your environment, see the <link href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.
pt_br: Esta seção descreve como instalar e configurar nodos de armazenamento que operam os serviços de contas, contêineres, e objeto. Para simplificar, esta configuração referencia dois nodos de armazenamento, cada um contendo dois dispositivos vazios de armazenamento de blocos. Cada um desses dispositivos, <literal>/dev/sdb</literal> e <literal>/dev/sdc</literal>, deve conter uma tabela de partição adequada com uma partição ocupando o dispositivo inteiro. Embora o serviço Object Storage suporte qualquer sistema de arquivos com <glossterm>atributos extendidos (xattr)</glossterm>, testes e avaliações comparativas indicam um melhor desempenho e confiabilidade em <glossterm>XFS</glossterm>. Para mais informações sobre escalar horizontalmente seu ambiente, consulte o <link href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.

source: You must configure each storage node before you install and configure the Object Storage service on it. Similar to the controller node, each storage node contains one network interface on the <glossterm>management network</glossterm>. Optionally, each storage node can contain a second network interface on a separate network for replication. For more information, see <xref linkend="ch_basic_environment"/>.
pt_br: Você deve configurar cada nodo de armazenamento antes de instalar e configurar o serviço Object Storage nele. Similar ao nodo controlador, cada nodo de armazenamento contém uma interface de rede na <glossterm>rede de gerenciamento</glossterm>. Opcionalmente, cada nodo de armazenamento pode conter uma segunda interface de rede em uma rede separada para replicação. Para mais informações, consulte <xref linkend="ch_basic_environment"/>.

source: Configure unique items on the first storage node:
pt_br: Configurar itens únicos no primeiro nodo de armazenamento:

source: IP address: 10.0.0.51
pt_br: Endereço IP: 10.0.0.51

source: Set the hostname of the node to <replaceable>object1</replaceable>.
pt_br: Defina o hostname do nodo para <replaceable>object1</replaceable>.

source: Configure unique items on the second storage node:
pt_br: Configurar itens únicos no segundo nodo de armazenamento:

source: IP address: 10.0.0.52
pt_br: Endereço IP: 10.0.0.52

source: Set the hostname of the node to <replaceable>object2</replaceable>.
pt_br: Defina o hostname do nodo para <replaceable>object2</replaceable>.

source: Configure shared items on both storage nodes:
pt_br: Configure itens compartilhados em ambos os nodos de armazenamento:

source: Copy the contents of the <filename>/etc/hosts</filename> file from the controller node and add the following to it:
pt_br: Copie o conteúdo do arquivo <filename>/etc/hosts</filename> do nodo controlador e adicione o seguinte a ele:

source: Install the supporting utility packages:
pt_br: Instalar os pacotes de utilitários de suporte:

source: Format the <literal>/dev/sdb1</literal> and <literal>/dev/sdc1</literal> partitions as XFS:
pt_br: Formatar as partições <literal>/dev/sdb1</literal> e <literal>/dev/sdc1</literal> como XFS:

source: Create the mount point directory structure:
pt_br: Criar a estrutura de diretório de ponto de montagem:

source: Edit the <filename>/etc/fstab</filename> file and add the following to it:
pt_br: Edite o arquivo <filename>/etc/fstab</filename> e adicione o seguinte a ele:

source: Mount the devices:
pt_br: Montar os dispositivos:

source: Edit the <filename>/etc/rsyncd.conf</filename> file and add the following to it:
pt_br: Edite o arquivo <filename>/etc/rsyncd.conf</filename> e adicione o seguinte a ele:

source: Replace <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> with the IP address of the management network on the storage node.
pt_br: Substitua <replaceable>MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> com o endereço IP da rede de gerenciamento no nodo de armazenamento.

source: The <systemitem role="service">rsync</systemitem> service requires no authentication, so consider running it on a private network.
pt_br: O serviço <systemitem role="service">rsync</systemitem> não requer autenticação, portanto, considere executá-lo em uma rede privada.

source: Edit the <filename>/etc/default/rsync</filename> file and enable the <systemitem role="service">rsync</systemitem> service:
pt_br: Edite o arquivo <filename>/etc/default/rsync</filename> e habilite o serviço <systemitem role="service">rsync</systemitem>:

source: Edit the <filename>/etc/xinetd.d/rsync</filename> file and enable the <systemitem role="service">rsync</systemitem> service:
pt_br: Edite o arquivo <filename>/etc/xinetd.d/rsync</filename> e habilite o serviço <systemitem role="service">rsync</systemitem>:

source: Start the <systemitem class="service">rsync</systemitem> service:
ko_kr: <systemitem class="service">rsync</systemitem> 서비스를 시작하십시오:
pt_br: Inicie o serviço <systemitem class="service">rsync</systemitem>:

source: Start the <systemitem class="service">rsyncd</systemitem> service and configure it to start when the system boots:
pt_br: Inicie o serviço <systemitem class="service">rsyncd</systemitem> e configure-o para iniciar quando o sistema inicializar:

source: Start the <systemitem class="service">xinetd</systemitem> service and configure it to start when the system boots:
ko_kr: <systemitem class="service">xinetd</systemitem> 서비스를 시작하고 시스템을 부팅할 때 시작하도록 설정하십시오:
pt_br: Inicie o serviço <systemitem class="service">xinetd</systemitem> e configure-o para iniciar quando o sistema inicializar.

source: Install and configure storage node components
pt_br: Instalar e configurar componentes do nodo de armazenamento

source: Perform these steps on each storage node.
pt_br: Realize estes passos em cada nodo de armazenamento.

source: Obtain the accounting, container, and object service configuration files from the Object Storage source repository:
pt_br: Obtenha os arquivos de configuração da contabilidade, contêiner e do serviço de objeto, a partir do repositório fonte do Object Storage:

source: Edit the <filename>/etc/swift/account-server.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/swift/account-server.conf</filename> e complete as seguintes ações:

source: In the <literal>[DEFAULT]</literal> section, configure the bind IP address, bind port, user, configuration directory, and mount point directory:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure o endereço IP de vinculação, a porta de vinculação, usuário, diretório de configuração, e diretório de ponto de montagem:

source: In the <literal>[pipeline:main]</literal> section, enable the appropriate modules:
pt_br: Na seção <literal>[pipeline:main]</literal>, habilite os módulos apropriados:

source: For more information on other modules that enable additional features, see the <link href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.
pt_br: Para mais informações sobre outros módulos que habilitam características adicionais, consulte o <link href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.

source: In the <literal>[filter:recon]</literal> section, configure the recon (metrics) cache directory:
pt_br: Na seção <literal>[filter:recon]</literal>, configure o diretório de cache recon (métricas):

source: Edit the <filename>/etc/swift/container-server.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/swift/container-server.conf</filename> e complete as seguintes ações:

source: Edit the <filename>/etc/swift/object-server.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/swift/object-server.conf</filename> e complete as seguintes ações:

source: Ensure proper ownership of the mount point directory structure:
pt_br: Garanta a propriedade adequada da estrutura de diretórios do ponto de montagem:

source: Create the <literal>recon</literal> directory and ensure proper ownership of it:
pt_br: Crie o diretório <literal>recon</literal> e garanta a propriedade adequada dele:

source: Create initial rings
pt_br: Criar anéis iniciais

source: Before starting the Object Storage services, you must create the initial account, container, and object rings. The ring builder creates configuration files that each node uses to determine and deploy the storage architecture. For simplicity, this guide uses one region and zone with 2^10 (1024) maximum partitions, 3 replicas of each object, and 1 hour minimum time between moving a partition more than once. For Object Storage, a partition indicates a directory on a storage device rather than a conventional partition table. For more information, see the <link href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.
pt_br: Antes de iniciar os serviços Object Storage, você deve criar os anéis iniciais de conta, contêiner, e objeto. O construtor de anéis cria arquivos de configuração que cada nodo utiliza para determinar e implantar a arquitetura de armazenamento. Para simplificar, este guia utiliza uma região e zona com partições máximas de 2^10 (1024), 3 réplicas de cada objeto, e tempo mínimo de 1 hora entre mover a partição mais de uma vez. Para o Object Storage, uma partição indica um diretório no dispositivo de armazenamento em vez de uma tabela de partição convencional. Para mais informações, consulte o <link href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.

source: Account ring
pt_br: Anel de conta
