Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: Install the L3 agent.
ko_kr: L3 에이전트를 설치하십시오.

source: Add the external network bridge
ko_kr: 외부 네트워크 브릿지를 추가하십시오.

source: Add the physical interface, for example eth0, that is connected to the outside network to this bridge:
ko_kr: 이 브릿지에 외부 네트워크를 연결할 eth0와 같은 물리 인터페이스를 추가하십시오:

source: Update the L3 configuration file <filename> /etc/neutron/l3_agent.ini</filename>:
ko_kr: L3 설정 파일<filename> /etc/neutron/l3_agent.ini</filename>를 업데이트하십시오:

source: Set the <placeholder-1/> option (it is True by default) because TenantA and TenantC have overlapping subnets, and the routers are hosted on one l3 agent network node.
ko_kr: TenantA와 TenantC가 중복 서브넷을 가지고 있고, 리우터는 L3 에이전트 네트워크 노드에서 제공하므로 <placeholder-1/> 옵션 (기본 값은 True입니다.)를 설정하십시오.

source: Start the L3 agent
ko_kr: L3 에이전트 시작

source: The Networking L3 agent can be a service of the operating system. The command to start the service depends on your operating system. The following command starts the agent directly:
ko_kr: L3 네트워킹 에이전트는 운영체제의 서비스가 될 수 있습니다. 서비스 시작 명령은 운영 체제에 따라 다릅니다. 다음 명령은 에이전트를 직접 시작합니다:

source: Configure logical network
ko_kr: 논리 네트워크 구성

source: You can run these commands on the network node.
ko_kr: 네트워크 노드에서 다음 명령어를 실행할 수 있습니다.

source: Ensure that the following environment variables are set. Various clients use these to access the Identity Service.
ko_kr: 다음 환경 변수를 설정했는지 확인하십시오. 여러 클라이언트에서 인증 서비스에 접근할 때 이 변수를 사용합니다.

source: Get the tenant ID (Used as $TENANT_ID later):
ko_kr: Tenant ID를 가져오십시오(이 값은 나중에 $TENANT_ID에 사용합니다.):

source: Get user information:
ko_kr: 사용자 정보를 가져오십시오:

source: Create the external network and its subnet by admin user:
ko_kr: admin 사용자로 외부 네트워크와 서브넷을 만드십시오:

source: <placeholder-1/> means that Networking does not have to realize this network through provider network. <placeholder-2/> means that an external network is created where you can create the floating IP and router gateway port.
ko_kr: <placeholder-1/>는 제공자 네트워크를 통해 이러한 네트워킹이 구현할 수 없는 네트워크임을 의미합니다. <placeholder-2/>는 유동 IP와 라우터 게이트웨이 포트를 만들 수 있는 위치에 외부 네트워크를 만듦을 의미합니다.

source: Add an IP on the external network to br-ex.
ko_kr: br-ex에 외부 네트워크 IP를 추가하십시오.

source: Because br-ex is the external network bridge, add an IP 30.0.0.100/24 to br-ex and ping the floating IP of the VM from our network node.
ko_kr: br-ex는 외부 네트워크 브릿지 이므로, br-ex에 30.0.0.100/24를 추가하고 네트워크 노드에서 VM의 유동 IP로 ping을 보내십시오.

source: Serve TenantA.
ko_kr: TenantA를 사용합니다.

source: For TenantA, create a private network, subnet, server, router, and floating IP.
ko_kr: TenantA에 사설 네트워크, 서브넷, 서버, 라우터, 유동 IP를 만드십시오.

source: Create a network for TenantA:
ko_kr: TenantA 네트워크를 만드십시오:

source: After that, you can use admin user to query the provider network information:
ko_kr: 그 후, provider의 네트워크 정보를 조하할 admin 사용자를 사용할 수 있습니다:

source: The network has GRE tunnel ID (for example, provider:segmentation_id) 1.
ko_kr: 네트워크에는 GRE 터널 ID 1이 있습니다.(예, provier:segmentation_id)

source: Create a subnet on the network TenantA-Net:
ko_kr: 네트워크 TenantA-Net에 서브넷을 만드십시오:

source: Create a server for TenantA:
ko_kr: TenantA의 서버를 만드십시오:

source: It is important to understand that you should not attach the instance to Ext-Net directly. Instead, you must use a floating IP to make it accessible from the external network.
ko_kr: 외부 네트워크에 인스턴스를 직접 연결하지 않아야한다는 것을 이해하는 것이 중요합니다. 대신, 외부 네트워크에서 접근할 수 있도록 유동 IP를 사용해야합니다.

source: Create and configure a router for TenantA:
ko_kr: TenantA에 라우터를 만들고 구성하십시오:

source: Added interface to router TenantA-R1
ko_kr: 라우터 TenantA-R1에 인터페이스를 추가하였습니다.

source: Associate a floating IP for TenantA_VM1.
ko_kr: TenantA_VM1에 유동 IP를 연결하십시오.

source: Create a floating IP:
ko_kr: 유동 IP를 만드십시오:

source: Get the port ID of the VM with ID 7c5e6499-7ef7-4e36-8216-62c2941d21ff:
ko_kr: ID가 7c5e6499-7ef7-4e36-8216-62c2941d21ff 인 가상 머신의 포트 ID를 가져오십시오:

source: Associate the floating IP with the VM port:
ko_kr: 가상 머신 포트와 유동 IP를 연결하십시오:

source: Ping the public network from the server of TenantA.
ko_kr: TenantA 서버에서 공인 네트워크로 ping을 합니다.

source: In my environment, 192.168.1.0/24 is my public network connected with my physical router, which also connects to the external network 30.0.0.0/24. With the floating IP and virtual router, you can ping the public network within the server of tenant A:
ko_kr: 제 환경의 경우, 실제 라우터에 연결한 공개 네트워크는 192.168.1.0/24 이며, 외부 네트워크 30.0.0.0/24로 연결되어 있기도 합니다. 유동 IP와 가상 라우터를 통해 테넌트 A의 서버에서 공개 네트워크로 ping 신호를 보낼 수 있습니다:

source: Ping the floating IP of TenantA's server:
ko_kr: TenantA 서버 유동 IP에 ping을 보내십시오:

source: Create other servers for TenantA.
ko_kr: TenantA의 다른 서버를 생성합니다.

source: You can create more servers for TenantA and add floating IPs for them.
ko_kr: TenantA 에 더 많은 서버를 생성하고 유동 IP를 할당할 수 있습니다.

source: Serve TenantC.
ko_kr: TenantC를 사용합니다.

source: For TenantC, you create two private networks with subnet 10.0.0.0/24 and subnet 10.0.1.0/24, some servers, one router to connect to these two subnets and some floating IPs.
ko_kr: TenantC에서 10.0.0.0/24, 10.0.1.0/24 두 개의 전용 하위 네트워크를 만들고, 서버 몇대를 놓은 다음 하위 네트워크를 연결하는 라우터를 배치하고 유동 IP 일부를 할당하십시오.

source: Create networks and subnets for TenantC:
ko_kr: TenantC의 네트워크와 서브넷을 만드십시오:

source: After that you can use admin user to query the network's provider network information:
ko_kr: 이 작업이 끝나면 네트워크의 제공자 네트워크 정보를 요청할 목적으로 admin 사용자를 사용할 수 있습니다:

source: You can see GRE tunnel IDs (such as, provider:segmentation_id) 2 and 3. And also note the network IDs and subnet IDs because you use them to create VMs and the router.
ko_kr: GRE 터널 ID 2,3을 볼 수 있습니다(provider:segmentation_id 같은 형식). 네트워크 ID와 하위 네트워크 ID는 가상 머신과 라우터를 만들 때 사용하므로 적어두십시오.

source: Create a server TenantC-VM1 for TenantC on TenantC-Net1.
ko_kr: TenantC에서 TenantC-Net1에 연결된 서버 TenantC-VM1을 생성합니다.

source: Create a server TenantC-VM3 for TenantC on TenantC-Net2.
ko_kr: TenantC에서 TenantC-Net2에 연결된 서버 TenantC-VM3를 생성합니다.

source: List servers of TenantC.
ko_kr: TenantC의 서버 목록을 확인하십시오.

source: Note the server IDs because you use them later.
ko_kr: 서버 ID는 다음에 사용하므로 적어두십시오.

source: Make sure servers get their IPs.
ko_kr: 서버가 IP를 가지고 있는지 확인합니다.

source: You can use VNC to log on the VMs to check if they get IPs. If not, you must make sure that the Networking components are running correctly and the GRE tunnels work.
ko_kr: 가상 머신에 IP를 부여하였다면 가상 머신 로그인에 VNC를 사용할 수 있습니다. 이게 안된다면 네트워킹 구성 요소가 올바르게 동작하는지 GRE 터널링이 동작하는지 확인해야 합니다.

source: Create and configure a router for TenantC:
ko_kr: TenantC에 라우터를 만들고 구성하십시오:

source: Checkpoint: ping from within TenantC's servers.
ko_kr: 확인: TenantC의 서버들끼리 ping을 주고 받아보십시오.

source: Because a router connects to two subnets, the VMs on these subnets can ping each other. And because the gateway for the router is set, TenantC's servers can ping external network IPs, such as 192.168.1.1, 30.0.0.1, and so on.
ko_kr: 라우터가 두 하위 네트워크를 연결하기 때문에, 이 하위 네트워크에 있는 가상 머신은 서로 ICMP ping 신호를 주고 받을 수 있습니다. 또한 라우터에 대한 게이트웨이를 설정했으므로 TenantC의 서버는 192.168.1.1, 30.0.0.1과 같은 외부 네트워크 IP로 ping 신호를 보낼 수 있습니다.

source: Associate floating IPs for TenantC's servers.
ko_kr: TenantC 서버에 유동 IP를 연결하십시오.

source: Because a router connects to two subnets, the VMs on these subnets can ping each other. And because the gateway interface for the router is set, TenantC's servers can ping external network IPs, such as 192.168.1.1, 30.0.0.1, and so on.
ko_kr: 라우터에 두 개의 하위 네트워크를 연결했으므로, 하위 네트워크의 가상 머신은 서로 ICMP ping 신호를 주고받을 수 있습니다. 또한 라우터에 대한 게이트웨이를 설정했으므로 TenantC의 서버는 192.168.1.1, 30.0.0.1과 같은 외부 네트워크 IP로 ping 신호를 보낼 수 있습니다.

source: You can use similar commands to the ones used in the section for TenantA.
ko_kr: TenantA에 대한 섹션에서 사용할 유사한 명령도 사용할 수 있습니다.

source: Use case: per-tenant routers with private networks
ko_kr: 사용 사례: 사설 네트워크에서 tenant당 라우터

source: This use case represents a more advanced router scenario in which each tenant gets at least one router, and potentially has access to the Networking API to create additional routers. The tenant can create their own networks, potentially uplinking those networks to a router. This model enables tenant-defined, multi-tier applications, with each tier being a separate network behind the router. Because there are multiple routers, tenant subnets can overlap without conflicting, because access to external networks all happens through SNAT or floating IPs. Each router uplink and floating IP is allocated from the external network subnet.
ko_kr: 이러한 예제를 통해 각 테넌트에 최소한 하나의 라우터를 사용하는 좀 더 발전된 라우터 시나리오를 나타내며, 추가 라우터를 만드는 네트워크 API로의 접근을 보유합니다. 테넌트에서는 자체 네트워크를 만들 수 있으며, 잠제적으로 이들 네트워크를 상위 네트워크로 연결하는 라우터로 연결할 수 있습니다. 이 모델을 통해 테넌트별 정의, 라우터 하부로 나뉜 각각의 네트워크로 존재하는 각 티어에 대한 다중 티어 응용 처리가 가능합니다. 여러 대의 라우터가 존재하기 때문에, 네트워크상의 각 노드의 충돌 없이 테넌트 하위 네트워크를 중복 적용할 수 있는데, 외부 네트워크로의 접근은 SNAT나 유동 IP를 통해 일어나기 때문입니다. 각각의 라우터 상위 연결과 유동 IP는 외부 네트워크의 하위 네트워크로부터 할당됩니다.

source: Add a networking service
ko_kr: 네트워킹 서비스 추가

source: Modular Layer 2 (ML2) plug-in
ko_kr: Modular Layer 2 (ML2) 플러그인

source: The OpenStack dashboard, also known as <link href="https://github.com/openstack/horizon/">Horizon</link>, is a Web interface that enables cloud administrators and users to manage various OpenStack resources and services.
ko_kr: <link href="https://github.com/openstack/horizon/">호라이즌</link>으로 알려진 오픈스택 대시보드는 클라우드 관리자 및 사용자로 하여금 다양한 오픈스택 자원과 서비스를 관리하도록 해주는 웹 인터페이스입니다.

source: These instructions show an example deployment configured with an Apache web server.
ko_kr: 아래 절차에서는 아파치 웹 서버로 설정한 예제 구성을 보여줍니다.

source: After you <link linkend="install_dashboard">install and configure the dashboard</link>, you can complete the following tasks:
ko_kr: <link linkend="install_dashboard">대시보드를 설치하고 설정</link>한 다음, 다음 작업을 완료할 수 있습니다:

source: Customize your dashboard. See section <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_install-dashboard.html#dashboard-custom-brand">Customize the dashboard</link> in the <link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>OpenStack Cloud Administrator Guide</citetitle></link>.
ko_kr: 대시보드를 별도로 설정하십시오. <link href="http://docs.openstack.org/admin-guide-cloud/content/"><citetitle>오픈스택 클라우드 관리자 안내서</citetitle></link>의 <link href="http://docs.openstack.org/admin-guide-cloud/content/ch_install-dashboard.html#dashboard-custom-brand">대시보드 사용자 정의</link> 섹션을 살펴보십시오.

source: Set up session storage for the dashboard. See <xref linkend="dashboard-sessions"/>.
ko_kr: 대시보드의 세션 스토리지를 설정하십시오. <xref linkend="dashboard-sessions"/>을 참조하십시오.

source: Verify the Orchestration service installation
ko_kr: Orchestration 서비스 설치 확인

source: Configure the Identity Service
ko_kr: Identity 서비스 구성

source: Add the Orchestration service
ko_kr: Orchestration 서비스 추가하기

source: Use the Orchestration module to create cloud resources using a template language called HOT. The integrated project name is Heat.
ko_kr: HOT라고 하는 양식 언어를 사용하여 클라우드 자원을 만들려면 오케스트레이션 모듈을 사용하십시오. 통합 프로젝트 이름은 Heat입니다.

source: Provider router with private networks
ko_kr: 사설 네트워크와 provider 라우터

source: This section describes how to install the OpenStack Networking service and its components for a single router use case: a provider router with private networks.
ko_kr: 이 섹션에서는 사설 내트워크의 provider 라우터를 사용하여 단일 라우터 구성에 대한 OpenStack 네트워킹 서비스와 구성요소를 설치하는 방법을 설명합니다.

source: This figure shows the set up:
ko_kr: 이 그림은 설치 장면을 보여줍니다:

source: Because you run the DHCP agent and L3 agent on one node, you must set <literal>use_namespaces</literal> to <literal>True</literal> (which is the default) in the configuration files for both agents.
ko_kr: DHCP 에이전트와 L3 에이전트를 하나의 노드에서 실행하므로, 두 에이전트의 설정 파일에서 <literal>use_namespaces</literal> 값을 <literal>True</literal>(기본값)로 설정해야 합니다.

source: The configuration includes these nodes:
ko_kr: 구성엔 다음 노드를 포함합니다:

source: Nodes for use case
ko_kr: 노드 사용 예시

source: Controller
ko_kr: Conteroller

source: Runs the Networking service, Identity Service, and all Compute services that are required to deploy a VM.
ko_kr: VM을 가동하는데 필요한 네트워킹 서비스, 인증 서비스, 모든 처리 서비스를 실행하십시오.

source: The service must have at least two network interfaces. The first should be connected to the Management Network to communicate with the compute and network nodes. The second interface should be connected to the API/public network.
ko_kr: 서비스느 최소한 두 개의 네트워크 인터페이스가 필요합니다. 첫번째는 처리 및 네트워크 노드와의 통신을 관리하기 위해 관리 네트워크에 연결해야 합니다. 두번째 인터페이스는 API/공용망에 연결되어야 합니다.

source: Runs Compute and the Networking L2 agent.
ko_kr: 처리부 에이전트와 L2 네트워킹 에이전트를 실행하십시오.

source: This node does not have access to the public network.
ko_kr: 이 노드는 공인 네트워크에 접근할 수 없습니다.

source: The node must have a network interface that communicates with the controller node through the management network. The VM receives its IP address from the DHCP agent on this network.
ko_kr: 노드는 관리 네트워크로 제어 노드와 통신하는 네트워크 인터페이스를 보유해야 합니다. VM에서는 이 네트워크의 DHCP 에이전트로부터 IP 주소를 받습니다.

source: Network
ko_kr: 네트워크

source: Runs Networking L2 agent, DHCP agent, and L3 agent.
ko_kr: L2 네트워킹 에이전트, DHCP 에이전트, L3 에이전트를 실행하십시오.

source: This node has access to the public network. The DHCP agent allocates IP addresses to the VMs on the network. The L3 agent performs NAT and enables the VMs to access the public network.
ko_kr: 이 노드는 공개 네트워크로의 접근을 포함합니다. DHCP 에이전트는 IP 주소를 네트워크의 가상 머신에 할당합니다. L3 에이전트는 NAT를 처리하고 가상 머신을 공개 네트워크에 접근할 수 있게 합니다.

source: A network interface that communicates with the controller node through the management network
ko_kr: 관리 네트워크를 통해 제어 노드와 통신하는 네트워크 인터페이스입니다

source: A network interface on the data network that manages VM traffic
ko_kr: 가상 머신 트래픽을 관리하는 데이터 네트워크의 네트워크 인터페이스입니다

source: A network interface that connects to the external gateway on the network
ko_kr: 네트워크의 외부 게이트웨이와 연결하는 네트워크 인터페이스입니다

source: The node must have:<placeholder-1/>
ko_kr: 반드시 보유해야 할 노드:<placeholder-1/>

source: To install and configure the controller node
ko_kr: 컨트롤러 노드를 설치하고 설정하려면

source: Run this command:
ko_kr: 이 명령을 실행하십시오:

source: Configure Networking services:
ko_kr: 네트워킹 서비스를 설정하십시오:

source: Edit the <filename>/etc/neutron/neutron.conf</filename> file and add these lines:
ko_kr: <filename>/etc/neutron/neutron.conf</filename> 파일을 편집하여 다음 줄을 추가하십시오:

source: Edit the <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file and add these lines:
ko_kr: <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> 파일을 편집하여 다음 줄을 추가하십시오:

source: Edit the <filename> /etc/neutron/api-paste.ini</filename> file and add these lines:
ko_kr: <filename> /etc/neutron/api-paste.ini</filename> 파일을 편집하여 다음 줄을 추가하십시오:

source: Start the services:
ko_kr: 서비스를 시작하십시오:

source: Install and configure the network node
ko_kr: 네트워크 노드 설치 및 구성

source: Start Open vSwitch<phrase os="rhel;centos;fedora;opensuse;sles"> and configure it to start when the system boots</phrase>:
ko_kr: Open vSwitch를 시작하고 <phrase os="rhel;centos;fedora;opensuse;sles">시스템을 부팅할 때 시작하도록 설정하십시오</phrase>:

source: Update the OpenStack Networking <filename>/etc/neutron/neutron.conf</filename> configuration file:
ko_kr: <filename>/etc/neutron/neutron.conf</filename> 오픈스택 네트워킹 설정 파일을 업데이트하십시오:

source: Update the plug-in <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> configuration file:
ko_kr: <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> 플러그인 설정 파일을 업데이트하십시오:

source: All VM communication between the nodes occurs through the <literal>br-eth1</literal> bridge.
ko_kr: 모든 노드간 가상 머신 통신은 <literal>br-eth1</literal> 브릿지를 통해 이루어집니다.

source: Create the <literal>br-eth1</literal> network bridge:
ko_kr: <literal>br-eth1</literal> 네트워크 브릿지를 만드십시오:

source: Create the external network bridge to the Open vSwitch:
ko_kr: Open vSwitch에 외부 네트워크 브릿지를 만드십시오:

source: Edit the <filename>/etc/neutron/l3_agent.ini</filename> file and add these lines:
ko_kr: <filename>/etc/neutron/l3_agent.ini</filename> 파일을 편집하여 다음 줄을 추가하십시오:

source: Edit the <filename>/etc/neutron/api-paste.ini</filename> file and add these lines:
ko_kr: <filename>/etc/neutron/api-paste.ini</filename> 파일을 편집하여 다음 줄을 추가하십시오:

source: Edit the <filename>/etc/neutron/dhcp_agent.ini</filename> file and add this line:
ko_kr: <filename>/etc/neutron/dhcp_agent.ini</filename> 파일을 편집하여 다음 줄을 추가하십시오:

source: Restart networking services:
ko_kr: 네트워킹 서비스를 다시 시작하십시오:

source: Start and permanently enable networking services:
ko_kr: 네트워킹 서비스를 시작하고 완전히 활성화 하십시오:

source: Enable the <systemitem class="service">neutron-ovs-cleanup</systemitem> service. This service starts on boot and ensures that Networking has full control over the creation and management of <literal>tap</literal> devices.
ko_kr: <systemitem class="service">neutron-ovs-cleanup</systemitem> 서비스를 활성화 하십시오. 이 서비스는 부팅할 때 시작하며 <literal>tap</literal> 장치의 생성과 관리에 대한 전반적인 제어권을 쥔 상태의 네트워킹 환경이 갖춰졌는지 확인합니다.

source: Install and configure the compute node
ko_kr: Compute 노드 설치 및 구성

source: Start the OpenvSwitch service<phrase os="rhel;centos;fedora;opensuse;sles"> and configure it to start when the system boots</phrase>:
ko_kr: Open vSwitch 서비스를 시작하고 <phrase os="rhel;centos;fedora;opensuse;sles">시스템을 부팅할 때 시작하도록 설정하십시오</phrase>:

source: Create the integration bridge:
ko_kr: 통합 브릿지를 만드십시오:

source: All VM communication between the nodes occur through the <literal>br-eth1</literal> bridge.
ko_kr: 노드 사이에서 주고받는 모든 가상 머신끼리의 통신은 <literal>br-eth1</literal> 브릿지를 통해 이루어집니다.

source: Edit the OpenStack Networking <filename>/etc/neutron/neutron.conf</filename> configuration file and add this line:
ko_kr: <filename>/etc/neutron/neutron.conf</filename> 오픈스택 네트워킹 설정 파일을 편집하여 다음 줄을 추가하십시오:

source: Restart the OpenvSwitch Neutron plug-in agent:
ko_kr: OpenvSwitch Neutron 플러그인 에이전트 재시작:

source: Logical network configuration
ko_kr: 논리 네트워크 설정

source: Run these commands on the network node.
ko_kr: 네트워크 노드에서 다음 명령을 실행하십시오.

source: Ensure that the following environment variables are set. Various clients use these variables to access the Identity Service.
ko_kr: 다음 환경 변수를 설정했는지 확인하십시오. 여러 클라이언트에서는 오픈스택 인증에 접근하는 목적으로 이 변수를 사용합니다.

source: Create an <filename>adminrc</filename> file that contains these lines:
ko_kr: 다음 줄의 내요잉 들어간 <filename>adminrc</filename> 파일을 만드십시오:

source: Export the environment variables in the <filename>adminrc</filename> file:
ko_kr: <filename>adminrc</filename> 파일의 환경 변수를 내보내십시오:

source: The <literal>admin</literal> tenant can define resources that other tenants can use but cannot modify. These resources are a provider network and its associated router.
ko_kr: <literal>admin</literal> 테넌트에서는 자원을 정의할 수 있지만 다른 테넌트은 그렇지 않습니다. 이 자원은 제공자 네트워크를 말하며, 라우터와 관련이 있습니다.

source: The <literal>admin</literal> user creates a network and subnet on behalf of <literal>tenant_A</literal>.
ko_kr: <literal>admin</literal> 사용자는 <literal>tenant_A</literal>의 네트워크와 하위 네트워크를 만듭니다.

source: A <literal>tenant_A</literal> user can also complete these steps.
ko_kr: <literal>tenant_A</literal> 사용자는 아래 단계를 마무리 지을 수 있습니다.

source: Configure internal networking
ko_kr: 내부 네트워크 구성

source: Get the <literal>tenant_A</literal> tenant ID:
ko_kr: <literal>tenant_A</literal> tenant ID를 가져옵니다:

source: Create the <literal>net1</literal> internal network for the <literal>tenant_A</literal> tenant:
ko_kr: <literal>tenant_A</literal> 테넌트용 <literal>net1</literal> 내부 네트워크를 만드십시오:

source: Create a subnet on the <literal>net1</literal> network and store its ID in a variable:
ko_kr: <literal>net1</literal> 네트워크에 하위 네트워크를 만들고 하위 네트워크 ID를 변수에 설정하십시오:

source: The <literal>id</literal> value will be different on your system.
ko_kr: <literal>id</literal> 값은 시스템에 따라 다를 수 있습니다.

source: A user with the <literal>admin</literal> role in the <literal>admin</literal> tenant must complete these steps.
ko_kr: <literal>admin</literal> 테넌트의 <literal>admin</literal> 역할을 가진 사용자는 아래 과정을 완료해야 합니다.

source: Configure the router and external networking
ko_kr: 라우터와 외부 네트워크 구성

source: Create a <literal>router1</literal> router and store its ID in the <literal>ROUTER_ID</literal> variable:
ko_kr: <literal>router1</literal> 라우터를 만들고 <literal>ROUTER_ID</literal> 변수에 라우터 ID를 지정하십시오:

source: The <parameter>--tenant-id</parameter> parameter is not specified, so this router is assigned to the <literal>admin</literal> tenant.
ko_kr: <parameter>--tenant-id</parameter> 매개 변수를 지정하지 않았으므로 이 라우터는 <literal>admin</literal> 테넌트에 할당합니다.

source: Add an interface to the <literal>router1</literal> router and attach it to the subnet from <literal>net1</literal>:
ko_kr: <literal>router1</literal> 라우터에 인터페이스를 추가하고 <literal>net1</literal>의 하위 네트워크에 연결하십시오.

source: You can repeat this step to add interfaces for networks that belong to other tenants.
ko_kr: 다른 테넌트 소속의 네트워크에 사용할 인터페이스를 추가하는데 이 과정을 반복할 수 있습니다.

source: Create the <literal>ext_net</literal> external network and store its ID in a the <literal>EXTERNAL_NETWORK_ID</literal> variable:
ko_kr: <literal>ext_net</literal> 외부 네트워크를 만들고 literal>EXTERNAL_NETWORK_ID</literal> 변수에 외부 네트워크 ID를 지정하십시오:

source: Create the subnet for floating IPs.
ko_kr: 유동 IP의 서브넷을 만드십시오.

source: The DHCP service is disabled for this subnet.
ko_kr: DHCP 서비스를 이 서브넷에서는 비활성화했습니다.

source: Set the gateway for the router to the external network:
ko_kr: 라우터의 게이트웨이를 외부 네트워크로 설정하십시오:

source: A user from <literal>tenant_A</literal> completes these steps, so the credentials in the environment variables are different than those in the previous procedure.
ko_kr: <literal>tenant_A</literal>의 사용자로 이 과정을 완료하여, 환경 변수의 인증 정보를 이전 과정과 다르게 하십시오.

source: Allocate floating IP addresses
ko_kr: 유동 IP 주소 할당

source: You can associate a floating IP address with a VM after it starts. Store the port ID that was allocated for the VM in the <literal>PORT_ID</literal> variable:
ko_kr: VM을 시작하고 나서도 유동 IP 주소를 할당할 수 있습니다. 가상 머신에 할당한 포트 ID를 <literal>PORT_ID</literal> 변수에 지정하십시오:

source: Allocate a floating IP and store its ID in the <literal>FLOATING_ID</literal> variable:
ko_kr: 유동 IP를 할당하고 유동 IP의 ID를 <literal>FLOATING_ID</literal> 변수에 지정하십시오:

source: Associate the floating IP with the port for the VM:
ko_kr: 가상 머신에 대한 유동 IP와 포트를 연결하십시오:

source: Show the floating IP:
ko_kr: 유동 IP를 표시하십시오:

source: Test the floating IP:
ko_kr: 유동 IP를 시험해보십시오:

source: Use case: provider router with private networks
ko_kr: 사용 사례: 사설 네트워크와 provider 라우터

source: This use case provides each tenant with one or more private networks that connect to the outside world through an OpenStack Networking router. When each tenant gets exactly one network, this architecture maps to the same logical topology as the VlanManager in Compute (although of course, Networking does not require VLANs). Using the Networking API, the tenant can only see a network for each private network assigned to that tenant. The router object in the API is created and owned by the cloud administrator.
ko_kr: 이 활용 사례의 경우 하나 이상의 오픈스택 네트워킹 라우터로 외부 연결과 연결된 개인 네트워크에 각각의 테넌트를 제공합니다. 각각의 테넌트에 정확히 하나의 네트워크를 제공할 경우 이러한 구조는 처리부의 VlanManager와 같은 논리 토폴로지에 대응됩니다(물론, 네트워킹에서 VLAN을 필요로 하지 않는다고 하지만). 네트워크 API를 사용하여 테넌트은 각 테넌트에 할당한 개인 네트워크의 네트워크만 볼 수 있습니다. API의 라우터 오브젝트는 클라우드 관리자가 만들고 소유합니다.

source: This model supports assigning public addresses to VMs by using <glossterm baseform="floating IP">floating IPs</glossterm>; the router maps public addresses from the external network to fixed IPs on private networks. Hosts without floating IPs can still create outbound connections to the external network because the provider router performs SNAT to the router's external IP. The IP address of the physical router is used as the <literal>gateway_ip</literal> of the external network subnet, so the provider has a default router for Internet traffic.
ko_kr: 이 모델은 <glossterm baseform="floating IP">유동 IP</glossterm>를 사용하여 가상 머신으로의 공용 주소 할당을 지원합니다. 라우터는 외부 네트워크로부터 비공개 네트워크의 고정 IP로 공용 주소를 일치시킵니다. 유동 IP를 사용하지 않는 호스트는 외부 네트워크로 연결하는 외부 연결을 만들 수 있는데 라우터의 외부 IP로 제공자 라우터에서 SNAT를 수행하기 때문입니다. 물리 라우터의 IP 주소는 외부 네트워크 하위 네트워크의 <literal>gateway_ip</literal>로 사용하여, 제공자 측에서는 인터넷 트래픽에 대한 기본 라우터를 보유합니다.
