Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: For simplicity, this guide describes configuring the Image Service to use the <literal>file</literal> back end, which uploads and stores in a directory on the controller node hosting the Image Service. By default, this directory is <filename>/var/lib/glance/images/</filename>.
pt_br: Para simplificar, este guia descreve a configuração do Serviço de Imagem para utilizar o back end de <literal>arquivo</literal>, que carrega e armazena em um diretório no nodo controlador que hospeda o Serviço de Imagem. Por padrão, este diretório é <filename>/var/lib/glance/images/</filename>.

source: Before you proceed, ensure that the controller node has at least several gigabytes of space available in this directory.
pt_br: Antes de prosseguir, certifique-se de que o nodo controlador tem pelo menos vários gigabytes de espaço disponível neste diretório.

source: For information on requirements for other back ends, see <link href="http://docs.openstack.org/trunk/config-reference/content/ch_configuring-openstack-image-service.html"><citetitle>Configuration Reference</citetitle></link>.
pt_br: Para informações sobre os requerimentos para outros back ends, consulte a <link href="http://docs.openstack.org/trunk/config-reference/content/ch_configuring-openstack-image-service.html"><citetitle>Referência de Configuração</citetitle></link>.

source: Before you begin
ko_kr: 시작 전 주의사항
pt_br: Antes de você começar

source: For best performance, we recommend that your environment meets or exceeds the hardware requirements in <xref linkend="example-architecture-with-neutron-networking-hw"/> or <xref linkend="example-architecture-with-legacy-networking-hw"/>. However, OpenStack does not require a significant amount of resources and the following minimum requirements should support a proof-of-concept environment with core services and several <glossterm>CirrOS</glossterm> instances:
pt_br: Para melhor desempenho, recomendamos que seu ambiente atenda ou exceda os requerimentos de hardware em <xref linkend="example-architecture-with-neutron-networking-hw"/> ou <xref linkend="example-architecture-with-legacy-networking-hw"/>. Contudo, o OpenStack não requer um tanto significativo de recursos e os seguintes requerimentos mínimos devem suportar um ambiente de prova de conceito com serviços principais e várias instâncias <glossterm>CirrOS</glossterm>.

source: Controller Node: 1 processor, 2 GB memory, and 5 GB storage
ko_kr: 컨트롤러 노드: 1 프로세서, 2 GB 메모리, 5GB 스토리지
pt_br: Nodo Controlador: 1 processador, 2 GB de memória, e 5GB de armazenamento

source: Network Node: 1 processor, 512 MB memory, and 5 GB storage
ko_kr: 네트워크 노드: 1 프로세서, 512 MB 메모리, 5 GB 스토리지
pt_br: Nodo de Rede: 1 processador, 512 MB de memória, e 5GB de armazenamento

source: Compute Node: 1 processor, 2 GB memory, and 10 GB storage
ko_kr: Compute 노드: 1 프로세서, 2 GB 메모리, 10 GB 스토리지
pt_br: Nodo de Computação: 1 processador, 2 GB de memória, e 10GB de armazenamento

source: To minimize clutter and provide more resources for OpenStack, we recommend a minimal installation of your Linux distribution. Also, we strongly recommend that you install a 64-bit version of your distribution on at least the compute node. If you install a 32-bit version of your distribution on the compute node, attempting to start an instance using a 64-bit image will fail.
pt_br: Para minimizar a desordem e fornecer mais recursos para o OpenStack, recomendamos uma instalação mínima de sua distribuição Linux. Também, recomendamos fortemente que você instale uma versão de 64-bits da sua distribuição pelo menos no nodo de Computação. se você instalar a versão de 32 bits da sua distribuição no nodo de computação, a tentativa de iniciar uma instância usando uma imagem de 64-bits irá falhar.

source: A single disk partition on each node works for most basic installations. However, you should consider <glossterm>Logical Volume Manager (LVM)</glossterm> for installations with optional services such as Block Storage.
pt_br: Uma partição simples de disco em cada nodo funciona para as instalações mais básicas. Contudo, você deve considerar o <glossterm>Gerenciador de volumes lógicos (LVM)</glossterm> para instalações com serviços opcionais como o Block Storage.

source: Many users build their test environments on <glossterm baseform="virtual machine (VM)">virtual machines (VMs)</glossterm>. The primary benefits of VMs include the following:
pt_br: Muitos usuários constroem seus ambientes de testes em <glossterm baseform="virtual machine (VM)">máquinas virtuais (VMs)</glossterm>. O principal benefício das VMs incluem os seguintes:

source: One physical server can support multiple nodes, each with almost any number of network interfaces.
pt_br: Um servidor físico pode suportar múltiplos nodes, cada um com quase qualquer número de interfaces de rede.

source: Ability to take periodic "snap shots" throughout the installation process and "roll back" to a working configuration in the event of a problem.
pt_br: Habilidade de pegar "snap shots" através do processo de instalação e "retornar" para uma configuração funcional em caso de problemas.

source: However, VMs will reduce performance of your instances, particularly if your hypervisor and/or processor lacks support for hardware acceleration of nested VMs.
pt_br: Contudo, as VMs irão reduzir o desempenho de suas instâncias, particularmente se seu hypervisor e/ou seu processador não possui suporte para aceleração por hardware de VMs aninhadas.

source: If you choose to install on VMs, make sure your hypervisor permits <glossterm>promiscuous mode</glossterm> and disables MAC address filtering on the <glossterm>external network</glossterm>.
pt_br: Se você escolher instalar em VMs, certifique-se que seu hypervisor permita <glossterm>modo promíscuo</glossterm> e desabilite a filtragem de endereços MAC na <glossterm>rede externa</glossterm>.

source: For more information about system requirements, see the <link href="http://docs.openstack.org/ops/">OpenStack Operations Guide</link>.
ko_kr: 더 많은 시스템 요구 사항 정보를 보려면 <link href="http://docs.openstack.org/ops/">오픈스택 운영 안내서</link>를 보십시오.
pt_br: Para mais informações sobre requisitos de sistema, consulte <link href="http://docs.openstack.org/ops/">OpenStack Operations Guide</link>.

source: Reserved user IDs
ko_kr: 예약된 사용자 ID
pt_br: IDs de usuário reservados

source: OpenStack reserves certain user IDs to run specific services and own specific files. These user IDs are set up according to the distribution packages. The following table gives an overview.
pt_br: O OpenStack reserva certos IDs de usuário para executar serviços específicos e deter arquivos específicos. Estes IDs de usuário são configurados de acordo com os pacotes da distribuição. A tabela seguinte dá uma visão geral.

source: Some OpenStack packages generate and assign user IDs automatically during package installation. In these cases, the user ID value is not important. The existence of the user ID is what matters.
ko_kr: 어떤 OpenStack 패키지를 생성하고 패키지 설치시 자동으로 사용자 ID를 지정합니다. 이런 경우, 사용자 ID 값은 중요하지 않습니다. 사용자 ID의 존재 여부가 중요합니다.
pt_br: Alguns pacotes do OpenStack geram e atribuem IDs de usuário automaticamente durante a instalação de pacotes. Nesses casos, o valor do ID de usuário não é importante. O que importa é a existência do ID.

source: Name
ko_kr: 이름
pt_br: Nome

source: Description
ko_kr: 설명
pt_br: Descrição

source: OpenStack Ceilometer Daemons
pt_br: Daemons de Ceilometer do openStack

source: Assigned during package installation
ko_kr: 패키지 설치하는 동안 지정
pt_br: Atribuído durante a instalação de pacotes.

source: OpenStack Cinder Daemons
pt_br: Daemons de Cinder do OpenStack

source: OpenStack Glance Daemons
pt_br: Daemons de Glance do OpenStack

source: OpenStack Heat Daemons
ko_kr: OpenStack Glance Daemons
pt_br: Daemons de Heat do OpenStack

source: OpenStack Keystone Daemons
pt_br: Daemons de Keystone do OpenStack

source: OpenStack Neutron Daemons
pt_br: Daemons de Neutron do OpenStack

source: OpenStack Nova Daemons
pt_br: Daemons de Nova do OpenStack

source: OpenStack Swift Daemons
pt_br: Daemons de Swift do OpenStack

source: Each user belongs to a user group with the same name as the user.
ko_kr: 각 사용자는 같은 이름의 유저 그룹에 사용자로 속합니다.
pt_br: Cada usuário pertence a um grupo de usuários com o mesmo nome do usuário.

source: Install and configure Orchestration
pt_br: Instale e configure a Orquestração

source: This section describes how to install and configure the Orchestration module, code-named heat, on the controller node.
pt_br: Esta seção descreve como instalar e configurar o módulo de Orquestração, apelidado de heat, no nodo controlador.

source: Before you install and configure Orchestration, you must create a database, service credentials, and API endpoints.
pt_br: Antes de instalar e configurar a Orquestração, você deve criar uma base de dados, credenciais de serviço, e endpoints de API.

source: Create the <literal>heat</literal> database:
pt_br: Crie a base de dados <literal>heat</literal>:

source: Grant proper access to the <literal>heat</literal> database:
pt_br: Conceda as pemissões apropriadas à base de dados do <literal>heat</literal>:

source: Replace <replaceable>HEAT_DBPASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>HEAT_DBPASS</replaceable> com uma senha adequada.

source: Create the <literal>heat</literal> user:
pt_br: Crie o usuário <literal>heat</literal>:

source: Replace <replaceable>HEAT_PASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>HEAT_PASS</replaceable> com uma senha adequada.

source: Add the <literal>admin</literal> role to the <literal>heat</literal> user:
pt_br: Adicione o papel <literal>admin</literal> ao usuário <literal>heat</literal>:

source: Create the <literal>heat_stack_owner</literal> role:
pt_br: Crie o papel <literal>heat_stack_owner</literal>:

source: Add the <literal>heat_stack_owner</literal> role to the <literal>demo</literal> tenant and user:
pt_br: Adicione o papel <literal>heat_stack_owner</literal> ao tenant e usuário <literal>demo</literal>:

source: You must add the <literal>heat_stack_owner</literal> role to users that manage stacks.
pt_br: Você deve adicionar o papel <literal>heat_stack_owner</literal> para usuários que gerenciam pilhas.

source: Create the <literal>heat_stack_user</literal> role:
pt_br: Crie o papel <literal>heat_stack_user</literal>:

source: The Orchestration service automatically assigns the <literal>heat_stack_user</literal> role to users that it creates during stack deployment. By default, this role restricts <glossterm>API</glossterm> operations. To avoid conflicts, do not add this role to users with the <literal>heat_stack_owner</literal> role.
pt_br: O serviço de Orquestração atribui automaticamente o papel <literal>heat_stack_user</literal> a usuários que ele cria durante a implantação da pilha ou stack. Por padrão, este papel restringe as operações de <glossterm>API</glossterm>. Para evitar conflitos, não adicione este papel para usuários com o papel <literal>heat_stack_owner</literal>.

source: Create the <literal>heat</literal> and <literal>heat-cfn</literal> service entities:
pt_br: Crie as entidades de serviço <literal>heat</literal> e <literal>heat-cfn</literal>:

source: Create the Orchestration service API endpoints:
pt_br: Crie os endpoints de API do serviço de Orquestração:

source: To install and configure the Orchestration components
pt_br: Para instalar e configurar os componentes da Orquestração

source: Run the following commands to install the packages:
pt_br: Execute os seguintes comandos para instalar os pacotes:

source: Edit the <filename>/etc/heat/heat.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/heat/heat.conf</filename> e complete as seguintes ações:

source: Replace <replaceable>HEAT_DBPASS</replaceable> with the password you chose for the Orchestration database.
pt_br: Substitua <replaceable>HEAT_DBPASS</replaceable> com a senha que você escolheu para a base de dados da Orquestração.

source: In the <literal>[keystone_authtoken]</literal> and <literal>[ec2authtoken]</literal> sections, configure Identity service access:
pt_br: Nas seções <literal>[keystone_authtoken]</literal> e <literal>[ec2authtoken]</literal>, configure o acesso ao serviço de Identidade:

source: Replace <replaceable>HEAT_PASS</replaceable> with the password you chose for the <literal>heat</literal> user in the Identity service.
pt_br: Substitua <replaceable>HEAT_PASS</replaceable> com a senha que você escolheu para o usuário <literal>heat</literal> no serviço de Identidade.

source: In the <literal>[DEFAULT]</literal> section, configure the metadata and wait condition URLs:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure o metadado e as URLs de condição de espera:

source: Populate the Orchestration database:
pt_br: Popule a base de dados de Orquestração:

source: In the <literal>[ec2authtoken]</literal> section, configure Identity service access:
pt_br: Na seção <literal>[ec2authtoken]</literal>, configure o acesso ao Serviço de Identidade:

source: Restart the Orchestration services:
pt_br: Reinicie os serviços de Orquestração:

source: Start the Orchestration services and configure them to start when the system boots:
pt_br: Inicie os serviços de Orquestração e configure-os para iniciar quando o sistema inicializar:

source: Configure the Image Service for Telemetry
ko_kr: Telemetry에 대한 이미지 서비스 구성
pt_br: Configure o Serviço de Imagem para Telemetria

source: To retrieve image samples, you must configure the Image Service to send notifications to the message broker. Edit the <filename>/etc/glance/glance-api.conf</filename> and <filename>/etc/glance/glance-registry.conf</filename> files and complete the following actions:
pt_br: Para recuperar amostras de imagem, você deve configurar o Serviço de Imagem para enviar notificações para o agente de mensagem. Edite os arquivos <filename>/etc/glance/glance-api.conf</filename> e <filename>/etc/glance/glance-registry.conf</filename> e complete as seguintes ações:

source: In the <literal>[DEFAULT]</literal> section, configure notifications and RabbitMQ message broker access:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure as notificações e o acesso ao agente de mensagens RabbitMQ:

source: Restart the Image Service:
pt_br: Reiniciando o Serviço de Imagens:

source: Services and the [keystone_authtoken]
ko_kr: 서비스와 [keystone_authtoken]
pt_br: Servicços e o [keystone_authtoken]

source: Because most OpenStack services must access the Identity Service, you must configure the IP address of the <code>keystone</code> server to be able to access it. You must also configure the <code>admin_tenant_name</code>, <code>admin_user</code>, and <code>admin_password</code> options for each service to work.
ko_kr: 대부분의 오픈스택 서비스는 반드시 인증 서비스에 접근하여야 하므로 <code>keystone</code> 서버에 접근할 수 있으려면 IP 주소를 설정해야 합니다. 또한 각 서비스가 동작하도록 <code>admin_tenant_name</code>, <code>admin_user</code>, <code>admin_password</code> 옵션을 설정해야 합니다.
pt_br: Como a maioria dos serviços do OpenStack deve acessar o Serviço de Identidade, você deve configurar o endereço IP do servidor do <code>keystone</code> de modo a poder acessá-lo. Você deve configurar também as opções <code>admin_tenant_name</code>, <code>admin_user</code>, e <code>admin_password</code> para cada serviço funcionar.

source: Generally, this section looks like this:
ko_kr: 보통, 이 섹션은 다음과 같이 보입니다:
pt_br: Geralmente, essa sessão aparece dessa forma:

source: The debconf system helps users configure the <code>auth_uri</code>, <code>identity_uri</code>, <code>admin_tenant_name</code>, <code>admin_user</code> and <code>admin_password</code> options.
pt_br: O sistema debconf ajuda os usuários a configurar as opções <code>auth_uri</code>, <code>identity_uri</code>, <code>admin_tenant_name</code>, <code>admin_user</code> e <code>admin_password</code>.

source: The following screens show an example Image Service configuration:
ko_kr: 다음 화면은 예제로 구성한 이미지 서비스를 보여줍니다:
pt_br: As telas seguintes mostram um exemplo de configuração do Serviço de Imagem.

source: This information is stored in the configuration file for each service. For example:
ko_kr: 이 정보는 개별 서비스의 구성파일에 저장됩니다. 예를 들면:
pt_br: Essa informação é armazenada no arquivo de configuração para cada serviço. For exemplo:

source: The Debian OpenStack packages offer automation for this, so OpenStack users do not have to manually edit the configuration files.
ko_kr: 데비안 오픈스택 꾸러미는 이에 대한 자동화를 제공하므로, 오픈스택 사용자가 설정 파일을 직접 편집할 필요가 없습니다.
pt_br: Os pacotes Debian OpenStack oferecem automatização para isso, então os usuários do OpenStack não devem editar manualmente os arquivos de configuração.

source: OpenStack Installation Guide for <phrase os="rhel;centos;fedora">Red Hat Enterprise Linux 7, CentOS 7, and Fedora 20</phrase><phrase os="ubuntu">Ubuntu 14.04</phrase><phrase os="debian">Debian 7</phrase><phrase os="opensuse">openSUSE 13.1 and SUSE Linux Enterprise Server 11 SP3</phrase>
pt_br: Guia de Instalação do OpenStack para <phrase os="rhel;centos;fedora">Red Hat Enterprise Linux 7, CentOS 7, and Fedora 20</phrase><phrase os="ubuntu">Ubuntu 14.04</phrase><phrase os="debian">Debian 7</phrase><phrase os="opensuse">openSUSE 13.1 e SUSE Linux Enterprise Server 11 SP3</phrase>

source: Red Hat Enterprise Linux, CentOS, and Fedora
ko_kr: Red Hat Enterprise Linux, CentOS, Fedora
pt_br: Red Hat Enterprise Linux, CentOS, e Fedora

source: openSUSE and SUSE Linux Enterprise Server
ko_kr: openSUSE, SUSE Linux Enterprise Server
pt_br: openSUSE e SUSE Linux Enterprise Server

source: OpenStack Installation Guide for <placeholder-1/><placeholder-2/><placeholder-3/><placeholder-4/>
pt_br: Guia de Instalação do OpenStack para <placeholder-1/><placeholder-2/><placeholder-3/><placeholder-4/>

source: OpenStack Installation Guide
ko_kr: OpenStack 설치 가이드
pt_br: Guia de Instalação do OpenStack

source: Copyright details are filled in by the template.
ko_kr: 저작권 상세 정보는 양식에 맞게 채워집니다.
pt_br: Detalhes de direitos autorais são preenchidos pelo modelo.

source: The OpenStack® system consists of several key projects that you install separately. These projects work together depending on your cloud needs. These projects include Compute, Identity Service, Networking, Image Service, Block Storage, Object Storage, Telemetry, Orchestration, and Database. You can install any of these projects separately and configure them stand-alone or as connected entities. <phrase os="debian">This guide walks through an installation by using packages available through Debian 7 (code name: Wheezy).</phrase><phrase os="ubuntu">This guide walks through an installation by using packages available through Ubuntu 14.04.</phrase><phrase os="rhel;centos;fedora">This guide shows you how to install OpenStack by using packages available through Fedora 20 as well as on Red Hat Enterprise Linux 7 and its derivatives through the EPEL repository.</phrase><phrase os="opensuse;sles">This guide shows you how to install OpenStack by using packages on openSUSE 13.1 and SUSE Linux Enterprise Server 11 SP3 through the Open Build Service Cloud repository.</phrase> Explanations of configuration options and sample configuration files are included.
pt_br: O sistema OpenStack consiste de vários projetos principais que você instala separadamente. Estes projetos trabalham juntos dependendo de suas necessidades de nuvem. Este projetos incluem Computação, Serviço de Identidade, Rede, Serviço de Imagem, Block Storage, Object Storage, Telemetria, Orquestração, e Banco de Dados. Você pode instalar quaisquer destes projetos separadamente e configurá-los autonomamente ou como entidades conectadas. <phrase os="debian">Este guia caminha através de uma instalação usando os pacotes disponíveis no Debian 7 (codinome: Wheezy).</phrase><phrase os="ubuntu">Este guia caminha através de uma instalação usando os pacotes disponíveis no Ubuntu 14.04.</phrase><phrase os="rhel;centos;fedora">Este guia mostra a você como instalar o OpenStack utilizando pacotes disponíveis através do Fedora 20 bem como no Red Hat Enterprise Linux 7 e seus derivados através do repositório EPEL.</phrase><phrase os="opensuse;sles">Este guia mostra a você como instalar o OpenStack utilizando pacotes disponíveis no openSUSE 13.1 e SUSE Linux Enterprise Server 11 SP3 através do repositório Open Build Service Cloud.</phrase>

source: For the Juno release, this guide contains these updates: Replace openstack-config commands with general configuration file editing. Standardize on a single message queue system (RabbitMQ). Reference generic SQL database, enabling MySQL or MariaDB where appropriate. Replace auth_port and auth_protocol with identity_uri, and auth_host with auth_uri. Multiple edits for consistency. It has been updated for Juno and new distribution versions.
pt_br: Para a versão Juno, este guia contém estas atualizações: Substitua os comandos openstack-config por edição de arquivos de configuração gerais. Padronize em um sistema simples de fila de mensagens (RabbitMQ). Referencie bancos de dados SQL genéricos, habilitando MySQL ou MariaDB onde apropriado. Substitua auth_port e auth_protocol por identity_uri, e auth_host por auth_uri. Várias edições para consistência. Ele tem sido atualizado para Juno e novas versões de distribuição.

source: Start documentation for Juno.
pt_br: Iniciar documentação para Juno.

source: Update for Icehouse, rework Networking setup to use ML2 as plugin, add new chapter for Database Service setup, improved basic configuration.
pt_br: Atualização para o Icehouse, retrabalho da configuração de Rede para utilizar ML2 como plug-in, adição de novo capítulo para configuração do Serviço de Banco de Dados, melhoria da configuração básica.

source: Added initial Debian support.
ko_kr: 초기 Debian 지원 추가함.
pt_br: Adicionado suporte inicial ao Debian.

source: Havana release.
ko_kr: Havana 릴리즈.
pt_br: Versão Havana.

source: Add support for SUSE Linux Enterprise.
ko_kr: SUSE Linux Enterprise 지원 추가.
pt_br: Adição do suporte para SUSE Linux Enterprise.

source: Complete reorganization for Havana.
ko_kr: Havana에 맞게 개편 완료.
pt_br: Reorganização completa para Havana.

source: Build also for openSUSE.
ko_kr: openSUSE용 빌드.
pt_br: Build para openSUSE.

source: Fixes to Object Storage verification steps. Fix bug <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1207347">1207347</link>.
ko_kr: 오브젝트 스토리지 확인 과정 수정함. <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1207347">1207347</link> 버그 수정.
pt_br: Correções nas etapas de verificação do Object Storage. Correção de bug <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1207347">1207347</link>.

source: Adds creation of cinder user and addition to the service tenant. Fix bug <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1205057">1205057</link>.
ko_kr: Cinder 사용자 생성하는 부분 추가 및 서비스 tenant 추가. <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1205057">1205057</link> 버그 수정.
pt_br: Adiciona a criação de usuário do cinder adicionalmente ao service tenant. Erro corrigido <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1205057"> 1.205.057 </link>.

source: Updated the book title for consistency.
ko_kr: 일관성 확보를 위해 책 제목 업데이트.
pt_br: Atualizado o título do livro para consistência.

source: Updated cover and fixed small errors in appendix.
ko_kr: 표지 업데이트 및 부록 부분의 약간의 오류 수정.
pt_br: Atualizada a capa e corrigidos pequenos erros no apêndice.

source: Messaging server
ko_kr: 메시징 서버
pt_br: Servidor de mensagens
