Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: Install and configure
pt_br: Instalação e configuração

source: This section describes how to install and configure the OpenStack Identity service on the controller node.
pt_br: Esta seção descreve com instalar e configurar o serviço de Identidade do OpenStack no nodo controlador.

source: To configure prerequisites
pt_br: Para configurar pre-requisitos

source: Before you configure the OpenStack Identity service, you must create a database and an administration token.
pt_br: Antes de você configurar o serviço de Identidade do OpenStack, você deve criar um banco de dados e um token de administração.

source: To create the database, complete these steps:
pt_br: Para criar a base de dados, complete estes passos:

source: Use the database access client to connect to the database server as the <literal>root</literal> user:
pt_br: Utilize o cliente de acesso a banco de dados para acessar o servidor de banco de dados como usuário <literal>root</literal>:

source: Create the <literal>keystone</literal> database:
pt_br: Crie a base de dados do <literal>keystone</literal>:

source: Grant proper access to the <literal>keystone</literal> database:
pt_br: Conceda os acessos adequados para a base de dados do <literal>keystone</literal>:

source: Replace <replaceable>KEYSTONE_DBPASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>KEYSTONE_DBPASS</replaceable> com uma senha adequada.

source: Exit the database access client.
pt_br: Saia do cliente de acesso a banco de dados.

source: Generate a random value to use as the administration token during initial configuration:
pt_br: Gere um valor aleatório para utilizar como token de administração durante a configuração inicial:

source: To install and configure the components
pt_br: Para instalar e configurar os componentes

source: Run the following command to install the packages:
pt_br: Execute os seguintes comandos para instalar os pacotes:

source: Edit the <filename>/etc/keystone/keystone.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/keystone/keystone.conf</filename> e complete as seguintes ações:

source: In the <literal>[DEFAULT]</literal> section, define the value of the initial administration token:
pt_br: Na seção <literal>[DEFAULT]</literal>, defina o valor do token de administração inicial:

source: Replace <replaceable>ADMIN_TOKEN</replaceable> with the random value that you generated in a previous step.
pt_br: Substitua <replaceable>ADMIN_TOKEN</replaceable> com o valor aleatório que você gerou no passo anterior.

source: In the <literal>[database]</literal> section, configure database access:
pt_br: Na seção <literal>[database]</literal>, configure o acesso ao banco de dados:

source: controller
pt_br: controlador

source: Replace <replaceable>KEYSTONE_DBPASS</replaceable> with the password you chose for the database.
pt_br: Substitua <replaceable>KEYSTONE_DBPASS</replaceable> com a senha que você escolheu para o banco de dados.

source: In the <literal>[token]</literal> section, configure the UUID token provider and SQL driver:
pt_br: Na seção <literal>[token]</literal>, configure o provedor do token UUID e o driver SQL:

source: In the <literal>[revoke]</literal> section, configure the SQL revocation driver:
pt_br: Na seção <literal>[revoke]</literal>, configure o controlador de revogação SQL:

source: (Optional) To assist with troubleshooting, enable verbose logging in the <literal>[DEFAULT]</literal> section:
pt_br: (Opcional) Para auxiliar com a solução de problemas, habilite o log detalhado na seção <literal>[DEFAULT]</literal> :

source: Create generic certificates and keys and restrict access to the associated files:
pt_br: Crie certificados e chaves genéricos e restrinja o acesso aos arquivos associados:

source: Populate the Identity service database:
pt_br: Popule a base de dados do Serviço de Identidade:

source: <package>python-keystoneclient</package> will automatically be installed as it is a dependency of the <package>keystone</package> package.
pt_br: <package>python-keystoneclient</package> será instalado automaticamente, pois é uma dependência do pacote <package>keystone</package.

source: Respond to prompts for <xref linkend="debconf-dbconfig-common"/>, which will fill the below database access directive.
pt_br: Responda à perguntas para <xref linkend="debconf-dbconfig-common"/>, que irá preencher a diretiva abaixo, de acesso ao banco de dados.

source: If you decide to not use <placeholder-1/>, then you will have to create the database and manage its access rights yourself, and run the following by hand.
pt_br: Se você não decidir usar <placeholder-1/>, então você terá que criar o banco de dados e gerenciar seus direitos de acesso a si mesmo, e executar na mão os comandos seguintes.

source: Configure the initial administration token:
pt_br: Configure o token de administração inicial:

source: Use the random value that you generated in a previous step. If you install using non-interactive mode or you do not specify this token, the configuration tool generates a random value.
pt_br: Utilize o valor aleatório que você gerou no passo anterior. Se você instalar usando o modo não interativo ou você não especificar este token, a ferramenta de configuração gera um valor aleatório.

source: Later on, the package will configure the below directive with the value you entered:
pt_br: Mais tarde, o pacote irá configurar a diretiva abaixo com o valor inserido:

source: Create the <literal>admin</literal> tenant and user:
pt_br: Crie o tenant e o usuário <literal>admin</literal>:

source: During the final stage of the package installation, it is possible to automatically create an admin tenant and an admin user. This can later be used for other OpenStack services to contact the Identity service. This is the equivalent of running the below commands:
pt_br: Durante o estágio final de instalação de pacotes, é possível criar um inquilino administrador e um usuário administrador. Isso pode ser usado depois por outros serviços do OpenStack para contactar o Serviço de Identidade. Isso é o equivalente a rodar os seguintes comandos:

source: Create the Identity service endpoints
pt_br: Criando o endpoint do Serviço de Identidade

source: In Debian, the Keystone package offers automatic registration of Keystone in the service catalogue. This is equivalent of running the below commands:
pt_br: No Debian, o pacote Keystone oferece registro automático de Keystone no catálogo de serviços. Isso é equivalente a executar os comandos abaixo:

source: To finalize installation
ko_kr: 설치 후
pt_br: Para finalizar a instalação

source: Restart the Identity service:
pt_br: Reinicie o serviço de Identidade:

source: Start the Identity service and configure it to start when the system boots:
pt_br: Inicie o serviço de Identidade e configure-o para iniciar quando o sistema inicializar:

source: On SLES:
pt_br: No SLES:

source: On openSUSE:
pt_br: No OpenSUSE:

source: By default, the Ubuntu packages create a SQLite database.
pt_br: Por padrão, os pacotes do Ubuntu criam um banco de dados SQLite.

source: Because this configuration uses a SQL database server, you can remove the SQLite database file:
pt_br: Devido esta configuração utilizar um servidor de banco de dados SQL, você pode remover o arquivo de banco de dados SQLite:

source: By default, the Identity service stores expired tokens in the database indefinitely. The accumulation of expired tokens considerably increases the database size and might degrade service performance, particularly in environments with limited resources.
pt_br: Por padrão, o serviço de Identidade armazena os tokens expirados na base de dados indefinidamente. A acumulação de tokens expirados aumenta consideravelmente o tamanho da base de dados e pode degradar o desempenho do sistema, particularmente em ambientes com recursos limitados.

source: The Keystone package already contains a cron job under <filename>/etc/cron.hourly/keystone</filename>, so it is not necessary to manually configure a periodic task that purges expired tokens hourly. You can however have a look at (and eventually customize) the already configured script.
pt_br: O pacote Keystone já contém uma tarefa de cron sob <filename>/etc/cron.hourly/keystone</filename>, portanto, não é necessário configurar manualmente uma tarefa periódica que remove tokens expirados de hora em hora. Você pode, contudo, dar uma olhada em um script já configurado (e , eventualmente, customizá-lo).

source: The Keystone package already contains a cron job under <filename>/etc/cron.hourly/openstack-keystone</filename>, so it is not necessary to manually configure a periodic task that purges expired tokens hourly. You can however have a look at (and eventually customize) the already configured script.
pt_br: O pacote keystone já contém uma tarefa de cron sob <filename>/etc/cron.hourly/openstack-keystone</filename>, portanto, não é necessário configurar manualmente uma tarefa periódica que remove tokens expirados de hora em hora. Você pode, contudo, dar uma olhada em um script já configurado (e , eventualmente, customizá-lo).

source: We recommend that you use <systemitem class="service">cron</systemitem> to configure a periodic task that purges expired tokens hourly:
pt_br: Recomendamos que você utilize o <systemitem class="service">cron</systemitem> para configurar uma tarefa periódica que limpa os tokens expirados de hora em hora:

source: Database
ko_kr: 데이터베이스
pt_br: Banco de dados

source: Most OpenStack services use an SQL database to store information. The database typically runs on the controller node. The procedures in this guide use <application>MariaDB</application> or <application>MySQL</application> depending on the distribution. OpenStack services also support other SQL databases including <link href="http://www.postgresql.org/">PostgreSQL</link>.
pt_br: A maioria dos serviços OpenStack utilizam uma base de dados SQL para armazenar informações. A base de dados roda tipicamente no nodo controlador. Os procedimentos neste guia usam <application>MariaDB</application> ou <application>MySQL</application> dependendo da distribuição. Os serviços OpenStack também suportam outros bancos de dados SQL, incluindo <link href="http://www.postgresql.org/">PostgreSQL</link>.

source: To install and configure the database server
pt_br: Instalar e configurar o servidor de banco de dados

source: Install the packages:
ko_kr: 패키지를 설치하십시오:
pt_br: Instale os pacotes:

source: The Python MySQL library is compatible with MariaDB.
pt_br: A biblioteca Python MySQL é compatível com o MariaDB.

source: Choose a suitable password for the database root account.
pt_br: Escolha uma senha adequada para a conta root do banco de dados.

source: Edit the <filename>/etc/mysql/my.cnf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/mysql/my.cnf</filename> e complete as seguintes ações:

source: Edit the <filename>/etc/my.cnf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/my.cnf</filename> e complete as seguintes ações:

source: In the <literal>[mysqld]</literal> section, set the <literal>bind-address</literal> key to the management IP address of the controller node to enable access by other nodes via the management network:
pt_br: Na seção <literal>[mysqld]</literal>, defina a chave <literal>bind-address</literal> para o IP de gerenciamento do nodo controlador para habilitar o acesso pelos outros nodos via rede de gerenciamento:

source: In the <literal>[mysqld]</literal> section, set the following keys to enable useful options and the UTF-8 character set:
pt_br: Na seção <literal>[mysqld]</literal>, defina as seguintes chaves para habilitar opções úteis e o conjunto de caracteres UTH-8:

source: Restart the database service:
pt_br: Reinicie o serviço de banco de dados:

source: Start the database service and configure it to start when the system boots:
pt_br: Inicie o serviço de banco de dados e configure-o para iniciar quando o sistema inicializar:

source: Secure the database service:
pt_br: Proteja o serviço de banco de dados:

source: Secure the database service including choosing a suitable password for the root account:
pt_br: Proteja o serviço de banco de dados incluindo a escolha de uma senha apropriada para a conta root:

source: Configure the database with dbconfig-common
ko_kr: dbconfig-common으로 데이터베이스 설정
pt_br: Configure o banco de dados com o dbconfig-common

source: Many of the OpenStack services need to be configured to access a database. These are configured through a DSN (Database Source Name) directive as follows:
pt_br: Muitos dos serviços do OpenStack precisam ser configurados para acessar um abnco de dados. Eles são configurados através de diretivas DSN (Database Source Name) como a seguir:

source: This <literal>connection</literal> directive will be handled by the <package>dbconfig-common</package> package, which provides a standard Debian interface. It enables you to configure Debian database parameters. It includes localized prompts for many languages and it supports the following database backends: SQLite, MySQL, and PostgreSQL.
pt_br: Esta diretiva <literal>connection</literal> será manipulada pelo pacote <package>dbconfig-common</package>, que fornece a interface padrão Debian. Ele o habilita a configurar os parâmetros de banco de dados do Debian. Ele inclui solicitações localizadas para várias linguagens e suporta os seguintes bancos de dados: SQLite, MySQL, e PostgreSQL.

source: By default, the <package>dbconfig-common</package> package configures the OpenStack services to use SQLite. So if you use <package>debconf</package> in non-interactive mode and without pre-seeding, the OpenStack services that you install will use SQLite.
pt_br: Por padrão, o pacote <package>dbconfig-common</package> configura os serviços OpenStack para utilizarem SQLite. Assim se você usar o <package>debconf</package> em modo não-interativo e sem pré-respostas, os serviços OpenStack que você instalar utilizarão SQLite.

source: By default, <package>dbconfig-common</package> does not provide access to database servers over a network. If you want the <package>dbconfig-common</package> package to prompt for remote database servers that are accessed over a network and not through a UNIX socket file, reconfigure it, as follows:
ko_kr: 기본적으로 <package>dbconfig-common</package> 꾸러미에서 네트워크를 통한 데이터베이스 서버 접근을 제공하지 않습니다. <package>dbconfig-common</package> 꾸러미가 유닉스 소켓 파일을 통하지 않고 네트워크를 동해 접근하는 원격 데이터베이스 서버에 대해 묻도록 하려면 다음처럼 다시 설정하십시오:
pt_br: Por padrão, o <package>dbconfig-common</package> não fornece acesso a servidores de banco de dados através de uma rede. Se você quiser que o pacote <package>dbconfig-common</package> solicite pelos servidores remotos de banco de dados que são acessados através de uma rede e não através do arquivo de soquete UNIX, reconfigure-o como segue:

source: These screens appear when you re-configure the <package>dbconfig-common</package> package:
ko_kr: 아래 화면은 <package>dbconfig-common</package> 꾸러미를 다시 설정하는 장면을 나타냅니다:
pt_br: Estas telas aparecem quando você reconfigura o pacote <package>dbconfig-common</package>:

source: Unlike other <package>debconf</package> prompts, you cannot pre-seed the responses for the <package>dbconfig-common</package> prompts by using <placeholder-1/>. Instead, you must create a file in <filename>/etc/dbconfig-common</filename>. For example, you might create a keystone configuration file for <package>dbconfig-common</package> that is located in <filename>/etc/dbconfig-common/keystone.conf</filename>, as follows:
ko_kr: 다른 <package>debconf</package> 프롬프트에서와는 달리 <placeholder-1/> 명령을 사용하여 <package>dbconfig-common</package> 프롬프트에 대한 응답을 미리 지정할 수는 없습니다. 대신 <filename>/etc/dbconfig-common</filename> 디렉터리에 파일을 만들어야 합니다. 예를 들자면, 다음과 같이 <filename>/etc/dbconfig-common/keystone.conf</filename> 파일에 지정한 <package>dbconfig-common</package>에 대한 키스톤 설정 파일을 만드십시오:
pt_br: Diferentemente de outras solicitações do <package>debconf</package>, você não pode pré-definir as respostas para as solicitações do <package>dbconfig-common</package> utilizando <placeholder-1/>. Em vez disso, você deve criar um arquivo em <filename>/etc/dbconfig-common</filename>. Por exemplo, você pode criar um arquivo de configuração do keystone para o <package>dbconfig-common</package> que está localizado em <filename>/etc/dbconfig-common/keystone.conf</filename>, como segue:

source: After you create this file, run this command:
ko_kr: 이 파일을 만나고 나면 다음 명령을 실행하십시오:
pt_br: Depois de criar este arquivo, execute este comando:

source: The Identity Service is installed with MySQL as the database back end, <literal>keystonedb</literal> as database name, and the localhost socket file. The corresponding DNS will then be:
pt_br: O Serviço de Identidade é instalado com o MySQL como banco de dados, <literal>keystonedb</literal> como nome da base de dados, e o arquivo de soquete localhost. O DNS correspondente será então:

source: The <package>dbconfig-common</package> package will configure MySQL for these access rights, and create the database for you. Since OpenStack 2014.1.1, all OpenStack packages in Debian are performing the following MySQL query after database creation (if you decide to use MySQL as a back-end):
pt_br: O pacote <package>dbconfig-common</package> irá configurar o MySQL para estes direitos de acesso, e criar a base de dados para você. Desde o OpenStack 2014.1.1, todos os pacotes OpenStack no Debian estão realizando a seguinte query MySQL após a criação da base de dados (se você decidir usar MySQL como retaguarda):

source: So, if using Debian, you wont need to care about database creation, access rights and character sets. All that is handled for you by the packages.
pt_br: Assim, se você estiver usando Debian, não precisará se preocupar com a criação de banco de dados, direitos de acesso e conjuntos de caracteres. Tudo isso é manipuado para você pelos pacotes.

source: As an example, here are screenshots from the <package>cinder-common</package> package:
pt_br: Com um exemplo, aqui estão telas do pacote <package>cinder-common</package>:

source: By default in Debian, you can access the MySQL server from either localhost through the socket file or 127.0.0.1. To access it over the network, you must edit the <filename>/etc/mysql/my.cnf</filename> file, and the <literal>mysql.user</literal> table. To do so, Debian provides a helper script in the <package>openstack-deploy</package> package. To use it, install the package and run:
pt_br: Por padrão no Debian, você pode acessar o servidor MySQL através do arquivo de soquete ou pelo endereço 127.0.0.1. Para acessá-lo pela rede, você deve editar o arquivo <filename>/etc/mysql/my.cnf</filename>, e a tabela <literal>mysql.user</literal> table. Para isto, O Debian fornece um script auxiliar no pacote package>openstack-deploy</package>. Para utilizá-lo, instale o pacote e execute:

source: Alternatively, if you do not want to install this package, run this script to enable remote root access:
ko_kr: 대신 이 꾸러미를 설치하지 않으려면, 원격 루트 접근을 가능케 하기 위해 이 스크립트를 실행하십시오:
pt_br: Alternativamente, se você não quiser instalar este pacote, execute este script para habilitar o acesso remoto de root:

source: You must enable remote access before you install OpenStack services on multiple nodes.
pt_br: Você deve habilitar o acesso remoto antes de instalar os serviços do OpenStack em múltiplos nodos.

source: Launch an instance
ko_kr: 인스턴스 실행
pt_br: Lançando uma instância

source: An instance is a VM that OpenStack provisions on a compute node. This guide shows you how to launch a minimal instance using the <glossterm>CirrOS</glossterm> image that you added to your environment in the <xref linkend="ch_glance"/> chapter. In these steps, you use the command-line interface (CLI) on your controller node or any system with the appropriate OpenStack client libraries. To use the dashboard, see the <link href="http://docs.openstack.org/user-guide/content/ch_dashboard.html"><citetitle>OpenStack User Guide</citetitle></link>.
pt_br: Uma instância é uma VM que o OpenStack provisiona em um nodo de Computação. Este guia mostra a você como lançar uma instância mínima utilizando a imagem <glossterm>CirrOS</glossterm> que você adicionou ao seu ambiente no capítulo <xref linkend="ch_glance"/>. Nesses passos, você utiliza a interface de linha de comando (CLI) no seu nodo controlador ou qualquer sistema com as bibliotecas adequadas do cliente OpenStack. Para utilizar o dashboard, consulte <link href="http://docs.openstack.org/user-guide/content/ch_dashboard.html"><citetitle>Giua do usuário OpenStack</citetitle></link>.

source: Launch an instance using <link linkend="launch-instance-neutron">OpenStack Networking (neutron) </link> or <link linkend="launch-instance-nova">legacy networking (nova-network) </link>. For more information, see the <link href="http://docs.openstack.org/user-guide/content/cli_launch_instances.html"><citetitle>OpenStack User Guide</citetitle></link>.
ko_kr: <link linkend="launch-instance-neutron">OpenStack 네트워킹 (neutron) </link> 또는 <link linkend="launch-instance-nova">레거시 네트워킹 (nova-network)</link>를 사용하여 인스턴스를 실행합니다. 자세한 내용은 <link href="http://docs.openstack.org/user-guide/content/cli_launch_instances.html"><citetitle>OpenStack 사용자 가이드</citetitle></link>에서 확인하세요.
pt_br: Lance uma instância utilizando a <link linkend="launch-instance-neutron">Rede OpenStack (neutron) </link> or <link linkend="launch-instance-nova">Rede legada (nova-network) </link>.

source: These steps reference example components created in previous chapters. You must adjust certain values such as IP addresses to match your environment.
pt_br: Esses passos referenciam componentes de exemplo criados no capitulo anterior. Você deve ajustar certos valores, tais como endereço IP para corresponder ao seu ambiente.

source: Configure the Object Storage service for Telemetry
ko_kr: Telemetry를 하기 위한 Object Storage 서비스 구성
pt_br: Configure o servico de Object Storage para Telemetria.

source: Install the <package>python-ceilometerclient</package> package on your Object Storage proxy server:
pt_br: Instale o pacote <package>python-ceilometerclient</package> em seu seu servidor proxy de Object Storage:

source: To retrieve object store statistics, the Telemetry service needs access to Object Storage with the <literal>ResellerAdmin</literal> role. Give this role to your <literal>os_username</literal> user for the <literal>os_tenant_name</literal> tenant:
ko_kr: 오브젝트 저장소 통계를 가져오려면 텔레메트리 서비스에서 <literal>ResellerAdmin</literal> 역할을 통해 오브젝트 저장소에 접근해야 합니다. <literal>os_tenant_name</literal> 테넌트의 <literal>os_username</literal> 사용자에게 이 역할을 부여하십시오:
pt_br: Para obter estatísticas de armazenamento de objeto, o serviço de Telemetria precisa acessar o Object Storage com o papel <literal>ResellerAdmin</literal>. Atribua este papel ao seu usuário <literal>os_username</literal> de tenant.

source: You must also add the Telemetry middleware to Object Storage to handle incoming and outgoing traffic. Add these lines to the <filename>/etc/swift/proxy-server.conf</filename> file:
ko_kr: 들어오고 나가는 트래픽을 처리하도록 오브젝트 저장소에 텔레메트리 미들웨어를 추가해야 합니다. <filename>/etc/swift/proxy-server.conf</filename> 파일에 다음 줄을 추가하십시오:
pt_br: Você deve adicionar o middleware de Telemetria ao Object Storage para lidar com o tráfego de entrada e saída. Adicione estas linhas ao arquivo <filename>/etc/swift/proxy-server.conf</filename>:

source: Add <literal>ceilometer</literal> to the <literal>pipeline</literal> parameter of that same file:
ko_kr: 같은 파일의 <literal>pipeline</literal> 매개 변수에 <literal>ceilometer</literal>를 추가하십시오:
pt_br: Adicione <literal>ceilometer</literal> ao parâmetro <literal>pipeline</literal> desse mesmo arquivo:
