Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: The account server uses the account ring to maintain lists of containers.
pt_br: O servidor de conta utiliza o anel de conta para manter listas de contêineres.

source: To create the ring
pt_br: Para criar o anel

source: Change to the <literal>/etc/swift</literal> directory.
pt_br: Mude para o diretório <literal>/etc/swift</literal>.

source: Create the base <filename>account.builder</filename> file:
pt_br: Crie o arquivo base <filename>account.builder</filename>:

source: Add each storage node to the ring:
pt_br: Adicione cada nodo de armazenamento ao anel:

source: Replace <replaceable>STORAGE_NODE_MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> with the IP address of the management network on the storage node. Replace <replaceable>DEVICE_NAME</replaceable> with a storage device name on the same storage node. For example, using the first storage node in <xref linkend="swift-install-storage-node"/> with the <literal>/dev/sdb1</literal> storage device and weight of 100:
pt_br: Substitua <replaceable>STORAGE_NODE_MANAGEMENT_INTERFACE_IP_ADDRESS</replaceable> com o endereço IP da rede de gerenciamento no nodo de armazenamento. Substitua <replaceable>DEVICE_NAME</replaceable> com um nome de dispositivo de armazenamento no mesmo nodo de armazenamento. Por exemplo, utilizando o primeiro nodo de armazenamento em <xref linkend="swift-install-storage-node"/> com o dispositivo de armazenamento <literal>/dev/sdb1</literal> e peso de 100:

source: Repeat this command for each storage device on each storage node. The example architecture requires four variations of this command.
pt_br: Repita este comando para cada dispositivo de armazenamento em cada nodo de armazenamento. A arquitetura de exemplo requer quatro variações deste comando.

source: Verify the ring contents:
pt_br: Verifique o conteúdo do anel:

source: Rebalance the ring:
pt_br: Reequilibre o anel:

source: This process can take a while.
pt_br: Este processo pode demorar um pouco.

source: Container ring
pt_br: Anel contêiner

source: The container server uses the container ring to maintain lists of objects. However, it does not track object locations.
pt_br: O servidor de contêiner utiliza o anel contêiner para manter listas de objetos. Contudo, ele não rastreia localizações de objeto.

source: Create the base <filename>container.builder</filename> file:
pt_br: Crie o arquivo base <filename>container.builder</filename>:

source: Object ring
pt_br: Anel Objeto

source: The object server uses the object ring to maintain lists of object locations on local devices.
pt_br: O servidor de objeto utiliza o anel objeto para manter listas de localizações de objeto nos dispositivos locais.

source: Create the base <filename>object.builder</filename> file:
pt_br: Crie o arquivo base <filename>object.builder</filename>:

source: Distribute ring configuration files
pt_br: Distribua os arquivos de configuração de anel

source: Copy the <filename>account.ring.gz</filename>, <filename>container.ring.gz</filename>, and <filename>object.ring.gz</filename> files to the <literal>/etc/swift</literal> directory on each storage node and any additional nodes running the proxy service.
pt_br: Copie os arquivos <filename>account.ring.gz</filename>, <filename>container.ring.gz</filename>, e <filename>object.ring.gz</filename> para o diretório <literal>/etc/swift</literal> em cada nodo de armazenamento e em quaisquer nodos adicionais que estejam executando o serviço de proxy.

source: This section describes how to verify operation of the Object Storage service.
pt_br: Esta seção descreve como verificar a operação do serviço Object Storage.

source: Show the service status:
pt_br: Exibir o status do serviço:

source: Upload a test file:
pt_br: Carregar um arquivo de teste:

source: Replace <replaceable>FILE</replaceable> with the name of a local file to upload to the <literal>demo-container1</literal> container.
pt_br: Substitua <replaceable>FILE</replaceable> com o nome do arquivo local carregado para o contêiner <literal>demo-container1</literal>.

source: List containers:
pt_br: Listar contêineres:

source: Download a test file:
pt_br: Baixar um arquivo de teste:

source: Replace <replaceable>FILE</replaceable> with the name of the file uploaded to the <literal>demo-container1</literal> container.
pt_br: Substitua <replaceable>FILE</replaceable> com o nome do arquivo carregado para o contêiner <literal>demo-container1</literal>.

source: Install and configure the controller node
pt_br: Instalar e configurar o nodo controlador

source: This section describes how to install and configure the proxy service that handles requests for the account, container, and object services operating on the storage nodes. For simplicity, this guide installs and configures the proxy service on the controller node. However, you can run the proxy service on any node with network connectivity to the storage nodes. Additionally, you can install and configure the proxy service on multiple nodes to increase performance and redundancy. For more information, see the <link href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.
pt_br: Esta seção descreve como instalar e configurar o serviço de proxy que lida com as requisições para serviços de conta, contêiner, e objeto operando nos nodos de armazenamento. Contudo, você pode executar o serviço de proxy em qualquer nodo com conectividade de rede ao nodo de armazenamento. Adicionalmente, você pode instalar e configurar o serviço de proxy em múltiplos nodos para aumentar o desempenho e a redundância. Para mais informações, consulte o <link href="http://docs.openstack.org/developer/swift/deployment_guide.html">Deployment Guide</link>.

source: The proxy service relies on an authentication and authorization mechanism such as the Identity service. However, unlike other services, it also offers an internal mechanism that allows it to operate without any other OpenStack services. However, for simplicity, this guide references the Identity service in <xref linkend="ch_keystone"/>. Before you configure the Object Storage service, you must create service credentials and API endpoints.
pt_br: O serviço de proxy confia em um mecanismo de autenticação e autorização tal como o Serviço de Identidade. Contudo, ao contrário de outros serviços, ele também oferece um mecanismo interno que o permite operar sem qualquer outro serviço OpenStack. Contudo, para simplificar, este guia referencia o Serviço de Identidade em <xref linkend="ch_keystone"/>. Antes de configurar o serviço Object Storage, você deve criar credenciais de serviço e endpoints de API.

source: The Object Storage service does not use a SQL database on the controller node.
pt_br: O serviço Object Storage não utiliza uma base de dados SQL no nodo controlador.

source: To create the Identity service credentials, complete these steps:
pt_br: Para criar as credenciais do Serviço de Identidade, complete estes passos:

source: Create the <literal>swift</literal> user:
pt_br: Crie o usuário <literal>swift</literal>:

source: Replace <replaceable>SWIFT_PASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>SWIFT_PASS</replaceable> com uma senha adequada.

source: Add the <literal>admin</literal> role to the <literal>swift</literal> user:
pt_br: Adicione o papel <literal>admin</literal> ao usuário <literal>swift</literal>:

source: Create the <literal>swift</literal> service entity:
pt_br: Crie a entidade de serviço <literal>swift</literal>:

source: Create the Object Storage service API endpoints:
pt_br: Crie os endpoints de API do serviço Object Storage:

source: To install and configure the controller node components
pt_br: Para instalar e configurar os componentes do nodo controlador

source: Complete OpenStack environments already include some of these packages.
pt_br: Ambientes OpenStack completos já incluem alguns destes pacotes.

source: Create the <literal>/etc/swift</literal> directory.
pt_br: Crie o diretório <literal>/etc/swift</literal>.

source: Obtain the proxy service configuration file from the Object Storage source repository:
pt_br: Obtenha o arquivo de configuração do serviço de proxy a partir do repositório fonte do Object Storage:

source: Edit the <filename>/etc/swift/proxy-server.conf</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/swift/proxy-server.conf</filename> e complete as seguintes ações:

source: In the <literal>[DEFAULT]</literal> section, configure the bind port, user, and configuration directory:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure a porta de vinculação, usuário, e o diretório de configuração:

source: In the <literal>[app:proxy-server]</literal> section, enable account management:
pt_br: Na seção <literal>[app:proxy-server]</literal>, habilite o gerenciamento de conta:

source: In the <literal>[filter:keystoneauth]</literal> section, configure the operator roles:
pt_br: Na seção <literal>[filter:keystoneauth]</literal>, configure os papéis de operador:

source: You might need to uncomment this section.
pt_br: Você pode precisar descomentar esta seção.

source: In the <literal>[filter:authtoken]</literal> section, configure Identity service access:
pt_br: Na seção <literal>[filter:authtoken]</literal>, configure o acesso ao Serviço de Identidade:

source: Replace <replaceable>SWIFT_PASS</replaceable> with the password you chose for the <literal>swift</literal> user in the Identity service.
pt_br: Substitua <replaceable>SWIFT_PASS</replaceable> com a senha que você escolheu para o usuário <literal>swift</literal> no Serviço de Identidade.

source: In the <literal>[filter:cache]</literal> section, configure the <application>memcached</application> location:
pt_br: Na seção <literal>[filter:cache]</literal>, configure a localização do <application>memcached</application>:

source: translator-credits
ko_kr: Sungjin Kang <ujuc@ujuc.kr>, 2012-2014. Jay Lee <hyangii@gmail.com>, 2014. Seong-ho Cho <darkcircle.0426@gmail.com>, 2014.
pt_br: Gabriel Wainer <gabrielcw@gmail.com>, 2013

source: Define users, tenants, and roles
ko_kr: 사용자, 테넌트, 역할 정의

source: After you install the Identity Service, set up <glossterm baseform="user">users</glossterm>, <glossterm baseform="tenant">tenants</glossterm>, and <glossterm baseform="role">roles</glossterm> to authenticate against. These are used to allow access to services and <glossterm baseform="endpoint">endpoints</glossterm>, described in the next section.
ko_kr: 인증 서비스를 설치한 다음, 인증할 <glossterm baseform="user">사용자</glossterm>, <glossterm baseform="tenant">테넌트</glossterm>, <glossterm baseform="role">역할</glossterm>을 설정하십시오. 서비스와 엔드 포인트에 접근을 허락하는데 사용하며, 다음 장에 설명합니다.

source: Create an administrative user
ko_kr: 관리 사용자 생성

source: Replace <replaceable>ADMIN_PASS</replaceable> with a secure password and replace <replaceable>ADMIN_EMAIL</replaceable> with an email address to associate with the account.
ko_kr: <replaceable>ADMIN_PASS</replaceable>에서 시큐리티 비밀번호를 변경하고 <replaceable>ADMIN_EMAIL</replaceable>에서 계정에 연결된 이메일 주소를 변경합니다.

source: Link the <literal>admin</literal> user, <literal>_member_</literal> role, and <literal>admin</literal> tenant:
ko_kr: <literal>admin</literal> 사용자, <literal>_member_</literal> 롤, <literal>admin</literal> tenant를 연결:

source: Create a normal user
ko_kr: 일반 사용자 생성

source: Create the <literal>demo</literal> user:
ko_kr: <literal>demo</literal> 사용자 생성:

source: Link the <literal>demo</literal> user, <literal>_member_</literal> role, and <literal>demo</literal> tenant:
ko_kr: <literal>demo</literal> 사용자, <literal>_member_</literal> 롤, <literal>demo</literal> tenant 연결:

source: Create a <literal>service</literal> tenant
ko_kr: <literal>service</literal> tenant 생성

source: OpenStack services also require a username, tenant, and role to access other OpenStack services. In a basic installation, OpenStack services typically share a single tenant named <literal>service</literal>.
ko_kr: OpenStack 서비스는 다른 OpenStack 서비스에 접근하기 위해서 사용자 이름, tenant, 롤을 요구합니다. 기본 설치에서는 OpenStack 서비스에서는 싱글 tenant 이름인 <literal>service</literal>를 일반적으로 공유합니다.

source: Configure the Image Service
ko_kr: 이미지 서비스 구성

source: Passwords
ko_kr: 암호

source: The complete list of passwords you need to define in this guide are: <table rules="all"><caption>Passwords</caption><thead><tr><th>Password name</th><th>Description</th></tr></thead><tbody><tr><td>Database password (no variable used)</td><td>Root password for the database</td></tr><tr os="ubuntu;opensuse;sles"><td><literal><replaceable>RABBIT_PASS</replaceable></literal></td><td>Password of user guest of RabbitMQ</td></tr><tr><td><literal><replaceable>KEYSTONE_DBPASS</replaceable></literal></td><td>Database password of Identity service</td></tr><tr><td><literal><replaceable>DEMO_PASS</replaceable></literal></td><td>Password of user <literal>demo</literal></td></tr><tr><td><literal><replaceable>ADMIN_PASS</replaceable></literal></td><td>Password of user <literal>admin</literal></td></tr><tr><td><literal><replaceable>GLANCE_DBPASS</replaceable></literal></td><td>Database password for Image Service</td></tr><tr><td><literal><replaceable>GLANCE_PASS</replaceable></literal></td><td>Password of Image Service user <literal>glance</literal></td></tr><tr><td><literal><replaceable>NOVA_DBPASS</replaceable></literal></td><td>Database password for Compute service</td></tr><tr><td><literal><replaceable>NOVA_PASS</replaceable></literal></td><td>Password of Compute service user <literal>nova</literal></td></tr><tr><td><literal><replaceable>DASH_DBPASS</replaceable></literal></td><td>Database password for the dashboard</td></tr><tr><td><literal><replaceable>CINDER_DBPASS</replaceable></literal></td><td>Database password for the Block Storage service</td></tr><tr><td><literal><replaceable>CINDER_PASS</replaceable></literal></td><td>Password of Block Storage service user <literal>cinder</literal></td></tr><tr><td><literal><replaceable>NEUTRON_DBPASS</replaceable></literal></td><td>Database password for the Networking service</td></tr><tr><td><literal><replaceable>NEUTRON_PASS</replaceable></literal></td><td>Password of Networking service user <literal>neutron</literal></td></tr><tr><td><literal><replaceable>HEAT_DBPASS</replaceable></literal></td><td>Database password for the Orchestration service</td></tr><tr><td><literal><replaceable>HEAT_PASS</replaceable></literal></td><td>Password of Orchestration service user <literal>heat</literal></td></tr><tr><td><literal><replaceable>CEILOMETER_DBPASS</replaceable></literal></td><td>Database password for the Telemetry service</td></tr><tr><td><literal><replaceable>CEILOMETER_PASS</replaceable></literal></td><td>Password of Telemetry service user <literal>ceilometer</literal></td></tr><tr><td><literal><replaceable>TROVE_DBPASS</replaceable></literal></td><td>Database password of Database service</td></tr><tr><td><literal><replaceable>TROVE_PASS</replaceable></literal></td><td>Password of Database Service user <literal>trove</literal></td></tr></tbody></table>
ko_kr: 이 가이드에서 정의하는 전체 비밀 번호 목록: <table rules="all"><caption>비밀 번호</caption><thead><tr><th>비밀번호 이름</th><th>설명</th></tr></thead><tbody><tr><td>데이터베이스 비밀번호 (no variable used)</td><td>데이터베이스 root 비밀 번호</td></tr><tr os="ubuntu;opensuse;sles"><td><literal><replaceable>RABBIT_PASS</replaceable></literal></td><td>RabbitMQ 게스트 사용자 비밀 번호</td></tr><tr><td><literal><replaceable>KEYSTONE_DBPASS</replaceable></literal></td><td>Identity 서비스에 대한 데이터베이스 비밀 번호</td></tr><tr><td><literal><replaceable>DEMO_PASS</replaceable></literal></td><td><literal>demo</literal> 사용자 비밀 번호</td></tr><tr><td><literal><replaceable>ADMIN_PASS</replaceable></literal></td><td><literal>admin</literal> 사용자 비밀 번호</td></tr><tr><td><literal><replaceable>GLANCE_DBPASS</replaceable></literal></td><td>이미지 서비스에 대한 데이터베이스 비밀 번호</td></tr><tr><td><literal><replaceable>GLANCE_PASS</replaceable></literal></td><td>이미지 서비스 사용자인 <literal>glance</literal>의 비밀 번호</td></tr><tr><td><literal><replaceable>NOVA_DBPASS</replaceable></literal></td><td>Compute 서비스에 대한 데이터베이스 비밀 번호</td></tr><tr><td><literal><replaceable>NOVA_PASS</replaceable></literal></td><td>Compute 서비스 사용자인 <literal>nova</literal>의 비밀 번호</td></tr><tr><td><literal><replaceable>DASH_DBPASS</replaceable></literal></td><td>대시보드에 대한 데이터베이스 비밀 번호</td></tr><tr><td><literal><replaceable>CINDER_DBPASS</replaceable></literal></td><td>블록 스토리지 서비스에 대한 데이터베이스 비밀 번호</td></tr><tr><td><literal><replaceable>CINDER_PASS</replaceable></literal></td><td>블록 스토리지 서비스 사용자인 <literal>cinder</literal>의 비밀 번호</td></tr><tr><td><literal><replaceable>NEUTRON_DBPASS</replaceable></literal></td><td>네트워킹 서비스에 대한 데이터베이스 비밀 번호</td></tr><tr><td><literal><replaceable>NEUTRON_PASS</replaceable></literal></td><td>네트워킹 서비스 사용자인 <literal>neutron</literal>의 비밀 번호</td></tr><tr><td><literal><replaceable>HEAT_DBPASS</replaceable></literal></td><td>Orchestration 서비스에 대한 데이터베이스 비밀 번호</td></tr><tr><td><literal><replaceable>HEAT_PASS</replaceable></literal></td><td>Orchestration 서비스 사용자인 <literal>heat</literal>의 비밀 번호</td></tr><tr><td><literal><replaceable>CEILOMETER_DBPASS</replaceable></literal></td><td>Telemetry 서비스에 대한 데이터베이스 비밀 번호</td></tr><tr><td><literal><replaceable>CEILOMETER_PASS</replaceable></literal></td><td>Telemetry 서비스 사용자인 <literal>ceilometer</literal>의 비밀 번호</td></tr><tr><td><literal><replaceable>TROVE_DBPASS</replaceable></literal></td><td>데이터베이스 서비스에 대한 데이터베이스 비밀 번호</td></tr><tr><td><literal><replaceable>TROVE_PASS</replaceable></literal></td><td>데이터베이스 서비스 사용자인 <literal>trove</literal>의 비밀 번호</td></tr></tbody></table>

source: Controller setup
ko_kr: Controller 설정

source: <phrase os="sles">For SUSE Linux Enterprise Server: </phrase> On the controller node, install the MySQL client and server packages, and the Python library.
ko_kr: <phrase os="sles">수세 리눅스 엔터프라이즈 서버: </phrase> 제어 노드에서 MySQL 클라이언트, 서버 꾸러미, 파이썬 라이브러리를 설치하십시오.

source: For openSUSE: On the controller node, install the MariaDB client and database server packages, and the MySQL Python library.
ko_kr: 오픈수세: 제어 노드에서 MariaDB 클라이언트와 데이터베이스 서버 꾸러미, MySQL 파이썬 라이브러리를 설치하십시오.

source: When you install the server package, you are prompted for the root password for the database. Choose a strong password and remember it.
ko_kr: 서버 꾸러미를 설치할 때 데이터베이스에 대한 루트 암호 질문을 받습니다. 강력한 암호를 사용하고 기억하십시오.

source: The MySQL configuration requires some changes to work with OpenStack.
ko_kr: OpenStack에서 작동할 수 있게 MySQL 구성을 수정합니다.

source: Edit the <filename>/etc/mysql/my.cnf</filename> file:
ko_kr: <filename>/etc/mysql/my.cnf</filename> 파일 편집:

source: Edit the <filename>/etc/my.cnf</filename> file:
ko_kr: <filename>/etc/my.cnf</filename> 파일 편집:

source: Under the <literal>[mysqld]</literal> section, set the <literal>bind-address</literal> key to the management IP address of the controller node to enable access by other nodes via the management network:
ko_kr: <literal>[mysqld]</literal> 섹션 아래, 관리 네트워크의 다른 노드에서 접근할 수 있는 컨트롤러 노드의 관리 IP 주소로 <literal>bind-address</literal> 키를 설정하십시오:

source: Restart the MySQL service to apply the changes:
ko_kr: 변경된 설정을 적용하기 위해 MySQL 서비스를 다시 시작 하십시오.

source: Finally, you should set a root password for your <phrase os="rhel;fedora;centos">MySQL</phrase><phrase os="opensuse;sles">MariaDB or MySQL</phrase> database. The OpenStack programs that set up databases and tables prompt you for this password if it is set.
ko_kr: 마지막으로 <phrase os="rhel;fedora;centos">MySQL</phrase><phrase os="opensuse;sles">MariaDB 또는 MySQL</phrase> 데이터베이스에 대한 루트 암호를 설정해야 합니다. 데이터베이스와 테이블을 설정하는 오픈스택 프로그램에서는 암호를 설정했는지 물어봅니다.

source: You must delete the anonymous users that are created when the database is first started. Otherwise, database connection problems occur when you follow the instructions in this guide. To do this, use the <placeholder-1/> command. Note that if <placeholder-2/> fails you might need to use <placeholder-3/> first:
ko_kr: 데이터베이스를 처음 시작했을 때 만든 익명 사용자는 삭제해야 합니다. 그렇지 않으면 이 안내서대로 절차를 따를 때 데이터베이스 연결에 문제가 생깁니다. 이 절차를 수행하려면 <placeholder-1/> 명령을 사용하십시오. <placeholder-2/> 명령 실행에 실패하면 <placeholder-3/> 명령을 먼저 사용할 필요가 있음을 참고하십시오:

source: <phrase os="rhel;centos;fedora;opensuse;sles">If you have not already set a root database password, press <keycap>ENTER</keycap> when you are prompted for the password.</phrase> This command presents a number of options for you to secure your database installation. Respond <placeholder-1/> to all prompts unless you have a good reason to do otherwise.
ko_kr: <phrase os="rhel;centos;fedora;opensuse;sles">루트 데이터베이스 암호를 아직 설정하지 않았다면 암호를 물어볼때 그냥 <keycap>ENTER</keycap>키를 누르십시오.</phrase> 이 명령에서는 데이트베이스 설치를 안전하게 하기 위한 몇가지 옵션을 보여줍니다. 몇가지 타당한 이유가 있기 전까지는 모든 질문에 <placeholder-1/>라고 답하십시오.

source: Node setup
ko_kr: Node 설정

source: Distributions might release OpenStack packages as part of their distribution or through other methods because the OpenStack and distribution release times are independent of each other.
ko_kr: 배포판에서는 배포판 자신의 일부로서 오픈스택 꾸러미를 출시하거나 다른 방법을 통해 오픈스택을 제공하는데 오픈스택과 배포판의 출시 시간은 제각각 독립적이기 때문입니다.

source: This section describes the configuration you must complete after you configure machines to install the latest OpenStack packages.
ko_kr: 이 섹션에서는 최신 오픈스택 꾸러미를 설치할 머신을 설정한 다음 완료해야 할 사항을 설명합니다.

source: The EPEL package includes GPG keys for package signing and repository information. This should only be installed on Red Hat Enterprise Linux and CentOS, not Fedora. Install the latest <package>epel-release</package> package (see <link href="http://download.fedoraproject.org/pub/epel/6/x86_64/repoview/epel-release.html">http://download.fedoraproject.org/pub/epel/6/x86_64/repoview/epel-release.html</link>). For example:
ko_kr: EPEL 꾸러미에는 꾸러미 서명을 위한 GPG 키와 저장소 정보가 들어있습니다. 이 꾸러미는 페도라를 제외한 레드햇 엔터프라이즈 리눅스와 센트OS에만 설치해야 합니다. 다음의 예처럼 최신 <package>epel-release</package> 꾸러미를 설치하십시오(<link href="http://download.fedoraproject.org/pub/epel/6/x86_64/repoview/epel-release.html">http://download.fedoraproject.org/pub/epel/6/x86_64/repoview/epel-release.html</link> 참조).

source: For openSUSE 13.1 use:
ko_kr: openSUSE 13.1에서 사용할려면:

source: If you use SUSE Linux Enterprise Server 11 SP3, use:
ko_kr: 수세 리눅스 엔터프라이즈 서버 11 SP3를 사용중이라면 다음 방법을 따라가십시오:

source: The <package>openstack-utils</package> package contains utility programs that make installation and configuration easier. These programs are used throughout this guide. Install <package>openstack-utils</package>. This verifies that you can access the Open Build Service repository:
ko_kr: <package>openstack-utils</package> 꾸러미에는 설치와 설정을 쉽게 하는 유틸리티 프로그램이 있습니다. 이 프로그램은 안내서의 전반적인 부분에서 사용합니다. <package>openstack-utils</package>를 설치하십시오. 다음 명령은 오픈 빌드 서비스 저장소를 접근할 수 있는지 확인합니다:

source: The <application>openstack-config</application> program in the <package>openstack-utils</package> package uses <application>crudini</application> to manipulate configuration files. However, <application>crudini</application> version 0.3 does not support multi valued options. See <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1269271">https://bugs.launchpad.net/openstack-manuals/+bug/1269271</link>. As a work around, you must manually set any multi valued options or the new value overwrites the previous value instead of creating a new option.
ko_kr: <package>openstack-utils</package> 꾸러미의 <application>openstack-config</application> 프로그램은 설정 파일을 다룰때 <application>crudini</application>를 사용합니다. 그러나 <application>crudini</application> 버전 0.3에서는 여러 값을 지닌 옵션을 지원하지 않습니다. <link href="https://bugs.launchpad.net/openstack-manuals/+bug/1269271">https://bugs.launchpad.net/openstack-manuals/+bug/1269271</link> 링크를 참조하십시오. 이런 동작 배경 때문에, 새 옵션을 만드는 대신에 여러 값을 직접 설정하거나 이전 값을 새 값으로 바꾸어 설정해야 합니다.

source: Upgrade your system packages:
ko_kr: 시스템 페키지를 업그레이드 하십시오:
