Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: If the upgrade included a new kernel package, reboot the system to ensure the new kernel is running:
ko_kr: 새 커널 꾸러미가 업그레이드에 포함되어 있다면, 새 커널이 동작하는지 확인하기 위해 시스템을 다시 부팅하십시오:

source: To use the Ubuntu Cloud Archive for Icehouse
ko_kr: Icehouse Ubuntu Cloud Archive 사용

source: The <link href="https://wiki.ubuntu.com/ServerTeam/CloudArchive">Ubuntu Cloud Archive</link> is a special repository that allows you to install newer releases of OpenStack on the stable supported version of Ubuntu.
ko_kr: <link href="https://wiki.ubuntu.com/ServerTeam/CloudArchive">Ubuntu Cloud Archive/link>는 Ubuntu의 안정 지원 버전에서 OpenStack 최신 릴리즈를 설치할 수 있도록 하는 특별한 저장소입니다.

source: Install the Ubuntu Cloud Archive for <glossterm>Icehouse</glossterm>: <placeholder-1/>
ko_kr: <glossterm>Icehouse</glossterm>의 Uubntu Cloud 저장소를 설치하십시오: <placeholder-1/>

source: Install the Ubuntu 13.10 backported kernel:
ko_kr: Ubuntu 13.10 backported 커널을 설치:

source: To use the Debian Wheezy backports archive for Icehouse
ko_kr: Icehouse에 대한 Debian Wheezy backports 저장소 사용

source: The <glossterm>Icehouse</glossterm> release is available only in Debian Sid (otherwise called Unstable). However, the Debian maintainers of OpenStack also maintain a non-official Debian repository for OpenStack containing Wheezy backports.
ko_kr: <glossterm>Icehouse</glossterm> 릴리즈는 Debian Sid (또는 Unstable)에서 사용할 수 있습니다. 그러나 OpenStack Debian 메인테이너는 Wheezy 백포트에 포함된 OpenStack에 대한 비공식 Debian 저장소에서 관리합니다.

source: Install the Debian Wheezy backport repository Icehouse:
ko_kr: Icehouse Debian Wheezy backport 저장소를 설치합니다:

source: Install the Debian Wheezy OpenStack repository for Icehouse:
ko_kr: Icehouse에 대한 Debian Wheezy OpenStack 저장소를 설치합니다:

source: All OpenStack packages are written in Python. Wheezy uses Python 2.6 and 2.7, with Python 2.6 as the default interpreter; Sid has only Python 2.7. There is one packaging change between these two. In Python 2.6, you installed the <package>python-argparse</package> package separately. In Python 2.7, this package is installed by default. Unfortunately, in Python 2.7, this package does not include <code>Provides: python-argparse</code> directive.
ko_kr: 모든 오픈스택 꾸러미는 파이썬으로 작성했습니다. 데비안에서는 2.6과 2.6을 둘 다 사용하는데, 휘지는 Python 2.6을 기본 인터프리터로, 시드에서는 2.7만을 사용합니다. 두가지 버전간에 패키징 하는데 한가지 다른 점이 있습니다. 파이썬 2.6에서는, 이미 설치한 <package>python-argparse</package> 를 따로 패키징했습니다. 파이썬 2.7에서는 기본으로 설치합니다. 불행하게도 데비안의 파이썬 2.7에선 <code>Provides: python-argparse</code> 지시어가 없습니다.

source: To disable <literal>firewalld</literal> and enable <literal>iptables</literal>:
ko_kr: <literal>firewalld</literal>를 중지하고 <literal>iptables</literal>를 사용하십시오:

source: Verify the Block Storage installation
ko_kr: 블록 스토리지 설치 확인

source: Source the <filename>demo-openrc.sh</filename> file:
ko_kr: <filename>demo-openrc.sh</filename> 파일을 source 명령으로 실행:

source: Use the <placeholder-1/> command to create a new volume:
ko_kr: <placeholder-1/> 명령을 사용하여 새로운 볼륨 생성:

source: Verify the Image Service installation
ko_kr: 이미지 서비스 설치 확인

source: To test the Image Service installation, download at least one virtual machine image that is known to work with OpenStack. For example, CirrOS is a small test image that is often used for testing OpenStack deployments (<link href="http://download.cirros-cloud.net/">CirrOS downloads</link>). This walk through uses the 64-bit CirrOS QCOW2 image.
ko_kr: 이미지 서비스 설치를 시험하려면, 오픈스택과 동작하는 걸로 알려져 있는 가상 머신 이미지를 최소한 한개 정도는 다운로드하십시오. 예를 들어 CirrOS 는 오픈스택 배포를 시험하는데 종종 사용하는 이미지입니다(<link href="http://download.cirros-cloud.net/">CirrOS 다운로드</link>). 이 링크를 통해 바로 CirrOS QCOW2 이미지를 사용할 수 있습니다.

source: Download the image into a dedicated directory using <placeholder-1/> or <placeholder-2/>:
ko_kr: <placeholder-1/> 또는 <placeholder-2/> 명령을 사용하여 준비된 디렉터리에 이미지를 다운로드하십시오:

source: Where:
ko_kr: 위치:

source: Arbitrary label. The name by which users refer to the image.
ko_kr: 임의 레이블입니다. 이미지를 참조하는 사용자가 지은 이름입니다.

source: Specifies the format of the image file. Valid formats include <literal>qcow2</literal>, <literal>raw</literal>, <literal>vhd</literal>, <literal>vmdk</literal>, <literal>vdi</literal>, <literal>iso</literal>, <literal>aki</literal>, <literal>ari</literal>, and <literal>ami</literal>.
ko_kr: 이미지 파일의 포멧을 지정하십시오. 유효한 포멧으로는 <literal>qcow2</literal>, <literal>raw</literal>, <literal>vhd</literal>, <literal>vmdk</literal>, <literal>vdi</literal>, <literal>iso</literal>, <literal>aki</literal>, <literal>ari</literal>, <literal>ami</literal>를 포함합니다.

source: You can verify the format using the <placeholder-1/> command: <placeholder-2/>
ko_kr: <placeholder-1/> 명령을 사용하여 포멧을 검증할 수 있습니다: <placeholder-2/>

source: Specifies the container format. Valid formats include: <literal>bare</literal>, <literal>ovf</literal>, <literal>aki</literal>, <literal>ari</literal> and <literal>ami</literal>.
ko_kr: 컨테이너 포멧을 지정하십시오. 유효한 포멧은 다음과 같습니다: <literal>bare</literal>, <literal>ovf</literal>, <literal>aki</literal>, <literal>ari</literal>, <literal>ami</literal>.

source: Specify <literal>bare</literal> to indicate that the image file is not in a file format that contains metadata about the virtual machine. Although this field is currently required, it is not actually used by any of the OpenStack services and has no effect on system behavior. Because the value is not used anywhere, it is safe to always specify <literal>bare</literal> as the container format.
ko_kr: 이미지 파일에 가상 머신용 메타데이터가 없는 이미지 파일 형식임을 나타내도록 <literal>bare</literal>를 설정하십시오. 이 필드가 필요하지만, 실제로 어떤 오픈스택 서비스에서도 사용하지 않으며 시스템 동작에 영향을 미치지는 않습니다. 어디에서든 사용하지 않는 값이기 때문에 컨테이너 형식으로 <literal>bare</literal>를 항상 정의하는 것이 안전합니다.

source: true - All users can view and use the image.
ko_kr: true - 모든 사용자들이 볼 수 있으며, 이미지를 사용합니다.

source: false - Only administrators can view and use the image.
ko_kr: false - 관리자만 볼수 있고 이미지를 사용합니다.

source: Specifies image access: <placeholder-1/>
ko_kr: 이미지 접근 권한을 지정하십시오: <placeholder-1/>

source: Specifies the name of your downloaded image file.
ko_kr: 다운로드한 이미지 파일의 이름을 지정하십시오.

source: For example:
ko_kr: 예:

source: Confirm that the image was uploaded and display its attributes:
ko_kr: 이미지가 올라갔는지, 속성 값이 나타났는지 확인하십시오:

source: Install and configure the OpenStack clients
ko_kr: 오픈스택 클라이언트 구성 및 설치

source: Create openrc.sh files
ko_kr: openrc.sh 파일 생성

source: To generate a keypair
ko_kr: Keypair 생성

source: Your first instance uses the <literal>cirros-0.3.2-x86_64</literal> image.
ko_kr: 첫 인스턴스에서는 <literal>cirros-0.3.2-x86_64</literal> 이미지를 사용합니다.

source: The debconf system helps users configure the <code>auth_host</code>, <code>admin_tenant_name</code>, <code>admin_user</code> and <code>admin_password</code> options.
ko_kr: Debconf 시스템은 <code>auth_host</code>, <code>admin_tenant_name</code>, <code>admin_user</code>, <code>admin_password</code> 옵션에 대한 사용자 구성하는데 도움을 줍니다.

source: The OpenStack Object Storage services work together to provide object storage and retrieval through a REST API. For this example architecture, you must have already installed the Identity Service, also known as Keystone.
ko_kr: 오픈스택 오브젝트 저장소 서비스는 오픈스택 저장소를 제공하고 REST API를 통해 가져다 주기 위해 서로 함께 동작합니다. 이 예제 아키텍처에서는 키스톤으로 알려진 인증 서비스를 먼저 설치해야 합니다.

source: Additionally, you can allocate IP addresses on external networks to ports on the internal network. Whenever something is connected to a subnet, that connection is called a port. You can associate external network IP addresses with ports to VMs. This way, entities on the outside network can access VMs.
ko_kr: 또한, 외부 네트워크를 내부 네트워크와 연결하도록 IP 주소를 할당할 수 있습니다. 하위 네트워크에 어떤 포트가 연결되든 이 연결을 포트라고 합니다. 외부 네트워크 IP 주소를 가상 머신에 포트와 할당할 수 이씃ㅂ니다. 이 방법을 통해 외부 네트워크의 실체가 가상 머신에 접근할 수 있습니다.

source: Install the Telemetry module
ko_kr: Telemetry 모듈 설치

source: Telemetry provides an API service that provides a collector and a range of disparate agents. Before you can install these agents on nodes such as the compute node, you must use this procedure to install the core components on the controller node.
ko_kr: Telemetry는 수집 프로그램과 다양한 에이전트에서 제공하는 API 서비스를 제공합니다. Compute 노드와 노드에서 이 에이전트를 설치하기 전에, controller 노드의 핵심 구성 요소를 설치하기 위해 이 과정을 지나가야 합니다.

source: Install the Telemetry service on the controller node:
ko_kr: 제어 노드에 텔레메트리 서비스를 설치하십시오:

source: Respond to the prompts for <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> settings</link>, <link linkend="debconf-rabbitqm">RabbitMQ credentials</link> and <link linkend="debconf-api-endpoints">API endpoint</link> registration.
ko_kr: <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> 설정</link>, <link linkend="debconf-rabbitqm">RabbitMQ 인증 정보</link>, <link linkend="debconf-api-endpoints">API 엔드 포인트</link>에 대한 질문에 응답하십시오.

source: The Telemetry service uses a database to store information. Specify the location of the database in the configuration file. The examples use a MongoDB database on the controller node:
ko_kr: 텔레메트리 서비스는 정보를 저장하기 위해 데이터베이스를 사용합니다. 설정 파일에 데이터베이스 위치를 지정하십시오. 예제에서는 제어 노드에서 MongoDB 데이터베이스를 사용합니다:

source: As the files are created the first time the MongoDB service starts you must stop the service and remove the files for this change to take effect:
ko_kr: MongoDB 서비스를 시작할 때 처음 파일을 만들었다면 바뀐 내용을 적용하기 위해 서비스를 멈추고 파일을 제거하셔야 합니다:

source: For more information on the <option>smallfiles</option> configuration key refer to the MongoDB documentation at <link href="http://docs.mongodb.org/manual/reference/configuration-options/#smallfiles"/>.
ko_kr: <option>smallfiles</option> 설정 키에 대한 더 많은 내용은 <link href="http://docs.mongodb.org/manual/reference/configuration-options/#smallfiles"/>의 MongoDB 문서를 참조하십시오.

source: For instructions detailing the steps to disable database journaling entirely refer to <link href="http://docs.mongodb.org/manual/tutorial/manage-journaling/"/>.
ko_kr: 데이터 베이스 저널링을 완전히 비활성화할 자세한 절차를 따라가려면 <link href="http://docs.mongodb.org/manual/tutorial/manage-journaling/"/>를 참고하십시오.

source: Restart the MongoDB service to apply the configuration change:
ko_kr: 변경된 설정을 적용하기 위해 MongoDB 서비스를 다시 시작 하십시오.

source: Start the MongoDB server and configure it to start when the system boots:
ko_kr: MongoDB 서버를 시작하고 시스템을 부팅할 때 시작하도록 설정하십시오:

source: Create the database and a <literal>ceilometer</literal> database user:
ko_kr: <literal>ceilometer</literal> 데이터베이스 사용자와 데이터베이스를 생성합니다:

source: Configure the Telemetry service to use the database:
ko_kr: 데이터베이스를 사용하도록 텔레메트리 서비스를 설정하십시오:

source: Edit the <filename>/etc/ceilometer/ceilometer.conf</filename> file and change the <literal>[database]</literal> section:
ko_kr: <filename>/etc/ceilometer/ceilometer.conf</filename> 파일에서 <literal>[database]</literal> 섹션을 편집합니다:

source: For SUSE Linux Enterprise, run the following command:
ko_kr: SUSE Linux Enterprise에서는 다음 명령을 실행합니다:

source: Edit the <filename>/etc/ceilometer/ceilometer.conf</filename> file and change the <literal>[publisher]</literal> section. Replace <replaceable>CEILOMETER_TOKEN</replaceable> with the results of the <literal>openssl</literal> command:
ko_kr: <filename>/etc/ceilometer/ceilometer.conf</filename>의 <literal>[publisher]</literal> 세션을 수정합니다. <replaceable>CEILOMETER_TOKEN</replaceable> 값을 <literal>openssl</literal> 명령으로 나온 값으로 변경합니다:

source: Configure the RabbitMQ access:
ko_kr: RabbitMQ 접근을 설정하십시오:

source: Edit the <filename>/etc/ceilometer/ceilometer.conf</filename> file and update the <literal>[DEFAULT]</literal> section:
ko_kr: <filename>/etc/ceilometer/ceilometer.conf</filename> 파일을 편집하여 <literal>[DEFAULT]</literal> 섹션의 내용을 업데이트하십시오:

source: Configure the log directory.
ko_kr: 로그 디렉터리를 구성합니다.

source: Create a <literal>ceilometer</literal> user that the Telemetry service uses to authenticate with the Identity Service. Use the <literal>service</literal> tenant and give the user the <literal>admin</literal> role:
ko_kr: 텔레메트리 서비스가 인증 서비스에 인증하는데 사용할 <literal>ceilometer</literal> 사용자를 만드십시오. <literal>service</literal> 테넌트를 사용하고 <literal>admin</literal> 역할을 부여하십시오:

source: Add the credentials to the configuration files for the Telemetry service:
ko_kr: 텔레메트리 서비스 설정 파일에 인증 정보를 추가하십시오:

source: Edit the <filename>/etc/ceilometer/ceilometer.conf</filename> file and change the <literal>[keystone_authtoken]</literal> section:
ko_kr: <filename>/etc/ceilometer/ceilometer.conf</filename> 파일을 편집하여 <literal>[keystone_authtoken]</literal> 섹션의 내용을 바꾸십시오:

source: Also set the <literal>[service_credentials]</literal> section:
ko_kr: <literal>[service_credentials]</literal> 섹션에도 설정하십시오:

source: Register the Telemetry service with the Identity Service so that other OpenStack services can locate it. Use the <placeholder-1/> command to register the service and specify the endpoint:
ko_kr: 텔레메트리 서비스를 인증 서비스와 등록하여 다른 오픈스택 서비스에서 위치에 접근할 수 있게 하십시오. <placeholder-1/> 명령을 사용하여 서비스를 등록하고 엔드 포인트를 지정하십시오:

source: Restart the services with their new settings:
ko_kr: 새 설정 내용으로 서비스를 다시 시작하십시오:

source: Start the <systemitem class="service">openstack-ceilometer-api</systemitem>, <systemitem class="service" os="opensuse;sles">openstack-ceilometer-agent-central</systemitem><systemitem class="service" os="rhel;fedora;centos">openstack-ceilometer-central</systemitem>, <systemitem class="service">openstack-ceilometer-collector</systemitem>, <systemitem class="service" os="opensuse;sles">openstack-ceilometer-alarm-evaluator</systemitem>, and <systemitem class="service" os="opensuse;sles">openstack-ceilometer-alarm-notifier</systemitem> services and configure them to start when the system boots:
ko_kr: <systemitem class="service">openstack-ceilometer-api</systemitem>, <systemitem class="service" os="opensuse;sles">openstack-ceilometer-agent-central</systemitem><systemitem class="service" os="rhel;fedora;centos">openstack-ceilometer-central</systemitem>, <systemitem class="service">openstack-ceilometer-collector</systemitem>, <systemitem class="service" os="opensuse;sles">openstack-ceilometer-alarm-evaluator</systemitem>, <systemitem class="service" os="opensuse;sles">openstack-ceilometer-alarm-notifier</systemitem> 서비스를 시작하고 시스템을 부팅할 때 시작하도록 설정하십시오:

source: To test the Telemetry installation, download an image from the Image Service, and use the <placeholder-1/> command to display usage statistics.
ko_kr: 텔레메트리 설치를 시험하려면, 이미지 서비스에서 이미지를 다운로드한 후, <placeholder-1/> 명령을 사용하여 사용 통계를 표시하십시오.

source: Use the <literal>ceilometer meter-list</literal> command to test the access to Telemetry:
ko_kr: <literal>ceilometer meter-list</literal> 명령을 사용하여 텔레메트리 접근을 시험하십시오:

source: Call the <literal>ceilometer meter-list</literal> command again to validate that the download has been detected and stored by the Telemetry:
ko_kr: <literal>ceilometer meter-list</literal> 명령을 다시 실행하여 텔레메트리에서 다운로드를 감지하고 저장했는지 검증하십시오:

source: You can now get usage statistics for the various meters:
ko_kr: 이제 다양한 측정 프로그램으로부터 사용 통계를 가져올 수 있습니다:

source: Ubuntu 14.04 Only
ko_kr: Ubuntu 14.04만

source: The Database module is only available under Ubuntu 14.04. Packages are not available for 12.04, or via the Ubuntu Cloud Archive.
ko_kr: 데이터베이스 모듈은 오직 Ubuntu 14.04에서만 사용이 가능합니다. 패키지를 12.04나 Ubuntu Cloud Archive를 통해서 사용할 수 없습니다.

source: Update the datastore to use the new image, using the <placeholder-1/> command.
ko_kr: <placeholder-1/> 명령을 사용하여, 새 이미지를 사용하는 datastore를 업로드합니다.

source: This example shows you how to create a MySQL 5.5 datastore:
ko_kr: 예제는 MySQL 5.5 datastore를 생성하는 방법에 대해서 보여줍니다:

source: Start Database services and configure them to start when the system boots:
ko_kr: 데이터베이스 서비스를 시작하고 시스템 부팅할 때 실행되도록 구성합니다:

source: Restart Database services:
ko_kr: 데이터베이스 서비스 재시작:

source: Run the following commands:
ko_kr: 다음 명령을 실행하십시오:

source: Install Compute controller services
ko_kr: Compute 컨트롤러 서비스 설치

source: Compute is a collection of services that enable you to launch virtual machine instances. You can configure these services to run on separate nodes or the same node. In this guide, most services run on the controller node and the service that launches virtual machines runs on a dedicated compute node. This section shows you how to install and configure these services on the controller node.
ko_kr: Compute는 가상 머신 인스턴스를 실행하도록 하는 서비스 모음입니다. 이들 서비스를 각각의 노드 또는 동일한 노드에서 실행하도록 설정할 수 있습니다. 이 안내서에서, 대부분 서비스는 컨트롤러 노드에서 실행하며 사항머신을 실행하는 서비스는 제공된 compute 노드상에서 동작합니다. 이 섹션에서는 컨트롤러 노드에서 서비스를 어떻게 설치하고 실행할지 보여드리겠습니다.

source: Install the Compute packages necessary for the controller node.
ko_kr: 컨트롤러 노드에 필요한 Compute 패키지를 설치합니다.

source: Respond to the prompts for <link linkend="debconf-dbconfig-common">database management</link>, <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> settings</link>, <link linkend="debconf-rabbitqm">RabbitMQ credentials</link>, and <link linkend="debconf-api-endpoints">API endpoint</link> registration. The <placeholder-1/> command runs automatically.
ko_kr: <link linkend="debconf-dbconfig-common">데이터베이스 관리</link>, <link linkend="debconf-keystone_authtoken"><literal>[keystone_authtoken]</literal> 설정</link>, <link linkend="debconf-rabbitqm">RabbitMQ 인증 정보</link>, <link linkend="debconf-api-endpoints">API 엔드 포인트</link>등록에 대한 질문에 답하십시오. <placeholder-1/> 명령은 자동으로 실행합니다.

source: Compute stores information in a database. In this guide, we use a MySQL database on the controller node. Configure Compute with the database location and credentials. Replace <replaceable>NOVA_DBPASS</replaceable> with the password for the database that you will create in a later step.
ko_kr: 처리부는 데이터베이스에 정보를 저장합니다. 이 안내서에서는 제어 노드에서 MySQL 데이터베이스를 사용합니다. 처리부의 데이터베이스 위치와 인증서를 설정하십시오. <replaceable>NOVA_DBPASS</replaceable>의 값을 나중 단계에서 만들 데이터베이스 암호로 바꾸십시오.

source: Set these configuration keys to configure Compute to use the Qpid message broker:
ko_kr: Qpid 메시지 브로커를 사용하려 처리부를 설정한다면 아래 설정키를 이용하십시오:

source: Configure the Compute service to use the RabbitMQ message broker by setting these configuration keys in the <literal>[DEFAULT]</literal> configuration group of the <filename>/etc/nova/nova.conf</filename> file:
ko_kr: <filename>/etc/nova/nova.conf</filename> 파일의 <literal>[DEFAULT]</literal> 구성 그룹에서 구성 키를 설정하여 RabbitMQ 메시지 브로커를 사용하는 Compute 서비스를 구성하십시오:

source: Set these configuration keys to configure Compute to use the RabbitMQ message broker:
ko_kr: RabbitMQ 메시지 브로커를 사용하려 처리부를 설정하려면 아래 설정키를 사용하십시오:

source: Edit the <filename>/etc/nova/nova.conf</filename> file and add these lines to the <literal>[DEFAULT]</literal> section:
ko_kr: <filename>/etc/nova/nova.conf</filename>를 편집하여 <literal>[DEFAULT]</literal>섹션에 다음 내용을 추가하십시오:

source: In Debian, the <package>debconf</package> package automatically sets up <literal>my_ip</literal> parameter but you must edit the <filename>/etc/nova/nova.conf</filename> file to configure the <option>vncserver_listen</option> and <option>vncserver_proxyclient_address</option> options, which appear at the end of the file:
ko_kr: 데비안에서는 <package>debconf</package> 꾸러미가 <literal>my_ip</literal> 매개 변수를 설정하는 반면에, <filename>/etc/nova/nova.conf</filename> 파일 마지막 부분에 있는 <option>vncserver_listen</option>옵션과 <option>vncserver_proxyclient_address</option>옵션은 직접 편집하여 설정해야 합니다.

source: By default, the Ubuntu packages create an SQLite database. Delete the <filename>nova.sqlite</filename> file created in the <filename>/var/lib/nova/</filename> directory so that it does not get used by mistake:
ko_kr: 기본 Ubuntu 패키지는 SQLite 데이터베이스를 사용하여 생성합니다. <filename>/var/lib/nova/</filename>에 있는 <filename>/var/lib/nova/</filename>파일을 삭제하여 실수로 사용하는 일이 없도록 하십시오:

source: Use the password you created previously to log in as root. Create a <literal>nova</literal> database user:
ko_kr: 루트 사용자로 로그인하려면 이미 만든 암호를 사용하십시오. <literal>nova</literal> 데이터베이스 사용자를 만드십시오:

source: Create the Compute service tables:
ko_kr: Compute 서비스 테이블 생성:

source: Create a <literal>nova</literal> user that Compute uses to authenticate with the Identity Service. Use the <literal>service</literal> tenant and give the user the <literal>admin</literal> role:
ko_kr: Identity 서비스를 이용하여 Compute에서 인증시 사용할 <literal>nova</literal> 사용자를 생성합니다. <literal>service</literal> tenant를 사용하고, 사용자에게 <literal>admin</literal> 롤을 부여하십시오:

source: Configure Compute to use these credentials with the Identity Service running on the controller. Replace <replaceable>NOVA_PASS</replaceable> with your Compute password.
ko_kr: Controller에서 실행하는 Identity 서비스에서 인증을 사용하도록 Compute를 설정하십시오. <replaceable>NOVA_PASS</replaceable>의 값을 Compute 암호로 바꾸십시오.

source: Edit the <literal>[DEFAULT]</literal> section in the <filename>/etc/nova/nova.conf</filename> file to add this key:
ko_kr: <filename>/etc/nova/nova.conf</filename> 파일의 <literal>[DEFAULT]</literal> 섹션을 편집하여 이 키를 수정하십시오:

source: Add these keys to the <literal>[keystone_authtoken]</literal> section:
ko_kr: 이 키를 <literal>[keystone_authtoken]</literal> 섹션에 추가하십시오:

source: You must register Compute with the Identity Service so that other OpenStack services can locate it. Register the service and specify the endpoint:
ko_kr: 다른 OpenStack 서비스를 찾을 수 있도록 Identity 서비스에 Compute를 등록해야합니다. 서비스를 등록하고 엔드포인트를 지정하십시오:

source: Start Compute services and configure them to start when the system boots:
ko_kr: 처리부 서비스를 시작하고 시스템일 부팅할 때 시작하도록 설정하십시오:

source: Restart Compute services:
ko_kr: Compute 서비스를 재시작하십시오:

source: To verify your configuration, list available images:
ko_kr: 설정을 확인하려면, 존재하는 이미지를 조회하십시오:

source: This section details set up for any node that runs the <literal>nova-compute</literal> component but does not run the full network stack.
ko_kr: 이 섹션에서는 전체 네트워크 스택을 구동하지 않고 <literal>nova-compute</literal> 구성 요소를 실행하는 노드 설정 방법을 자세하게 다룹니다.

source: Disable packet destination filtering (route verification) to let the networking services route traffic to the VMs. Edit the <filename>/etc/sysctl.conf</filename> file and run the following command to activate changes:
ko_kr: 네트워킹 서비스가 트래픽을 각 가상 머신으로 라우팅하도록 패킷 목적지 필터링(라우팅 검증)을 비활성화 하십시오. <filename>/etc/sysctl.conf</filename> 파일을 편집한 후 바뀐 내용을 활성화 하기 위해 다음 명령을 실행하십시오:

source: Install Open vSwitch plug-in
ko_kr: Open vSwitch 플러그인 설치

source: Install the Open vSwitch plug-in and its dependencies:
ko_kr: Open vSwitch 플러그인과 의존하는 패키지를 설치하십시오:

source: Restart Open vSwitch:
ko_kr: Open vSwitch를 다시 시작하십시오:

source: Start Open vSwitch and configure it to start when the system boots:
ko_kr: Open vSwitch를 시작하고 시스템을 부팅할 때 시작하도록 설정하십시오:

source: You must set some common configuration options no matter which networking technology you choose to use with Open vSwitch. You must add the <literal>br-int</literal> integration bridge, which connects to the VMs.
ko_kr: Open vSwitch와 사용하려 선택한 네트워크 기술이 어떤 것이든간에 일반적인 설정 옵션은 반드시 설정해야 합니다. 가상 머신에 연결할 <literal>br-int</literal> 통합 브릿지를 반드시 추가하십시오.

source: You must set some common configuration options. You must configure Networking core to use <acronym>OVS</acronym>. Edit the <filename>/etc/neutron/neutron.conf</filename> file:
ko_kr: 일반 구성 옵션을 설정해야 합니다. 네트워킹 핵심부에서 <acronym>OVS</acronym>를 사용하도록 설정해야 합니다. <filename>/etc/neutron/neutron.conf</filename> 파일을 편집하십시오:

source: You must configure a firewall as well. You should use the same firewall plug-in that you chose to use when you set up the network node. To do this, edit <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> file and set the <literal>firewall_driver</literal> value under the <literal>securitygroup</literal> to the same value used on the network node. For instance, if you chose to use the Hybrid OVS-IPTables plug-in, your configuration looks like this:
ko_kr: 마찬가지로 방화벽도 설정해야 합니다. 네트워크 노드를 설치할 때 사용한 동일한 방화벽 플러그인을 사용해야 합니다. 이렇게 하려면 <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> 파일을 편집하고 <literal>securitygroup</literal>의 <literal>firewall_driver</literal>값을 네트워크 노드에서 사용하는 같은 값으로 설정하십시오. 예를 들어 Hybrid OVS-IPTables 플러그인을 사용하도록 설정한다면, 설정 내용은 다음과 같습니다:
