Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: List agents to verify successful launch of the neutron agents:
pt_br: Liste os agentes para verificar a inicialização com sucesso dos agentes do neutron:

source: This section describes how to verify operation of the Block Storage service by creating a volume.
pt_br: Esta seção descreve como verificar a operação do serviço de Block Storage através da criação de um volume.

source: For more information about how to manage volumes, see the <link href="http://docs.openstack.org/user-guide/content/index.html"><citetitle>OpenStack User Guide</citetitle></link>.
pt_br: Para mais informações sobre como gerenciar volumes, consulte <link href="http://docs.openstack.org/user-guide/content/index.html"><citetitle>OpenStack User Guide</citetitle></link>.

source: Source the <literal>demo</literal> tenant credentials to perform the following steps as a non-administrative tenant:
pt_br: Obtenha as credenciais do tenant <literal>demo</literal> para realizar os seguintes passos como um tenant não-administrativo:

source: Create a 1 GB volume:
pt_br: Crie um volume de 1 GB:

source: Verify creation and availability of the volume:
pt_br: Verifique a criação e a disponibilidade do volume:

source: If the status does not indicate <literal>available</literal>, check the logs in the <filename>/var/log/cinder</filename> directory on the controller and volume nodes for more information.
pt_br: Se o status não indicar <literal>disponível</literal>, cheque os logs no diretório <filename>/var/log/cinder</filename> nos nodos controlador e de volume para mais informações.

source: The <link linkend="launch-instance">launch an instance</link> chapter includes instructions for attaching this volume to an instance.
pt_br: O capítulo <link linkend="launch-instance">lançar uma instância</link> inclui instruções para conectar este volume a uma instância.

source: Before you configure the OpenStack Networking (neutron) service, you must create a database, service credentials, and API endpoints.
pt_br: Antes de instalar e configurar o serviço de Rede OpenStack (neutron), você deve criar uma base de dados, credenciais de serviço, e endpoints de API.

source: Create the <literal>neutron</literal> database:
pt_br: Crie a base de dados <literal>neutron</literal>:

source: Grant proper access to the <literal>neutron</literal> database:
pt_br: Conceda os acessos apropriados à base de dados <literal>neutron</literal>:

source: Replace <replaceable>NEUTRON_DBPASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>NEUTRON_DBPASS</replaceable> com uma senha adequada.

source: Create the <literal>neutron</literal> user:
ko_kr: <literal>neutron</literal> 사용자 생성:
pt_br: Crie o usuário <literal>neutron</literal>:

source: Replace <replaceable>NEUTRON_PASS</replaceable> with a suitable password.
pt_br: Substitua <replaceable>NEUTRON_PASS</replaceable> com uma senha adequada.

source: Add the <literal>admin</literal> role to the <literal>neutron</literal> user:
pt_br: Adicione o papel <literal>admin</literal> ao usuário <literal>neutron</literal>:

source: Create the <literal>neutron</literal> service entity:
pt_br: Crie a entidade de serviço <literal>neutron</literal>:

source: Create the Networking service API endpoints:
pt_br: Crie os enpoints de API do Serviço de Rede:

source: To configure the Networking server component
ko_kr: 네트워킹 서비스 구성 요소로 구성
pt_br: Para configurar o componente de servidor de Rede

source: The Networking server component configuration includes the database, authentication mechanism, message broker, topology change notifications, and plug-in.
pt_br: A configuração dos componentes do servidor de Rede inclui base de dados, mecanismo de autenticação, intermediador de mensagens, notificações de alteração de topologia, e plug-in.

source: Replace <replaceable>NEUTRON_DBPASS</replaceable> with the password you chose for the database.
pt_br: Substitua <replaceable>NEUTRON_DBPASS</replaceable> com a senha que você escolheu para o banco de dados.

source: In the <literal>[DEFAULT]</literal> section, configure Networking to notify Compute of network topology changes:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure a Rede para notificar à Computação sobre alterações de topologia de rede:

source: Replace <replaceable>SERVICE_TENANT_ID</replaceable> with the <literal>service</literal> tenant identifier (id) in the Identity service and <replaceable>NOVA_PASS</replaceable> with the password you chose for the <literal>nova</literal> user in the Identity service.
pt_br: Substitua <replaceable>SERVICE_TENANT_ID</replaceable> com o identificador (id) do <literal>serviço</literal> de tenant no Serviço de Identidade e substitua <replaceable>NOVA_PASS</replaceable> com a senha que você escolheu para o usuário <literal>nova</literal> no serviço de Identidade.

source: To obtain the <literal>service</literal> tenant identifier (id):
pt_br: Para obter o identificador (id) do <literal>serviço</literal> de tenant:

source: The ML2 plug-in uses the <glossterm baseform="Open vSwitch">Open vSwitch (OVS)</glossterm> mechanism (agent) to build the virtual networking framework for instances. However, the controller node does not need the OVS components because it does not handle instance network traffic.
pt_br: O plug-in ML2 utiliza o mecanismo (agente) <glossterm baseform="Open vSwitch">Open vSwitch (OVS)</glossterm> para construir a estrutura virtual de rede para as instâncias. Contudo, o nodo controlador não precisa dos componentes OVS porque ele não lida com o tráfego de rede das instâncias.

source: Once you configure the ML2 plug-in, be aware that disabling a network type driver and re-enabling it later can lead to database inconsistency.
pt_br: Um vez que você configura o plug-in ML2, esteja ciente de que desabilitando o driver de tipo de rede e habilitando-o novamente pode levar à inconsistências na base de dados.

source: Edit the <filename>/etc/nova/nova.conf</filename> file on the controller node and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/nova/nova.conf</filename> no nodo controlador e complete as seguintes ações:

source: Populate the database:
pt_br: Popule a base de dados:

source: Database population occurs later for Networking because the script requires complete server and plug-in configuration files.
pt_br: O preenchimento da base de dados ocorre mais tarde para a Rede porque o script requer arquivos de configuração completos de servidor e de plug-in.

source: Start the Networking service and configure it to start when the system boots:
ko_kr: 네트워킹 서비스를 시작하고 시스템을 부팅할 때 시작하도록 설정하십시오:
pt_br: Inicie o serviço de rede e configure-o para iniciar quando o sistema inicializar:

source: Restart the Networking service:
ko_kr: 네트워킹 서비스를 다시 시작하십시오:
pt_br: Reinicie o serviço de Rede:

source: List loaded extensions to verify successful launch of the <literal>neutron-server</literal> process:
pt_br: Liste as extensões carregadas para verificar a inicialização com sucesso, do processo do <literal>neutron-server</literal>:

source: Verify the Telemetry installation
ko_kr: Telemetry 설치 확인
pt_br: Verifique a instalação da Telemetria

source: This section describes how to verify operation of the Telemetry module.
pt_br: Essa seção descreve como verificar operações no módulo de Telemetria.

source: Perform these steps on the controller node.
pt_br: Realize estes passos no nodo controlador.

source: List available meters:
pt_br: Lista de medidas disponíveis:

source: Some meters might not appear until after you successfully launch at least one instance.
pt_br: Alguns medidores podem não aparecer até que você lance posteriormente, com sucesso, pelo menos uma instância.

source: Download an image from the Image Service:
ko_kr: Image Service 에서 이미지를 다운로드 합니다:
pt_br: Baixe uma imagem a partir do serviço de Imagem:

source: List available meters again to validate detection of the image download:
pt_br: Lista medidores novamente de modo a validar a detecção do download da imagem.

source: Retrieve usage statistics from the <literal>image.download</literal> meter:
pt_br: Recuperar estatísticas de uso através do medidor <literal>image.download</literal>:

source: Install and configure network node
pt_br: Instalar e configurar o nodo de rede

source: The network node primarily handles internal and external routing and <glossterm>DHCP</glossterm> services for virtual networks.
pt_br: O nodo de rede manipula primariamente o roteamento interno e externo e os serviços de <glossterm>DHCP</glossterm> para redes virtuais.

source: In the <literal>[database]</literal> section, comment out any <literal>connection</literal> options because network nodes do not directly access the database.
pt_br: Na seção <literal>[database]</literal>, comente quaisquer opções <literal>connection</literal> porque os nodos de rede não acessam a base de dados diretamente.

source: The ML2 plug-in uses the <glossterm baseform="Open vSwitch">Open vSwitch (OVS)</glossterm> mechanism (agent) to build the virtual networking framework for instances.
pt_br: O plug-in ML2 utiliza o mecanismo (agente) <glossterm baseform="Open vSwitch">Open vSwitch (OVS)</glossterm> para construir a estrutura de rede virtual para as instâncias.

source: In the <literal>[ml2_type_flat]</literal> section, configure the external flat provider network:
pt_br: Na seção <literal>[ml2_type_flat]</literal>, configure o provedor externo de rede fixa:

source: In the <literal>[ovs]</literal> section, enable tunnels, configure the local tunnel endpoint, and map the external flat provider network to the <literal>br-ex</literal> external network bridge:
pt_br: Na seção <literal>[ovs]</literal>, habilite os túneis, configure o endpoint do túnel local, e mapeie o provedor externo de rede fixa para a bridge de rede externa <literal>br-ex</literal>:

source: Replace <replaceable>INSTANCE_TUNNELS_INTERFACE_IP_ADDRESS</replaceable> with the IP address of the instance tunnels network interface on your network node.
pt_br: Substitua <replaceable>INSTANCE_TUNNELS_INTERFACE_IP_ADDRESS</replaceable> com o endereço IP da interface de rede da instância de túneis em seu nodo de rede.

source: To configure the Layer-3 (L3) agent
ko_kr: Layer-3 (L3) 에전트 구성
pt_br: Para configurar o agente Camada-3 (L3)

source: The <glossterm>Layer-3 (L3) agent</glossterm> provides routing services for virtual networks.
pt_br: O <glossterm>agente Layer-3 (L3)</glossterm> fornece serviços de roteamento para redes virtuais.

source: Edit the <filename>/etc/neutron/l3_agent.ini</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/neutron/l3_agent.ini</filename> e complete as seguintes ações:

source: In the <literal>[DEFAULT]</literal> section, configure the driver, enable <glossterm baseform="network namespace">network namespaces</glossterm>, configure the external network bridge and enable deletion of defunct router namespaces:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure o drive, ative o <glossterm baseform="network namespace">namespace de rede </glossterm>, configure a bridge ao acesso externo e ative a supressão de namespaces de roteamento extintos:

source: Due to an issue with old versions of the <application>iproute2</application> utility, we recommend that you do not configure the <placeholder-1/> option on SLES 11 SP3.
pt_br: Devido a um defeito com a antiga versão do <application>iproute2</application>, nós recomendamos que você não configure a opção <placeholder-1/>em SLES 11 SP3.

source: To configure the DHCP agent
ko_kr: DHCP 에이전트 구성
pt_br: Para configurar o agente DHCP

source: The <glossterm>DHCP agent</glossterm> provides DHCP services for virtual networks.
pt_br: O <glossterm>agente DHCP</glossterm> fornece serviços DHCP para redes virtuais.

source: Edit the <filename>/etc/neutron/dhcp_agent.ini</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/neutron/dhcp_agent.ini</filename> e complete as seguintes ações:

source: In the <literal>[DEFAULT]</literal> section, configure the drivers, enable namespaces and enable deletion of defunct DHCP namespaces:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure os drivers, ative namespaces e ative a supressão de namespaces DHCP extintos:

source: (Optional)
pt_br: (Opcional)

source: Tunneling protocols such as GRE include additional packet headers that increase overhead and decrease space available for the payload or user data. Without knowledge of the virtual network infrastructure, instances attempt to send packets using the default Ethernet <glossterm>maximum transmission unit (MTU)</glossterm> of 1500 bytes. <glossterm>Internet protocol (IP)</glossterm> networks contain the <glossterm>path MTU discovery (PMTUD)</glossterm> mechanism to detect end-to-end MTU and adjust packet size accordingly. However, some operating systems and networks block or otherwise lack support for PMTUD causing performance degradation or connectivity failure.
pt_br: Protocolos de tunelamento como o GRE incluem cabeçalhos de pacote adicionais que aumentam a sobrecarga e diminuem o espaço disponível para o payload e dados de usuário. Sem o conhecimento da infraestrutura virtual de rede, as instâncias tentam enviar pacotes utilizando a padrão Ethernet de glossterm>maximum transmission unit (MTU)</glossterm> de 1500 bytes. As redes <glossterm>Internet protocol (IP)</glossterm> contém o mecanismo <glossterm>path MTU discovery (PMTUD)</glossterm> para detectar o MTU fim-a-fim e ajustar o tamanho dos pacotes adequadamente. Contudo, alguns sistemas operacionais e redes, bloqueiam ou, ao contrário, não possuem suporte para o PMTUD causando degradação de desempenho ou falha de conectividade.

source: Ideally, you can prevent these problems by enabling <glossterm baseform="jumbo frame">jumbo frames</glossterm> on the physical network that contains your tenant virtual networks. Jumbo frames support MTUs up to approximately 9000 bytes which negates the impact of GRE overhead on virtual networks. However, many network devices lack support for jumbo frames and OpenStack administrators often lack control over network infrastructure. Given the latter complications, you can also prevent MTU problems by reducing the instance MTU to account for GRE overhead. Determining the proper MTU value often takes experimentation, but 1454 bytes works in most environments. You can configure the DHCP server that assigns IP addresses to your instances to also adjust the MTU.
pt_br: Idealmente, você pode evitar estes problemas habilitando os <glossterm baseform="jumbo frame">jumbo frames</glossterm> na rede física que contém suas redes de tenants virtuais. Os Jumbo frames suportam MTUs de até aproximadamente 9000 bytes, que anula o impacto da sobrecarga do GRE nas redes virtuais. Contudo, muitos dispositivos de rede não possuem suporte para Jumbo frames e os administradores de OpenStack frequentemente perdem o controle sobre a infraestrutura de rede. Dadas as últimas complicações, você pode também evitar problemas de MTU reduzindo o MTU da instância para acomodar a sobrecarga do GRE. Determinar o valor adequado de MTU geralmente exige experimentação, mas 1454 bytes funciona na maioria dos ambientes.

source: Some cloud images ignore the DHCP MTU option in which case you should configure it using metadata, a script, or another suitable method.
pt_br: Algumas imagens da nuvem ignoram a opção de MTU do DHCP, caso em que você deverá configurá-la utilizando metadados, um script, ou outro método adequado.

source: Edit the <filename>/etc/neutron/dhcp_agent.ini</filename> file and complete the following action:
pt_br: Edite o arquivo <filename>/etc/neutron/dhcp_agent.ini</filename> e complete as seguintes ações:

source: In the <literal>[DEFAULT]</literal> section, enable the <glossterm>dnsmasq</glossterm> configuration file:
pt_br: Na seção <literal>[DEFAULT]</literal>, habilite o arquivo de configuração <glossterm>dnsmasq</glossterm>:

source: Create and edit the <filename>/etc/neutron/dnsmasq-neutron.conf</filename> file and complete the following action:
pt_br: Crie e edite o arquivo <filename>/etc/neutron/dnsmasq-neutron.conf</filename> e complete as seguintes ações:

source: Enable the DHCP MTU option (26) and configure it to 1454 bytes:
pt_br: Habilite a opção (26) DHCP MTU e configure-a para 1454 bytes:

source: Kill any existing <systemitem role="process">dnsmasq</systemitem> processes:
pt_br: Mate qualquer processo <systemitem role="process">dnsmasq</systemitem> existente:

source: To configure the metadata agent
ko_kr: 메타데이터 에이전트 구성
pt_br: Para configurar o agente de metadado

source: The <glossterm baseform="Metadata agent">metadata agent</glossterm> provides configuration information such as credentials to instances.
pt_br: O <glossterm baseform="Metadata agent">agente de metadados</glossterm> fornece informações de configuração tais como credenciais para as instâncias.

source: Edit the <filename>/etc/neutron/metadata_agent.ini</filename> file and complete the following actions:
pt_br: Edite o arquivo <filename>/etc/neutron/metadata_agent.ini</filename> e complete as seguintes ações:

source: In the <literal>[DEFAULT]</literal> section, configure access parameters:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure os parâmetros de acesso:

source: In the <literal>[DEFAULT]</literal> section, configure the metadata host:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure o host de metadados:

source: In the <literal>[DEFAULT]</literal> section, configure the metadata proxy shared secret:
pt_br: Na seção <literal>[DEFAULT]</literal>, configure o shared secret do proxy de metadados:

source: Replace <replaceable>METADATA_SECRET</replaceable> with a suitable secret for the metadata proxy.
pt_br: Substitua <replaceable>METADATA_SECRET</replaceable> com um secret adequado para o proxy de metadados.

source: On the <emphasis>controller</emphasis> node, edit the <filename>/etc/nova/nova.conf</filename> file and complete the following action:
pt_br: No nodo <emphasis>controlador</emphasis>, edite o arquivo <filename>/etc/nova/nova.conf</filename> e complete as seguintes ações:

source: In the <literal>[neutron]</literal> section, enable the metadata proxy and configure the secret:
pt_br: Na seção <literal>[neutron]</literal>, habilite o proxy de metadados e configure o secret:

source: Replace <replaceable>METADATA_SECRET</replaceable> with the secret you chose for the metadata proxy.
pt_br: Substitua <replaceable>METADATA_SECRET</replaceable> com a senha que você escolheu para o proxy de metadado.

source: On the <emphasis>controller</emphasis> node, restart the Compute <glossterm>API</glossterm> service:
pt_br: No nodo <emphasis>controlador</emphasis>, reinicie o serviço de <glossterm>API</glossterm> de Computação

source: The OVS service provides the underlying virtual networking framework for instances. The integration bridge <literal>br-int</literal> handles internal instance network traffic within OVS. The external bridge <literal>br-ex</literal> handles external instance network traffic within OVS. The external bridge requires a port on the physical external network interface to provide instances with external network access. In essence, this port connects the virtual and physical external networks in your environment.
pt_br: O serviço OVS fornece a estrutura virtual de rede subjacente para as instâncias. A bridge de integração <literal>br-int</literal> manipula o tráfego dentro do OVS. A bridge externa <literal>br-ex</literal> manipula o tráfego externo de rede da instância dentro do OVS. A bridge externa requer uma porta na interface física da rede externa para fornecer instâncias com acesso à rede externa. Essencialmente, esta porta conecta as redes virtual e física em seu ambiente.

source: Add the external bridge:
ko_kr: 외부 브릿지 추가:
pt_br: Adicione a bridge externa:

source: Add a port to the external bridge that connects to the physical external network interface:
pt_br: Adicione uma porta à bridge externa que conecta à interface de rede física externa:

source: Depending on your network interface driver, you may need to disable <glossterm>generic receive offload (GRO)</glossterm> to achieve suitable throughput between your instances and the external network.
pt_br: Dependendo do seu driver de interface de rede, você poderá precisar desabilitar o <glossterm>generic receive offload (GRO)</glossterm> para alcançar a taxa de transferência desejada entre suas instâncias e a rede externa.

source: To temporarily disable GRO on the external network interface while testing your environment:
ko_kr: 환경을 테스트하는 경우, 외부 네트워크 인터페이스에 임시로 GRO를 사용하지 않도록 설정:
pt_br: Para desabilitar o GRO na interface de rede externa enquanto testa seu ambiente:

source: The Networking service initialization scripts expect the variable <literal>NEUTRON_PLUGIN_CONF</literal> in the <filename>/etc/sysconfig/neutron</filename> file to reference the ML2 plug-in configurarion file. Edit the <filename>/etc/sysconfig/neutron</filename> file and add the following:
pt_br: Os scripts de inicialização do serviço de Rede esperam que a variável <literal>NEUTRON_PLUGIN_CONF</literal> no arquivo <filename>/etc/sysconfig/neutron</filename> referencie o arquivo de configuração do plug-in ML2. Edite o arquivo <filename>/etc/sysconfig/neutron</filename> e adicione o seguinte:

source: Start the Networking services and configure them to start when the system boots:
ko_kr: 네트워킹 서비스를 시작하고 시스템 부팅할 때 시작하도록 설정합니다:
pt_br: Inicie os serviços de Rede e configure-os para iniciar quando o sistema inicializar:

source: Do not explictly start the <systemitem class="service">neutron-ovs-cleanup</systemitem> service.
pt_br: Não inicie explicitamente o serviço <systemitem class="service">neutron-ovs-cleanup</systemitem>.

source: Do not explictly start the <systemitem class="service">openstack-neutron-ovs-cleanup</systemitem> service.
pt_br: Não inicie explicitamente o serviço <systemitem class="service">openstack-neutron-ovs-cleanup</systemitem>.

source: Restart the Networking services:
ko_kr: 네트워킹 서비스 재시작:
pt_br: Reinicie os serviços de Rede:

source: Add the Telemetry module
ko_kr: Telemetry 모듈 추가
pt_br: Adicionar o módulo de Telemetria

source: Telemetry provides a framework for monitoring and metering the OpenStack cloud. It is also known as the ceilometer project.
pt_br: A Telemetria fornece uma estrutura para monitoramento e medição da nuvem OpenStack. Ela é conhecida como projeto ceilometer.

source: Your OpenStack environment now includes Telemetry. You can <link linkend="launch-instance">launch an instance</link> or add more services to your environment in the previous chapters.
pt_br: Seu ambiente OpenStack agora inclui Telemetria. Você pode <link linkend="launch-instance">lançar uma instância</link> ou adicionar mais serviços ao seu ambiente nos capítulos anteriores.

source: Create OpenStack client environment scripts
pt_br: Criar scripts de ambiente de cliente OpenStack
