Repository: openstack/openstack-manuals
Catalog: doc/install-guide/locale/*.po
Languages: ko_kr, pt_br

source: Runs the Networking service, Identity Service, and Compute services that are required to deploy VMs (<systemitem class="service">nova-api</systemitem>, <systemitem class="service">nova-scheduler</systemitem>, for example). The node must have at least one network interface, which is connected to the Management Network. The host name is <literal>controller</literal>, which every other node resolves to the IP of the controller node.
ko_kr: 가상 머신(예: <systemitem class="service">nova-api</systemitem>, <systemitem class="service">nova-scheduler</systemitem>)을 배포하는데 필요한 네트워킹 서비스, 인증 서비스, 처리부 서비스를 실행하십시오. 노드에는 최소한 한개의 네트워크 인터페이스가 있어야 하며 네트워크 인터페이스는 관리 네트워크에 연결되어 있어야 합니다. 호스트 이름은 모든 다른 노드가 제어 노드의 IP로 식별하게 하는 <literal>controller</literal> 입니다.

source: The <systemitem class="service">nova-network</systemitem> service should not be running. This is replaced by the OpenStack Networking component, <systemitem class="service">neutron</systemitem>. To delete a network, run this command:
ko_kr: <systemitem class="service">nova-network</systemitem>를 동작하면 안됩니다. 이 서비스는 오픈스택 네트워킹 구성 요소 <systemitem class="service">neutron</systemitem>으로 바뀝니다. 네트워크를 삭제하려면 다음 명령을 실행하십시오:

source: Note that a network must first be disassociated from a project using the <code>nova network-disassociate</code> command before it can be deleted.
ko_kr: 참고로 네트워크는 우선 <code>nova network-disassociate</code> 명령을 지우기 전에 사용하여 프로젝트로부터 따로 분리해야 합니다.

source: Runs the Networking L2 agent and the Compute services that run VMs (<placeholder-1/> specifically, and optionally other nova-* services depending on configuration). The node must have at least two network interfaces. The first communicates with the controller node through the management network. The second interface handles the VM traffic on the data network. The VM can receive its IP address from the DHCP agent on this network.
ko_kr: 네트워킹 L2 에이전트와 VM을 실행하는 처리 서비스를 실행하십시오(<placeholder-1/> 특히, 설정과 관계된 다른 추가 nova-* 서비스). 노드에는 최소한 두 네트워크 인터페이스를 보유해야 합니다. 하나는 관리 네트워크를 통해 제어 노드와 통신합니다. 다른 인터페이스는 데이터 네트워크의 가상 머신 트래픽을 처리합니다. 가상 머신은 해당 네트워크에서 DHCP 에이전트로부터 IP 주소를 받을 수 있습니다.

source: Runs Networking L2 agent and the DHCP agent. The DHCP agent allocates IP addresses to the VMs on the network. The node must have at least two network interfaces. The first communicates with the controller node through the management network. The second interface handles the VM traffic on the data network.
ko_kr: 네트워킹 L2 에이전트와 DHCP 에이전트를 실행하십시오. DHCP 에이전트는 네트워크의 가상 머신에 IP 주소를 할당합니다. 노드는 최소한 두 개의 인터페이스를 가지고 있어야 합니다. 첫번째 인터페이스는 관리 네트워크를 통해 제어 노드와 통신합니다. 두번째 인터페이스는 데이터 네트워크의 가상 머신 트래픽을 다룹니다.

source: The demo assumes the following prerequisites:
ko_kr: 시험 동작은 다음 상황이라 가정합니다:

source: Glance is installed, configured, and running. Additionally, an image must be available.
ko_kr: 글랜스를 설치하고 설정하여 동작중입니다. 게다가, 이미지는 반드시 있어야합니다.

source: OpenStack Identity is installed, configured, and running. A Networking user <emphasis role="bold">neutron</emphasis> is in place on tenant <emphasis role="bold">service</emphasis> with password <replaceable>NEUTRON_PASS</replaceable>.
ko_kr: 오픈스택 아이덴티티를 설치하고, 설정하고 실행중입니다. <emphasis role="bold">neutron</emphasis> 네트워킹 사용자는 <emphasis role="bold">service</emphasis> 테넌트에 <replaceable>NEUTRON_PASS</replaceable> 암호를 지닌채로 존재합니다.

source: Additional services:
ko_kr: 추가 서비스:

source: RabbitMQ is running with the default guest user and password <replaceable>RABBIT_PASS</replaceable>.
ko_kr: RabbitMQ는 기본적으로 guest 사용자와 <replaceable>RABBIT_PASS</replaceable> 암호로 실행합니다.

source: Qpid is running with the default guest user and password.
ko_kr: 기본 guest 사용자, 암호를 사용하여 Qpid를 작동합니다.

source: Compute is installed and configured.
ko_kr: Compute를 설치하고 구성하였습니다.

source: Install the Networking server and respond to <systemitem class="library">debconf</systemitem> prompts to configure the database, the <code>keystone_authtoken</code>, and the RabbitMQ credentials.
ko_kr: 네트워킹 서버를 설치하고 <systemitem class="library">debconf</systemitem> 프롬프트에 응답하여 데이터베이스 <code>keystone_authtoken</code>, RabbitMQ 인증 정보를 설정하십시오.

source: See <xref linkend="neutron-controller-node"/> for installation instructions.
ko_kr: 설치 방법은 <xref linkend="neutron-controller-node"/>를 참고하십시오.

source: See <xref linkend="neutron-network-node"/> for database creation details.
ko_kr: 데이터베이스를 만드는 세부 절차는 <xref linkend="neutron-network-node"/>을(를) 참고하십시오.

source: If not already configured, update the Networking <filename> /etc/neutron/neutron.conf</filename> configuration file to use the Identity Service, the plug-in, and database configuration:
ko_kr: 설정하지 않았다면 <filename> /etc/neutron/neutron.conf</filename> 네트워크 설정 파일을 업데이트하여 인증 서비스, 플러그인, 데이터베이스 설정을 사용하도록 하십시오:

source: Configure Networking to use your chosen plug-in:
ko_kr: 선택한 플러그인을 사용하도록 네트워킹을 설정하십시오:

source: If not already configured, update the Networking <filename> /etc/neutron/neutron.conf</filename> configuration file to choose a plug-in and Identity Service user as necessary:
ko_kr: 설정하지 않았다면 <filename> /etc/neutron/neutron.conf</filename> 네트워킹 설정 파일을 업데이트하여 플러그인과 인증 서비스 사용자를 필요한 대로 선택하도록 하십시오:

source: Update the plug-in <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> configuration file with the bridge mappings:
ko_kr: <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> 플러그인 설정 파일을 브리지 매핑 내용으로 업데이트하십시오:

source: Install the <systemitem class="service">nova-compute</systemitem> service.
ko_kr: <systemitem class="service">nova-compute</systemitem> 서비스를 설치하십시오.

source: See <xref linkend="nova-compute"/> for installation instructions.
ko_kr: 설치 과정은 <xref linkend="nova-compute"/>을(를) 참고하십시오.

source: Update the Compute <filename> /etc/nova/nova.conf</filename> configuration file to make use of OpenStack Networking:
ko_kr: <filename> /etc/nova/nova.conf</filename> 처리부 설정 파일을 업데이트하여 오픈스택 네트워킹을 사용하도록 하십시오:

source: Restart the Compute services
ko_kr: Compute 서비스 재시작

source: Compute and Network node - L2 agent
ko_kr: Compute와 네트워크 노드 - L2 에이전트

source: Install and start Open vSwitch. Then, configure <systemitem class="service">neutron</systemitem> accordingly.
ko_kr: Open vSwitch를 설치하고 시작하십시오. 다음 <systemitem class="service">neutron</systemitem>을 올바르게 설정하십시오.

source: Add the integration bridge to Open vSwitch:
ko_kr: Open vSwitch에 통합 브릿지를 추가하십시오:

source: Update the Networking <filename> /etc/neutron/neutron.conf</filename> configuration file:
ko_kr: <filename> /etc/neutron/neutron.conf</filename> 네트워킹 설정 파일을 업데이트하십시오:

source: If not already configured, update the Networking <filename> /etc/neutron/neutron.conf</filename> configuration file to use the plug-in, message queue, and database configuration:
ko_kr: 설정하지 않았다면, <filename> /etc/neutron/neutron.conf</filename> 네트워킹 설정 파일을 업데이트하여 플러그인, 메시지 큐, 데이터베이스 설정을 사용하도록 하십시오:

source: Update the plug-in <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> configuration file:
ko_kr: <filename> /etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> 플러그인 설정 파일을 업데이트하십시오:

source: Create a symbolic link from <filename>/etc/neutron/plugin.ini</filename> to <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename> or <code>neutron-server</code> will not run:
ko_kr: 작동하지 않는 <code>neutron-server</code> 또는 <filename>/etc/neutron/plugins/openvswitch/ovs_neutron_plugin.ini</filename>에서 <filename>/etc/neutron/plugin.ini</filename>으로 심볼릭 링크를 만듭니다:

source: Create the <emphasis role="bold">br-eth0</emphasis> network bridge to handle communication between nodes using eth0:
ko_kr: eth0을 사용하여 노드 사이의 통신을 처리하는 <emphasis role="bold">br-eth0</emphasis> 네트워크 브릿지를 만드십시오:

source: Restart the OpenStack Networking L2 agent:
ko_kr: 오픈스택 네트워킹 L2 에이전트를 다시 시작하십시오:

source: See <xref linkend="neutron-network-node"/> for <emphasis role="bold">generic</emphasis> installation instructions.
ko_kr: <emphasis role="bold">일반</emphasis> 설치 방법은 <xref linkend="neutron-network-node"/>을(를) 참고하십시오.

source: If not already configured, update the Networking <filename> /etc/neutron/neutron.conf</filename> configuration file to use the plug-in and message queue.
ko_kr: 설정하지 않았다면, <filename> /etc/neutron/neutron.conf</filename> 네트워킹 설정 파일을 업데이트하여 플러그인과 메시지 큐를 사용하도록 하십시오:

source: Ensure that the DHCP agent is using the correct plug-in my changing the configuration in <filename> /etc/neutron/dhcp_agent.ini</filename>:
ko_kr: <filename> /etc/neutron/dhcp_agent.ini</filename> 파일에서 바꾼 설정이 DHCP 에이전트가 올바른 플러그인을 사용하도록 하는 설정인지 확인하십시오:

source: Restart the DHCP agent:
ko_kr: DHCP 에이전트 다시 시작:

source: Use the following commands on the network node.
ko_kr: 네트워크 노드에 다음 명령을 사용하십시오.

source: Get the user information:
ko_kr: 사용자 정보를 가져오십시오:

source: Create a internal shared network on the demo tenant ($TENANT_ID is b7445f221cda4f4a8ac7db6b218b1339):
ko_kr: demo 테넌트에 내부 공유 네트워크를 만드십시오($TENANT_ID는 b7445f221cda4f4a8ac7db6b218b1339이 됨):

source: Create a subnet on the network:
ko_kr: 네트워크에 서브넷을 만드십시오:

source: Create a server for tenant A:
ko_kr: Tenant A의 서버를 만드십시오:

source: Ping the server of tenant A:
ko_kr: Tenant A의 서버에 ping을 보내십시오:

source: Ping the public network within the server of tenant A:
ko_kr: Tenant A 서버에서 공인 네트워크로 ping을 보내십시오:

source: The 192.168.1.1 is an IP on public network to which the router connects.
ko_kr: 192.168.1.1은 라우터가 연결된 공개 네트워크의 IP입니다.

source: Create servers for other tenants with similar commands. Because all VMs share the same subnet, they can access each other.
ko_kr: 비슷한 명령을 사용하여 다른 테넌트에 대한 서버를 만들 수도 있습니다. 따라서 모든 가상 머신은 동일한 하위 네트워크를 공유하며, 서로 접근할 수 있습니다.

source: Use case: single flat network
ko_kr: 사용 사례: 단일 플랫 네트워크

source: The simplest use case is a single network. This is a "shared" network, meaning it is visible to all tenants via the Networking API. Tenant VMs have a single NIC, and receive a fixed IP address from the subnet(s) associated with that network. This use case essentially maps to the FlatManager and FlatDHCPManager models provided by Compute. Floating IPs are not supported.
ko_kr: 가장 간단한 사용 사례는 단일 네트워크 입니다. 네트워킹 API를 통해서 모든 tenant를 확인할 수 있는 "공유" 네트워크입니다. Tenant VM은 하나의 NIC를 가지고 있고, 그 네트워크와 연결된 서브넷에서 고정 IP주소를 받습니다. 이 사용 사례는 Compute에서 제공하는 FlatManager와 FlatDHCPManager 모델에 맵핑됩니다. 유동 IP는 지원하지 않습니다.

source: This network type is often created by the OpenStack administrator to map directly to an existing physical network in the data center (called a "provider network"). This allows the provider to use a physical router on that data center network as the gateway for VMs to reach the outside world. For each subnet on an external network, the gateway configuration on the physical router must be manually configured outside of OpenStack.
ko_kr: 이 네트워크 타입은 데이터 센터("provider 네트워크"라고 함)에서 기존 물리 네트워크를 직접 맵핑할 수 있는 OpenStack 관리자에 의해서 생성됩니다. VM이 게이트웨이를 통해 외부로 나가기 위해 provider가 제공한 데이터 센터 네트워크의 물리 라우터를 사용합니다. 외부 네트워크에서 각 서브넷애 대한 물리 라우터의 게이트웨이 구성을 OpenStack 외부에서 직접 설정 해야합니다.

source: Use case: multiple flat network
ko_kr: 사용 사례: 다중 플랫 네트워크

source: This use case is similar to the above single flat network use case, except that tenants can see multiple shared networks via the Networking API and can choose which network (or networks) to plug into.
ko_kr: 이 사용 사례는 tenant가 네트워킹 API를 통해 여러 공유 내트워크를 볼 수 있게 연결되는 네트워크를 선택할 수 있다는 점을 제외하면 위의 단일 플랫 네트워크 사용의 경우와 유사합니다.

source: Use case: mixed flat and private network
ko_kr: 사용 사례: 플랫 네트워크와 사설 네트워크 혼합형

source: This use case is an extension of the above Flat Network use cases. In addition to being able to see one or more shared networks via the OpenStack Networking API, tenants can also have access to private per-tenant networks (only visible to tenant users).
ko_kr: 이 사용 사례는 플랫 네트워크 사용 사례에 확장에 대한 내용입니다. OpenStack 네트워킹 API를 통해 하나 이상의 공유 네트워크를 볼수 있을 뿐만아니라, tenant는 (tenant 사용자만 볼 수 있는) tenant별 사설 네트워크에 접근할 수 있습니다.

source: Created VMs can have NICs on any of the shared or private networks that the tenant owns. This enables the creation of multi-tier topologies that use VMs with multiple NICs. It also enables a VM to act as a gateway so that it can provide services such as routing, NAT, and load balancing.
ko_kr: 기존에 만든 가상 머신에는 테넌트 소유의 공유 또는 비공개 네트워크의 NIC를 보유할 수 있습니다. 이렇게 구성하면 다중 NIC를 보유한 가상 머신을 사용하는 다중 티어 토폴로지를 만들 수 있습니다. 또한 가상 머신으로 하여금 게이트웨이처럼 동작하게 하여 라우팅, NAT, 로드 밸런싱 서비스를 제공하게 할 수 있습니다.

source: Configure a Block Storage service node
ko_kr: 블록 스토리지 서비스 노드 구성

source: Use the instructions in <xref linkend="ch_basics"/> to configure the system. Note the following differences from the installation instructions for the controller node:
ko_kr: 시스템을 설정하려면 <xref linkend="ch_basics"/>의 절차를 따르십시오. 제어 노드의 설치 절차와는 다음의 차이점이 있음을 참고바랍니다:

source: Follow the instructions in <xref linkend="basics-ntp"/> to synchronize from the controller node.
ko_kr: Compute 노드를 동기화하기 위해선 <xref linkend="basics-ntp"/>의 절차를 따르십시오.

source: Install the required LVM packages, if they are not already installed:
ko_kr: 만약 먼저 설치되어 있지 않았다면, 필요한 LVM 패키지를 설치합니다:

source: Create the LVM physical and logical volumes. This guide assumes a second disk <literal>/dev/sdb</literal> that is used for this purpose:
ko_kr: LVM 물리, 논리 볼륨을 만드십시오. 이 안내서에서는 LVM 볼륨을 만들려는 목적으로 두번째 디스크 <literal>/dev/sdb</literal>를 사용함을 가정합니다:

source: You must add required physical volumes for LVM on the Block Storage host. Run the <placeholder-1/> command to get a list or required volumes.
ko_kr: 블록 저장소 호스트에서 LVM에 대한 필수 물리 볼륨을 추가해야 합니다. 볼륨 목록 또는 필수 볼륨을 가져오려면 <placeholder-1/> 명령을 실행하십시오.

source: Each item in the filter array starts with either an <literal>a</literal> for accept, or an <literal>r</literal> for reject. The physical volumes that are required on the Block Storage host have names that begin with <literal>a</literal>. The array must end with "<literal>r/.*/</literal>" to reject any device not listed.
ko_kr: 필터 배열의 각각의 항목은 허용이라는 의미의 <literal>a</literal> 로 시작하거나 불허라는 의미의 <literal>r</literal>로 시작합니다. 블록 저장소 호스트에서 필요한 물리 볼륨에는 <literal>a</literal> 로 시작하는 이름을 가지고 있습니다. 장치를 목록에 나타나지 않도록 거절하려면 "<literal>r/.*/</literal>"로 끝나야 합니다.

source: In this example, <literal>/dev/sda1</literal> is the volume where the volumes for the operating system for the node reside, while <literal>/dev/sdb</literal> is the volume reserved for <literal>cinder-volumes</literal>.
ko_kr: 이 예제에서, <literal>/dev/sda1</literal>는 노드쪽의 운영체제가 위치하는 볼륨이며, <literal>/dev/sdb</literal>는 <literal>cinder-volumes</literal>에서 예약한 볼륨입니다.

source: Configure a Block Storage service controller
ko_kr: 블록 스토리지 서비스 컨트롤러 구성

source: Install the appropriate packages for the Block Storage service:
ko_kr: 블록 스토리지 서비스에 적합한 패키지 설치:

source: Create the database tables for the Block Storage service:
ko_kr: 블록 스토리지 서비스에 대한 데이터베이스 테이블을 생성:

source: Create a <literal>cinder</literal> user.
ko_kr: <literal>cinder</literal> 사용자 생성합니다.

source: Use the <literal>service</literal> tenant and give the user the <literal>admin</literal> role:
ko_kr: <literal>service</literal> tenant를 사용하고, <literal>admin</literal> 역할을 사용자에게 부여합니다:

source: Edit the <filename>/etc/cinder/cinder.conf</filename> configuration file:
ko_kr: <filename>/etc/cinder/cinder.conf</filename> 구성 파일 편집:

source: OpenStack Installation Guide for <phrase os="rhel;centos;fedora">Red Hat Enterprise Linux, CentOS, and Fedora</phrase><phrase os="ubuntu">Ubuntu 12.04/14.04 (LTS)</phrase><phrase os="debian">Debian 7.0 (Wheezy)</phrase><phrase os="opensuse">openSUSE and SUSE Linux Enterprise Server</phrase>
ko_kr: <phrase os="rhel;centos;fedora">Red Hat Enterprise Linux, CentOS, Fedora</phrase><phrase os="ubuntu">Ubuntu 12.04/14.04 (LTS)</phrase><phrase os="debian">Debian 7.0 (Wheezy)</phrase><phrase os="opensuse">openSUSE, SUSE Linux Enterprise Server</phrase>에 대한 OpenStack 설치 가이드

source: OpenStack Foundation
ko_kr: OpenStack 재단

source: Edit the <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> file.
ko_kr: <filename>/etc/neutron/plugins/ml2/ml2_conf.ini</filename> 파일을 편집합니다.

source: Add the following keys to the <literal>[ml2_type_gre]</literal> section:
ko_kr: <literal>[ml2_type_gre]</literal> 섹션에 다음키 추가합니다:

source: Add the <literal>[ovs]</literal> section and the following keys to it:
ko_kr: <literal>[ovs]</literal> 섹션과 다음 키를 추가합니다:

source: Add the integration bridge:
ko_kr: 통합 브릿지 추가:

source: Three-node architecture with OpenStack Networking (neutron). See <xref linkend="example-architecture-with-neutron-networking"/>.
ko_kr: OpenStack 네트워킹 (neutron)에서의 세 개 노드 아키텍처 구성입니다. <xref linkend="example-architecture-with-neutron-networking"/>를 확인하십시오.

source: Install the dashboard
ko_kr: 대시보드 설치

source: Before you can install and configure the dashboard, meet the requirements in <xref linkend="dashboard-system-requirements"/>.
ko_kr: 대시보드를 설치하고 설정하기 전에, <xref linkend="dashboard-system-requirements"/>의 요구사항을 확인하십시오.

source: When you install only Object Storage and the Identity Service, even if you install the dashboard, it does not pull up projects and is unusable.
ko_kr: 오브젝트 저장소와 인증 서비스만 설치할 경우 대시보드를 설치하더라도 프로젝트를 가동할 수 없어 사용할 수 없습니다.

source: For more information about how to deploy the dashboard, see <link href="http://docs.openstack.org/developer/horizon/topics/deployment.html">deployment topics in the developer documentation</link>.
ko_kr: 대시보드를 배포 가동하는 더 많은 정보를 보려면 <link href="http://docs.openstack.org/developer/horizon/topics/deployment.html">개발자 문서의 배포 가동편</link>을 보십시오.

source: Install the dashboard on the node that can contact the Identity Service as root:
ko_kr: Root 권한으로 Identity 서비스에 접근할 수 있는 노드에 대시보드를 설치하십시오:

source: Note for Ubuntu users
ko_kr: 우분투 사용자 참고사항

source: Remove the <literal>openstack-dashboard-ubuntu-theme</literal> package. This theme prevents translations, several menus as well as the network map from rendering correctly: <placeholder-1/>
ko_kr: <literal>openstack-dashboard-ubuntu-theme</literal> 패키지를 제거하십시오. 이 테마는 번역한 내용과 메뉴들 그리고 올바르게 ㄹㄴ더링된 네트워크 맵을 표현하는데 문제가 있습니다: <placeholder-1/>

source: Note for Debian users
ko_kr: Debian 사용자 참고사항

source: To install the Apache package:
ko_kr: 아파치 꾸러미를 설치하려면:

source: This command installs and configures Apache correctly, provided that the user asks for it during the <package>debconf</package> prompts. The default SSL certificate is self-signed, and it is probably wise to have it signed by a root Certificate Authority (CA).
ko_kr: 이 명령은 <package>debconf</package> 프롬프트가 뜨는 동안 사용자에 대한 질문을 제공하며, 아파치를 올바르게 설치하고 설정합니다. 기본 SSL 인증은 자체 서명 방식이며, 루트 서명 인증(CA)을 통해 서명한 인증을 들고 있는 것이 현명합니다.

source: Modify the value of <literal>CACHES['default']['LOCATION']</literal> in <filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> to match the ones set in <filename os="ubuntu;debian">/etc/memcached.conf</filename><filename os="centos;fedora;rhel;opensuse;sles">/etc/sysconfig/memcached</filename>.
ko_kr: <filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> 의 <literal>CACHES['default']['LOCATION']</literal> 값을 수정하여 <filename os="ubuntu;debian">/etc/memcached.conf</filename><filename os="centos;fedora;rhel;opensuse;sles">/etc/sysconfig/memcached</filename>에 설정한 내용과 일치하게 하십시오.

source: Open <filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename> and look for this line:
ko_kr: <filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename>에서 다음 내용을 확인하십시오:

source: Notes
ko_kr: 참고

source: The address and port must match the ones set in <filename os="ubuntu;debian">/etc/memcached.conf</filename><filename os="centos;fedora;rhel;opensuse;sles">/etc/sysconfig/memcached</filename>.
ko_kr: 주소와 포트가 <filename os="ubuntu;debian">/etc/memcached.conf</filename><filename os="centos;fedora;rhel;opensuse;sles">/etc/sysconfig/memcached</filename>에 설정한 내용과 일치해야 합니다.

source: If you change the memcached settings, you must restart the Apache web server for the changes to take effect.
ko_kr: Memcached 설정을 변경하게되면, 변경된 내용을 적용하기 위해서 아파치 웹 서버를 재시작합니다.

source: You can use options other than memcached option for session storage. Set the session back-end through the <parameter>SESSION_ENGINE</parameter> option.
ko_kr: 세션 스토리지를 위해 memcached 옵션이 아닌 다른 옵션을 사용할 수 있습니다. <parameter>SESSION_ENGINE</parameter> 옵션을 통해서 세션 백엔드를 설정합니다.

source: To change the timezone, use the dashboard or edit the <filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> file.
ko_kr: 시간대를 바꾸려면 대시보드를 사용하거나 <filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> 파일을 편집하십시오.

source: Change the following parameter: <code>TIME_ZONE = "UTC"</code>
ko_kr: 다음 매개변수를 바꾸십시오: <code>TIME_ZONE = "UTC"</code>

source: Update the <literal>ALLOWED_HOSTS</literal> in <filename>local_settings.py</filename> to include the addresses you wish to access the dashboard from.
ko_kr: <filename>local_settings.py</filename> 에서 <literal>ALLOWED_HOSTS</literal>를 업데이트 하여 대시보드에서 접근하려는 주소를 포함하도록 하십시오.

source: Edit <filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename>:
ko_kr: <filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> 파일을 편집하십시오:

source: This guide assumes that you are running the Dashboard on the controller node. You can easily run the dashboard on a separate server, by changing the appropriate settings in <filename>local_settings.py</filename>.
ko_kr: 이 안내서는 제어 노드에서 대시보드를 실행 중인 상황을 가정합니다. <filename>local_settings.py</filename> 파일에서 적절하게 설정을 바꾸면 각각의 서버에서 대시보드를 쉽게 실행할 수 있습니다.

source: Edit <filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> and change <literal>OPENSTACK_HOST</literal> to the hostname of your Identity Service:
ko_kr: <filename os="centos;fedora;rhel">/etc/openstack-dashboard/local_settings</filename><filename os="ubuntu;debian">/etc/openstack-dashboard/local_settings.py</filename><filename os="opensuse;sles">/srv/www/openstack-dashboard/openstack_dashboard/local/local_settings.py</filename> 파일에서 <literal>OPENSTACK_HOST</literal> 값을 Identity 서비스의 호스트 이름 값으로 변경하십시오:

source: Setup Apache configuration: <placeholder-1/>
ko_kr: 아파치 구성을 설정하십시오: <placeholder-1/>
