Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: If prompted about which type of devices your installation uses, choose :guilabel:`Virtio Block Device`.
de: Wenn Sie dazu aufgefordert werden, welche Art von Geräten Ihre Installation verwendet, wählen Sie :guilabel: `Virtio Block Device`.
id: Jika diminta tentang tipe perangkat yang digunakan instalasimu, pilih :guilabel:`Virtio Block Device`.
tr_tr: Kurulumunuzun ne tür aygıtlar kullandığı sorulursa, :guilabel:`Virtio Blok Aygıtı` seçin.

source: If the account you use to ssh into your server does not have permissions to run libvirt, but has sudo privileges, do:
de: Wenn das Konto, das Sie verwenden, um ssh in Ihren Server zu machen, keine Berechtigungen zum Ausführen von libvirt aber sudo Privilegien hat, machen Sie:
id: Jika akun Anda gunakan untuk ssh ke server Anda tidak memiliki izin untuk menjalankan libvirt, tetapi memiliki hak sudo, lakukan:
tr_tr: Sunucunuza ssh çekmek için kullandığınız hesabınızın libvirt çalıştırma izni yoksa, ama sudo yetkileri varsa, şunu yapın:

source: If the consumer subsequently wants to hide the image, the consumer uses the OpenStack Image API to change the image member status to ``rejected``. If the consumer wants to hide the image, but is open to the possibility of being reminded by the producer that the image is available, the consumer uses the OpenStack Image API to change the image member status back to ``pending``, by using the ``Update image member`` API operation.
de: Wenn der Verbraucher danach das Abbild verbergen will, verwendet der Verbraucher die OpenStack Image API, um den Status des Imagemitglieds auf ``rejected`` zu ändern. Wenn der Verbraucher das Abbild verbergen will, ist es aber offen für die Möglichkeit, vom Produzenten daran erinnert zu werden, dass das Abbild verfügbar ist. Der Verbraucher nutzt die OpenStack Image API, um den Status des Abbildmitglieds wieder auf ``pending`` zu ändern das ``Update Image Member`` API Operation.
id: Jika kemudian konsumen ingin menyembunyikan image, konsumen menggunakan OpenStack Image API untuk mengubah status anggota image menjadi ``rejected``. Jika konsumen ingin menyembunyikan image, tetapi terbuka kemungkinan untk diingatkan oleh produsen bahwa image tersedia, konsumen dapat menggunakan OpenStack Image API untuk mengubah status anggota image kembali ke ``pending``, dengan menggunakan operasi API ``Update image member``.
tr_tr: Tüketici sonradan imajı gizlemek isterse, OpenStack İmaj API'sini kullanarak imaj üyelik durumunu ``reddedildi`` yapar. Tüketici imajı gizlemek isterse, ama üretici tarafından imajın kullanılırlığıyla ilgili hatırlatılmaya açık olmak istiyorsa, OpenStack API'sindeki ``İmaj üyesini güncelle`` API işemini kullanarak imaj üyeliğini tekrar ``beklemede`` yapabilir.

source: If the consumer wants the image to appear in the image list, the consumer uses the OpenStack Image API to change the image member status to ``accepted``, by using the ``Update image member`` API operation.
de: Wenn der Verbraucher das Abbild in der Abbildliste erscheinen möchte, verwendet der Verbraucher die OpenStack Image API, um den Status des Abbildmitglieds auf ``accepted`` zu ändern, indem er die ``Update image member`` API-Operation verwendet.
id: Jika konsumen ingin memunculkan image dalam daftar image, konsumen menggunakan OpenStack Image API untuk mengubah status anggota image menjadi ``accepted``, dengan menggunakan operasi API ``Update image member``.
tr_tr: Tüketici imajın imaj listesinde görünmesini isterse, tüketici ``İmaj üyesini güncelle`` API işlemini kullanarak OpenStack API'si ile imaj üyeliği durumunu ``kabul edildi`` olarak değiştirir.

source: If the image has multiple partitions, use :command:`kpartx` to expose the partitions as separate devices (for example, ``/dev/mapper/loop0p1``), then mount the partition that corresponds to the root file system:
de: Wenn das Abbild mehrere Partitionen hat, verwenden Sie :command:`kpartx`, um die Partitionen als separate Geräte freizugeben (z. B.` `/dev/mapper/loop0p1``) und dann die Partition, die dem Root-Dateisystem entspricht,
id: Jika image memiliki beberapa partisi, gunakan :command:`kpartx` untuk mengekspos partisi sebagai perangkat terpisah (misalnya, ``/dev/mapper/loop0p1``), kemudian mount partisi yang sesuai dengan sistem file root:
tr_tr: İmajda birden fazla bölüm varsa, bölümleri ayrı aygıtlar olarak ortaya çıkarmak için :command:`kpartx` kullanın (örneğin, ``/dev/mapper/loop0p1``), ardından kök dosya sistemine denk gelen bölümü bağlayın:

source: If the image has, say three partitions (/boot, /, swap), there should be one new device created for each partition:
de: Wenn das Abbild sagen wir drei Partitionen (/boot, /, swap) hat, sollte es ein neues Gerät für jede Partition erstellt werden:
id: Jika image memiliki, katakanlah tiga partisi (/boot, /, swap), harus ada satu perangkat baru yang diciptakan untuk setiap partisi:
tr_tr: İmajın örneğin üç bölümü varsa (/boot, /, swap) her bir bölüm için bir yeni aygıt oluşturulmuş olmalı:

source: If the image has, say three partitions (/boot, /, swap), there should be one new device created per partition:
de: Wenn das Abbild sagen wir drei Partitionen (/boot, /, swap) hat, sollte es ein neues Gerät pro Partition erstellt werden:
id: Jika image memiliki, katakanlah tiga partisi (/boot, /, swap), harus ada satu perangkat baru yang dibuat per partisi:
tr_tr: İmajın örneğin üç bölümü varsa (/boot, /, swap), bölüm başına bir yeni aygıt oluşturulmuş olmalıdır:

source: If the image only has a single partition, you can mount the loop device directly:
de: Wenn das Abbild nur eine einzelne Partition hat, können Sie das Loop-Gerät direkt anbringen:
id: Jika image hanya memiliki satu partisi, Anda dapat me-mount perangkat loop secara langsung:
tr_tr: İmaj tek bir bölümden oluşuyorsa, döngü aygıtını doğrudan bağlayabilirsiniz:

source: If the image partitions are managed with LVM, after you use :command:`qemu-nbd` and :command:`partprobe`, you must use :command:`vgscan` and :command:`vgchange -ay` in order to expose the LVM partitions as devices that can be mounted:
de: Wenn die Abbildpartitionen mit LVM verwaltet werden, verwenden Sie :command: `qemu-nbd` und :command:`partprobe`, Sie müssen :command:`vgscan` und :command:`vgchange -ay` benutzen, um die LVM-Partitionen als einbindbare Geräte zu erstellen:
id: Jika partisi image dikelola dengan LVM, setelah Anda menggunakan :command: `qemu-nbd` dan :command:` partprobe`, Anda harus menggunakan :command:`vgscan` dan :command:`vgchange -ay` dalam rangka untuk mengekspos partisi LVM sebagai perangkat yang dapat dipasang:
tr_tr: İmaj bölümleri LVM ile yönetiliyorsa, :command:`qemu-nbd` ve :command:`partprobe` komutunu kullandıktan sonra, :command:`vgscan` ve :command:`vgchange -ay` komutlarını sırasıyla kullanarak LVM bölümlerini bağlanabilir aygıtlar olarak ortaya çıkarabilirsiniz:

source: If the image partitions are not managed with LVM, they can be mounted directly:
de: Wenn die Abbildpartitionen nicht mit LVM verwaltet werden, können sie direkt montiert werden:
id: Jika partisi image tidak dikelola dengan LVM, mereka dapat dipasang langsung:
tr_tr: İmaj bölümleri LVM ile yönetilmiyorsa, doğrudan bağlanabilirler:

source: If the installer asks for web site name and CentOS directory separately, you might enter:
de: Wenn der Installateur nach Website-Namen und CentOS-Verzeichnis separat fragt, können Sie Folgendes eingeben:
id: Jika installer meminta nama situs web dan direktori CentOS secara terpisah, Anda dapat memasukkan:
tr_tr: Yükleyici web sitesi ismini ve CentOS dizinini ayrı ayrı sorarsa, şunları girebilirsiniz:

source: If the network block device you selected was already in use, the initial :command:`qemu-nbd` command will fail silently, and the ``/dev/nbd3p{1,2,3}`` device files will not be created.
de: Wenn das Netzwerkblockgerät, das Sie ausgewählt haben, bereits verwendet wurde, wird der Befehl :command:`qemu-nbd` fehlschlagen, und die` `/dev/nbd3p{1,2,3}` `Gerätedateien werden nicht erstellt.
id: Jika perangkat blok jaringan dimana Anda pilih sudah digunakan, perintah awal :command:`qemu-nbd` akan gagal secara diam-diam, dan file perangkat ``/dev/nbd3p{1,2,3}`` tidak akan dibuat.
tr_tr: Seçtiğiniz ağ blok aygıtı kullanımdaysa, ilk :command:`qemu-nbd` komutu sessizce başarısız olacaktır, ve ``/dev/nbd3p{1,2,3}`` aygıt dosyaları oluşturulmayacaktır.

source: If the network is not active, start it by doing:
de: Wenn das Netzwerk nicht aktiv ist, starten Sie es mit:
id: Jika jaringan tidak aktif, mulailah dengan melakukan ini:
tr_tr: Ağ etkin değilse, şu şekilde başlatın:

source: If unsure, use the default partition scheme for the installer. While no scheme is inherently better than another, having the partition that you want to dynamically grow at the end of the list will allow it to grow without crossing another partition's boundary.
de: Wenn Sie unsicher sind, verwenden Sie das Standard-Partitionsschema für das Installationsprogramm. Während kein Schema inhärent besser ist als ein anderes, mit der Partition, die Sie am Ende der Liste dynamisch wachsen lassen möchten, wird es möglich sein, ohne eine andere Trennungsgrenze zu überschreiten.
id: Jika tidak yakin, gunakan skema partisi default untuk installer. Meskipun tidak ada skema secara inheren lebih baik dari yang lain, pemilikan partisi dimana Anda ingin tumbuh secara dinamis pada akhir daftar akan memungkinkan untuk tumbuh tanpa melintasi batas partisi lainnya.
tr_tr: Emin değilseniz, kurulum için öntanımlı bölümleme şemasını kullanın. Bir şemanın diğerlerine göre doğuştan iyi olduğu söylenemez ancak dinamik olarak genişletmek istedğiniz bölümü listenin sonuna bırakmanız herhangi bir bölümün sınırlarına girmeden genişleyebilmesini sağlar.

source: If unsure, we recommend you use the installer's default partition scheme, since there is no clear advantage to one scheme or another.
de: Wenn Sie unsicher sind, empfehlen wir Ihnen, das Standard-Partitionsschema des Installationsprogramms zu verwenden, da es keinen eindeutigen Vorteil für ein Schema oder ein anderes gibt.
id: Jika tidak yakin, sebaiknya Anda menggunakan skema partisi default installer, karena tidak ada keuntungan yang jelas untuk satu skema atau yang lain.
tr_tr: Emin değilseniz, yükleyicinin öntanımlı bölüm şemasını kullanmanızı öneririz, bir şemanın diğerine karşı bir avantajı yoktur.

source: If we did not know in advance what the mount point is in the guest, we could use the ``-i`` (inspect) flag to tell guestmount to automatically determine what mount point to use:
de: Wenn wir im voraus nicht wussten, was der Einstieg in den Gast ist, könnten wir die ``-i`` (Inspektion) -Flag verwenden, damit guestmount automatisch sagt, welcher Mountpunkt zu verwenden ist:
id: Jika kita tidak tahu sebelumnya apakan mount point berada di guest, kita bisa menggunakan ``-i`` (inspect) flag untuk memberitahu guestmount secara otomatis untuk menentukan apakah mount point yang akan digunakan:
tr_tr: Misafirdeki bağlama noktasının ne olduğunu bilmiyorsak, ``-i`` (inspect) bayrağını kullanarak guestmount'a kullanılacak bağlama noktasını otomatik belirlemesini söyleyebiliriz:

source: If you are building the image on a headless server, and you have an X server on your local machine, you can launch :command:`virt-manager` using ssh X11 forwarding to access the GUI. Since virt-manager interacts directly with libvirt, you typically need to be root to access it. If you can ssh directly in as root (or with a user that has permissions to interact with libvirt), do:
de: Wenn Sie das Abbild auf einem kopflosen Server bilden und Sie einen X-Server auf Ihrem lokalen Rechner haben, können Sie :command:`virt-manager` mit ssh X11 Weiterleitung zum Zugriff auf die GUI starten. Da virt-manager direkt mit libvirt interagiert, müssen Sie normalerweise root sein, um darauf zuzugreifen. Wenn Sie ssh direkt als root (oder mit einem Benutzer, der Berechtigungen hat, um mit libvirt zu interagieren), machen:
id: Jika Anda sedang membangun image pada server tanpa kepala (headless server), dan Anda memiliki server X pada komputer lokal Anda, Anda dapat memulai :command:`virt-manager` menggunakan ssh X11 forwarding untuk mengakses GUI. Sejak virt-manager berinteraksi langsung dengan libvirt, Anda biasanya perlu menjadi root untuk mengaksesnya. Jika Anda bisa ssh langsung sebagai root (atau dengan pengguna yang memiliki izin untuk berinteraksi dengan libvirt), lakukan:
tr_tr: İmajı grafik ortamsız bir sunucuda inşa ediyorsanız, ve yerel makinenizde X sunucunuz varsa, GUI'ye erişebilmek için X11 yönlendirmeli ssh kullanarak :command:`virt-manager` başlatabilirsiniz. Virt-manager doğrudan libvirt ile etkileşime geçtiğinden, genellikle root erişiminizin olması gerekir. Doğrudan root ile ssh çekebiliyorsanız (ya da libvirt ile etkileşim yetkisi olan bir kullanıcı ile), şunu yapın:

source: If you are not able to install the ``cloud-init`` package in your image, to fetch the ssh public key and add it to the root account, edit the ``/etc/rc.d/rc.local`` file and add the following lines before the line ``touch /var/lock/subsys/local``:
de: Wenn Sie das ``cloud-init``-Paket nicht in Ihrem Abbild installieren können, um den ssh-public Key abzurufen und dem Root-Account hinzuzufügen, bearbeiten Sie das ``/etc/rc.d/rc.local`` Datei und fügen Sie die folgenden Zeilen vor der Zeile ``touch /var/lock/subsys/local``:
id: Jika Anda tidak dapat menginstal paket ``cloud-init`` dalam image Anda, mengambil ssh kunci publik dan menambahkannya ke akun root, edit file ``/etc/rc.d/rc.local`` dan tambahkan baris berikut sebelum baris ``touch /var/lock/subsys/local``:
tr_tr: İmajınıza ``cloud-init`` paketini kuramıyorsanız, ssh açık anahtarını çekmek ve root hesabına eklemek için, ``/etc/rc.d/rc.local`` dosyasını düzenleyin ve ``touch /var/lock/subsys/local`` satırıdan önce şu satırları girin:

source: If you are unable or unwilling to install ``cloud-init`` inside the guest, you can write a custom script to fetch the public key and add it to a user account.
de: Wenn Sie nicht in der Lage sind, ``cloud-init`` in den Gast zu installieren, können Sie ein benutzerdefiniertes Skript schreiben, um den öffentlichen Schlüssel abzurufen und zu einem Benutzerkonto hinzuzufügen.
id: Jika Anda tidak dapat atau tidak mau memasang ``cloud-init`` dalam guest, Anda dapat menulis skrip khusus untuk mengambil kunci publik dan menambahkannya ke akun pengguna.
tr_tr: Misafir içinde ``cloud-init`` paketini kuramıyor ya da kurmak istemiyorsanız, açık anahtarı çekip kullanıcı hesabına eklemek için özel bir betik yazabilirsiniz.

source: If you are using :command:`virt-manager`, the commands should look something like this:
de: Wenn Sie :command:`virt-manager` benutzt haben, sollten die Befehle so aussehen:
id: Jika Anda menggunakan :command:`virt-manager`, perintah harus terlihat seperti ini:
tr_tr: :command:`virt-manager` kullanıyorsanız, komutlar şuna benzer olmalıdır:

source: If you can install the ``cloud-init`` and ``cloud-utils`` packages, we recommend that when you create your images, you create a single ext3 or ext4 partition (not managed by LVM).
de: Wenn Sie die ``cloud-init`` und ``cloud-utils`` Pakete installieren können, empfehlen wir Ihnen, bei der Erstellung Ihrer Abbilder eine einzelne ext3 oder ext4 Partition (nicht von LVM verwaltet) zu erstellen.
id: Jika Anda bisa menginstal paket ``cloud-init`` dan ``cloud-utils``, kami menyarankan agar saat Anda membuat image, Anda membuat partisi ext3 atau ext4 tunggal (tidak dikelola oleh LVM).
tr_tr: ``cloud-init`` ve ``cloud-utils`` paketlerini kurabilirseniz, imajları oluştururken tek bir ext3 veya ext4 bölüm oluşturmanızı öneriyoruz (LVM tarafından yönetilmeyen).

source: If you cannot install ``cloud-init`` and ``cloud-tools`` inside of your guest, and you want to support resize, you must write a script that your image runs on boot to modify the partition table. In this case, we recommend using LVM to manage your partitions. Due to a limitation in the Linux kernel (as of this writing), you cannot modify a partition table of a raw disk that has partitions currently mounted, but you can do this for LVM.
de: Wenn Sie ``cloud-init`` und ``cloud-tools`` innerhalb Ihres Gastes nicht installieren können und Sie die Größe ändern möchten, müssen Sie ein Skript schreiben, das Ihr Abbild beim Booten ausführt, um die Partitionstabelle zu ändern. In diesem Fall empfehlen wir die Verwendung von LVM zur Verwaltung Ihrer Partitionen. Wegen einer Einschränkung im Linux-Kernel (ab diesem Schreiben) können Sie keine Partitionstabelle einer Rawdisk ändern, bei der Partitionen aktuell installiert sind, aber Sie können dies für LVM tun.
id: Jika Anda tidak dapat menginstal ``cloud-init`` dan ``cloud-tools`` dalam guest Anda, dan Anda ingin mendukung resize (perubahan ukuran), Anda harus menulis skrip dimana image Anda berjalan pada boot untuk memodifikasi tabel partisi. Dalam hal ini, kami sarankan menggunakan LVM untuk mengelola partisi Anda. Karena keterbatasan dalam kernel Linux (seperti tulisan ini), Anda tidak dapat mengubah tabel partisi dari disk baku (raw disk) yang memiliki partisi saat dipasang, tetapi Anda dapat melakukan ini untuk LVM.
tr_tr: ``cloud-init`` ve ``cloud-tools`` paketlerini misafirinizde kuramıyorsanız, ve yeniden boyutlandırmayı desteklemek istiyorsanız, imajınızın önyüklemede çalıştırarak bölüm tablosunu değiştirdiği bir betik yazmalısınız. Bu durumda, bölümlerinizi yönetmek için LVM kullanmanızı öneriyoruz. Linux çekirdeğindeki bir kısıtlama sebebiyle (bu yazının yazıldığı tarihte) bağlı durumda bölümleri olan bir raw diskin bölüm tablosunu değiştiremezsiniz, ama LVM ile bunu yapabilirsiniz.

source: If you cannot install ``cloud-initramfs-tools``, Robert Plestenjak has a GitHub project called `linux-rootfs-resize <https://github.com/flegmatik/linux-rootfs-resize>`_ that contains scripts that update a ramdisk by using ``growpart`` so that the image resizes properly on boot.
de: Wenn Sie ``cloud-initramfs-tools` nicht installieren können, hat Robert Plestenjak ein GitHub-Projekt namens `linux-rootfs-resize <https://github.com/flegmatik/linux-rootfs-resize>`_, das Skripts enthält, die eine ramdisk aktualisieren, indem sie` `growpart`` verwenden, damit das Abbild beim Booten korrekt verändert wird.
id: Jika Anda tidak dapat menginstal ``cloud-initramfs-tools``, Robert Plestenjak memiliki proyek GitHub disebut `linux-rootfs-resize <https://github.com/flegmatik/linux-rootfs-resize>`_ yang berisi script yang memperbarui ramdisk dengan menggunakan ``growpart`` sehingga image dapat mengubah ukuran secara benar pada boot.
tr_tr: ``cloud-initramfs-tools`` paketini yükleyemiyorsanız, Robert Plestenjak'ın imajın önyüklemede düzgün yeniden boyutlandırılmasını sağlamak için ``growpart`` kullanarak ramdisk'i güncelleyen betikler içeren `linux-rootfs-resize <https://github.com/flegmatik/linux-rootfs-resize>`_ isimli bir GitHub projesi var.

source: If you delete the network persistent rules files, you may get a ``udev kernel`` warning at boot time, which is why we recommend replacing them with empty files instead.
de: Wenn Sie die Netzwerk-persistenten Regeln-Dateien löschen, erhalten Sie eine ``udev kernel`` Warnung zum Booten, weshalb wir empfehlen, sie mit leeren Dateien zu ersetzen.
id: Jika Anda menghapus file aturan kaku jaringan, Anda mungkin mendapatkan peringatan ``udev kernel`` pada saat boot, itulah sebabnya mengapa kami sarankan menggantinya dengan file kosong sebagai gantinya.
tr_tr: Ağ kalıcılık kuralları dosyasını silerseniz, önyükleme sırasında ``udev kernel`` uyarısı alabilirsiniz, bu yüzden boş bir dosyayla değiştirmenizi öneriyoruz.

source: If you do not have access to the libguestfs, you can mount image file systems directly in the host using loop devices, kpartx, and network block devices.
de: Wenn Sie keinen Zugriff auf die libguestfs haben, können Sie Abbilddateisysteme direkt im Host über Loop-Geräte, kpartx und Netzwerk-Block-Geräte montieren.
id: Jika Anda tidak memiliki akses ke libguestfs, Anda dapat me-mount sistem file image langsung di host menggunakan perangkat loop, kpartx, dan perangkat blok jaringan (network block).
tr_tr: libguestfs erişiminiz yoksa, imaj dosya sistemlerini doğrudan döngü aygıtları, kpartx, ve ağ blok aygıtları kullanarak sunucuya bağlayabilirsiniz.

source: If you do not use LVM, you must modify the table to extend the existing root partition to encompass this additional space.
de: Wenn Sie LVM nicht verwenden, müssen Sie die Tabelle ändern, um die vorhandene Root-Partition zu erweitern, um diesen zusätzlichen Speicherplatz zu umfassen.
id: Jika Anda tidak menggunakan LVM, Anda harus memodifikasi tabel untuk memperluas (extend) partisi root yang ada untuk mencakup ruang tambahan ini.
tr_tr: LVM kullanmıyorsanız, tabloyu mevcut kök bölümü bu ek alanı kapsayacak şekilde genişletmelisiniz.

source: If you do not wish to use :command:`virt-manager` (for example, you do not want to install the dependencies on your server, you do not have an X server running locally, the X11 forwarding over SSH is not working), you can use the :command:`virt-install` tool to boot the virtual machine through libvirt and connect to the graphical console from a VNC client installed on your local machine.
de: Wenn Sie :command:`virt-manager` nicht verwenden wollen (z.B. willst Sie die Abhängigkeiten auf Ihrem Server nicht installieren, haben Sie keinen X-Server, der lokal läuft, somit wird die X11-Weiterleitung über SSH nicht funktionieren), können Sie den Befehl :command:`virt-install` verwenden, um die virtuelle Maschine über libvirt zu starten und eine Verbindung zu der grafischen Konsole von einem auf Ihrem lokalen Rechner installierten VNC-Client herzustellen.
id: Jika Anda tidak ingin menggunakan :command: `virt-manager` (misalnya, Anda tidak ingin menginstal dependensi di server Anda, Anda tidak memiliki server X yang berjalan secara lokal, penerusan X11 di SSH tidak berfungsi) , Anda bisa menggunakan alat :command: `virt-install` untuk mem-boot mesin virtual melalui libvirt dan terhubung ke konsol grafis dari klien VNC yang terpasang pada komputer lokal Anda.
tr_tr: :command:`virt-manager` kullanmak istemiyorsanız (örneğin bağımlılıklarını sunucunuza kurmak istemiyorsanız, çalışan bir X sunucunuz yoksa, SSH üzerinden X11 yönlendirme çalışmıyorsa) :command:`virt-install` aracını kullanarak sanal makineyi libvirt aracılığıyla önyükleyebilir ve yerel makinenize kurulu VNC istemcisiyle grafik konsola bağlanabilirsiniz.

source: If you have a raw virtual machine image that is not using LVM to manage its partitions, use the :command:`losetup` command to find an unused loop device.
de: Wenn Sie ein raw virtuelles Maschinenabbild haben, das LVM nicht verwendet, um seine Partitionen zu verwalten, verwenden Sie den Befehl :command:`losetup`, um ein unbenutztes Loop-Gerät zu finden.
id: Jika Anda memiliki image mesin virtual yang masih baku yang tidak menggunakan LVM untuk mengelola partisi nya, gunakan perintah :command:`losetup` untuk menemukan perangkat loop yang tidak terpakai.
tr_tr: Bölümlerini yönetmek için LVM kullanmayan bir raw sanal makine imajınız varsa, kullanılmayan bir döngü aygıtı bulmak için :command:`losetup` komutunu kullanın.
