Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: Images are not the only OpenStack resource that can have metadata associated with them. Many other resources (for example, volumes) support setting metadata on the resources. As with images, the metadata may be consumed by humans to understand something about the resource, or may be used by other OpenStack services so that they can make efficient use of the resource (for example, the nova filter scheduler using the image ``architecture`` property to determine an appropriate host on which to build an instance from that image). Thus it is important that there be a discoverable way for people and services to determine what metadata properties and values are available throughout an OpenStack cloud.
id: Images bukan satu-satunya sumber daya OpenStack yang dapat memiliki metadata yang terkait dengannya. Banyak sumber daya lain (misalnya, volume) mendukung pengaturan metadata pada sumber daya. Seperti images, metadata dapat dikonsumsi oleh manusia untuk memahami sesuatu tentang sumber daya atau dapat digunakan oleh layanan OpenStack lain sehingga mereka dapat membuat penggunaan sumber daya secara efisien (misalnya, penjadwal filter nova menggunakan image ``architecture`` property untuk menentukan host yang tepat di mana untuk membangun sebuah instance dari image itu). Karena itu, penting bahwa ada cara yang dapat ditemukan bagi orang dan layanan untuk menentukan properti dan nilai metadata apa yang tersedia di seluruh cloud OpenStack.

source: In a CirrOS image, the login account is ``cirros``. The password is ``gocubsgo``. Since the fixed PW allows anyone to login, you should not run this image with a public IP attached.
id: Dalam image CirrOS, akun login adalah ``cirros``. Kata sandinya adalah ``gocubsgo``. Karena PW tetap memungkinkan siapa saja untuk masuk, Anda tidak boleh menjalankan image ini dengan IP publik terpasang.

source: Load VirtIO SCSI drivers and network drivers by choosing an installation target when prompted. Click :guilabel:`Load driver` and browse the file system.
id: Muat driver Virtio SCSI dan driver jaringan dengan memilih target instalasi ketika diminta. Click :guilabel:`Load driver` dan jelajahi sistem file.

source: Metadata definition (metadefs) service
id: Layanan metadata definition (metadefs)

source: More parameters can be added to further customize the image:
id: Lebih banyak parameter dapat ditambahkan untuk menyesuaikan image lebih lanjut:

source: Other Compute scheduler filters may also be affected by image metadata. For a complete list of valid property keys and values, refer to the `Useful image properties <https://docs.openstack.org/glance/latest/admin/useful-image-properties.html>`_ section of the Glance Administration Guide.
id: Filter penjadwal komputasi lain mungkin juga dipengaruhi oleh metadata image. Untuk daftar lengkap kunci dan nilai properti yang valid, lihat bagian `Useful image properties <https://docs.openstack.org/glance/latest/admin/useful-image-properties.html>`_ bagian Glance Administration Guide.

source: SUSE maintains official SUSE Linux Enterprise Server cloud images. Go to `download.suse.com <https://download.suse.com>`_ and search for ``SUSE Linux Enterprise Server 15 JeOS``.
id: SUSE memelihara image cloud SUSE Linux Enterprise Server resmi. Kunjungi ke`download.suse.com <https://download.suse.com>`_ dan cari ``SUSE Linux Enterprise Server 15 JeOS``.

source: Select the VirtIO SCSI drivers.
id: Pilih driver VirtIO SCSI.

source: Select the ``E:\virtio-win-0.1XX\viostor\2k12\amd64`` folder. The Windows installer displays a list of drivers to install.
id: Pilih folder ``E:\virtio-win-0.1XX\viostor\2k12\amd64``. Pemasang Windows menampilkan daftar driver untuk diinstal.

source: Select the network drivers, and continue the installation. Once the installation is completed, the VM restarts.
id: Pilih driver jaringan, dan lanjutkan instalasi. Setelah instalasi selesai, VM restart.

source: So that image consumers can easily identify the container and disk format of images, the image service has set aside particular metadata keys for these. Not surprisingly, these are named ``container_format`` and ``disk_format``. The legal values for each of these are specified in the Image service's Image schema, which you can obtain in any OpenStack installation by making the following API call::
id: Agar konsumen image dapat dengan mudah mengidentifikasi kontainer dan format disk image, layanan Image telah menyisihkan kunci metadata khusus untuk ini. Tidak mengherankan, ini dinamai ``container_format`` dan ``disk_format``. Nilai legal untuk masing-masing ditentukan dalam skema Image layanan Image, yang dapat Anda peroleh dalam instalasi OpenStack dengan membuat panggilan API berikut ::

source: The file ``/root/my-hook-script.sh`` will recieve 2 environment variable: ``BODI_CHROOT_PATH`` path where the image is mounted, and ``BODI_RELEASE`` which is the name of the Debian release that is being bootstraped. Here's an example for customizing the motd:
id: File `` / root / my-hook-script.sh`` akan menerima 2 variabel lingkungan: jalur ``BODI_CHROOT_PATH`` tempat image dipasang, dan `` BODI_RELEASE`` yang merupakan nama rilis Debian yang merupakan sedang bootstraped. Berikut ini contoh untuk menyesuaikan motd:

source: The image schema lists the legal identifiers for container and disk formats. To understand what these identifiers refer to, consult the `Disk and Container Formats <https://docs.openstack.org/glance/latest/user/formats.html>`_ section of the Glance User Guide.
id: Skema image mencantumkan pengidentifikasi legal untuk format kontainer dan disk. Untuk memahami apa yang dirujuk oleh pengidentifikasi ini, bacalah bagian `Disk and Container Formats <https://docs.openstack.org/glance/latest/user/formats.html>`_ bagian dari Glance User Guide.

source: The openSUSE community provides images for `openSUSE <https://software.opensuse.org/distributions/leap#JeOS-ports>`_.
id: Komunitas openSUSE menyediakan image untuk `openSUSE <https://software.opensuse.org/distributions/leap#jeos-ports>`_.

source: The stored file may be a *container* that contains the virtual disk. For example, the virtual disk may be contained in a ``tar`` file which must be opened before the disk can be retrieved. It's possible, however, that the virtual disk is not contained in a file, but is just stored as-is by the Image Service.
id: File yang disimpan mungkin *container* yang berisi disk virtual. Sebagai contoh, disk virtual dapat dimuat dalam file ``tar`` yang harus dibuka sebelum disk dapat diambil. Mungkin saja, bagaimanapun, bahwa disk virtual tidak terkandung dalam file, tetapi hanya disimpan apa adanya oleh Image Service.

source: The supported formats may vary across OpenStack clouds. The formats accepted by a particular cloud will be specified in that cloud's get-schema response to the Images API.
id: Format yang didukung dapat bervariasi di antara cloud OpenStack. Format yang diterima oleh cloud tertentu akan ditentukan dalam respons cloud's get-schema untuk API Images.

source: The underlying image file that you created with the :command:`qemu-img create` command, such as ``/var/lib/libvirt/images/bionic.qcow2``, is now ready for uploading to the Image service by using the :command:`openstack image create` command. For more information, see the `Glance User Guide <https://docs.openstack.org/glance/latest/user/index.html>`__.
id: File image dasar yang Anda buat dengan perintah :command:`qemu-img create`, seperti ``/var/lib/libvirt/images/bionic.qcow2``, sekarang siap untuk mengunggah ke layanan Image dengan menggunakan perintah :command:`openstack image create`. Untuk informasi lebih lanjut, lihat `Glance User Guide <https://docs.openstack.org/glance/latest/user/index.html>`__.

source: The virtual disk itself has its bits arranged in some format. A consuming service must know what this format is before it can effectively use the virtual disk.
id: Disk virtual itu sendiri memiliki bit yang disusun dalam beberapa format. Layanan yang memakan harus tahu apa format ini sebelum dapat menggunakan disk virtual secara efektif.

source: There is no special relationship between the Image service and the Metadefs service. If you want to apply the keys and values defined in the Metadefs service to images, you must use the Image service API or client tools just as you would for any other OpenStack service.
id: Tidak ada hubungan khusus antara layanan Image dan layanan Metadefs. Jika Anda ingin menerapkan kunci dan nilai yang ditentukan dalam layanan Metadefs ke images, Anda harus menggunakan API layanan Images atau alat klien sama seperti yang Anda lakukan untuk layanan OpenStack lainnya.

source: This example installs an Ubuntu 18.04 (Bionic Beaver) image. To create an image for a different version of Ubuntu, follow these steps with the noted differences.
id: Contoh ini menginstal image Ubuntu 18.04 (Bionic Beaver). Untuk membuat image versi Ubuntu yang berbeda, ikuti langkah-langkah ini dengan perbedaan yang dicatat.

source: This hook script will conveniently be called at the correct moment of the build process, when everything is installed, but before unmounting the partition.
id: Skrip kait ini akan dipanggil pada saat yang tepat dari proses build, ketika semuanya diinstal, tetapi sebelum melepas partisi.

source: To facilitate this, Glance (the OpenStack Image service) hosts a metadata definition service, which is also known as the *OpenStack metadefs catalog*.
id: Untuk memfasilitasi ini, Glance (layanan OpenStack Image) menghosting layanan definisi metadata, yang juga dikenal sebagai *OpenStack metadefs catalog*.

source: Virtual machine images come in different *formats*. A format describes the way the bits making up a file are arranged on the storage medium. Knowledge of a format is required in order for a consumer to interpret the content of the file correctly (rather than to simply view it as a bunch of bits).
id: Images mesin virtual datang dalam berbagai *formats*. Format menggambarkan cara bit menyusun file diatur pada media penyimpanan. Pengetahuan tentang suatu format diperlukan agar konsumen dapat menafsirkan konten file dengan benar (bukan hanya melihatnya sebagai banyak bit).

source: When considering a stored virtual machine image, there are two types of format that can come into play.
id: Saat mempertimbangkan image mesin virtual yang disimpan, ada dua jenis format yang dapat ikut bermain.

source: When you boot for the first time after install, it may ask you about authentication tools, you can just choose :guilabel:`Exit`. Then, log in as admin user using the password you specified.
id: Ketika Anda mem-boot untuk pertama kali setelah menginstal, ia mungkin bertanya tentang alat otentikasi, Anda bisa memilih :guilabel:`Exit`. Kemudian, masuk sebagai pengguna admin menggunakan kata sandi yang Anda tentukan.

source: `Fedora Virtio <https://docs.fedoraproject.org/en-US/quick-docs/creating-windows-virtual-machines-using-virtio-drivers/index.html#virtio-win-direct-downloads>`_ provides also Windows images.
id: `Fedora Virtio <https://docs.fedoraproject.org/en-US/quick-docs/creating-windows-virtual-machines-using-virtio-drivers/index.html#virtio-win-direct-downloads>`_ juga menyediakan image Windows.

source: `Using Glance’s Metadata Definitions Catalog Public APIs <https://docs.openstack.org/glance/latest/user/glancemetadefcatalogapi.html>`_ in the Glance User Guide
id: `Using Glance’s Metadata Definitions Catalog Public APIs <https://docs.openstack.org/glance/latest/user/glancemetadefcatalogapi.html>`_ di Glance User Guide

source: `openstack-debian-images <https://packages.debian.org/openstack-debian-images>`_ is the tool Debian uses to create its official OpenStack image. It is made of a single very simple shell script that is easy to understand and modify. It supports Grub and Syslinux, BIOS or EFI, amd64 and arm64 arch.
id: `openstack-debian-images <https://packages.debian.org/openstack-debian-images>`_ adalah alat yang digunakan Debian untuk membuat image OpenStack resminya. Itu terbuat dari satu skrip shell yang sangat sederhana yang mudah dimengerti dan dimodifikasi. Ini mendukung Grub dan Syslinux, BIOS atau EFI, amd64 dan arm64 arch.

source: container format
id: format kontainer

source: disk format
id: format disk

source: openstack-debian-images can also be used to create a bootable image directly on a hard disk, instead of using the Debian installer.
id: openstack-debian-images juga dapat digunakan untuk membuat image yang dapat di-boot langsung pada hard disk, daripada menggunakan installer Debian.
