Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: (BoolOpt) Should unused base images be removed? When set to True, the interval at which base images are removed are set with the following two settings. If set to False base images are never removed by Compute.
de: (BoolOpt) Sollten unbenutzte Basisbilder entfernt werden? Wenn auf True gesetzt, wird das Intervall, bei dem die Basisbilder entfernt werden, mit den beiden folgenden Einstellungen eingestellt. Wenn auf false gestellt, werden Basisabbilder niemals von Compute entfernt.
id: (BoolOpt) Apakah image dasar yang tidak terpakai harus dihapus? Bila diatur ke True, interval dimana image dasar yang dihapus akan diatur dengan dua pengaturan berikut. Jika diatur ke False, image dasar tidak pernah dihapus oleh Compute.
tr_tr: (BoolOpt) Kullanılmayan taban imajlar silinmeli mi? Doğru olarak ayarlandığında, aşağıdaki iki ayarla taban imajların silinme aralıkları ayarlanır. Yanlış olarak ayarlanırsa taban imajlar Hesaplama tarafından asla silinmez.

source: (IntOpt) Unused resized base images younger than this are not removed. Default is 3600 seconds, or one hour.
de: (IntOpt) Unbenutzte verkleinerte Basisbilder, die jünger als diese sind, werden nicht entfernt. Die Voreinstellung ist 3600 Sekunden oder eine Stunde.
id: (IntOpt) Image dasar ukurannya yang tidak terpakai lebih muda dari ini tidak dihapus. Default adalah 3600 detik, atau satu jam.
tr_tr: (IntOpt) Bundan daha yeni kullanılmayan yeniden boyutlandırılmış taban imajlar silinmez. Öntanımlı olarak 3600 saniyedir, yani bir saat.

source: (IntOpt) Unused unresized base images younger than this are not removed. Default is 86400 seconds, or 24 hours.
de: (IntOpt) Unbenutzte unbesetzte Basisabbilder jünger als diese werden nicht entfernt. Standard ist 86400 Sekunden oder 24 Stunden.
id: (IntOpt) Image dasar unresized yang tidak terpakai lebih muda dari ini tidak dihapus. Default adalah 86400 detik, atau 24 jam.
tr_tr: (IntOpt) Bundan daha yeni kullanılmayan yeniden boyutlandırılmamış taban imajlar silinmez. Varsayılan 86400 saniyedir, yani 24 saat.

source: (StrOpt) VM image preallocation mode:
de: (StrOpt) VM-Abbild-Vorbereitungsmodus:
tr_tr: (StrOpt) Sanal makine imajı ön ayırma kipi:

source: (Type) Description
de: (Typ) Beschreibung
id: (Tipe) deskripsi
tr_tr: (Tür) Açıklama

source: **To create a FreeBSD image**
de: **So erstellen Sie ein FreeBSD-Abbild**
tr_tr: **Bir FreeBSD imajı oluşturmak için**

source: **Volume-from-Image properties**
de: **Volumen-von-Abbild-Eigenschaften**
tr_tr: **İmajdan-birim özellikleri**

source: **What is a virtual machine image?**
de: **Was ist ein virtuelles Abbild?**
tr_tr: **Bir sanal makine imajı nedir?**

source: A UEC (Ubuntu Enterprise Cloud) tarball is a gzipped tarfile that contains an AMI file, AKI file, and ARI file.
de: Ein UEC (Ubuntu Enterprise Cloud) Tarball ist ein gezipptes Tarfile, das eine AMI-Datei, eine AKI-Datei und eine ARI-Datei enthält.
tr_tr: Bir UEC (Ubuntu Kurumsal Bulut) tarball dosyası AMI, AKI ve ARI dosyalarını içeren gzip'lenmiş bir tar dosyasıdır.

source: A docker container format.
de: Ein Docker-Container-Format.
tr_tr: Docker kapsayıcı biçimi.

source: A full treatment of Oz is beyond the scope of this document, but we will provide an example. You can find additional examples of Oz template files on GitHub at `rcbops/oz-image-build/tree/master/templates <https://github.com/rcbops/oz-image-build/tree/master/templates>`_. Here's how you would create a CentOS 6.4 image with Oz.
de: Eine vollständige Behandlung von Oz geht über den Rahmen dieses Dokuments hinaus, aber wir werden ein Beispiel geben. Hier finden Sie weitere Beispiele für Oz-Template-Dateien auf GitHub unter `rcbops/oz-image-build/tree/master/templates <https://github.com/rcbops/oz-image-build/tree/master/templates> `_. Hier steht, wie Sie ein CentOS 6.4 Abbild mit Oz erstellen würden.
id: Perlakukan penuh Oz adal di luar lingkup dokumen ini, tetapi kami akan memberikan contoh. Anda dapat menemukan contoh tambahan dari file template Oz pada GitHub di `rcbops/oz-image-build/tree/master/templates <https://github.com/rcbops/oz-image-build/tree/master/templates>`_. Berikut adalah bagaimana Anda akan membuat image CentOS 6.4 dengan Oz.
tr_tr: Oz'u tamamen anlatmak bu belgenin kapsamı dışındadır, ama bir örnek vereceğiz. Github `rcbops/oz-image-build/tree/master/templates <https://github.com/rcbops/oz-image-build/tree/master/templates>`_ adresinde örnek ek Oz şablonları bulabilirsiniz.

source: A kernel file that the hypervisor will load initially to boot the image. For a Linux machine, this would be a ``vmlinuz`` file.
de: Eine Kernel-Datei, die der Hypervisor zuerst laden wird, um das Abbild zu booten. Für eine Linux-Maschine wäre das eine ``vmlinuz`` Datei.
tr_tr: Hipervizörün ilk olarak ön yükleyeceği bir çekirdek dosyası. Linux bir makine için bu ``vmlinuz`` dosyasıdır.

source: A potential consumer provides the producer with the consumer's project ID. Optionally, the producer might request the consumer's email address for notification purposes, but this is outside the scope of the API.
de: Ein potentieller Verbraucher stellt dem Produzenten die Projekt-ID des Verbrauchers zur Verfügung. Optional kann der Hersteller die E-Mail-Adresse des Verbrauchers zur Benachrichtigung anfordern, aber dies liegt außerhalb des Geltungsbereichs der API.
id: Sebuah konsumen potensial memberikan produsen dengan ID proyek konsumen. Secara opsional, produser mungkin meminta alamat email konsumen untuk tujuan pemberitahuan, tetapi ini adalah di luar lingkup API.
tr_tr: Potansiyel bir tüketici üreticiye tüketicinin proje kimliğini sağlar. İsteğe bağlı olarak, üretici tüketicinin eposta adresini bildirim amacıyla alabilir, ama bu API kapasamı dışındadır.

source: A single property and its primitive constraints. Each property can only be a primitive type. For example, string, integer, number, boolean, or array.
de: Eine einzige Eigenschaft und ihre primitiven Zwänge. Jede Eigenschaft kann nur ein primitiver Typ sein. Zum Beispiel String, Integer, Number, Boolean oder Array.
id: Properti tunggal dan mempunyai primitive constraint (pembatas primitif). Setiap properti hanya dapat menjadi tipe primitif. Misalnya, string, integer, number (angka), boolean, atau array.
tr_tr: Tek bir özellik ve ilk kısıtlamaları. Her bir özellik yalnızca bir ilk tür olabilir. Örneğin, karakter dizisi, tamsayı, numara, bool veya dizi.

source: A virtual machine image is a single file which contains a virtual disk that has a bootable operating system installed on it.
de: Ein virtuelles Maschinenbild ist eine einzelne Datei, die ein virtuelles Laufwerk enthält, auf dem ein bootfähiges Betriebssystem installiert ist.
id: Virtual machine image adalah file tunggal yang berisi disk virtual yang memiliki sistem operasi bootable yang diinstal di atasnya.
tr_tr: Bir sanal makine imajı üzerinde ön yüklenebilir bir işletim sistemi kurulumu içeren tek dosyadan oluşan sanal disktir.

source: AKI (Amazon Kernel Image)
tr_tr: AKI (Amazon Çekirdek İmajı)

source: AMI (Amazon Machine Image)
tr_tr: AMI (Amazon Makine İmajı)

source: ARI (Amazon Ramdisk Image)
de: ARI (Amazon Ramdisk Abbild)
tr_tr: ARI (Amazon Ramdisk İmajı)

source: Abstract
de: Abstrakt
id: Abstrak
tr_tr: Özet

source: Accept the default keymap or select an appropriate mapping for your needs.
de: Übernehmen Sie die Standard-Keymap oder wählen Sie eine entsprechende Mapping für Ihre Bedürfnisse aus.
id: Terima keymap standar atau pilih pemetaan yang sesuai untuk kebutuhan Anda.
tr_tr: Öntanımlı tuş eşlemini kabul edin veya ihtiyacınıza göre bir eşleşme seçin.

source: Accept the default network mirror.
de: Akzeptiere den Standard-Netzwerk-Mirror.
id: Terima network mirror default.
tr_tr: Öntanımlı ağ yansısını kabul edin.

source: Access instance by using ssh public key (cloud-init)
de: Zugriffsinstanz mit ssh public key (cloud-init)
id: Akses instance dengan menggunakan ssh public key (cloud-init)
tr_tr: Ssh açık anahtar kullanarak sunucuya erişin (cloud-init)

source: Access instance using ssh public key (``cloud-init``)
de: Zugriffsinstanz mit ssh public key (``cloud-init``)
id: Akses instance menggunakan ssh public key (``cloud-init``)
tr_tr: Sunucuya ssh açık anahtarını kullanarak eriş (``cloud-init``)

source: After Oz completes the initial OS install using the kickstart file, it customizes the image with an update. It also removes any reference to the eth0 device that libvirt creates while Oz does the customizing, as specified in the ``command`` section of the XML file.
de: Nachdem Oz die ursprüngliche OS-Installation mit der Kickstart-Datei abgeschlossen hat, passt es das Abbild mit einem Update an. Es entfernt auch jede Referenz auf das eth0-Gerät, das libvirt erzeugt, während Oz das Customizing ausführt, wie im Abschnitt ``command`` der XML-Datei angegeben.
id: Setelah Oz melengkapi install OS awal menggunakan file kickstart, Oz itu menyesuaikan image dengan pembaruan. Ini juga menghilangkan setiap referensi untuk perangkat eth0 yang dibuat libvirt saat Oz menyesuaikannya, sebagaimana yang ditentukan dalam bagian ``command`` dari file XML ini.
tr_tr: Oz kickstart dosyasını kullanarak ilk OS kurulumunu bitirdikten sonra, imajı bir güncellemeyle özelleştirir. Ayrıca Oz özelleştirme yaparken libvirt'in oluşturduğu eth0 aygıtına başvuruları da XML dosyasının ``command`` kısmında belirtildiği gibi kaldırır.

source: After the installation program starts, choose your preferred language and click :guilabel:`Continue` to get to the installation summary. Accept the defaults.
de: Nachdem das Installationsprogramm gestartet wurde, wählen Sie Ihre bevorzugte Sprache und klicken Sie auf :guilabel:`Continue`, um zur Installationsübersicht zu gelangen. Akzeptieren Sie die Vorgaben.
id: Setelah program penginstalan dimulai, pilih bahasa pilihan Anda dan klik :guilabel: `Continue` untuk sampai ke ringkasan instalasi. Terima default
tr_tr: Kurulum programı başladıktan sonra, istediğiniz dili seçin ve kurulum özetine geçmek için :guilabel:`Devam et`e tıklayın. Öntanımlıları kabul edin.

source: After you exit, you can open a shell to complete manual configuration steps. Select :guilabel:`Yes` to make a few OpenStack-specific changes:
de: Nach dem Beenden können Sie eine Shell öffnen, um manuelle Konfigurationsschritte abzuschließen. Wählen Sie :guilabel: `Yes`, um ein paar OpenStack-spezifische Änderungen zu machen:
id: Setelah Anda keluar, Anda dapat membuka shell untuk menyelesaikan langkah konfigurasi manual. Pilih :guilabel:`Yes` untuk membuat beberapa perubahan OpenStack-spesific:
tr_tr: Çıktıktan sonra, elle yapılandırma adımlarını tamamlamak için bir kabuk açabilirsiniz. Bir kaç OpenStack'e özel değişiklik yapmak için :guilabel:`Evet`e tıklayın:

source: All associated properties for an image can be displayed using the :command:`openstack image show` command. For example:
de: Alle zugehörigen Eigenschaften für ein Abbild können mit dem Befehl :command:`openstack image show` angezeigt werden. Beispielsweise:
id: Semua properti terkait untuk image dapat ditampilkan dengan menggunakan perintah :command:`openstack image show`. Sebagai contoh:
tr_tr: Bir imaj için ilişkili tüm özellikler :command:`openstack image show` komutuyla görüntülenebilir. Örneğin:

source: An Amazon kernel image.
de: Ein Amazon-Kernbild.
tr_tr: Amazon çekirdek imajı.

source: An Amazon machine image.
de: Ein Amazon-Abbild.
tr_tr: Amazon makine imajı.

source: An Amazon ramdisk image.
de: Ein Amazon ramdisk Abbild.
tr_tr: Amazon ramdisk imajı.

source: An OVF package can be distributed in different ways. For example, it could be distributed as a set of discrete files, or as a tar archive file with an ``.ova`` (open virtual appliance/application) extension.
de: Ein OVF-Paket kann auf unterschiedliche Weise verteilt werden. Zum Beispiel könnte es als ein Satz von diskreten Dateien verteilt werden, oder als eine tar-Archivdatei mit einer ``.ova`` (offene virtuelle Appliance / Anwendung) Erweiterung.
tr_tr: Bir OVF paketi farklı yollarla dağıtılabilir. Örneğin ayrık dosyalar kümesi olarak dağıtılabilir, ya da ``.ova`` (açık sanal gereç/uygulama) uzantılı bir tar arşivi dosyası olarak.

source: An OVF package in a tarfile.
de: Ein OVF-Paket in einem tar-Archiv.
tr_tr: Tar dosyasında bir OVF paketi.

source: An OpenStack Compute cloud is not very useful unless you have virtual machine images (which some people call "virtual appliances"). This guide describes how to obtain, create, and modify virtual machine images that are compatible with OpenStack.
de: Eine OpenStack Compute Cloud ist nicht sehr nützlich, es sei denn, Sie haben virtuelle Maschinenbilder (die manche Leute 'virtuelle Appliances' nennen). In diesem Handbuch wird beschrieben, wie Sie virtuelle Maschinenbilder erhalten, erstellen und modifizieren, die mit OpenStack kompatibel sind.
id: Cloud OpenStack Compute tidak sangat berguna kecuali jika Anda memiliki gambar mesin virtual (yang beberapa orang menyebutnya "virtual appliances"). Panduan ini menjelaskan cara untuk mendapatkan, membuat, dan memodifikasi gambar mesin virtual yang kompatibel dengan OpenStack.
tr_tr: Sanal makineleriniz yoksa (bazı insanlar "sanal gereçler" de der) OpenStack Hesaplama bulutu pek de faydalı değildir. Bu kılavuz OpenStack ile uyumlu sanal makine imajlarını nasıl alabileceğinizi, oluşturabileceğinizi ve değiştirebileceğinizi anlatır.

source: An archive format for the data contents of an optical disc, such as CD-ROM.
de: Ein Archivformat für den Dateninhalt einer optischen Platte wie CD-ROM.
tr_tr: CD-ROM gibi bir optik diskin veri içeriği için bir arşiv biçimi.

source: An instance must interact with the metadata service to perform several tasks on start up. For example, the instance must get the ssh public key and run the user data script. To ensure that the instance performs these tasks, use one of these methods:
de: Eine Instanz muss mit dem Metadatendienst interagieren, um beim Start mehrere Aufgaben auszuführen. Zum Beispiel muss die Instanz den ssh-public Key erhalten und das Benutzerdaten-Skript ausführen. Um sicherzustellen, dass die Instanz diese Aufgaben ausführt, verwenden Sie eine dieser Methoden:
id: Sebuah instance harus berinteraksi dengan layanan metadata untuk melakukan beberapa tugas pada start up. Misalnya, instance harus mendapatkan ssh public key dan menjalankan skrip data pengguna. Untuk memastikan bahwa instance melakukan tugas ini, gunakan salah satu metode ini:
tr_tr: Bir sunucu başlarken çeşitli görevleri tamamlayabilmek için metaveri servisiyle iletişime geçebilmelidir. Örneğin sunucu ssh açık anahtarını almalı ve kullanıcı veri betiğini çalıştırmalıdır. Sunucunun bu görevleri yaptığından emin olmak için, şu yöntemlerden birini kullanın:

source: An instance must interact with the metadata service to perform several tasks on start up. For example, the instance must get the ssh public key and run the user data script. To ensure that the instance performs these tasks, use the ``cloud-init`` package.
de: Eine Instanz muss mit dem Metadatendienst interagieren, um beim Start mehrere Aufgaben auszuführen. Zum Beispiel muss die Instanz den ssh-public key erhalten und das Benutzerdaten-Skript ausführen. Um sicherzustellen, dass die Instanz diese Aufgaben ausführt, verwenden Sie das ``cloud-init``-Paket.
id: Instance harus berinteraksi dengan layanan metadata untuk melakukan beberapa tugas saat memulai. Misalnya, instance harus mendapatkan kunci publik ssh dan menjalankan skrip data pengguna. Untuk memastikan bahwa instance melakukan tugas ini, gunakan paket ``cloud-init``.
tr_tr: Sunucu başlarken çeşitli görevleri yerine getirmek için metaveri servisiyle iletişime geçmelidir. Örneğin, sunucu ssh açık anahtarını almalı ve kullanıcı veri betiğini çalıştırmalıdır. Sunucunun bu işlemleri yaptığından emin olmak için ``cloud-init`` paketini kurun.

source: An optional ramdisk file mounted at boot time. For a Linux machine, this would be an ``initrd`` file.
de: Eine optionale ramdisk-Datei zum Zeitpunkt des Bootens. Für eine Linux-Maschine wäre das eine ``initrd`` Datei.
tr_tr: İsteğe bağlı bir ramdisk dosyası önyükleme aşamasında yüklenir. Linux makineler için bu ``initrd`` dosyasıdır.

source: An unstructured disk image format; if you have a file without an extension it is possibly a raw format.
de: Ein unstrukturiertes Datenträger-Abbildformat; Wenn Sie eine Datei ohne Erweiterung haben, ist es vielleicht ein Raw-Format.
tr_tr: Yapısal olmayan bir disk imaj biçimi; uzantısı olmayan bir dosyanız varsa muhtemelen raw biçimindedir.

source: Argument to qemu-img
de: Argument für qemu-img
id: Argumen untuk qemu-img
tr_tr: qemu-img bağımsız değişkenleri

source: As the OpenStack metadata service is compatible with version 2009-04-04 of the Amazon EC2 metadata service, consult the Amazon EC2 documentation on `Using Instance Metadata <http://docs.amazonwebservices.com/AWSEC2/2009-04-04/UserGuide/ AESDG-chapter-instancedata.html>`_ for details on how to get user data.
de: Da der OpenStack-Metadatendienst mit der Version 2009-04-04 des Amazon EC2-Metadatendienstes kompatibel ist, konsultieren Sie die Amazon EC2-Dokumentation zum Thema 'Instanzmetadaten verwenden' <http://docs.amazonwebservices.com/AWSEC2/2009-04-04/UserGuide/ AESDG-chapter-instancedata.html> `_ für Details, wie man Benutzerdaten erhält.
id: Sebagai layanan OpenStack metadata menjadi kompatibel dengan versi 2009/04/04 layanan metadata Amazon EC2, cari keterangan dokumentasi Amazon EC2 di `Using Instance Metadata <http://docs.amazonwebservices.com/AWSEC2/2009-04-04/UserGuide/ AESDG-chapter-instancedata.html>`_ untuk rincian tentang bagaimana mendapatkan data pengguna.
tr_tr: OpenStack metaveri servisi Amazon EC2 metaveri servisinin 2009-04-04 sürümüyle uyumlu olduğundan, kullanıcı verisinin nasıl alınacağıyla ilgili bilgi için `Sunucu Metaverisinin Kullanımı <http://docs.amazonwebservices.com/AWSEC2/2009-04-04/UserGuide/ AESDG-chapter-instancedata.html>`_ adresindeki Amazon EC2 belgelendirmesine danışın.

source: Associates the definitions with different types of resources.
de: Verknüpft die Definitionen mit verschiedenen Arten von Ressourcen.
id: Kaitkan definisi dengan berbagai tipe sumber daya.
tr_tr: Tanımları farklı kaynak türleriyle ilişkilendirir.

source: Assume that the name of your virtual machine image is ``ubuntu-14.04``, which you need to know when you use :command:`virsh` commands to manipulate the state of the image.
tr_tr: Sanal makine imajınızın isminin ``ubuntu-14.04`` olduğunu varsayın, :command:`virsh` komutlarını kullanarak imaj durumunu değiştirirken bilmeniz gerekecek.

source: Assume that you have a CentOS qcow2 image called ``centos63_desktop.img``. Mount the image in read-write mode as root, as follows:
de: Angenommen, Sie haben ein CentOS qcow2 Abbild namens `` centos63_desktop.img``. Montieren das Abbild im Read-Write-Modus als root, wie folgt:
id: Asumsikan bahwa Anda telah memiliki sebuah image qcow2 CentOS disebut ``centos63_desktop.img``. Mount image dalam modus read-write sebagai root, sebagai berikut:
tr_tr: ``centos63_desktop.img`` isimli bir CentOS qcow2 imajınız olduğunu varsayın. Root olarak imajı okuma-yazma kipinde bağlayın, şu şekilde:

source: Assume that:
de: Annehmen, dass:
id: Asumsikan bahwa:
tr_tr: Şunları varsayın:

source: Assuming the first block device (``/dev/nbd0``) is not currently in use, we can expose the disk partitions using the :command:`qemu-nbd` and :command:`partprobe` commands. As root:
de: Angenommen, das erste Blockgerät (``/dev/nbd0``) ist derzeit nicht benutzt, können wir die Festplattenpartitionen mit dem :command:`qemu-nbd` und :command:`partprobe`-Befehle aufsetzen. Als root:
id: Dengan asumsi perangkat blok pertama (``/dev/nbd0``) tidak sedang digunakan, kita dapat mengekspos partisi disk menggunakan perintah :command:`qemu-nbd` dan :command:`partprobe`. Sebagai root:
tr_tr: İlk blok aygıtın (``/dev/nbd0``) kullanımda olmadığını varsayarsak, :command:`qemu-nbd` ve :command:`partprobe` komutlarını kullanarak disk bölümlerini ortaya çıkarabiliriz. Root olarak:

source: At the initial Installer boot menu, choose the :guilabel:`Install CentOS 7` option. After the installation program starts, choose your preferred language and click :guilabel:`Continue` to get to the installation summary. Accept the defaults.
de: Wählen Sie im ersten Installations-Boot-Menü die Option :guilabel: `Install CentOS 7`. Nachdem das Installationsprogramm gestartet wurde, wählen Sie Ihre bevorzugte Sprache und klicken Sie auf :guilabel: `Continue`, um zur Installationsübersicht zu gelangen. Akzeptieren Sie die Vorgaben.
id: Pada menu Installer boot awal, pilih opsi :guilabel:`Install CentOS 7`. Setelah program penginstalan dimulai, pilih bahasa pilihan Anda dan klik :guilabel: `Continue` untuk sampai ke ringkasan instalasi. Terima default
tr_tr: İlk Kurulum önyükleme menüsünde, :guilabel:`Install CentOS 7` seçeneğini seçin. Kurulum programı başladıktan sonra, tercih ettiğiniz dili seçin ve kurulum özetine geçmek için :guilabel:`Devam Et`e tıklayın. Öntanımlıları kabul edin.

source: At the initial Installer boot menu, choose the :guilabel:`Install` option. Step through the installation prompts, the defaults should be fine.
de: Wählen Sie im ersten Installations-Boot-Menü die Option :guilabel: `Install`. Gehen Sie durch die Installationsaufforderungen, die Vorgaben sollten gut sein.
id: Pada menu Installer boot awal, pilih opsi :guilabel:`Install`. Ikuti langkah seluruh petunjuk instalasi, default seharusnya berjalan baik.
tr_tr: İlk Yükleyici önyükleme menüsünde, :guilabel:`Kur` seçeneğini seçin. Kurulum adımlarını geçin, öntanımlı değerler iyidir.

source: Automatic updates
de: Automatische Updates
id: Pembaruan otomatis
tr_tr: Otomatik güncellemeler

source: Because 86400 seconds (24 hours) is the default time for ``remove_unused_original_minimum_age_seconds``, you can either wait for that time interval to see the base image removed, or set the value to a shorter time period in the ``nova.conf`` file. Restart all nova services after changing a setting in the ``nova.conf`` file.
de: Weil 86400 Sekunden (24 Stunden) die Standardzeit für `` remove_unused_original_minimum_age_seconds`` ist, können Sie entweder auf dieses Zeitintervall warten, um das Basisabbild zu entfernen oder den Wert auf einen kürzeren Zeitraum in der ``nova.conf`` Datei setzen. Starten Sie alle nova-Dienste neu, nachdem Sie eine Einstellung in der ``nova.conf`` Datei geändert haben.
id: Karena 86400 detik (24 jam) adalah waktu default untuk ``remove_unused_original_minimum_age_seconds``, Anda dapat menunggu interval waktu untuk melihat image dasar yang dihapus, atau mengatur nilai untuk periode waktu yang lebih singkat dalam file ``nova.conf``. Restart semua layanan nova setelah mengubah pengaturan di file ``nova.conf``.
tr_tr: ``remove_unused_original_minimum_age_seconds`` için öntanımlı değer 86400 saniye (24 saat) olduğundan, taban imajın silindiğini görmek için bu kadar saniye bekleyebilir, ya da ``nova.conf`` dosyasında aralığı daha kısa tutabilirsiniz. ``nova.conf`` dosyasında bir ayar değiştirdikten sonra tüm nova servislerini yeniden başlatın.
