Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: Xen: one ext3/ext4 partition (no LVM)
de: Xen: eine ext3/ext4-Partition (keine LVM)
id: Xen: satu partisi ext3/ext4 (tanpa LVM)
tr_tr: Xen: bir ext3/ext4 bölümü (LVM yok)

source: You can access this information through the metadata service or referring to `Store metadata on the configuration drive <https://docs.openstack.org/user-guide/cli-config-drive.html>`_. As the OpenStack metadata service is compatible with version 2009-04-04 of the Amazon EC2 metadata service, consult the Amazon EC2 documentation on `Using Instance Metadata <http://docs.amazonwebservices.com/ AWSEC2/2009-04-04/UserGuide/AESDG-chapter-instancedata.html>`_ for details on how to retrieve the user data.
de: Sie können auf diese Informationen über den Metadatendienst zugreifen oder auf `Metadaten auf dem Konfigurationslaufwerk speichern` <https://docs.openstack.org/user-guide/cli-config-drive.html> verweisen`_. Da der OpenStack-Metadatendienst mit der Version 2009-04-04 des Amazon EC2-Metadatendienstes kompatibel ist, konsultieren Sie die Amazon EC2-Dokumentation zum Thema `Instanzmetadaten verwenden <http://docs.amazonwebservices.com/ AWSEC2/2009-04-04/UserGuide/AESDG-chapter-instancedata.html>`_ für Details zum Abrufen der Benutzerdaten.
id: Anda dapat mengakses informasi ini melalui layanan metadata atau mengacu `Store metadata on the configuration drive <https://docs.openstack.org/user-guide/cli-config-drive.html>`_. Sebagai layanan metadata OpenStack kompatibel dengan versi 2009/04/04 layanan metadata Amazon EC2, carilah keterangan dokumentasi Amazon EC2 di `Using Instance Metadata <http://docs.amazonwebservices.com/ AWSEC2/2009-04-04/UserGuide/AESDG-chapter-instancedata.html>`_ untuk rincian tentang bagaimana mengambil data pengguna.
tr_tr: Bu bilgiye metaveri servisi üzerinden veya `Yapılandırma sürücüsü üzerine metaveri saklayarak <https://docs.openstack.org/user-guide/cli-config-drive.html>`_ erişebilirsiniz. OpenStack metaveri servisi Amazon EC2 metaveri servisinin 2009-04-04 sürümüyle uyumlu olduğundan, kullanıcı verisini nasıl alacağınızla ilgili bilgi için Amazon EC2 `Sunucu Metaverisini Kullanmak <http://docs.amazonwebservices.com/ AWSEC2/2009-04-04/UserGuide/AESDG-chapter-instancedata.html>`_ belgesine danışabilirsiniz.

source: You can add metadata to Image service images by using the ``--property key=value`` parameter with the :command:`openstack image create` or :command:`openstack image set` command. More than one property can be specified. For example:
de: Sie können Metadaten zu Abbilddienst-Abbildern hinzufügen, indem Sie den Parameter ``--property key=value`` mit dem :command:`openstack image create` verwenden oder :command:`openstack image set` Befehl. Es können mehr als eine Eigenschaft angegeben werden. Beispielsweise:
id: Anda dapat menambahkan metadata ke image di layanan Image dengan menggunakan parameter ``--property key=value`` dengan perintah :command:`openstack image create` atau :command:`openstack image set`. Lebih dari satu properti dapat ditentukan. Sebagai contoh:
tr_tr: ``--property key=value`` parametresini :command:`openstack image create` veya :command:`openstack image set` komutuyla kullanarak İmaj servisine metaveri ekleyebilirsiniz. Birden fazla özellik eklenebilir. Örneğin:

source: You can change the name of the account used by ``cloud-init`` by editing the ``/etc/cloud/cloud.cfg`` file and adding a line with a different user. For example, to configure ``cloud-init`` to put the key in an account named ``admin``, use the following syntax in the configuration file:
de: Sie können den Namen des von ``cloud-init` verwendeten Kontos ändern, indem Sie die Datei ``/etc/cloud/cloud.cfg`` bearbeiten und eine Zeile mit einem anderen Benutzer hinzufügen. Um beispielsweise ``cloud-init`` zu konfigurieren, um den Schlüssel in ein Konto mit dem Namen ``admin`` zu setzen, verwenden Sie die folgende Syntax in der Konfigurationsdatei:
id: Anda dapat mengubah nama akun yang digunakan oleh ``cloud-init`` dengan mengedit file ``/etc/cloud/cloud.cfg`` dan menambahkan sebuah baris dengan pengguna yang berbeda. Misalnya, untuk mengkonfigurasi ``cloud-init`` untuk meletakkan kunci di akun bernama ``admin``, gunakan sintaks berikut di file konfigurasi:
tr_tr: ``cloud-init`` tarafıdan kullanılan hesap ismini ``/etc/cloud/cloud.cfg`` dosyasını düzenleyerek farklı kullanıcı içeren bir satır ekleyerek değiştirebilirsiniz. Örneğin, ``cloud-init``i ``admin`` isimli bir hesaba anahtar koyacak şekilde yapılandırmak için , yapılandırma dosyasında aşağıdaki sözdizimini kullanın.

source: You can set the container format for your image to one of the following values:
de: Sie können das Containerformat für Ihr Abbild auf einen der folgenden Werte setzen:
tr_tr: İmajınız için kapsayıcı biçimini şu değerlerden birine ayarlayabilirsiniz:

source: You can specify up to 1 GB additional RAM to make the installation process run faster.
de: Sie können bis zu 1 GB zusätzlichen RAM angeben, um den Installationsvorgang schneller laufen zu lassen.
id: Anda dapat menentukan hingga 1 GB tambahan RAM untuk membuat proses instalasi berjalan lebih cepat.
tr_tr: Kurulum sürecini daha hızlı hale getirmek için 1 GB'a kadar ek RAM belirtebilirsiniz.

source: You do not need a ``/boot`` partition unless your image is an older Linux distribution that requires that ``/boot`` is not managed by LVM.
de: Sie brauchen keine `` /boot``-Partition, es sei denn, Ihr Abbild ist eine ältere Linux-Distribution, die erfordert, dass ``/boot`` nicht von LVM verwaltet wird.
id: Anda tidak perlu partisi ``/boot`` kecuali image Anda adalah distribusi Linux yang lebih tua yang mengharuskan dimana ``/boot`` tidak dikelola oleh LVM.
tr_tr: Linux dağıtımınız ``/boot`` yolunun LVM tarafından yönetilmemesini gerektiren eski dağıtımlardan değilse ayrı bir ``/boot`` bölümüne ihtiyacınız yoktur.

source: You do not need to add users at this time. The ``bsd-cloudinit`` program adds a ``freebsd`` user account if one does not exist. The ``ssh`` keys for this user are associated with OpenStack. To customize this user account, you can create it now. For example, you might want to customize the shell for the user.
de: Sie müssen keine Benutzer zu diesem Zeitpunkt hinzufügen. Das ``bsd-cloudinit``-Programm fügt ein ``freebsd`` Benutzerkonto hinzu, wenn es nicht existiert. Die ``ssh`` Schlüssel für diesen Benutzer sind mit OpenStack verbunden. Um dieses Benutzerkonto anzupassen, können Sie es jetzt erstellen. Zum Beispiel möchten Sie vielleicht die Shell für den Benutzer anpassen.
id: Anda tidak perlu menambahkan pengguna saat ini. Program ``bsd-cloudinit`` menambahkan akun pengguna ``freebsd`` jika salah satu tidak ada. Kunci ``ssh`` untuk pengguna ini berhubungan dengan OpenStack. Untuk menyesuaikan akun pengguna ini, Anda dapat membuat sekarang. Misalnya, Anda mungkin ingin menyesuaikan (customize) shell untuk pengguna.
tr_tr: Bu aşamada kullanıcı eklemenize gerek yok. ``bsd-cloudinit`` programı mevcut değilse bir ``freebsd`` hesabı ekler. Bu kullanıcı için ``ssh`` anahtarları OpenStack ile ilişkilendirilmiştir. Bu kullanıcı hesabını özelleştirmek için, şu an oluşturabilirsiniz. Örneğin, kullanıcı kabuğunu özelleştirmek isteyebilirsiniz.

source: You must configure the image so that the kernel writes the boot log to the ``ttyS0`` device. In particular, the ``console=tty0 console=ttyS0,115200n8`` arguments must be passed to the kernel on boot.
de: Sie müssen das Abbild so konfigurieren, dass der Kernel das Bootprotokoll an das ``ttyS0`` Gerät schreibt. Insbesondere müssen die ``console = tty0 console = ttyS0,115200n8`` Argumente an den Kernel beim Booten übergeben werden.
id: Anda harus mengkonfigurasi image sehingga kernel menulis log boot ke perangkat ``ttyS0``. Secara khusus, argumen ``console = tty0 console = ttyS0,115200n8`` harus dilewatkan ke kernel saat boot.
tr_tr: İmajınızı çekirdeği önyükleme logunu ``ttyS0`` aygıtına yazacak şekilde yapılandırmalısınız. Özellikle, önyükleme sırasında ``console=tty0 console=ttyS0,115200n8`` değişkenleri çekirdeğe aktarılmalıdır.

source: You must configure these items for your image:
de: Sie müssen diese Elemente für Ihr Abbild konfigurieren:
id: Anda harus mengkonfigurasi item ini untuk image Anda:
tr_tr: İmajınız içim şu ögeleri yapılandırmalısınız:

source: You must install an ssh server into the image and ensure that it starts up on boot, or you cannot connect to your instance by using ssh when it boots inside of OpenStack. This package is typically called ``openssh-server``.
de: Sie müssen einen ssh-Server in das Abbild installieren und sicherstellen, dass er beim Booten startet, oder Sie können keine Verbindung zu Ihrer Instanz herstellen, indem Sie ssh verwenden, wenn es in OpenStack bootet. Dieses Paket wird normalerweise ``openssh-server`` genannt.
id: Anda harus menginstal server ssh ke dalam image dan memastikan bahwa server itu dimulai pada boot, atau Anda tidak dapat terhubung ke instance Anda dengan menggunakan ssh ketika server boot dalam OpenStack. Paket ini biasanya disebut ``openssh-server``.
tr_tr: İmaja bir ssh sunucu kurmalı ve önyükleme sırasında başladığından emin olmalısınız, yoksa OpenStack içinde açıldığında sunucuya ssh ile erişemezsiniz. Bu paket genellikle ``openssh-server`` olarak adlandırılır.

source: You must remove the network persistence rules in the image because they cause the network interface in the instance to come up as an interface other than eth0. This is because your image has a record of the MAC address of the network interface card when it was first installed, and this MAC address is different each time the instance boots. You should alter the following files:
de: Sie müssen die Netzwerk-Persistenzregeln im Abbild entfernen, da sie dazu führen, dass die Netzwerkschnittstelle in der Instanz als eine andere Schnittstelle als eth0 auftritt. Dies liegt daran, dass Ihr Abbild eine Aufzeichnung der MAC-Adresse der Netzwerkschnittstellenkarte hat, als es zum ersten Mal installiert wurde, und diese MAC-Adresse ist bei jedem Start der Instanz unterschiedlich. Sie sollten folgende Dateien ändern:
id: Anda harus menghapus aturan kaku (persistence rule) jaringan dalam image karena mereka akan menyebabkan interface jaringan dalam instance untuk muncul sebagai interface bukannya eth0. Hal ini karena image Anda memiliki catatan alamat MAC dari kartu antarmuka jaringan ketika pertama kali diinstal, dan alamat MAC ini berbeda setiap kali instance boot. Anda harus mengubah file berikut:
tr_tr: İmajdaki ağ kalıcılık kurallarını kaldırmalısınız çünkü sunucudaki ağ arayüzünün eth0 dışında bir arayüz olarak açılmalarına sebep olur. Bunun sebebi imajınızın ilk kurulumdaki ağ arayüz kartının MAC adresinin kaydına sahip olmasıdır, ve bu MAC adresi sunucu her önyüklendiğinde değişir. Aşağıdaki dosyaları düzenlemelisiniz:

source: You need the ``nbd`` (network block device) kernel module loaded to mount qcow2 images. This will load it with support for 16 block devices, which is fine for our purposes. As root:
de: Du brauchst das geladene ``nbd`` (network block device) Kernelmodul, um qcow2 Abbilder zu mounten. Dies lädt es mit Unterstützung für 16 Block-Geräte, was für unsere Zwecke gut ist. Als root:
id: Anda memerlukan modul kernel ``nbd`` (network block device) yang dimuat untuk me-mount image qcow2. Image ini akan memuat modul kernel dengan dukungan perangkat 16 blok, yang baik-baik saja untuk tujuan kita. Sebagai root:
tr_tr: Qcow2 imajlarını bağlamak için ``nbd`` (ağ blok aygıtı) çekirdek modülüne ihtiyacını vardır. Bu komut 16 blok aygıt destekleyecek şekilde yükleyecektir, işimiz görmeye yeter. Root olarak.

source: You now have a VM that boots from the downloaded install ISO and is connected to the blank virtual disk that you created previously.
de: Sie haben jetzt eine VM, die von der heruntergeladenen Installation ISO bootet und mit dem leeren virtuellen Laufwerk verbunden ist, das Sie zuvor erstellt haben.
id: Anda sekarang memiliki VM yang boot dari ISO install yang didownload dan terhubung ke disk virtual kosong dimana Anda buat sebelumnya.
tr_tr: Artık indirilen kurulum ISO'sundan ön yüklenen ve daha önce oluşturduğunuz boş sanal diske bağlı bir sanal makineniz var.

source: You saved the netinstall ISO image to the ``/data/isos`` directory.
de: Sie haben das netinstall ISO-Image im ``/data/isos``-Verzeichnis gespeichert.
id: Anda menyimpan image ISO netinstall ke direktori ``/data/isos``.
tr_tr: Ağ kurulumu ISO imajını ``/data/isos`` dizinine kaydettiniz.

source: You saved the netinstall ISO image to the ``/tmp`` directory.
de: Sie haben das netinstall ISO-Image im ``/tmp``-Verzeichnis gespeichert.
id: Anda menyimpan citra ISO netinstall di direktori ``/tmp``.
tr_tr: Ağ kurulum ISO imajını ``/tmp`` dizinine kaydettiniz.

source: You will be shown a series of dialog boxes that will allow you to specify information about the virtual machine.
de: Sie werden eine Reihe von Dialogfeldern angezeigt bekommen, mit denen Sie Informationen über die virtuelle Maschine angeben können.
id: Anda akan ditampilkan serangkaian kotak dialog yang akan memungkinkan Anda untuk menentukan informasi tentang mesin virtual.
tr_tr: Sanal makine hakkında bilgileri belirtmenizi sağlayacak bir seri iletişim penceresi açılacaktır.

source: Your image is ready to upload to the Image service:
de: Ihr Abbild ist bereit zum Hochladen in den Abbilddienst:
id: Image Anda siap untuk meng-upload ke layanan Image:
tr_tr: İmajınız imaj sunucusuna yüklenmeye hazır:

source: Your image must be able to resize its partitions on boot to match the size requested by the user. Otherwise, after the instance boots, you must manually resize the partitions to access the additional storage to which you have access when the disk size associated with the flavor exceeds the disk size with which your image was created.
de: Ihr Abbild muss in der Lage sein, seine Partitionen beim Booten zu ändern, um die vom Benutzer angeforderte Größe zu erfüllen. Andernfalls müssen Sie nach dem Booten der Instanz die Partitionen manuell ändern, um auf den zusätzlichen Speicher zuzugreifen, auf den Sie zugreifen können, wenn die mit der Variante verknüpfte Datenträgergröße die Datenträgergröße überschreitet, mit der Ihr Abbild erstellt wurde.
id: Image Anda harus dapat mengubah ukuran partisi pada boot untuk mencocokkan ukuran yang diminta oleh pengguna. Jika tidak, setelah instance boot, Anda harus secara manual mengubah ukuran partisi untuk mengakses penyimpanan tambahan dimana Anda memiliki akses ketika ukuran disk dibuat, ukuran disk ini terkait dengan flavor melebihi ukuran disk dengan image yang Anda ciptakan.
tr_tr: İmajınız kullanıcı tarafıdan istenen boyutla eşleşecek şekilde önyüklemeden bölümlerini yeniden boyutlandırabilmelidir. Aksi halde imajınız oluşturulduğun ayarlanan disk boyutu nitelikteki disk boyutundan küçükse sunucu önyüklendikten sonra elle bölümleri yeniden boyutlandırıp nitelikle ilişkili ek disk boyutuna erişimeniz gerekir.

source: Your script must do something like the following:
de: Ihr Skript muss so etwas wie das Folgende tun:
id: Skrip Anda harus melakukan sesuatu seperti berikut:
tr_tr: Betiğiniz aşağıdaki gibi bir şey yapmalı:

source: `CentOS 6 images <http://cloud.centos.org/centos/6/images/>`_
de: `CentOS 6 Abbilder <http://cloud.centos.org/centos/6/images/> `_
tr_tr: `CentOS 6 imajları <http://cloud.centos.org/centos/6/images/>`_

source: `CentOS 7 images <http://cloud.centos.org/centos/7/images/>`_
de: `CentOS 7 Abbilder <http://cloud.centos.org/centos/7/images/> `_
tr_tr: `CentOS 7 imajları <http://cloud.centos.org/centos/7/images/>`_

source: `Debian provides images for direct download <http://cdimage.debian.org/cdimage/openstack/>`_. They are made at the same time as the CD and DVD images of Debian. Therefore, images are available on each point release of Debian. Also, weekly images of the testing distribution are available.
de: `Debian bietet Abbilder zum direkten Download <http://cdimage.debian.org/cdimage/openstack/> `_. Sie werden zur gleichen Zeit wie die CD- und DVD-Abbilder von Debian gemacht. Daher sind Abbilder auf jedem Punkt Release von Debian verfügbar. Auch wöchentliche Abbilder der Testverteilung sind verfügbar.
id: `Debian provides images for direct download <http://cdimage.debian.org/cdimage/openstack/>`_. Mereka dibuat pada waktu yang sama seperti CD dan DVD image Debian. Oleh karena itu, image tersedia di setiap rilis Debian. Juga tersedia, image distribusi pengujian mingguan.
tr_tr: `Debian doğrudan indirmeye hazır imajlar sağlar <http://cdimage.debian.org/cdimage/openstack/>`_. Debian CD ve DVD imajlarıyla aynı anda yapılırlar. Yani imajlar Debian'ın her yayın noktasında çıkar. Ayrıca deneme dağıtımının haftalık imajları da kullanılabilir.

source: `OVF <http://dmtf.org/sites/default/files/OVF_Overview_Document_2010.pdf>`_ (Open Virtualization Format) is a packaging format for virtual machines, defined by the Distributed Management Task Force (DMTF) standards group. An OVF package contains one or more image files, a ``.ovf`` XML metadata file that contains information about the virtual machine, and possibly other files as well.
de: `OVF <http://dmtf.org/sites/default/files/OVF_Overview_Document_2010.pdf> `_ (Open Virtualization Format) ist ein Verpackungsformat für virtuelle Maschinen, das von der Standardgruppe der Distributed Management Task Force (DMTF) definiert ist. Ein OVF-Paket enthält eine oder mehrere Abbilddateien, eine ``.ovf`` XML-Metadatendatei, die Informationen über die virtuelle Maschine und möglicherweise auch andere Dateien enthält.
tr_tr: `OVF <http://dmtf.org/sites/default/files/OVF_Overview_Document_2010.pdf>`_ (Açık Sanallaştırma Biçimi) sanal makineler için Dağıtık Yönetim Görev Gücü (DMTF) standartları grubu tarafından tanımlanan bir paketleme biçimidir. Bir OVF paketi bir ya da daha fazla imaj dosyası içerir, bir ``.ovf`` XML metaveri dosyası sanal makine hakkında bilgi ve muhtemelen başka dosyalar içerir.

source: `Oz <https://github.com/clalancette/oz/wiki>`_ is a command-line tool that automates the process of creating a virtual machine image file. Oz is a Python app that interacts with KVM to step through the process of installing a virtual machine.
de: Oz <https://github.com/clalancette/oz/wiki> `_ ist ein Befehlszeilentool, das den Prozess der Erstellung einer virtuellen Maschinenbilddatei automatisiert. Oz ist eine Python-App, die mit KVM interagiert, um durch den Prozess der Installation einer virtuellen Maschine zu treten.
id: `Oz <https://github.com/clalancette/oz/wiki>`_ adalah alat command-line yang mengotomatisasi proses pembuatan file image mesin virtual. Oz adalah aplikasi Python yang berinteraksi dengan KVM untuk melangkah melalui proses pemasangan mesin virtual.
tr_tr: `Oz <https://github.com/clalancette/oz/wiki>`_ sanal makine imaj dosyası oluşturmak sürecini otomatikleştiren bir komut satırı aracıdır. Oz bir sanal makine kurulumu sürecinden adım adım geçmek için KVM ile etkileşime geçen bir Python uygulamasıdır.

source: `Packer <https://packer.io>`_ is a tool for creating machine images for multiple platforms from a single source configuration.
de: `Packer <https://packer.io> `_ ist ein Werkzeug zum Erstellen von Maschinenabbildern für mehrere Plattformen aus einer einzigen Quellkonfiguration.
id: `Packer <https://packer.io>`_ adalah alat untuk pembuatan image mesin untuk berbagai platform dari konfigurasi sumber tunggal.
tr_tr: `Packer <https://packer.io>`_ tek bir kaynak yapılandırmadan birden çok platform için makine imajları oluşturmak için bir araçtır.

source: `Red Hat Enterprise Linux 6 KVM Guest Image <https://access.redhat.com/downloads/content/69/ver=/rhel---6/x86_64/product-downloads>`_
tr_tr: `Red Hat Kurumsal Linux 6 KVM Misafir İmajı <https://access.redhat.com/downloads/content/69/ver=/rhel---6/x86_64/product-downloads>`_

source: `Red Hat Enterprise Linux 7 KVM Guest Image <https://access.redhat.com/downloads/content/69/ver=/rhel---7/x86_64/product-downloads>`_
tr_tr: `Red Hat Kurumsal Linux 7 KVM Misafir İmajı <https://access.redhat.com/downloads/content/69/ver=/rhel---7/x86_64/product-downloads>`_

source: `SUSE Linux Enterprise Server 12 SP1 JeOS <https://www.suse.com/products/server/jeos>`_
tr_tr: `SUSE Linux Kurumsal Sunucu 12 SP1 JeOS <https://www.suse.com/products/server/jeos>`_

source: `SUSE Studio <http://susestudio.com>`_ is a web application for building and testing software applications in a web browser. It supports the creation of physical, virtual or cloud-based applications and includes support for building images for OpenStack based clouds using SUSE Linux Enterprise and openSUSE as distributions.
tr_tr: `SUSE Stüdyo <http://susestudio.com>`_ yazılım uygulamalarını bir web tarayıcıda inşa etmek ve denemek için bir web uygulamasıdır. Fiziksel, sanal veya bulut tabanlı uygulamaların oluşturulmasını destekler ve SUSE Linux Kurumsal ve openSUSE dağıtımlarını baz alan OpenStack tabanlı bulutlar için imajlar inşa etme desteğini içerir.

source: `VeeWee <https://github.com/jedi4ever/veewee>`_ is often used to build `Vagrant <http://vagrantup.com>`_ boxes, but it can also be used to build the KVM images.
de: `VeeWee <https://github.com/jedi4ever/veewee> `_ wird oft verwendet, um` Vagrant-Boxen zu bauen <http://vagrantup.com> `_ , aber es kann auch verwendet werden, um die KVM Abbilder zu bauen.
id: `VeeWee <https://github.com/jedi4ever/veewee>`_ sering digunakan untuk membangun kotak `Vagrant <http://vagrantup.com>`_, tetapi VeeWee juga dapat digunakan untuk membangun citra KVM.
tr_tr: `VeeWee <https://github.com/jedi4ever/veewee>`_ genellikle `Vagrant <http://vagrantup.com>`_ kutuları inşa etmek için kullanılır, ama KVM imajları inşa etmek için de kullanılabilir.

source: `Virt-builder <http://libguestfs.org/virt-builder.1.html>`_ is a tool for quickly building new virtual machines. You can build a variety of VMs for local or cloud use, usually within a few minutes or less. Virt-builder also has many ways to customize these VMs. Everything is run from the command line and nothing requires root privileges, so automation and scripting is simple.
de: `Virt-builder <http://libguestfs.org/virt-builder.1.html> `_ ist ein Werkzeug für den schnellen Aufbau neuer virtueller Maschinen. Sie können eine Vielzahl von VMs für lokale oder Cloud-Nutzung, in der Regel innerhalb von ein paar Minuten oder weniger zu bauen. Virt-Builder hat auch viele Möglichkeiten, diese VMs anzupassen. Alles läuft von der Kommandozeile aus und nichts erfordert root-Berechtigungen, so dass Automatisierung und Scripting einfach sind.
id: `Virt-builder <http://libguestfs.org/virt-builder.1.html>`_ adalah alat untuk membangun mesin virtual baru secara cepat. Anda dapat membangun berbagai VM untuk penggunaan lokal atau cloud, biasanya dalam beberapa menit atau kurang. Virt-builder juga memiliki banyak cara untuk menyesuaikan VM ini. Semuanya dijalankan dari command line dan tidak membutuhkan hak akses root, jadi otomatisasi dan scripting menjadi sederhana.
tr_tr: `Virt-builder <http://libguestfs.org/virt-builder.1.html>`_ hızlıca yeni sanal makineler inşa etmek için bir araçtır. Yerel veya bulut kullanımı amacıyla çeşitli sanal makineler inşa edebilirsiniz, genellikle yalnızca dakikalar alır. Virt-builder ayrıca bu sanal makineleri özelleştirmek için bir çok yol sunar. Her şey komut satırından çalıştırılır ve hiçbir şey root yetkisi istemez, yani otomasyon ve betikleme basittir.

source: ``auto_disk_config=True`` is set as a property on the image in the image registry.
de: ``auto_disk_config=True`` wird als Eigenschaft auf dem Abbild in der Abbildregistrierung gesetzt.
id: ``auto_disk_config=True`` diatur sebagai properti pada image di registri image.
tr_tr: ``auto_disk_config=True`` imaj kaydında imaj için özellik olarak ayarlanır.
