Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: In general, we recommend that you disable any firewalls inside of your image and use OpenStack security groups to restrict access to instances. The reason is that having a firewall installed on your instance can make it more difficult to troubleshoot networking issues if you cannot connect to your instance.
de: Im Allgemeinen empfehlen wir Ihnen, alle Firewalls innerhalb Ihres Abbildes zu deaktivieren und OpenStack Sicherheitsgruppen zu verwenden, um den Zugriff auf Instanzen zu beschränken. Der Grund dafür ist, dass eine Firewall auf Ihrer Instanz installiert ist, kann es schwieriger machen, Netzwerkprobleme zu beheben, wenn Sie keine Verbindung zu Ihrer Instanz herstellen können.
id: Secara umum, kami menyarankan Anda menonaktifkan firewall apapun di dalam image Anda dan gunakan kelompok keamanan OpenStack untuk membatasi akses ke instance. Alasannya adalah bahwa kepemilikan firewall yang terpasang pada instance Anda dapat membuatnya lebih sulit untuk memecahkan masalah jaringan jika Anda tidak dapat terhubung ke instance Anda.
tr_tr: Genellikle, imajınızdaki güvenlik duvarlarını kapatmanızı ve sunuculara erişim için OpenStack güvenlik gruplarını kullanmanızı öneriyoruz. Bunun sebebi sunucuda çalışan güvenlik duvarının sunucunuza bağlanamadığınız durumlarda sorun gidermeyi zorlaştıracak olmasıdır.

source: In order for the root partition to properly resize, install the ``cloud-utils-growpart`` package, which contains the proper tools to allow the disk to resize using cloud-init.
de: Damit die Root-Partition richtig vergrössert werden kann, installieren Sie das ``cloud-utils-growpart``-Paket, das die richtigen Tools enthält, damit der Datenträger die Größe von cloud-init ändern kann.
id: Agar partisi root dapat disesuaikan dengan benar, pasang paket ``cloud-utils-growpart``, yang berisi alat yang tepat agar disk dapat diubah ukurannya menggunakan cloud-init.
tr_tr: Kök bölümün düzgün yeniden boyutlandırılması için, ``cloud-utils-growpart`` paketini kurun, bu paket cloud-init kullanarak diskin yeniden boyutlandırılmasını sağlayan uygun araçları içerir.

source: In the :guilabel:`configuration options` window, change the following settings:
de: Im Fenster :guilabel:`Konfigurationsoptionen` ändern Sie folgende Einstellungen:
id: Dalam jendela :guilabel:`configuration options`, ubahlah pengaturan berikut:
tr_tr: :guilabel:`yapılandırma seçenekleri` penceresinde, aşağıdaki ayarları değiştirin:

source: In the OpenStack Image API, the image member status serves three purposes:
de: In der OpenStack Image API dient der Image Member Status drei Zwecke:
id: Dalam OpenStack Image API, status anggota image melayani tiga tujuan:
tr_tr: OpenStack İmaj API'sinde, imaj üye durumu üç amaçla bulunur:

source: In the ``/var/log/compute/compute.log`` file, look for the identifier:
de: In der ``/var/log/compute/compute.log`` Datei suchen Sie nach der Kennung:
id: Dalam file ``/var/log/compute/compute.log``, carilah pengenal (identifier):
tr_tr: ``/var/log/compute/compute.log`` dosyasında tanımlayıcıya bakın:

source: In the example above, the guest ``centos`` uses VNC display ``:1``, which corresponds to TCP port ``5901``. You should be able to connect a VNC client running on your local machine to display ``:1`` on the remote machine and step through the installation process.
de: Im obigen Beispiel verwendet der Gast ``centos`` die VNC-Anzeige ``:1``, was dem TCP-Port `` 5901` entspricht. Sie sollten in der Lage sein, einen VNC-Client auf Ihrem lokalen Rechner zu verbinden, um ``:1`` auf dem Remote-Rechner anzuzeigen und den Installationsvorgang durchzuführen.
id: Pada contoh di atas, guest ``centos`` menggunakan layar VNC ``:1`` , yang sesuai dengan port TCP ``5901``. Anda harus bisa menghubungkan klien VNC yang berjalan di komputer lokal Anda untuk menampilkan ``:1`` pada mesin remote dan masuk melalui proses instalasi.
tr_tr: Yukardaki örnekte, misafir ``centos`` VNC ``:1`` numaralı görüntülemeyi kullanır, bu da ``5901`` TCP bağlantı noktasına denk gelir. Yerel makinenizde çalışan bir VNC istemcisi ile uzak makinede ``:1`` görüntülemek için bağlanabilmeli ve kurulum sürecini devam ettirebilmelisiniz.

source: In the previous example, you paused the instance, ejected the disk, and unpaused the instance. In theory, you could have ejected the disk at the :guilabel:`Installation complete` screen. However, our testing indicates that the Ubuntu installer locks the drive so that it cannot be ejected at that point.
tr_tr: Önceki örnekte, sunucuyu durdurdunuz, diski çıkardınız ve sunucuyu devam ettirdiniz. Teoride diski :guilabel:`Kurulum tamamlandı` ekranında diski çıkarabilirdiniz. Ancak denemelerimiz Ubuntu yükleyicinin bu noktada sürücüyü kitlediğini bu yüzden çıkarılamayacağını gösteriyor.

source: In this case, it is the ``/dev/sda2`` partition that we want to resize. We create a new qcow2 image and use the :command:`virt-resize` command to write a resized copy of the original into the new image:
de: In diesem Fall ist es die ``/dev/sda2``-Partition, die wir ändern möchten. Wir erstellen ein neues qcow2-Abbild und verwenden den Befehl :command:`virt-resize`, um eine veränderte Kopie des Originals in das neue Abbild zu schreiben:
id: Dalam hal ini, itu adalah `` / dev / sda2`` partisi yang ingin kita resize. Kami menciptakan image qcow2 baru dan menggunakan perintah :command:`virt-resize` untuk menulis salinan image asli yang telah berubah ukurannya menjadi image baru:
tr_tr: Bu durumda, ``/dev/sda2`` bölümünü yeniden boyutlandırmak istiyoruz. Yeni bir qcow2 imajı oluşturuyoruz ve :command:`virt-resize` komutu ile asıl imajın yeniden boyutlandırılmış kopyasını yeni imaja yazıyoruz:

source: In this example, ``/dev/loop0`` is free. Associate a loop device with the raw image:
de: In diesem Beispiel ist ``/dev/loop0`` frei. Verknüpfen Sie ein Loop-Gerät mit dem Raw-Abbild:
id: Dalam contoh ini, ``/dev/loop0`` bebas. Kaitkan perangkat loop dengan image baku:
tr_tr: Bu örnekte, ``/dev/loop0`` boş. Raw imajla bir döngü aygıtı ilişkilendirelim:

source: Install GRUB boot loader
de: GRUB boot loader installieren
id: Menginstal GRUB boot loader
tr_tr: GRUB önyükleyicisini kurun

source: Install ``sudo`` and configure the ``freebsd`` user to have passwordless access:
de: Installieren Sie ``sudo`` und konfiguriere den ``freebsd`` Benutzer mit passwortlosem Zugriff:
id: Install ``sudo`` dan mengkonfigurasi pengguna ``freebsd`` untuk memiliki akses passwordless:
tr_tr: ``sudo``yu kurun ve ``freebsd`` kullanıcısı için parolasız erişimi yapılandırın:

source: Install a ``cloud-init`` RPM, which is a port of the Ubuntu `cloud-init <https://launchpad.net/cloud-init>`_ package. This is the recommended approach.
de: Installiere eine ``cloud-init`` RPM, was ein Port des Ubuntu `Cloud-init <https://launchpad.net/cloud-init> `_ Paket ist Dies ist der empfohlene Ansatz.
id: Instal RPM ``cloud-init``, yang merupakan port dari Ubuntu paket `cloud-init <https://launchpad.net/cloud-init>`_. Ini adalah pendekatan yang direkomendasikan.
tr_tr: Ubuntu `cloud-init <https://launchpad.net/cloud-init>`_ paketinin türevi olan bir ``cloud-init`` RPM'i kurun. Bu tavsiye edilen yaklaşımdır.

source: Install cloud-init
de: Cloud-init installieren
id: Instal cloud-init
tr_tr: cloud-init'i kurun

source: Install cloud-utils-growpart to allow partitions to resize
de: Installieren von Cloud-utils-growpart, um Partitionen zu vergrössern
id: Instal cloud-utils-growpart untuk memungkinkan partisi untuk mengubah ukuran
tr_tr: Bölümlerin yeniden boyutlandırılmasına izin vermek için cloud-utils-growpart kurun

source: Install the ACPI service
de: Installiere den ACPI-Dienst
id: Menginstal layanan ACPI
tr_tr: ACPI sunucusunu kurun

source: Install the ``cloud-init`` package:
de: Installieren des ``cloud-init`` Paket:
id: Instal paket ``cloud-init``:
tr_tr: ``cloud-init`` paketini kurun:

source: Introduction
de: Einführung
id: Pengantar
tr_tr: Giriş

source: Issue this command to download and install the latest ``bsd-cloudinit`` package, and install the necessary prerequisites.
de: Geben Sie diesen Befehl ein, um das neueste ``bsd-cloudinit``-Paket herunterzuladen und zu installieren und die notwendigen Voraussetzungen zu installieren.
id: Keluarkan perintah ini untuk men-download dan menginstal paket ``bsd-cloudinit`` terbaru, dan menginstal prasyarat yang diperlukan.
tr_tr: En son ``bsd-cloudinit`` paketini indirmek ve kurmak, ve gerekli bağımlılıkları yüklemek için bu komutu girin.

source: It uses a predefined set of kickstart (Red Hat-based systems) and preseed files (Debian-based systems) for operating systems that it supports, and it can also be used to create Microsoft Windows images.
de: Es verwendet einen vordefinierten Satz von Kickstart (Red Hat-basierte Systeme) und vorgewählte Dateien (Debian-basierte Systeme) für Betriebssysteme, die es unterstützt, und es kann auch verwendet werden, um Microsoft Windows-Abbilder zu erstellen.
id: Ini menggunakan seperangkat kickstart yang telah ditentukan sebelumnya (sistem berbasis Red Hat) dan file yang sudah dipasangkan (sistem berbasis Debian) untuk sistem operasi yang didukungnya, dan juga dapat digunakan untuk membuat image Microsoft Windows.
tr_tr: Destekleyen işletim sistemlerinde öntanımlı bir kickstart (Red Hat tabanlı sistemler) ve preseed dosyaları (Debian tabanlı sistemler) kümesini kullanır, ayrca Microsoft Windows imajları oluşturmak için de kullanılabilir.

source: KVM with virtio drivers is used as the virtualization platform because that is the most widely used among OpenStack operators. If you use a different platform for your cloud virtualization, use that same platform in the image creation step.
de: KVM mit virtio-Treibern wird als Virtualisierungsplattform verwendet, da dies bei OpenStack-Operatoren am weitesten verbreitet ist. Wenn Sie eine andere Plattform für Ihre Cloud-Virtualisierung verwenden, verwenden Sie dieselbe Plattform im Abbilderstellungsschritt.
id: KVM dengan driver virtio digunakan sebagai platform virtualisasi karena itu adalah yang paling banyak digunakan di antara operator OpenStack. Jika Anda menggunakan platform yang berbeda untuk virtualisasi cloud Anda, gunakan platform yang sama dalam langkah pembuatan image.
tr_tr: Sanallaştırma platformu olarak virtio sürücülerine sahip KVM kullanılır çünkü OpenStack işletenler arasında en yaygını budur. Bulut sanallaştırmanız için başka bir platform kullanıyorsanız, imaj oluşturma adımında bu aynı platformu kullanın.

source: Launch a VM on your local workstation. Use the same hypervisor, virtual disk, and virtual network drivers as you use in your production environment.
de: Starten Sie eine VM auf Ihrem lokalen Arbeitsplatz. Verwenden Sie dieselben Hypervisor-, virtuellen Festplatten- und virtuellen Netzwerk-Treiber, wie Sie es in Ihrer Produktionsumgebung verwenden.
id: Luncurkan VM pada workstation lokal Anda. Gunakan hypervisor, disk virtual, dan driver virtual jaringan yang sama dimana Anda gunakan dalam lingkungan produksi Anda.
tr_tr: Yerel iş istasyonunuzda bir sanal makine başlatın. Üretim ortamınızda kullandığınızla aynı hipervizörü, sanal diski, ve sanal ağ sürücülerini kullanın.

source: Log in as administrator and start a command window.
de: Melden Sie sich als Administrator an und starten Sie ein Befehlsfenster.
id: Login sebagai administrator dan mulai jendela perintah.
tr_tr: Yönetici olarak giriş yapın ve bir komut penceresi başlatın.

source: Log in as root to the CentOS guest and run the following commands to install the ACPI service and configure it to start when the system boots:
de: Melden Sie sich als root für den CentOS-Gast an und führen Sie die folgenden Befehle aus, um den ACPI-Dienst zu installieren und zu konfigurieren, um zu starten, wenn das System bootet:
id: Masuk sebagai root ke CentOS guest dan jalankan perintah berikut untuk menginstal layanan ACPI dan konfigurasikan untuk memulai saat sistem boot:
tr_tr: CentOS misafirine root olarak giriş yapın ve ACPI servisini kurup sistem ön yüklenirken başlayacak şekilde yapılandırmak için aşağıdaki komutları çalıştırın:

source: Log in as root to the Fedora guest and run the following commands to install the ACPI service and configure it to start when the system boots:
de: Melden Sie sich als root an den Fedora-Gast an und führen Sie die folgenden Befehle aus, um den ACPI-Dienst zu installieren und zu konfigurieren, dass er startet, wenn das System bootet:
id: Masuk sebagai root ke Fedora guest dan jalankan perintah berikut untuk menginstal layanan ACPI dan konfigurasikan untuk memulai saat sistem boot:
tr_tr: Fedora misafirine root olarak giriş yapın ve ACPI servisini kurup sistem ön yüklenirken açılacak şekilde yapılandırmak için şu komutları çalıştırın:

source: Log in to newly created image
de: Melden Sie sich beim neu erstellten Abbild an
id: Log in image yang baru dibuat
tr_tr: Yeni oluşturulan imaja giriş yapın

source: Loop devices, kpartx, network block devices
de: Loop-Geräte, kpartx, Netzwerk-Block-Geräte
id: Perangkat loop, kpartx, perangkat network block
tr_tr: Döngü aygıtları, kpartx, ağ blok aygıtları

source: Make a virtual drive:
de: Machen Sie ein virtuelles Laufwerk:
id: Buat drive virtual:
tr_tr: Bir sanal sürücü yapın:

source: Manage the image cache
de: Verwalten Sie den Abbildcache
id: Mengelola cache image
tr_tr: İmaj önbelleğini yönetin

source: Metadata can also determine the scheduling of hosts. If the ``property`` option is set on an image, and Compute is configured so that the ``ImagePropertiesFilter`` scheduler filter is enabled (default), then the scheduler only considers compute hosts that satisfy that property.
de: Metadaten können auch die Terminierung von Hosts bestimmen. Wenn die ``property``-Option auf einem Abbild gesetzt ist und Compute so konfiguriert ist, dass der ``ImagePropertiesFilter`` Scheduler-Filter aktiviert ist (Standard), dann berücksichtigt der Scheduler nur Compute-Hosts, die diese Eigenschaft erfüllen.
tr_tr: Metaveri sunucuların eşzamanlamasını da belirleyebilir. Eğer bir imajda ``property`` seçeneği ayarlanmışsa, ve Hesaplama ``ImagePropertiesFilter`` zamanlama süzgeci etkin (öntanımlı) olarak yapılandırılmışsa, zamanlayıcı yalnızca özelliği sağlayan hesaplama sunucularını hesaba katar.

source: Metadata definition service
de: Metadatendefinitionsdienst
tr_tr: Metaveri tanımlama servisi

source: Microsoft Hyper-V uses the VHD (Virtual Hard Disk) format for images.
de: Microsoft Hyper-V verwendet das VHD-Format (Virtual Hard Disk) für Abbilder.
tr_tr: Microsoft Hyper-V imajlar için VHD (Sanal Sabit Disk) biçimi kullanır.

source: Minimize boot delay:
de: Minimierung der Boot-Verzögerung:
id: Meminimalkan booting delay:
tr_tr: Ön yükleme gecikmesini asgariye indirin:

source: Modify a single file inside of an image
de: Ändern Sie eine einzelne Datei innerhalb eines Abbildes
id: Memodifikasi file tunggal dalam image
tr_tr: Bir imaj içinde tek bir dosyayı değiştir

source: Modify images
de: Abbilder ändern
id: Memodifikasi image
tr_tr: İmajları değiştirin

source: Modify the ``/etc/rc.local`` file to fetch desired information from the metadata service, as described in the next section.
de: Ändern Sie die Datei ``/etc/rc.local``, um die gewünschten Informationen aus dem Metadatendienst abzurufen, wie im nächsten Abschnitt beschrieben.
id: Modifikasi file ``/etc/rc.local`` untuk mengambil informasi yang diinginkan dari layanan metadata, seperti yang akan dijelaskan di bagian selanjutnya.
tr_tr: Sonraki kısımda açıklandığı şekilde ``/etc/rc.local`` dosyasını değiştirip istenen bilgiyi metaveri servisinden çekin.

source: Modify the partition table to make it aware of the additional space:
de: Ändern Sie die Partitionstabelle, um sie auf den zusätzlichen Speicherplatz aufmerksam zu machen:
id: Lakukan modifikasi tabel partisi dengan memperhatikan akan ruang tambahan:
tr_tr: Bölüm tablosunu değiştirerek ek bölümden haberdar edin:

source: Mount a qcow2 image (with LVM)
de: Ein qcow2-Abbild (mit LVM) einbinden
id: Mount image qcow2 (dengan LVM)
tr_tr: Bir qcow2 imajı bağlayın (LVM ile)

source: Mount a qcow2 image (without LVM)
de: Ein qcow2-Abbild (ohne LVM)
id: Mount image qcow2 (tanpa LVM)
tr_tr: Bir qcow2 imajı bağlama (LVM olmadan)

source: Mount a raw image (with LVM)
de: Ein Raw Abbild (mit LVM)
id: Mount image baku (dengan LVM)
tr_tr: Bir raw imajı bağlayın (LVM ile)

source: Mount a raw image (without LVM)
de: Ein Raw-Abbild (ohne LVM)
id: Mount image baku (tanpa LVM)
tr_tr: Bir raw imaj bağlayın (LVM olmadan)

source: Mounting untrusted guest images using the tools described in this section is a security risk, always use libguestfs tools such as guestfish and guestmount if you have access to them. See `A reminder why you should never mount guest disk images on the host OS <https://www.berrange.com/posts/2013/02/20/ a-reminder-why-you-should-never-mount-guest-disk-images-on-the-host-os/>`_ by Daniel Berrangé for more details.
de: Die Installation von nicht vertrauenswürdigen Gastbildern mit den in diesem Abschnitt beschriebenen Werkzeugen ist ein Sicherheitsrisiko, verwenden Sie immer libguestfs-Tools wie guestfish und guestmount, wenn Sie Zugang zu ihnen haben. Siehe `Eine Erinnerung, warum sollten Sie nie Gast-Festplatten-Abbilder auf dem Host-Betriebssystem montieren<https://www.berrange.com/posts/2013/02/20/ a-reminder-why-you-should-never-mount-guest-disk-images-on-the-host-os/> `_von Daniel Berrangé für weitere Details.
id: Mounting (pemasangan) image guest yang tidak dipercaya menggunakan alat yang dijelaskan dalam bagian ini memiliki resiko keamanan, gunakanlah selalu alat libguestfs seperti guestfish dan guestmount jika Anda memiliki akses kepada mereka. Lihat `A reminder why you should never mount guest disk images on the host OS <https://www.berrange.com/posts/2013/02/20/ a-reminder-why-you-should-never-mount-guest-disk-images-on-the-host-os/>`_ oleh Daniel Berrangé untuk lebih jelasnya.
tr_tr: Bu kısımda anlatılan araçları kullanarak güvenilmeyen misafir imajları bağlamak güvenlik riski oluşturur, her zaman guestfish ve guestmount gibi libguestfs araçlarını kullanmaya çalışın. Daniel Berrangé tarafınan yazılan `Sunucu işletim sistemine misafir disk imajları bağlamamanız gerektiğiyle ilgili hatırlatmaya <https://www.berrange.com/posts/2013/02/20/ a-reminder-why-you-should-never-mount-guest-disk-images-on-the-host-os/>`_ göz atın.

source: Namespace
de: Namensraum
tr_tr: İsim uzayı

source: Navigate to the `CentOS mirrors <https://www.centos.org/download/mirrors/>`_ page.
de: Navigieren Sie zu den `CentOS Mirror <https://www.centos.org/download/mirrors/> `_ Seiten.
id: Arahkan ke halaman `CentOS mirrors <https://www.centos.org/download/mirrors/>`_.
tr_tr: `CentOS yansıları <https://www.centos.org/download/mirrors/>`_ sayfasına gidin.

source: Navigate to the `Download Fedora Server page <https://getfedora.org/en/server/download/>`_ for a Fedora Server ISO image.
de: Navigieren Sie zur `Download Fedora Server Seite <https://getfedora.org/en/server/download/> `_ für ein Fedora Server ISO-Image.
id: Kunjungi `Laman unduhan Fedora Server <https://getfedora.org/en/server/download/>`_ untuk citra ISO Fedora Server.
tr_tr: Fedora Sunucu ISO imajı için `Fedora Sunucu İndirme sayfasına <https://getfedora.org/en/server/download/>`_ gidin.

source: Network adapter to configure: ``Red Hat VirtIO Ethernet Adapter``
de: Netzwerkadapter zum Konfigurieren: ``Red Hat VirtIO Ethernet Adapter``
id: Adapter jaringan untuk mengkonfigurasi: ``Red Hat VirtIO Ethernet Adapter``
tr_tr: Yapılandırılacak ağ bağdaştırıcı: ``Red Hat VirtIO Ethernet Bağdaştırıcısı``

source: Next, update the grub configuration. On Debian-based operating systems such as Ubuntu, run this command:
de: Als nächstes aktualisieren Sie die Grub-Konfiguration. Auf Debian-basierten Betriebssystemen wie Ubuntu führen Sie diesen Befehl aus:
id: Selanjutnya, perbarui konfigurasi grub. Pada sistem operasi berbasis Debian seperti Ubuntu, jalankan perintah ini:
tr_tr: Ardından grub yapılandırmasını güncelleyin. Ubuntu gibi Debian tabanlı işletim sistemlerinde, şu komutu çalıştırın:

source: Next, we want to delete a file. We can use the :command:`rm` guestfish command, which works the same way it does in a traditional shell.
de: Als nächstes wollen wir eine Datei löschen. Wir können den :command:`rm` guestfish Befehl verwenden, der genauso funktioniert wie es in einer traditionellen Shell funktioniert.
id: Selanjutnya, kita ingin menghapus file. Kita dapat menggunakan perintah guestfish :command:`rm`, yang bekerjanya sama dengan cara kerja di shell tradisional.
tr_tr: Şimdi, bir dosya silmek istiyoruz. Geleneksel kabuktaki gibi çalışan guestfish :command:`rm` komutunu kullanabiliriz.

source: Next, you need to use the :command:`vgscan` command to identify the LVM volume groups and then the :command:`vgchange` command to expose the volumes as devices:
de: Als nächstes müssen Sie den Befehl :command:`vgscan` verwenden, um die LVM-Volume-Gruppen zu identifizieren und dann den Befehl :command:`vgchange`, um die Volumes als Geräte freizulegen:
id: Selanjutnya, Anda perlu menggunakan perintah :command:`vgscan` untuk mengidentifikasi kelompok volume LVM dan kemudian perintah :command:`vgchange` untuk mengekspos volume sebagai perangkat:
tr_tr: Ardından, :command:`vgscan` komutunu kullanarak LVM birim gruplarını tanımlamalı ve :command:`vgchange` komutuyla birimleri aygıtlar olarak ortaya çıkarmalısınız:

source: No hard-coded MAC address information
de: Keine Hardcoded MAC Adresse Informationen
id: Tidak informasi alamat MAC hard-coded
tr_tr: Gömülü MAC adresi bilgisi yok

source: No storage provisioning occurs up front.
de: Vorn erfolgt keine Speicherbereitstellung.
id: Tidak ada pengadaan storage terjadi di depan.
tr_tr: Önden hiçbir depolama hazırlığı meydana gelmiyor.

source: Non-Xen with cloud-init/cloud-tools: one ext3/ext4 partition (no LVM)
de: Nicht-Xen mit Cloud-init / Cloud-Tools: eine ext3 / ext4-Partition (keine LVM)
id: Non-Xen dengan cloud-init/cloud-tools: satu partisi ext3/ext4 (tanpa LVM)
tr_tr: cloud-init/cloud-tools ile Xen-Olmayan: bir ext3/ext4 bölümü (LVM yok)

source: Non-Xen without cloud-init/cloud-tools: LVM
de: Nicht-Xen ohne cloud-init/cloud-Tools: LVM
id: Non-Xen tanpa cloud-init/cloud-tools: LVM
tr_tr: cloud-init/cloud-tools olmadan Xen-Dışı: LVM

source: Now that the image is ready to be uploaded to the Image service, you no longer need to have this virtual machine image managed by libvirt. Use the :command:`virsh undefine vm-image` command to inform libvirt:
de: Jetzt, da das Abbild bereit ist, in den Image-Service hochgeladen zu werden, müssen Sie dieses virtuelle Abbild nicht mehr von libvirt verwaltet haben. Verwenden Sie den :command:`virsh undefine vm-image`, um libvirt zu informieren:
id: Sekarang bahwa image siap untuk di-upload ke layanan Image, Anda tidak lagi perlu memiliki image mesin virtual ini yang dikelola oleh libvirt. Gunakan perintah :command:`virsh undefine vm-image` untuk menginformasikan libvirt:
tr_tr: İmaj artık İmaj servisine yüklenebilir olduğundan, bu sanal makine imajını libvirt tarafından yönetme gerekliliği kalmamıştır. libvirt'i bilgilendirmek için :command:`virsh undefine vm-image` komutunu kullanın:
