Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: Now that you can upload the image to the Image service, you no longer need to have this virtual machine image managed by libvirt. Use the :command:`virsh undefine vm-image` command to inform libvirt:
de: Jetzt können Sie das Abbild auf den Image-Service hochladen, Sie müssen dieses virtuelle Abbild nicht mehr von libvirt verwaltet haben. Verwenden Sie den Befehl: `virsh undefine vm-image`, um libvirt zu informieren:
id: Sekarang Anda dapat meng-upload image ke layanan Image, Anda tidak lagi perlu memiliki image mesin virtual ini yang dikelola oleh libvirt. Gunakan perintah :command:`virsh undefine vm-image` untuk menginformasikan libvirt:
tr_tr: Artık imajı İmaj servisine yükleyebileceğinize göre, bu sanal makine imajını libvirt tarafından yönetme ihtiyacınız kalmadı. libvirt'i bilgilendirmek için :command:`virsh undefine vm-image` komutunu kullanın:

source: Object
de: Objekt
id: Obyek
tr_tr: Nesne

source: On Fedora-based systems, such as RHEL and CentOS, and on openSUSE, run this command:
de: Auf Fedora-basierten Systemen wie RHEL und CentOS und auf openSUSE führen Sie diesen Befehl aus:
id: Pada sistem berbasis Fedora, seperti RHEL dan CentOS, dan pada openSUSE, jalankan perintah ini:
tr_tr: RHEL ve CentOS gibi Fedora tabanlı sistemlerde ve openSUSE'de, şu komutu çalıştırın:

source: Once done, we unmount:
de: Sobald wir fertig sind,
id: Setelah selesai, kita unmount:
tr_tr: İş bitince, bağlantıyı kesiyoruz:

source: Once mounted, we could do things like list the installed packages using rpm:
de: Einmal montiert, könnten wir Dinge tun wie Liste der installierten Pakete mit rpm:
id: Setelah di-mount, kita bisa melakukan berbagai hal seperti mendaftar paket yang diinstal dengan menggunakan rpm:
tr_tr: Bağlandıktan sonra, rpm kullanarak kurulu paketleri listeleme gibi şeyler yapabiliriz:

source: Once the installation is completed, the VM restarts. Define a password for the administrator when prompted.
de: Sobald die Installation abgeschlossen ist, startet die VM neu. Definieren Sie ein Kennwort für den Administrator, wenn Sie dazu aufgefordert werden.
tr_tr: Kurulum tamamlandığında, sanal makine yeniden başlar. Sorulduğunda yönetici için bir parola tanımlayın.

source: Once you are done, to clean up:
de: Sobald Sie fertig sind um aufzuräumen:
id: Setelah Anda selesai, untuk membersihkannya:
tr_tr: İşiniz bittiğinde, temizlik için:

source: Once you have obtained a virtual machine image, you may want to make some changes to it before uploading it to the Image service. Here we describe several tools available that allow you to modify images.
de: Sobald Sie ein virtuelles Maschinenbild erhalten haben, können Sie einige Änderungen vor dem Hochladen in den Image-Service vornehmen. Hier beschreiben wir mehrere Werkzeuge, die Ihnen erlauben, Abbilder zu ändern.
id: Setelah Anda telah memperoleh image mesin virtual, Anda mungkin ingin membuat beberapa perubahan sebelum meng-upload ke layanan Image. Di sini kami menjelaskan beberapa alat yang tersedia yang memungkinkan Anda untuk memodifikasi image.
tr_tr: Bir sanal makine imajı elde ettikten sonra, imaj servisine yüklemeden önce bir takım değişiklikler yapmak isteyebilirsiniz. Burda imajları değiştirmenize yardımcı olacak çeşitli araçları tanıtıyoruz.

source: OpenStack Compute does not currently have support for OVF packages, so you will need to extract the image file(s) from an OVF package if you wish to use it with OpenStack.
de: OpenStack Compute hat derzeit keine Unterstützung für OVF-Pakete, so dass Sie die Image-Datei(en) aus einem OVF-Paket extrahieren müssen, wenn Sie es mit OpenStack verwenden möchten.
tr_tr: OpenStack Hesaplama henüz OVF paketlerini desteklemiyor, bu yüzden OpenStack ile kullanmak isterseniz imaj dosya(lar)ını OVF paketinden çıkarmanız gerekir.

source: OpenStack Virtual Machine Image Guide
id: OpenStack Virtual Machine Image Guide (panduan image mesin virtual OpenStack)
tr_tr: OpenStack Sanal Makine İmaj Kılavuzu

source: Optionally, add users.
de: Optional können Benutzer hinzugefügt werden.
id: Secra opsional, tambahkan pengguna.
tr_tr: İsteğe bağlı olarak kullanıcılar ekleyin.

source: Optionally, the producer notifies the consumer that the image has been shared and provides the image's ID (UUID).
de: Optional informiert der Hersteller dem Verbraucher, dass das Abbild geteilt wurde und die ID des Abbildes (UUID) zur Verfügung stellt.
id: Secara psional, produser memberitahu konsumen bahwa image telah dibagikan dan memberikan ID image itu (UUID).
tr_tr: İsteğe bağlı olarak, üretici tüketiciyi imajın paylaşıldığıyla ilgili bilgilendirir ve imajın kimliğini sağlar (UUID).

source: Oz will invoke libvirt to boot the image inside of KVM, then Oz will ssh into the instance and perform the customizations.
de: Oz wird libvirt aufrufen, um das Abbild innerhalb von KVM zu booten, dann wird Oz ssh in die Instanz starten und die Anpassungen ausführen.
id: Oz akan memanggil libvirt untuk boot image dalam KVM, kemudian oz akan ssh ke instance dan melakukan kustomisasi.
tr_tr: Oz libvirt'i imajı KVM içinde ön yükleyecek şekilde başlatır, ardından Oz sunucuya ssh çekerek özelleştirmeleri gerçekleştirir.

source: Paravirtualized Xen support in Linux kernel (Xen hypervisor only with Linux kernel version < 3.0)
de: Paravirtualisierte Xen-Unterstützung im Linux-Kernel (Xen Hypervisor nur mit Linux-Kernel-Version < 3.0)
id: Paravirtualized Xen mendukung Linux kernel (Xen hypervisor hanya dengan Linux kernel version < 3.0)
tr_tr: Linux çekirdeğinde yarı sanallaştırılmış Xen desteği (Yalnızca Linux çekirdeği sürüm < 3.0 ile Xen hipervizörü)

source: Paravirtualized Xen support in the kernel (Xen hypervisor only)
de: Paravirtualisierte Xen-Unterstützung im Kernel (nur Xen Hypervisor)
id: Paravirtualized Xen mendukung dalam kernel (hanya Xen hypervisor)
tr_tr: Çekirdekte yarı sanallaştırılmış Xen desteği (Yalnızca Xen hipervizörü)

source: Partition the disks
de: Partitionieren Sie die Festplatten
id: Partisi disk
tr_tr: Diskleri bölümlendirin

source: Point the installer to a CentOS web server
de: Richten Sie das Installationsprogramm auf einen CentOS Webserver
id: Arahkan installer ke web server CentOS
tr_tr: Yükleyiciyi bir CentOS web sunucuya çevirin

source: Power off the system:
de: Schalten Sie das System aus:
id: Matikan sistem:
tr_tr: Sistemi kapatın:

source: Prior to Linux kernel version 3.0, the mainline branch of the Linux kernel did not have support for paravirtualized Xen virtual machine instances (what Xen calls DomU guests). If you are running the Xen hypervisor with paravirtualization, and you want to create an image for an older Linux distribution that has a pre 3.0 kernel, you must ensure that the image boots a kernel that has been compiled with Xen support.
de: Vor der Linux-Kernel-Version 3.0 hatte der Mainline-Branch des Linux-Kernels keine Unterstützung für paravirtualisierte Xen-Virtual Machine-Instanzen (was Xen DomU-Gäste anruft). Wenn Sie den Xen-Hypervisor mit Paravirtualisierung ausführen und ein Abbild für eine ältere Linux-Distribution erstellen möchten, die über einen Vorkern 3.0 verfügt, müssen Sie sicherstellen, dass das Abbild einen Kernel startet, der mit Xen-Unterstützung kompiliert wurde.
id: Sebelum Linux kernel versi 3.0, percabangan utama kernel Linux tidak memiliki dukungan untuk instance mesin virtual paravirtualized Xen (dimana Xen memanggil DomU guest). Jika Anda menjalankan hypervisor Xen dengan paravirtualization, dan Anda ingin membuat image untuk distribusi Linux yang lebih tua yang memiliki kernel sebelum 3.0, Anda harus memastikan bahwa image boot kernel yang telah dikompilasi dengan dukungan Xen.
tr_tr: 3.0 sürümünden önceki Linux çekirdeklerinde, Linux çekirdeğinin ana dalı yarı sanallaştırılmış Xen sanal makineleri desteklemiyordu (Xen bunları DomU misafirleri olarak adlandırır). Xen hipervizörünü yarı sanallaştırmayla çalıştırıyorsanız, ve 3.0 çekirdeği önceskinde bir çekirdeğe sahip eski bir Linux dağıtımı için bir imaj oluşturacaksanız, imajın Xen desteği ile derlenmiş bir çekirdekle önyüklendiğinden emin olmalısınız.

source: Process user data and other metadata (``cloud-init``)
de: Verarbeiten von Benutzerdaten und anderen Metadaten (``cloud-init``)
id: Proses data pengguna dan metadata lainnya (``cloud-init``)
tr_tr: Kullanıcı verisi ve diğer metaveriyi işle (``cloud-init``)

source: Process user data and other metadata (cloud-init)
de: Prozessdaten und andere Metadaten bearbeiten (cloud-init)
id: Proses pengguna data dan metadata lainnya (cloud-init)
tr_tr: Kullanıcı verisini ve diğer metaveriyi işle (cloud-init)

source: Property
de: Eigenschaften
id: Properti
tr_tr: Özellik

source: Provide a host name for your image. If you use ``bsd-cloudinit``, it overrides this value with the name provided by OpenStack when an instance boots from this image.
de: Geben Sie einen Hostnamen für Ihr Abbild an. Wenn Sie ``bsd-cloudinit`` verwenden, überschreibt es diesen Wert mit dem Namen, der von OpenStack bereitgestellt wird, wenn eine Instanz von diesem Abbild hochfährt.
id: Berikan nama host untuk image Anda. Jika Anda menggunakan ``bsd-cloudinit``, nama ini akan menimpa nilai nama yang diberikan oleh OpenStack ketika sebuah instance boot dari image ini.
tr_tr: İmajınız için bir makine adı sağlayın. ``bsd-cloudinit`` kullanırsanız, bu imajdan ön yüklenen bir sunucu olduğundan OpenStack tarafından sağlanan isimle bu değerin üzerine yazar.

source: QCOW2 (KVM, Xen)
tr_tr: QCOM2 (KVM, Xen)

source: Red Hat Enterprise Linux
tr_tr: Red Hat Kurumsal Linux

source: Red Hat maintains official Red Hat Enterprise Linux cloud images. A valid Red Hat Enterprise Linux subscription is required to download these images.
de: Red Hat unterhält offizielle Red Hat Enterprise Linux-Cloud-Abbilder. Für das Herunterladen dieser Abbilder ist ein gültiges Red Hat Enterprise Linux-Abonnement erforderlich.
id: Red Hat memelihara image cloud resmi Red Hat Enterprise Linux. Langganan Red Hat Enterprise Linux valid diwajibkan untuk men-download image ini.
tr_tr: Red Hat resmi Red Hat Kurumsal Linux imajlarını dağıtır. Bu imajları indirmek için geçerli bir Red Hat Kurumsal Linux aboneliği gereklidir.

source: Remove the HWADDR line from ``/etc/sysconfig/network-scripts/ifcfg-eth0`` on Fedora-based images.
de: Entfernen Sie die HWADDR-Zeile aus ``/etc/sysconfig/network-scripts/ifcfg-eth0`` auf Fedora-basierten Abbildern.
id: Hapus baris HWADDR dari ``/etc/sysconfig/network-scripts/ifcfg-eth0`` image berbasis Fedora.
tr_tr: Fedora tabanlı imajlarda ``/etc/sysconfig/network-scripts/ifcfg-eth0`` dosyasından HWADDR satırını silin.

source: Replace ``/etc/udev/rules.d/70-persistent-net.rules`` with an empty file (contains network persistence rules, including MAC address).
de: Ersetzen Sie ``/etc/udev/rules.d/70-persistent-net.rules`` mit einer leeren Datei (enthält Netzwerk-Persistenzregeln, einschließlich MAC-Adresse).
id: Ganti ``/etc/udev/rules.d/70-persistent-net.rules`` dengan file kosong (berisi aturan kaku (persistence rule) jaringan, termasuk alamat MAC).
tr_tr: ``/etc/udev/rules.d/70-persistent-net.rules`` dosyasını boş bir dosyayla değiştirin (ağ kalıcılık kurallarını içerir, MAC adresleri de dahil).

source: Replace ``/lib/udev/rules.d/75-persistent-net-generator.rules`` with an empty file (this generates the file above).
de: Ersetzen Sie ``/lib/udev/rules.d/75-persistent-net-generator.rules`` mit einer leeren Datei (dies erzeugt die Datei oben).
id: Ganti ``/lib/udev/rules.d/75-persistent-net-generator.rules`` dengan file kosong (file ini menghasilkan file di atas).
tr_tr: ``/lib/udev/rules.d/75-persistent-net-generator.rules`` dosyasını boş bir dosyayla değiştirin (bu yukardaki dosyayı üretir).

source: Resize an image
de: Größe eines Abbildes ändern
id: Mengubah ukuran image
tr_tr: Bir imajı yeniden boyutlandırın

source: Resize the root file system. For example, ``resize2fs /dev/mapper/node-root``.
de: Ändern Sie die Größe des Root-Dateisystems. Zum Beispiel, ``resize2fs /dev/mapper/node-root``.
id: Ubah ukuran sistem file root. Sebagai contoh, ``resize2fs /dev/mapper/node-root``.
tr_tr: Kök dosya sistemini yeniden boyutlandırın. Örneğin ``resize2fs /dev/mapper/node-root``.

source: Resize the root volume file system.
de: Ändern Sie die Größe des Root-Volume-Dateisystems.
id: Mengubah ukuran sistem akar berkas volume.
tr_tr: Kök birim dosya sistemini yeniden boyutlandır.

source: Resource type association
de: Ressourcentyp-Assoziation
id: Asosiasi tipe sumber daya
tr_tr: Kaynak türü ilişkilendirme

source: Review the Ethernet status
de: Überprüfen Sie den Ethernet-Status
id: Ulas status Ethernet
tr_tr: Ethernet durumunu gözden geçirin

source: Run the :command:`osinfo-query os` command to see a range of allowed ``--os-variant`` options.
de: Führen Sie den Befehl :command:`osinfo-query os` aus, um eine Reihe von erlaubten` `--os-variant`` Optionen zu sehen.
id: Jalankan perintah :command:`osinfo-query os` untuk melihat rentang opsi yang diperbolehkan ``--os-variant``.
tr_tr: İzin verilen ``--os-variant`` seçenekleri aralığını görmek için :command:`osinfo-query os` komutunu çalıştırın.

source: Run the following command to convert a vmdk image file to a qcow2 image file.
de: Führen Sie den folgenden Befehl aus, um eine vmdk-Image-Datei in eine qcow2-Image-Datei zu konvertieren.
id: Jalankan perintah berikut untuk mengkonversi file image vmdk untuk file image qcow2.
tr_tr: Aşağıdaki komutu çalıştırarak bir vmdk imajını qcow2 imaj dosyasına çevirin.

source: Run the following command to convert a vmdk image file to a raw image file.
de: Führen Sie den folgenden Befehl aus, um eine vmdk-Abbilddatei in eine raw Abbilddatei zu konvertieren.
id: Jalankan perintah berikut untuk mengkonversi file image vmdk untuk file image mentah.
tr_tr: Bir vmdk imaj dosyasını raw imaj dosyasına dönüştürmek için aşağıdaki komutu çalıştırın.

source: Run the following command to save the changes:
de: Führen Sie den folgenden Befehl aus, um die Änderungen zu speichern:
id: Jalankan perintah berikut untuk menyimpan perubahan:
tr_tr: Değişiklikleri kaydetmek için aşağıdaki komutu çalıştırın:

source: Run the following commands from the host to eject the disk and reboot using ``virsh``, as root. If you are using ``virt-manager``, the commands below will work, but you can also use the GUI to detach and reboot it by manually stopping and starting.
de: Führen Sie die folgenden Befehle vom Host aus, um den Datenträger auszuwerfen und mit ``virsh`` als root neu zu starten. Wenn Sie ``virt-manager`` verwenden, funktionieren die folgenden Befehle, aber Sie können auch die GUI verwenden, um sie abzubrechen und neu zu starten, indem Sie manuell stoppen und starten.
id: Jalankan perintah berikut dari host untuk mengeluarkan disk dan reboot menggunakan ``virsh``, sebagai root. Jika Anda menggunakan ``virt-manager``, perintah di bawah ini akan bekerja, tetapi Anda juga dapat menggunakan GUI untuk melepaskan dan reboot dengan menghentikan dan memulai secara manual.
tr_tr: Sunucudan aşağıdaki komutları çalıştırarak diski çıkartın ve root olarak ``virsh`` kullanarak yeniden başlatın. ``virt-manager`` kullanıyorsanız yukardaki komutlar çalışacaktır, ama ayrıca GUI kullanarak da ayırma ve yeniden başlatmayı elle durdurup başlatarak yapabilirsiniz.

source: Run the following commands in the host as root to start up the machine again as paused, eject the disk and resume. If you are using ``virt-manager``, you may use the GUI instead.
tr_tr: Aşağıdaki komutları sunucuda çalıştırarak makineyi durdurulmuş olarak başlatın, diski çıkarın ve devam edin. ``virt-manager`` kullanıyorsanız, bunun yerine GUI kullanabilirsiniz.

source: Run the installer:
de: Führen Sie den Installer aus:
id: Jalankan installer:
tr_tr: Yükleyiciyi çalıştırın:

source: SSH server running
de: SSH-Server läuft
tr_tr: SSH sunucu çalışıyor

source: SUSE Studio
tr_tr: SUSE Stüdyo

source: SUSE maintains official SUSE Linux Enterprise Server cloud images. A valid SUSE Linux Enterprise Server subscription is required to download these images.
tr_tr: SUSE resmi SUSE Linux Kurumsal Sunucu bulut imajlarını tutar. Geçerli bir SUSE Linux Kurumsal Sunucu aboneliği bu imajları indirmek için gereklidir.

source: Second partition: A ``freebsd-ufs`` partition with a mount point of ``/`` with all remaining free space.
de: Zweite Partition: Eine ``freebsd-ufs``-Partition mit einem Einhängepunkt von ``/`` mit dem restlichen freien Platz.
id: Kedua partisi: Partisi `` freebsd-ufs`` dengan mount point dari ``/ `` dengan semua sisa ruang bebas .
tr_tr: İkinci bölüm: Geri kalan tüm boş alanı alan ``/`` bağlama noktasına sahip ``freebsd-ufs`` bölümü.

source: See `CentOS mirror page <https://www.centos.org/download/mirrors/>`_ to get a full list of mirrors, click on the ``HTTP`` link of a mirror to retrieve the web site name of a mirror.
de: Siehe `CentOS Mirrorseite <https://www.centos.org/download/mirrors/> `_, um eine vollständige Liste der Mirror zu erhalten, klicken Sie auf die` `HTTP`` Link eines Mirrors, um den Webseitennamen eines Mirrors abzurufen.
id: Lihat `CentOS mirror page <https://www.centos.org/download/mirrors/>`_ untuk mendapatkan daftar mirror penuh, klik pada link mirror ``HTTP`` untuk mengambil nama situs web untuk mirror.
tr_tr: Yansıların tam listesini almak için `CentOS yansı sayfasına <https://www.centos.org/download/mirrors/>`_ göz atın, yansının web sitesi ismini almak için ``HTTP`` bağlantısına tıklayın.

source: Select :guilabel:`Create` to create a partition table. This action is the default when no partition table exists. Then, select :guilabel:`GPT GUID Partition Table` from the list. This choice is the default.
de: Wählen Sie :guilabel: `Create`, um eine Partitionstabelle zu erstellen. Diese Aktion ist die Voreinstellung, wenn keine Partitionstabelle vorhanden ist. Dann wählen Sie :guilabel: `GPT GUID Partitionstabelle` aus der Liste. Diese Wahl ist die Voreinstellung.
id: Pilih :guilabel:`Create` untuk membuat tabel partisi. Tindakan ini menjadi default bila tidak ada tabel partisi dijumpai. Kemudian, pilih :guilabel:`GPT GUID Partition Table` dari daftar. Pilihan ini adalah default.
tr_tr: Bölüm tablosu oluşturmak için :guilabel:`Oluştur`u seçin. Bölümlendirme tablosu olmadığında bu eylem öntanımlıdır. Ardından listeden :guilabel:`GPT GUID Bölümlendirme Tablosu`nu seçin. Bu seçim öntanımlıdır.

source: Select :guilabel:`Finish` and then :guilabel:`Commit` to commit your changes.
de: Wählen Sie :guilabel: `Finish` und dann :guilabel:` Commit`, um Ihre Änderungen auszuführen.
id: Pilih :guilabel:`Finish` dan kemudian :guilabel:`Commit` untuk melakukan perubahan.
tr_tr: :guilabel:`Bitir`i seçin ve değişiklikleri kaydetmek için :guilabel:`Gönder`e tıklayın.

source: Select :guilabel:`Yes` when asked about installing the GRUB boot loader to the master boot record.
de: Wählen Sie :guilabel: `Yes`, wenn Sie nach der Installation des GRUB-Bootloaders auf den Master-Boot-Record gefragt werden.
id: Pilih :guilabel:`Yes` ketika ditanya tentang menginstal GRUB boot loader ke master boot record.
tr_tr: GRUB önyükleyiciyi ana önyükleme kaydına kurmanız istendiginde :guilabel:`Evet` seçin.

source: Select a mirror
de: Wählen eines Mirrors
id: Pilih mirror
tr_tr: Bir yansı seçin

source: Select a root password.
de: Wählen Sie ein Root-Passwort aus.
id: Pilih password root.
tr_tr: Bir root parolası seçin.

source: Select installation option
de: Wählen Sie die Installationsoption
id: Pilih opsi instalasi
tr_tr: Kurulum seçeneğini seçin

source: Select software to install
de: Software zum Installieren auswählen
id: Pilih perangkat lunak untuk dipasang
tr_tr: Kurulacak yazılımı seçin

source: Select the CMOS time zone.
de: Wählen Sie die CMOS-Zeitzone aus.
id: Pilih zona waktu CMOS.
tr_tr: CMOS zaman dilimini seçin.

source: Select the defaults for all of the remaining options. When the installation is complete, you will be prompted to remove the CD-ROM.
tr_tr: Kalan tüm seçenekler için öntanımlıları seçin. Kurulum tamamlandığında, CD-ROM'u çıkarmanız istenecek.

source: Select the time zone appropriate to your environment.
de: Wählen Sie die Zeitzone aus, die Ihrer Umgebung entspricht.
id: Pilih zona waktu yang sesuai dengan lingkungan Anda.
tr_tr: Ortamınıza uygun zaman dilimini seçin.

source: Serial port for logging: ``COM1``
de: Serieller Port für die Protokollierung: ``COM1``
id: Port serial untuk logging: ``COM1``
tr_tr: Kayıt için seri bağlantı noktası: ``COM1``

source: Set the disk format for your image to one of the following values:
de: Legen Sie das Festplattenformat für Ihr Abbild auf einen der folgenden Werte fest:
tr_tr: İmajınız için disk biçimini şu değerlerden biri olarak ayarlayın:

source: Set the root password
de: Legen Sie das Root-Passwort fest
id: Tetapkan kata sandinya
tr_tr: Root parolasını ayarlayın

source: Set up disk partitioning.
de: Festplattenpartitionierung einrichten
id: Atur partisi disk.
tr_tr: Disk bölümlendirmeyi ayarlayın.

source: Set up the console:
de: Richten Sie die Konsole ein:
id: Atur konsol:
tr_tr: Konsolu ayarlayın:

source: Sharing an image
de: Ein Abbild teilen
id: Berbagai image
tr_tr: Bir imajın paylaşılması

source: Shut down the instance
de: Schalten Sie die Instanz aus
id: Matikan instance
tr_tr: Sunucuyu kapatın

source: Software selection: OpenSSH server
de: Softwareauswahl: OpenSSH Server
id: Pemilihan software: OpenSSH server
tr_tr: Yazılım seçimi: OpenSSH sunucu

source: Some VNC clients replace : (colon) with ; (semicolon) and _ (underscore) with - (hyphen). If editing a file over a VNC session, make sure it is http: not http; and authorized_keys not authorized-keys.
de: Einige VNC-Clients ersetzen: (Doppelpunkt) mit; (Semikolon) und _ (Unterstrich) mit - (Bindestrich). Wenn Sie eine Datei über eine VNC-Sitzung bearbeiten, stellen Sie sicher, dass es http: nicht http ist. und authorized_keys nicht authorized-keys.
id: Beberapa klien VNC menggantikan : (colon) dengan ; (semicolon) and _ (underscore) dengan - (hyphen). Jika mengedit file selama sesi VNC, pastikan penggantian karakter itu seperti http: tidak http; dan authorized_keys tidak authorized-keys.
tr_tr: Bazı VNC istemcileri : (iki nokta) işaretini ; (noktalı virgül) ve _ (alt çizgi) işaretini - (tire) ile değiştirir. Dosyayı VNC oturumu üzerinden değiştiriyorsanız, http; değil http: ve authorized-keys değil authorized_keys olduğundan emin olun.

source: Some VNC clients replace the colon (``:``) with a semicolon (``;``) and the underscore (``_``) with a hyphen (``-``). Make sure to specify ``http:`` and not ``http;``. Make sure to specify ``authorized_keys`` and not ``authorized-keys``.
de: Einige VNC-Clients ersetzen den Doppelpunkt (``:``) mit einem Semikolon (``;``) und den Unterstrich (``_``) mit einem Bindestrich (``-``). Stellen Sie sicher, dass ``http:`` und nicht ``http;`` heisst. Achten Sie darauf, ``authorized_keys`` und nicht ``authorized-keys`` zu spezifizieren.
id: Beberapa klien VNC menggantikan colon (``:``) dengan semicolon (``;``) dan underscore (``_``) dengan hyphen (``-``). Pastikan untuk menentukan ``http:`` dan bukan ``http;``. Pastikan untuk menentukan ``authorized_keys`` dan bukan ``authorized-keys``.
tr_tr: Bazı VNC istemcileri iki noktayı (``:``) noktalı virgül ile (``;``) ve alt çizgiyi (``_``) tire ile (``-``) değiştirir. ``http;`` değil ``http:`` belirttiğinize emin olun. ``authorized-keys`` değil ``authorized_keys`` belirttiğinize emin olun.
