Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: Detect if any additional space is available on the disk. For example, parse the output of ``parted /dev/sda --script "print free"``.
de: Ermitteln Sie, ob auf der Festplatte zusätzlicher Speicherplatz vorhanden ist. Zum Beispiel, analysieren Sie die Ausgabe von ``parted /dev/sda --script "print free"``.
id: Lakkan deteksi jika ada ruang tambahan tersedia pada disk. Misalnya, mengurai output ``parted /dev/sda --script "print free"``.
tr_tr: Diskte ek bir alan olup olmadığını tanımalı. Örneğin, ``parted /dev/sda --script "print free"`` çıktısını ayrıştırabilir.

source: Disable firewall
de: Firewall deaktivieren
id: Firewall nonaktif
tr_tr: Güvenlik duvarını kapat

source: Disable the zeroconf route
de: Deaktivieren der Zeroconf-Route
id: Nonaktifkan rute zeroconf
tr_tr: Zeroconf rotasını kapatın

source: Disk and container formats for images
de: Festplatten- und Containerformate für Abbilder
id: Format disk dan kontainer untuk image
tr_tr: İmajlar için disk ve kapsayıcı biçimleri

source: Disk formats
de: Festplattenformate
tr_tr: Disk biçimleri

source: Disk partitioning is a critical element of the image creation process and the auto-generated default partitioning scheme does not work with ``bsd-cloudinit`` at this time.
de: Die Festplattenpartitionierung ist ein kritisches Element des Abbilderstellungsprozesses und das automatisch generierte Standardpartitionierungsschema funktioniert derzeit nicht mit ``bsd-cloudinit``.
id: Partisi disk adalah elemen penting dari proses pembuatan image dan susunan partisi yang auto-generated tidak bekerja dengan ``bsd-cloudinit`` saat ini.
tr_tr: Disk bölümlendirme imaj oluşturma sürecinin önemli bir elemanıdır ve otomatik üretilen öntanımlı bölümlendirme şeması şu an ``bsd-cloudinit`` ile çalışmamaktadır.

source: Disk partitions and resize root partition on boot (``cloud-init``)
de: Festplattenpartitionen und Resize-Root-Partition beim Booten (``cloud-init``)
id: Partisi disk dan mengubah ukuran partisi root pada boot (``cloud-init``)
tr_tr: Disk bölümleri ve önyüklemede kök bölümü yeniden boyutlandır (``cloud-init``)

source: Disk partitions and resize root partition on boot (cloud-init)
de: Festplattenpartitionen und Resize-Root-Partition beim Booten (cloud-Init)
id: Partisi disk dan mengubah ukuran partisi root pada boot (cloud-init)
tr_tr: Disk bölümleri ve önyüklemede kök bölümleri yeniden boyutlandır (cloud-init)

source: Do not attempt to use these tools to modify an image that is attached to a running virtual machine. These tools are designed only to modify the images that are not currently running.
de: Versuchen Sie nicht, diese Werkzeuge zu verwenden, um ein Abbild zu ändern, das an eine laufende virtuelle Maschine angehängt ist. Diese Werkzeuge sind nur dazu bestimmt, die momentan laufenden Abbilder zu modifizieren.
id: Jangan mencoba untuk menggunakan alat ini untuk memodifikasi image yang terpasang ke mesin virtual yang berjalan. Alat-alat ini dirancang hanya untuk memodifikasi image yang tidak sedang berjalan.
tr_tr: Bu araçları çalışan bir sanal makineye bağlı imajları değiştirmek için kullanmayın. Bu araçlar yalnızca henüz çalışmayan imajları değiştirmek üzere tasarlanmıştır.

source: Download a CentOS install ISO
de: Laden Sie ein CentOS-Installations-ISO herunter
id: Download sebuah file ISO install CentOS
tr_tr: Bir CentOS kurulum ISO'su indirin

source: Download a Fedora install ISO
de: Laden Sie eine Fedora-Installation-ISO herunter
id: Unduh pemasang Fedora ISO
tr_tr: Fedora kurulum ISO'su indirin

source: Download a Windows Server 2012 installation ISO. Evaluation images are available on the `Microsoft website <http://www.microsoft.com/en-us/evalcenter/ evaluate-windows-server-2012>`_ (registration required).
de: Laden Sie eine Windows Server 2012 Installations-ISO herunter. Evaluierungsabsbilder sind auf der Microsoft Website verfügbar <http://www.microsoft.com/en-us/evalcenter/ evaluate-windows-server-2012> `_ (Anmeldung erforderlich).
id: Download ISO instalasi Windows Server 2012. Image evaluasi tersedia di `Microsoft website <http://www.microsoft.com/en-us/evalcenter/ evaluate-windows-server-2012>`_ (pendaftaran diperlukan).
tr_tr: Windows Sunucu 2012 kurulum ISO'su indirin. Değerlendirme imajları `Microsoft web sitesinde <http://www.microsoft.com/en-us/evalcenter/ evaluate-windows-server-2012>`_ bulunur (kayıt gerekli).

source: Download an Ubuntu installation ISO
de: Laden Sie eine Ubuntu-Installations-ISO herunter
id: Download ISO instalasi Ubuntu
tr_tr: Bir Ubuntu kurulum ISO'su indirin

source: Download and install the ``Cloudbase-Init``:
de: Downloaden und installieren Sie die ``Cloudbase-Init``:
id: Download dan instal ``Cloudbase-Init``:
tr_tr: ``Cloudbase-Init``i indirin ve kurun:

source: Download the latest ``bsd-cloudinit-installer``. The download commands differ between FreeBSD 10.1 and 9.2 because of differences in how the :command:`fetch` command handles HTTPS URLs.
de: Laden Sie die neueste ``bsd-cloudinit-installer`` herunter. Die Download-Befehle unterscheiden sich zwischen FreeBSD 10.1 und 9.2 aufgrund von Unterschieden in wie der :command:`fetch` Befehl behandelt HTTPS URLs.
id: Lakukan download ``bsd-cloudinit-installer`` terkini. Perintah download berbeda antara FreeBSD 10.1 dan 9.2 karena perbedaan dalam bagaimana perintah :command:`fetch` menangani HTTPS URL.
tr_tr: En son ``bsd-cloudinit-installer``i indirin. İndirme komutları :command:`fetch` komutunun HTTPS URL'leri ele alma şeklinde değişiklik sebebiyle FreeBSD 10.1 ve 9.2 arasında değişiklik gösterir.

source: Download the signed VirtIO drivers ISO from the `Fedora website <https://fedoraproject.org/wiki/ Windows_Virtio_Drivers#Direct_download>`_.
tr_tr: `Fedora web sitesinden <https://fedoraproject.org/wiki/ Windows_Virtio_Drivers#Direct_download>`_ imzalı VirtIO sürücülerini indirin.

source: During the installation, remember to set the root password when prompted.
de: Achten Sie während der Installation darauf, das Root-Passwort festzulegen, wenn Sie dazu aufgefordert werden.
id: Selama instalasi, ingatlah untuk mengatur password root saat diminta.
tr_tr: Kurulum sırasında, sorulduğunda root parolasını ayarlamayı unutmayın.

source: Edit the ``/etc/default/grub`` file and configure the ``GRUB_CMDLINE_LINUX`` option. Delete the ``rhgb quiet`` and add ``console=tty0 console=ttyS0,115200n8`` to the option.
de: Bearbeiten Sie die ``/etc/default/grub`` Datei und konfigurieren Sie die ``GRUB_CMDLINE_LINUX`` Option. Löschen Sie die Option ``rhgb quiet`` und fügen Sie ``console=tty0 console=ttyS0,115200n8`` hinzu.
id: Edit file ``/etc/default/grub`` dan konfigurasi opsi ``GRUB_CMDLINE_LINUX``. Hapus ``rhgb quiet`` dan tambah ``console=tty0 console=ttyS0,115200n8`` ke opsi.
tr_tr: ``/etc/default/grub`` dosyasını düzenleyin ve ``GRUB_CMDLINE_LINUX`` seçeneğini yapılandırın. ``rhgb quiet`` yi silin ve seçeneğe ``console=tty0 console=ttyS0,115200n8`` ekleyin.

source: Edit the ``/etc/default/grub`` file and configure the ``GRUB_CMDLINE_LINUX`` option. Delete the ``rhgb quiet`` and add ``console=tty0 console=ttyS0,115200n8`` to the option. For example:
de: Bearbeiten Sie die ``/etc/default/grub`` Datei und konfigurieren Sie die ``GRUB_CMDLINE_LINUX`` Option. Löschen Sie die ``rhgb quiet`` und fügen Sie die ``console = tty0 console = ttyS0,115200n8`` Option hinzu. Beispielsweise:
id: Edit file ``/etc/default/grub`` dan konfigurasi opsi ``GRUB_CMDLINE_LINUX``. Hapus ``rhgb quiet`` dan tambahkan ``console=tty0 console=ttyS0,115200n8`` untuk pilihan. Sebagai contoh:
tr_tr: ``/etc/default/grub`` dosyasını düzenleyin ve ``GRUB_CMDLINE_LINUX`` seçeneğini düzenleyin. ``rhgb quiet`` alanını silin ve seçeneğe ``console=tty0 console=ttyS0,115200n8`` ekleyin. Örneğin:

source: Enable the VirtIO drivers.
de: Aktiviere die VirtIO-Treiber.
tr_tr: VirtIO sürücülerini etkinleştirin.

source: Ensure image writes boot log to console
de: Stellen Sie sicher, dass das Abbild das Bootprotokoll zur Konsole schreibt
id: Pastikan image menulis catatan booting (boot log) ke konsol
tr_tr: İmajın önyükleme kaydını konsola yazdığından emin olun

source: Ensure ssh server runs
de: Stellen Sie sicher, dass ssh-Server läuft
id: Pastikan server ssh berjalan
tr_tr: Ssh sunucunun çalıştığından emin olun

source: Ensure that the Ethernet setting is ``ON``. Additionally, make sure that ``IPv4 Settings' Method`` is ``Automatic (DHCP)``, which is the default.
de: Stellen Sie sicher, dass die Ethernet-Einstellung ``ON`` ist. Darüber hinaus stellen Sie sicher, dass ``IPv4 Einstellungsmethode`` Automatik (DHCP) ``die Standardeinstellung ist.
id: Pastikan pengaturan Ethernet adalah ``ON``. Selain itu, pastikan bahwa ``IPv4 Settings' Method`` adalah ``Automatic (DHCP) ``, yang merupakan default.
tr_tr: Ethernet ayarının ``AÇIK`` olduğundan emin olun. Ek olarak, ``IPv4 Ayarlama Yöntemi``nin öntanımlı değer olan ``Otomatik (DHCP)`` olduğundan emin olun.

source: Example guestfish session
de: Beispiel guestfish session
tr_tr: Örnek guestfish oturumu

source: Example: CentOS image
de: Beispiel: CentOS Abbild
id: Contoh: image CentOS
tr_tr: Örneğin: CentOS imajı

source: Example: Fedora image
de: Beispiel: Fedora Abbild
id: Contoh: image Fedora
tr_tr: Örnek: Fedora imajı

source: Example: FreeBSD image
de: Beispiel: FreeBSD-Abbild
id: Contoh: image FreeBSD
tr_tr: Örneğin: FreeBSD imajı

source: Example: Microsoft Windows image
de: Beispiel: Microsoft Windows-Abbild
id: Contoh: image Microsoft Windows
tr_tr: Örnek: Microsoft Windows imajı

source: Example: Ubuntu image
de: Beispiel: Ubuntu-Abbild
id: Contoh: image Ubuntu
tr_tr: Örnek: Ubuntu imajı

source: Extend the logical volume contained the root partition by the amount of space. For example, ``lvextend /dev/mapper/node-root /dev/sda6``.
de: Erweitern Sie das logische Volume, das die Root-Partition enthält, um den Platzbedarf. Zum Beispiel ``lvextend /dev/mapper/node-root /dev/sda6``.
id: Perluas volume logis yang terkandung partisi root dengan luasan ruang. Sebagai contoh, ``lvextend /dev/mapper/node-root /dev/sda6``.
tr_tr: Kök bölümü içeren mantıksal birimi boş alan miktarınca genişletin. Örneğin, ``lvextend /dev/mapper/node-root /dev/sda6``.

source: Extend the volume group with this physical partition. For example, ``vgextend vg00 /dev/sda6``.
de: Erweitern Sie die Volume-Gruppe mit dieser physischen Partition. Zum Beispiel, ``vgextend vg00 /dev/sda6``.
id: Perluas (extend) kelompok volume dengan partisi fisik ini. Sebagai contoh, ``vgextend vg00 /dev/sda6``.
tr_tr: Birim grubunu bu fiziksel bölümle genişletin. Örneğin, ``vgextend vg00 /dev/sda6``.

source: Final config
de: Endkonfiguration
id: Config akhir
tr_tr: Son yapılandırma

source: First partition: A 64 kB ``freebsd-boot`` partition with no mount point.
de: Erste Partition: A 64 kB ``freebsd-boot`` Partition ohne Einhängepunkt.
id: Partisi pertama: Partisi ``freebsd-boot`` 64 kB tanpa mount point.
tr_tr: İlk bölüm: Bağlama noktası olmayan 64 kB ``freebsd-boot`` bölümü.

source: First, we use :command:`virt-filesystems` to identify the partitions:
de: Zuerst verwenden wir :command:`virt-filesystems`, um die Partitionen zu identifizieren:
id: Pertama, kita menggunakan :command:`virt-filesystems` untuk mengidentifikasi partisi:
tr_tr: Önce bölümleri tanımlamak için :command:`virt-filesystems` kullanıyoruz:

source: Follow these steps to prepare the installation:
de: Gehen Sie folgendermaßen vor, um die Installation vorzubereiten:
id: Ikuti langkah ini untuk mempersiapkan instalasi:
tr_tr: Kurulumu hazırlamak için şu adımları takip edin:

source: For a Linux-based image to have full functionality in an OpenStack Compute cloud, there are a few requirements. For some of these, you can fulfill the requirements by installing the `cloud-init <https://cloudinit.readthedocs.org/en/latest/>`_ package. Read this section before you create your own image to be sure that the image supports the OpenStack features that you plan to use.
de: Für ein Linux-basiertes Abbild, das volle Funktionalität in einer OpenStack Compute Cloud hat, gibt es ein paar Anforderungen. Für einige von diesen können Sie die Anforderungen durch die Installation der `cloud-init <https://cloudinit.readthedocs.org/en/latest/> `_ Paket erfüllen. Lesen Sie diesen Abschnitt, bevor Sie Ihr eigenes Abbild erstellen, um sicherzustellen, dass das Abbild die OpenStack-Funktionen unterstützt, die Sie verwenden möchten.
id: Untuk image berbasis Linux untuk memiliki fungsi penuh dalam cloud OpenStack Compute, ada beberapa persyaratan. Untuk itui, Anda dapat memenuhi persyaratan dengan menginstal paket `cloud-init <https://cloudinit.readthedocs.org/en/latest/>`_. Baca bagian ini sebelum Anda membuat image Anda sendiri untuk memastikan bahwa image mendukung fitur OpenStack dimana Anda berencana untuk menggunakannya.
tr_tr: Linux tabanlı bir imajın OpenStack Hesaplama bulutunda tam işlevselliğe sahip olması için, bazı gereksinimler bulunur. Bunlardan bazıları için, gereksinimleri `cloud-init <https://cloudinit.readthedocs.org/en/latest/>`_ paketini kurarak sağlayabilirsiniz. İmajın kullanmayı planladığınız OpenStack özelliklerini desteklediğinden emin olmak için imajı oluşturmadan önce bu kısmı okuyun.

source: For example, the ``Netinstall Image`` is a good choice because it is a smaller image that downloads missing packages from the Internet during installation.
de: Zum Beispiel ist das `Netinstall Image`` eine gute Wahl, denn es ist ein kleineres Abbild, das während der Installation fehlende Pakete aus dem Internet herunterlädt.
id: Misalnya, ``Netinstall Image`` adalah pilihan yang baik karena ini adalah image yang lebih kecil yang mendownload paket hilang dari Internet saat instalasi.
tr_tr: Örneğin, ``Ağ Kurulum İmajı`` iyi bir seçimdir çünkü eksik paketleri kurulum sırasında internetten indiren küçük bir imajdır.

source: For example, to mount the root partition from our ``centos63_desktop.qcow2`` image to ``/mnt``, we can do:
de: Um beispielsweise die Root-Partition von unserem ``centos63_desktop.qcow2``-Abbild auf ``/mnt`` zu bringen, können wir:
id: Misalnya, untuk me-mount partisi root dari image kami ``centos63_desktop.qcow2``` ke ``/mnt``, kita dapat melakukan:
tr_tr: Örneğin, ``centos63_desktop.qcow2`` imajımızdan kök bölümü ``/mnt`` yoluna bağlamak için:

source: For example:
de: Beispielsweise:
id: Sebagai contoh:
tr_tr: Örneğin:

source: For information about the libvirt images in OpenStack, see `The life of an OpenStack libvirt image from Pádraig Brady <http://www.pixelbeat.org/docs/openstack_libvirt_images/>`_.
de: Für Informationen über die libvirt Abbilder in OpenStack, siehe `Das Leben eines OpenStack libvirt Abbild von Pádraig Brady <http://www.pixelbeat.org/docs/openstack_libvirt_images/> `_.
id: Untuk informasi tentang image libvirt di OpenStack, lihat `The life of an OpenStack libvirt image from Pádraig Brady <http://www.pixelbeat.org/docs/openstack_libvirt_images/>`_.
tr_tr: OpenStack'deki libvirt imajlarıyla ilgili bilgi için, bknz `Pádraig Brady'den bir OpenStack libvirt imajının yaşamı <http://www.pixelbeat.org/docs/openstack_libvirt_images/>`_.

source: For more information on configuring Grub, see the section called ":ref:`write-to-console`".
de: Weitere Informationen zum Konfigurieren von Grub finden Sie im Abschnitt ":ref:`write-to-console`".
id: Untuk informasi lebih lanjut tentang konfigurasi Grub, lihat bagian yang disebut ":ref:`write-to-console`".
tr_tr: Grub'u yapılandırmakla ilgili daha fazla bilgi için, ":ref:`write-to-console`" kısmına bakın.

source: For openSUSE and SUSE Linux Enterprise Server (SLES), custom images can also be built with a web-based tool called `SUSE Studio <https://susestudio.com>`_.
tr_tr: openSUSE ve SUSE Linux Kurumsal Sunucu (SLES) için, özel imajlar web tabanlı bir araç olan `SUSE Stüdyo <https://susestudio.com>`_ ile inşa edilebilir.

source: For some types of changes, you may find it easier to mount the image's file system directly in the guest. The ``guestmount`` program, also from the libguestfs project, allows you to do so.
de: Für einige Arten von Änderungen, ist es einfacher, das Abbild-Dateisystem direkt in den Gast zu montieren. Das ``guestmount`` Programm, auch aus dem libguestfs Projekt, ermöglicht es Ihnen, dies zu tun.
id: Untuk beberapa tipe perubahan, Anda mungkin akan lebih mudah untuk me-mount langsung sistem file image di guest. Program ``guestmount``, juga dari proyek libguestfs, memungkinkan Anda untuk melakukannya.
tr_tr: Bazı türde değişiklikler için, imajın dosya sistemini doğrudan misafire bağlamayı düşünebilirsiniz. Yine libguestfs projesinden gelen ``guestmount`` programı, bunu yapabilmenizi sağlar.

source: For the :command:`nova console-log` command to work properly on CentOS 7, you might need to do the following steps:
de: Damit der Befehl :command:`nova console-log` unter CentOS 7 funktioniert, müssen Sie möglicherweise die folgenden Schritte ausführen:
id: Untuk perintah :command: `nova console-log` untuk bekerja dengan baik di CentOS 7, Anda mungkin perlu melakukan langkah-langkah berikut:
tr_tr: :command:`nova console-log` komutunun CentOS 7'de düzgün çalışması için, aşağıdaki adımları tamamlamanız gerekebilir:

source: For the :command:`nova console-log` command to work properly on Fedora, you might need to do the following steps:
de: Für den Befehl :command:`nova console-log` müssen Sie möglicherweise die folgenden Schritte ausführen, um ordnungsgemäß auf Fedora zu arbeiten:
id: Untuk perintah :command: `nova console-log` untuk bekerja dengan baik di Fedora, Anda mungkin perlu melakukan langkah-langkah berikut:
tr_tr: :command:`nova console-log` komutunun Fedora'da düzgün çalışması için, şu adımları yapmanız gerekebilir:

source: For the instance to access the metadata service, you must disable the default zeroconf route:
de: Damit die Instanz auf den Metadatendienst zugreifen kann, müssen Sie die Standard-Zeroconf-Route deaktivieren:
id: Supaya instance dapat mengakses layanan metadata, Anda harus menonaktifkan rute zeroconf default:
tr_tr: Sununcunun metaveri servisine erişebilmesi için, öntanımlı zeroconf rotasını kapatmalısınız:

source: FreeBSD 9.2 :command:`fetch` does not support peer-verification for https. For FreeBSD 9.2, run this command:
de: FreeBSD 9.2 :command:`fetch` unterstützt keine Peer-Verifikation für https. Führen Sie für FreeBSD 9.2 diesen Befehl aus:
id: FreeBSD 9.2 :command:`fetch` tidak mendukung peer-verification untuk https. Untuk FreeBSD 9.2, jalankan perintah ini:
tr_tr: FreeBSD 9.2 :command:`fetch` https için eş onaylamayı desteklemez. FreeBSD 9.2 için şu komutu çalıştırın:

source: From inside the instance, as root:
de: Aus dem Inneren der Instanz, als root:
id: Dari dalam instance, sebagai root:
tr_tr: Sunucu içinden, root olarak:

source: From inside the instance, run as root:
de: Von der Instanz aus als root laufen lassen:
id: Dari dalam instance, jalankan sebagai root:
tr_tr: Sunucu içinden, root olarak şunu çalıştırın:

source: From the list of services to start on boot, you must select :guilabel:`ssh`. Optionally, select other services.
de: Aus der Liste der Dienste, die beim Booten starten, müssen Sie auswählen :guilabel:`ssh`. Optional können Sie andere Dienste auswählen.
id: Dari daftar layanan untuk memulai boot, Anda harus memilih :guilabel:`ssh`. Secara opsional, pilih layanan lainnya.
tr_tr: Önyüklemede başlatılacak servisler listesinden :guilabel:`ssh`ı seçmelisiniz. İsteğe bağlı olarak diğer servisleri de seçin.

source: Further customization could be accomplished by setting environment variables or adding elements to the command-line:
de: Eine weitere Anpassung könnte durch das Setzen von Umgebungsvariablen oder das Hinzufügen von Elementen zu der Befehlszeile erreicht werden:
id: Kustomisasi lebih lanjut dapat dicapai dengan menetapkan variabel lingkungan atau menambahkan elemen ke command-line:
tr_tr: Daha ince özelleştirme ortam değişkenleri ayarlayarak veya komut satırı elemanları ekleyerek yapılabilir:

source: Get images
de: Abbilder abrufen
id: Dapatkan images
tr_tr: İmajları al

source: Get the installer ISO:
de: Holen Sie sich das Installationsprogramm ISO:
id: Dapatkan ISO installer:
tr_tr: Kurulum ISO'sunu al:

source: Go further with guestfish
de: Gehen Sie weiter mit guestfish
id: Melangkah lebih jauh dengan guestfish
tr_tr: guestfish ile daha ileri gidin

source: Here is an example of how to use :command:`virt-resize` to resize an image. Assume we have a 16 GB Windows image in qcow2 format that we want to resize to 50 GB.
de: Hier ist ein Beispiel für die Verwendung :command:`virt-resize` zur Größenänderung eines Abbildes. Angenommen, wir haben ein 16 GB Windows-Image im qcow2-Format, das wir auf 50 GB ändern möchten.
id: Berikut adalah contoh bagaimana menggunakan :command:`virt-resize` untuk mengubah ukuran image. Anggaplah kita memiliki image Windows 16 GB dalam format qcow2 dimana kita ingin mengubah ukuran menjadi 50 GB.
tr_tr: Burda da :command:`virt-resize` kullanarak bir imajın yeniden boyutlandırılması gösteriliyor. 50 GB olarak boyutlandırmak istediğimiz 16 GB boyutunda ve qcow2 biçiminde bir Windows imajımız olduğunu düşünelim.

source: Hostname
tr_tr: Makine Adı

source: If ``console=tty0 console=ttyS0,115200n8`` does not appear, you must modify your grub configuration. In general, you should not update the ``grub.cfg`` directly, since it is automatically generated. Instead, you should edit the ``/etc/default/grub`` file and modify the value of the ``GRUB_CMDLINE_LINUX_DEFAULT`` variable:
de: Wenn ``console=tty0 console=ttyS0,115200n8`` nicht angezeigt wird, müssen Sie Ihre Grub-Konfiguration ändern. Im Allgemeinen sollten Sie die `` grub.cfg`` nicht direkt aktualisieren, da sie automatisch generiert wird. Stattdessen sollten Sie die ``/etc/default/grub`` Datei bearbeiten und den Wert der ``GRUB_CMDLINE_LINUX_DEFAULT`` Variable ändern:
id: Jika ``console = tty0 console = ttyS0,115200n8`` tidak muncul, Anda harus memodifikasi konfigurasi grub Anda. Secara umum, Anda seharusnya tidak mengupdate ``grub.cfg`` secara langsung, karena dibuat secara otomatis. Sebagai gantinya, Anda harus mengedit file ``/etc/default/grub`` dan mengubah nilai variabel ``GRUB_CMDLINE_LINUX_DEFAULT``:
tr_tr: ``console=tty0 console=ttyS0,115200n8`` görünmezse, grub yapılandırmanızı değiştirmeniz gerekir. Genellikle ``grub.cfg`` dosyasını doğrudan düzenlememeniz gerekir, çünkü otomatik olarak üretilir. Bunun yerine ``/etc/default/grub`` dosyasını düzenlemeli ve ``GRUB_CMDLINE_LINUX_DEFAULT`` değişkeninin değerini değiştirmelisiniz:

source: If both the XenAPI agent and ``cloud-init`` are present in an image, ``cloud-init`` handles ssh-key injection. The system assumes ``cloud-init`` is present when the image has the ``cloud_init_installed`` property.
de: Wenn sowohl der XenAPI-Agent als auch ``cloud-init`` in einem Abbild vorhanden sind, behandelt ``cloud-init`` die ssh-Schlüssel-Injektion. Das System setzt voraus, dass ``cloud-init`` vorhanden ist, wenn das Abbild die ``cloud_init_installed`` Eigenschaft hat.
id: Jika agen XenAPI dan ``cloud-init`` berada dalam image, ``cloud-init`` akan menangani injeksi ssh-key. Sistem ini mengasumsikan bahwa ``cloud-init`` ada ketika image memiliki ``properti cloud_init_installed``.
tr_tr: Bir imajda hem XenAPI aracısı hem de ``cloud-init`` mevcutsa, ssh anahtarı eklemeyi ``cloud-init`` ele alır. İmajda ``cloud_init_intalled`` özelliği mevcutsa sistem ``cloud-init``in mevcut olduğunu varsayar.
