Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: This Oz template specifies where to download the Centos 6.4 install ISO. Oz will use the version information to identify which kickstart file to use. In this case, it will be `RHEL6.auto <https://github.com/clalancette/oz/blob/master/oz/auto/RHEL6.auto>`_. It adds EPEL as a repository and install the ``epel-release``, ``cloud-utils``, and ``cloud-init`` packages, as specified in the ``packages`` section of the file.
de: Diese Oz-Vorlage gibt an, wo das Centos 6.4 install ISO heruntergeladen werden soll. Oz verwendet die Versionsinformationen, um zu identifizieren, welche Kickstart-Datei verwendet werden soll. In diesem Fall wird es 'RHEL6.auto' sein <https://github.com/clalancette/oz/blob/master/oz/auto/RHEL6.auto> `_. Es fügt EPEL als Repository hinzu und installiert die ``epel-release``, `` cloud-utils`` und ``cloud-init`` Pakete, wie im ``packages`` Abschnitt der Datei angegeben.
id: Template Oz ini menetapkan dimana untuk men-download Centos 6.4 install ISO. Oz akan menggunakan informasi versi untuk mengidentifikasi file kickstart untuk digunakan. Dalam hal ini, template itu akan menjadi `RHEL6.auto <https://github.com/clalancette/oz/blob/master/oz/auto/RHEL6.auto>`_. Template menambahkan EPEL sebagai repositori dan menginstal paket ``epel-release``, ``cloud-utils``, dan ``cloud-init``, sebagaimana ditetapkan dalam bagian ``packages`` dari file.
tr_tr: Bu Oz şablonu Centos 6.4 kurulum ISO'sunun nereye indirileceğini belirtir. Oz sürüm bilgisini kullanarak hangi kickstart dosyasını kullanacağını tanımlar. Bu durumda, `RHEL6.auto <https://github.com/clalancette/oz/blob/master/oz/auto/RHEL6.auto>`_. EPEL'i bir depo olarak ekler ve ``epel-release``, ``cloud-utils``, ve ``cloud-init`` paketlerini, dosyanın ``packages`` kısmında belirtildiği gibi kurar.

source: This VM must also have Internet access to download packages.
de: Diese VM muss auch über einen Internet-Zugang zum Herunterladen von Paketen verfügen.
id: VM ini juga harus memiliki akses Internet untuk men-download paket.
tr_tr: Bu sanal makine paketleri indiribilmek için internet erişimine de ihtiyaç duyar.

source: This example creates a Windows Server 2012 qcow2 image, using the :command:`virt-install` command and the KVM hypervisor.
de: Dieses Beispiel erstellt ein Windows Server 2012 qcow2-Abbild mit dem Befehl :command:`virt-install` und dem KVM-Hypervisor.
id: Contoh ini membuat image qcow2 Windows Server 2012, dengan menggunakan: perintah :command:`virt-install` dan hypervisor KVM.
tr_tr: Bu örnek :command:`virt-install` komutu ve KVM hipervizörü ile bir Windows Sunucu 2012 qcow2 imajı oluşturur.

source: This example creates a generic, bootable Ubuntu image of the latest release.
de: Dieses Beispiel erstellt ein generisches, bootfähiges Ubuntu-Abbild der neuesten Version.
id: Contoh ini membuat image generik, Ubuntu bootable dari rilis terbaru.
tr_tr: Bu örnek genel, ön yüklenebilir bir son sürüm Ubuntu imajı oluşturur.

source: This example creates a minimal FreeBSD image that is compatible with OpenStack and ``bsd-cloudinit``. The ``bsd-cloudinit`` program is independently maintained and in active development. The best source of information on the current state of the project is at `bsd-cloudinit <http://pellaeon.github.io/bsd-cloudinit/>`_.
de: Dieses Beispiel erzeugt ein minimales FreeBSD-Abbild, das mit OpenStack und ``bsd-cloudinit`` kompatibel ist. Das ``bsd-cloudinit`` Programm ist unabhängig gepflegt und aktiv. Die beste Informationsquelle über den aktuellen Stand des Projektes ist `bsd-cloudinit<http://pellaeon.github.io/bsd-cloudinit/>`_.
id: Contoh ini menciptakan image FreeBSD minimal yang kompatibel dengan OpenStack dan ``bsd-cloudinit``. Program ``bsd-cloudinit`` secara independen dipertahankan dan aktif dalam pembangunan. Sumber terbaik informasi tentang keadaan saat ini untuk proyek ini berada di `bsd-cloudinit <http://pellaeon.github.io/bsd-cloudinit/>`_.
tr_tr: Bu örnek OpenStack ve ``bsd-cloudinit`` ile uyumlu asgari bir FreeBSD imajı oluşturur. ``bsd-cloudinit`` programı bağımsız olarak yönetilir ve etkin şekilde geliştirilmektedir. Projenin mevcut durumuyla ilgili en iyi bilgi kaynağı `bsd-cloudinit <http://pellaeon.github.io/bsd-cloudinit/>`_ adresindedir.

source: This example installs an Ubuntu 14.04 (Trusty Tahr) image. To create an image for a different version of Ubuntu, follow these steps with the noted differences.
tr_tr: Bu örnek Ubuntu 14.04 (Trusty Tahr) imajı kurar. Farklı sürüm bir Ubuntu için imaj oluşturmak için, belirtilen farklılıklarla bu adımları takip edin.

source: This example shows how to create a FreeBSD 10 image. To create a FreeBSD 9.2 image, follow these steps with the noted differences.
de: Dieses Beispiel zeigt, wie ein FreeBSD 10-Abbild erstellt wird. Um ein FreeBSD 9.2-Abbild zu erstellen, folgen Sie diesen Schritten mit den angegebenen Unterschieden.
id: Contoh ini menunjukkan bagaimana untuk membuat image FreeBSD 10. Untuk membuat image FreeBSD 9.2, ikuti langkah-langkah berikut dan perhatikan perbedaan keduanya.
tr_tr: Bu örnek FreeBSD 10 imajı oluşturmayı gösterir. FreeBSD 9.2 imajı oluşturmak için gerekli değişikliklerle beraber bu adımları takip edin.

source: This example shows how to use :command:`virt-edit` to modify a file. The command can take either a filename as an argument with the ``-a`` flag, or a domain name as an argument with the ``-d`` flag. The following examples shows how to use this to modify the ``/etc/shadow`` file in instance with libvirt domain name ``instance-000000e1`` that is currently running:
de: Dieses Beispiel zeigt, wie man :command:`virt-edit` verwendet, um eine Datei zu ändern. Der Befehl kann entweder einen Dateinamen als Argument mit dem ``-a``-Flag oder einen Domain-Namen als Argument mit dem ``-d``-Flag enthalten. Die folgenden Beispiele zeigen, wie man die Datei ``/etc/shadow`` in der Instanz mit dem libvirt Domainnamen ``instance-000000e1``, der gerade läuft,
id: Contoh ini menunjukkan bagaimana menggunakan :command: `virt-edit` untuk memodifikasi file. Perintah dapat mengambil nama file sebagai argumen dengan flag ``-a``, ataupun nama domain sebagai argumen dengan flag ``-d``. Contoh berikut menunjukkan bagaimana menggunakan ini untuk memodifikasi file ``/etc/shadow`` dalam instance dengan nama domain libvirt ``instance-000000e1`` yang saat ini sedang berjalan:
tr_tr: Bu örnek :command:`virt-edit` kullanarak bir dosyanın değiştirilmesini gösteriyor. Komut değişken olarak ``-a`` ile bir dosya ismi alabilir veya ``-d`` bayrağıyla bir alan adı alabilir. Aşağıdaki örnekler çalışan ve libvirt alan adı ``instance-000000e1`` olan bir sunucu içinde ``/etc/shadow`` dosyasının nasıl olacağını gösterir:

source: This example shows you how to install a CentOS image and focuses mainly on CentOS 7. Because the CentOS installation process might differ across versions, the installation steps might differ if you use a different version of CentOS.
de: Dieses Beispiel zeigt Ihnen, wie Sie ein CentOS-Abbild installieren und konzentrieren sich hauptsächlich auf CentOS 7. Da der CentOS-Installationsvorgang möglicherweise in Versionen abweicht, können sich die Installationsschritte unterscheiden, wenn Sie eine andere Version von CentOS verwenden.
id: Contoh ini menunjukkan Anda bagaimana untuk menginstal image CentOS dan berfokus terutama pada CentOS 7. Karena proses instalasi CentOS mungkin berbeda di berbagai versi, langkah instalasi mungkin berbeda jika Anda menggunakan versi yang berbeda dari CentOS.
tr_tr: Bu örnek bir CentOS imajını nasıl kuracağınız gösterir ve temelde CentOS 7 üzerine yoğunlaşır. CentOS kurulumu sürümler arasında farklılık gösterebileceğinden, farklı bir CentOS sürümü kullanırsanız kurulum adımları değişebilir.

source: This example shows you how to install a Fedora image and focuses mainly on Fedora 25. Because the Fedora installation process might differ across versions, the installation steps might differ if you use a different version of Fedora.
de: Dieses Beispiel zeigt Ihnen, wie Sie ein Fedora-Image installieren und konzentrieren sich hauptsächlich auf Fedora 25. Da der Installationsvorgang von Fedora sich in Versionen unterscheiden könnte, können sich die Installationsschritte unterscheiden, wenn Sie eine andere Version von Fedora verwenden.
id: Contoh ini menunjukkan cara memasang image Fedora dan berfokus terutama pada Fedora 25. Karena proses instalasi Fedora mungkin berbeda di seluruh versi, langkah-langkah pemasangan mungkin berbeda jika Anda menggunakan versi Fedora yang berbeda.
tr_tr: Bu örnek bir Fedora imajını nasıl yükleyeceğinizi gösterir ve Fedora 25'e odaklanır. Fedora kurulum süreci sürümden sürüme farklılık gösterebileceğinden, kurulum adımları farklı bir Fedora sürümü kullanıyorsanız farklı olabilir.

source: This example will convert a raw image file named ``image.img`` to a qcow2 image file.
de: Dieses Beispiel konvertiert eine raw Abbilddatei mit dem Namen `` image.img`` in eine qcow2 Abbilddatei.
id: Contoh ini akan mengkonversi file image mentah bernama ``image.img`` ke file image qcow2.
tr_tr: Bu örnek ``image.img`` isimli raw imaj dosyasını qcow2 imaj dosyasına dönüştürecek.

source: This guide describes how to obtain, create, and modify virtual machine images that are compatible with OpenStack.
de: In diesem Handbuch wird beschrieben, wie Sie virtuelle Maschinenbilder erhalten, erstellen und modifizieren, die mit OpenStack kompatibel sind.
id: Panduan ini menjelaskan cara untuk mendapatkan, membuat, dan memodifikasi image mesin virtual yang kompatibel dengan OpenStack.
tr_tr: Bu kılavuz OpenStack ile uyumlu sanal makine imajlarını nasıl elde edeceğinizi, oluşturacağınızı ve değiştireceğinizi anlatır.

source: This is a virtual machine image in raw format, as described above.
de: Dies ist ein virtuelles Maschinenbild im Raw-Format, wie oben beschrieben.
tr_tr: Bu raw biçiminde bir sanal makine imajı, yukarıda tanımlandığı gibi.

source: This menu enables you to update previous settings. Check that the settings are correct, and click :guilabel:`exit`.
de: In diesem Menü können Sie die vorherigen Einstellungen aktualisieren. Überprüfen Sie, ob die Einstellungen korrekt sind, und klicken Sie auf :guilabel:`exit`.
id: Menu ini memungkinkan Anda untuk memperbarui pengaturan sebelumnya. Periksa apakah pengaturan sudah benar, dan klik :guilabel:`exit`.
tr_tr: Bu menü önceki ayarları güncellemenizi sağlar. Ayarların doğru olduğunu kontrol edin, ve :guilabel:`çıkış`a tıklayın.

source: This sets console output to go to the serial console, which is displayed by :command:`nova consolelog`, and the video console for sites with VNC or Spice configured.
de: Dies setzt die Konsolenausgabe auf die serielle Konsole, die angezeigt wird durch :command:`nova consolelog` und die Videokonsole für Seiten mit VNC oder Spice konfiguriert.
id: Pengaturan ini menetapkan keluaran konsol melalui konsol serial, yang ditampilkan oleh :command:`nova consolelog`, dan konsol video untuk situs dengan VNC atau Spice yang dikonfigurasi.
tr_tr: Bu konsol çıktısını seri konsola gidecek şekilde ayarlar, bu da :command:`nova consolelog` ile ve VNC veya Spice yapılandırılmış siteler için video konsoluyla görüntülenebilir.

source: This starts a guestfish session.
de: Hier beginnt eine Gastfisch-Session.
id: Disini memulai sesi guestfish.
tr_tr: Bu bir guestfish oturumu başlatır.

source: To allow the :term:`Cloudbase-Init` to run scripts during an instance boot, set the PowerShell execution policy to be unrestricted:
de: Um den Begriff :term:`Cloudbase-Init` zum Ausführen von Skripts während eines Instanzstarts zuzulassen, legen Sie die PowerShell-Ausführungsrichtlinie für uneingeschränkt fest:
id: Untuk mengizinkan :term:`Cloudbase-Init` untuk menjalankan skrip selama instance boot, menetapkan kebijakan eksekusi PowerShell untuk tidak dibatasi:
tr_tr: Sunucu önyüklenirken :term:`Cloudbase-Init` in betik çalıştırmasına izin vermek için, PowerShell çalıştırma ilkesini kısıtlamasız olarak ayarlayın:

source: To build an image, call the following script:
de: Um ein Abbild zu erstellen, rufen Sie das folgende Skript auf:
id: Untuk membangun image, panggil skrip berikut:
tr_tr: Bir imaj inşa etmek için, aşağıdaki betikleri çağırın:

source: To create a new image, you will need the installation CD or DVD ISO file for the guest operating system. You will also need access to a virtualization tool. You can use KVM for this. Or, if you have a GUI desktop virtualization tool (such as, VMware Fusion or VirtualBox), you can use that instead. Convert the file to raw once you are done.
de: Um ein neues Abbild zu erstellen, benötigen Sie die Installations-CD oder DVD-ISO-Datei für das Gastbetriebssystem. Sie benötigen auch Zugriff auf ein Virtualisierungswerkzeug. Hierfür können Sie KVM verwenden. Oder wenn Sie ein GUI-Desktop-Virtualisierungs-Tool (wie zB VMware Fusion oder VirtualBox) haben, können Sie das stattdessen verwenden. Konvertieren Sie die Datei zu raw, sobald Sie fertig sind.
id: Untuk membuat image baru, Anda akan memerlukan CD instalasi atau file ISO DVD untuk sistem operasi guest (tamu). Anda juga akan memerlukan akses ke alat virtualisasi. Anda dapat menggunakan KVM untuk ini. Atau, jika Anda memiliki alat virtualisasi desktop GUI (seperti, VMware Fusion atau VirtualBox), Anda dapat menggunakannya. Lakukan konversi file ke raw (baku) setelah Anda menyelesaikannya.
tr_tr: Yeni bir imaj oluşturmak için, misafir işletim sistemi için kurulum CD veya DVD ISO dosyasına ihtiyacınız olacak. Ayrıca bir sanallaştırma aracına ihtiyacınız var. Bunun için KVM kullanabilirsiniz. Veya bir GUI masa üstü sanallaştırma aracınız varsa (VMware Fusion veya VirtualBox gibi) bunu kullanabilirsiniz. İşiniz bittiğinde dosyayı raw'a dönüştürün.

source: To eject a disk by using the :command:`virsh` command, libvirt requires that you attach an empty disk at the same target that the CD-ROM was previously attached, which may be ``hda``. You can confirm the appropriate target using the :command:`virsh dumpxml vm-image` command.
de: Zum Auswerfen eines Datenträgers mit dem Befehl :comand: `virsh` erfordert libvirt, dass Sie eine leere Disk an derselben Stelle anhängen, auf der die CD-ROM zuvor angeschlossen war, was möglicherweise` `hda`` ist. Sie können das entsprechende Ziel mit dem Befehl :command:'virsh dumpxml vm-image' bestätigen.
id: Untuk mengeluarkan disk dengan menggunakan perintah :command:`virsh`, libvirt mengharuskan Anda memasang disk kosong pada target yang sama dengan CD-ROM yang sebelumnya terpasang, yang mungkin adalah ``hda``. Anda bisa mengkonfirmasi target yang sesuai dengan perintah :command:`virsh dumpxml vm-image`.
tr_tr: :command:`virsh` komutunu kullanarak bir diski çıkarmak için, libvirt CD-ROM'un daha önce bağlı olduğu aynı hedefe boş bir disk eklemenizi gerektirir, bu ``hda`` olabilir. Uygun hedefi :command:`virsh dumpxml vm-image` komutuyla doğrulayabilirsiniz.

source: To eject a disk using :command:`virsh`, libvirt requires that you attach an empty disk at the same target that the CDROM was previously attached, which should be ``hdc``. You can confirm the appropriate target using the :command:`virsh dumpxml vm-image` command.
tr_tr: :command:`virsh` kullanarak diski çıkarmak için, libvirt CD-ROM'un daha önce ekli olduğu aynı hedefe ``hdc`` olması gereken boş bir disk eklemenizi gerektirir. :command:`virsh dumpxml vm-image` komutuyla uygun hedefi doğrulayabilirsiniz.

source: To enable the hypervisor to reboot or shutdown an instance, you must install and run the ``acpid`` service on the guest system.
de: Um den Hypervisor zum Neustarten oder Herunterfahren einer Instanz zu aktivieren, müssen Sie den ``acpid`` Service auf dem Gast-System installieren und ausführen.
id: Untuk mengaktifkan hypervisor untuk reboot atau shutdown suatu instance, Anda harus menginstal dan menjalankan layanan ``acpid`` pada sistem guest.
tr_tr: Hipervizörün bir sunucuyu yeniden başlatabilmesi ya da kapatabilmesi için, ``acpid`` sunucusunu misafir sistemde kurmalı ve çalıştırmalısınız.

source: To export the definitions in JSON format:
de: Um die Definitionen im JSON-Format zu exportieren:
id: Untuk mengekspor definisi dalam format JSON:
tr_tr: Tanımları JSON biçiminde dışa aktarmak için:

source: To fetch the ssh public key and add it to the root account, edit the ``/etc/rc.local`` file and add the following lines before the line ``touch /var/lock/subsys/local``. This code fragment is taken from the `rackerjoe oz-image-build CentOS 6 template <https://github.com/ rackerjoe/oz-image-build/blob/master/templates/centos60_x86_64.tdl>`_.
de: Um den ssh-öffentlichen Schlüssel abzurufen und dem Root-Account hinzuzufügen, editiere die Datei ``/etc/rc.local`` und füge folgende Zeilen vor der Zeile `` touch /var/lock/subsys/local`` hinzu. Dieses Code-Fragment wird aus der `rackerjoe oz-image-build CentOS 6 Vorlage genommen <https://github.com/ rackerjoe/oz-image-build/blob/master/templates/centos60_x86_64.tdl> `_.
id: Untuk mengambil kunci publik ssh dan menambahkannya ke account root, edit file ``/etc/rc.local`` dan tambahkan baris berikut sebelum baris ``touch /var/lock/subsys/local``. Fragmen kode ini diambil dari `rackerjoe oz-image-build CentOS 6 template <https://github.com/ rackerjoe/oz-image-build/blob/master/templates/centos60_x86_64.tdl>`_.
tr_tr: Ssh açık anahtarını çekip root hesabına eklemek için, ``/etc/rc.local`` dosyasını düzenleyin ve ``touch /var/lock/subsys/local`` satırından önce şu satırları ekleyin. Bu kod parçası `rackerjoe oz-image-build CentOS 6 şablonundan <https://github.com/ rackerjoe/oz-image-build/blob/master/templates/centos60_x86_64.tdl>`_ alınmıştır.

source: To import it into libvirt with :command:`virsh`:
de: Um es in libvirt zu importieren mit :command:`virsh`:
id: Mengimpornya ke libvirt dengan :command:`virsh`:
tr_tr: :command:`virsh` ile libvirt'e aktarmak için:

source: To install the operating system, complete the following steps inside the VM:
de: Um das Betriebssystem zu installieren, füllen Sie die folgenden Schritte innerhalb der VM aus:
id: Untuk menginstal sistem operasi, lakukan langkah berikut dalam VM:
tr_tr: İşletim sistemini yüklemek için, sanal makine içinde aşağıdaki adımları tamamlayın:

source: To keep things brief, we will sometimes use the term ``image`` instead of virtual machine image.
de: Um die Dinge kurz zu halten, werden wir manchmal den Begriff ``image`` anstelle des virtuellen Maschinenbildes verwenden.
id: Supaya menjadil singkat, kita kadang-kadang menggunakan istilah ``image`` dari pada image mesin virtual.
tr_tr: Kısa ve öz tutmak için, sanal makine imajı yerine bazen ``imaj`` diyeceğiz.

source: To list the operating systems available to install:
de: Um die zur Installation verfügbaren Betriebssysteme aufzulisten:
id: Untuk daftar sistem operasi yang tersedia untuk menginstal:
tr_tr: Kurulabilir işletim sistemlerini listelemek için:

source: To mount the second partition, as root:
de: Um die zweite Partition als root zu installieren:
id: Untuk me-mount partisi kedua, sebagai root:
tr_tr: İkinci bölümü bağlamak için, root olarak:

source: To run this:
de: Um dies zu starten:
id: Untuk menjalankan ini:
tr_tr: Bunu çalıştırmak için:

source: To see how the settings affect the deletion of a running instance, check the directory where the images are stored:
de: Um zu sehen, wie sich die Einstellungen auf das Löschen einer laufenden Instanz auswirken, überprüfen Sie das Verzeichnis, in dem die Abbilder gespeichert sind:
tr_tr: Ayarların çalışan bir sunucunun silinmesini nasıl etkilediğini görmek için, imajları kaydedildiği dizini kontrol edin:

source: To set the metadata source to be used by the image run the :command:`dpkg-reconfigure` command against the ``cloud-init`` package. When prompted select the :guilabel:`EC2` data source:
de: Um die Metadatenquelle festzulegen, die vom Abbild verwendet werden soll, rufen Sie den :command:`dpkg-reconfigure` gegen das ``cloud-init``-Paket auf. Wenn Sie dazu aufgefordert werden, wählen Sie :guilabel:`EC2` Datenquelle:
id: Untuk mengatur sumber metadata yang akan digunakan oleh image jalankan perintah :command:`dpkg-reconfigure` terhadap paket ``cloud-init``. Ketika diminta (prompt) pilihlah sumber data :guilabel:`EC2`:
tr_tr: İmaj tarafından kullanılacak metaveri kaynağını ayarlamak için ``cloud-init`` paketi için :command:`dpkg-reconfigure` komutunu çalıştırın. Sorulduğunda :guilabel:`EC2` veri kaynağını seçin:

source: To unload the files from the database:
de: Um die Dateien aus der Datenbank zu entladen:
id: Untuk membongkar file dari database:
tr_tr: Dosyaları veritabanından çıkarmak için:

source: To verify that the libvirt ``default`` network is enabled, use the :command:`virsh net-list` command and verify that the ``default`` network is active:
de: Um zu überprüfen, ob das libvirt ``default`` Netzwerk aktiviert ist, verwenden Sie den Befehl :command:`virsh net-list` und vergewissern Sie sich, dass das ``default`` Netzwerk aktiv ist:
id: Untuk memverifikasi bahwa jaringan ``default`` libvirt diaktifkan, gunakan perintah :command:`virsh net-list` dan memverifikasi bahwa jaringan ``default`` aktif:
tr_tr: Libvirt ``öntanımlı`` ağının etkin olduğunu doğrulamak için, :command:`virsh net-list` komutunu kullanın ve ``öntanımlı`` ağın etkin olduğunu doğrulayın:

source: Tool support for image creation
de: Werkzeugunterstützung für die Abbilderstellung
id: Alat yang mendukungan untuk pembuatan image
tr_tr: İmaj oluşturma için araç desteği

source: Ubuntu Enterprise Cloud refers to a discontinued Eucalyptus-based Ubuntu cloud solution that has been replaced by the OpenStack-based Ubuntu Cloud Infrastructure.
de: Ubuntu Enterprise Cloud bezieht sich auf eine abgebrochene Eucalyptus-basierte Ubuntu-Cloud-Lösung, die durch die OpenStack-basierte Ubuntu Cloud Infrastructure ersetzt wurde.
tr_tr: Ubuntu Kurumsal Bulutu devam ettirilmeyen, OpenStack tabanlı Ubuntu Bulut Altyapısı ile değiştirilmiş bir Eucalyptus tabanlı Ubuntu bulut çözümüne başvurur.

source: Undefine the libvirt domain
de: Undefinieren Sie die libvirt Domain
id: Tak ada penetapan domain libvirt
tr_tr: libvirt alanı tanımını kaldır

source: Use :command:`virt-manager` or :command:`virt-viewer` to connect to the VM and start the Windows installation.
de: Verwenden Sie :command:`virt-manager` oder :command:`virt-viewer`, um eine Verbindung zur VM herzustellen und die Windows-Installation zu starten.
id: Gunakan :command:`virt-manager` atau :command:`virt-viewer` untuk menghubungkan ke VM dan memulai instalasi Windows.
tr_tr: Sanal makineye bağlanmak ve Windows kurulumunu başlatmak için :command:`virt-manager` veya :command:`virt-viewer` kullanın.

source: Use cloud-init to fetch the public key
de: Verwenden Sie cloud-init, um den öffentlichen Schlüssel zu holen
id: Gunakan cloud-init untuk mengambil kunci publik (public key).
tr_tr: cloud-init kullanarak açık anahtarı çekin
