Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: Use options in the ``nova.conf`` file to control whether, and for how long, unused base images are stored in the ``/var/lib/nova/instances/_base/``. If you have configured live migration of instances, all your compute nodes share one common ``/var/lib/nova/instances/`` directory.
de: Verwenden Sie die Optionen in der ``nova.conf`` Datei, um zu steuern, ob und wie lange unbenutzte Basisbilder im ``/var/lib/nova/instances/_base / `` gespeichert sind. Wenn Sie die Live-Migration von Instanzen konfiguriert haben, teilen sich alle Ihre Compute-Knoten ein gemeinsames `` /var/lib/nova/instances/`` Verzeichnis.
id: Gunakan opsi di file ``nova.conf`` untuk mengontrol apakah, dan untuk berapa lama, image dasar yang tidak digunakan disimpan dalam ``/var/lib/nova/instances/_base/``. Jika Anda telah mengkonfigurasi migrasi langsung (live migration) instance, semua node komputasi Anda akan berbagi dalam satu kesamaan direktori ``/var/lib/nova/instances/``.
tr_tr: Kullanılmayan taban imajların ``/var/lib/nova/instances/_base/``de tutulup tutulmayacağını ya da ne kadar tutulacağını kontrol etmek için ``nova.conf`` dosyasındaki seçenekleri kullanın. Sunucuların canlı göçünü yapılandırdıysanız, tüm hesaplama düğümleriniz ortak bir ``/var/lib/nova/instances/`` dizinini paylaşır.

source: Use the :command:`virsh vncdisplay vm-name` command to get the VNC port number.
de: Verwenden Sie den Befehl :command:`virsh vncdisplay vm-name`, um die VNC-Portnummer zu erhalten.
id: Gunakan perintah :command:`virsh vncdisplay vm-name` untuk mendapatkan nomor port VNC.
tr_tr: VNC bağlantı noktası numarasını almak için :command:`virsh vncdisplay vm-name` komutunu kullanın.

source: Use the virt-manager X11 GUI
de: Verwenden Sie die virt-manager X11 GUI
id: Gunakan virt-manager X11 GUI
tr_tr: virt-manager X11 GUI'yi kullan

source: Use virt-install and connect by using a local VNC client
de: Verwenden Sie virt-install und verbinden Sie ihn mit einem lokalen VNC-Client
id: Gunakan virt-instal dan hubungkan dengan menggunakan klien VNC lokal
tr_tr: virt-install kullanın ve yerel VNC istemcisiyle bağlanın

source: Username: ``Administrator``
de: Benutzername: ``Administrator``
tr_tr: Kullanıcı adı: ``Administrator``

source: Using sparse representation, so the image size is smaller.
de: Mit spärlicher Darstellung ist also die Abbildgröße kleiner.
tr_tr: Seyrek temsil kullanır, böylece imaj boyutu küçüktür.

source: VBoxManage: VDI (VirtualBox) to raw
de: VBoxManage: VDI (VirtualBox) zu raw
id: VBoxManage: VDI (VirtualBox) ke raw (baku)
tr_tr: VBoxManage: VDI (VirtualBox)'den raw'a

source: VMware ESXi hypervisor uses the `VMDK <https://developercenter.vmware.com/web/sdk/60/vddk>`_ (Virtual Machine Disk) format for images.
de: VMware ESXi Hypervisor verwendet die `VMDK <https://developercenter.vmware.com/web/sdk/60/vddk> `_ (Virtual Machine Disk) Format für Abbilder.
tr_tr: VMware ESXi hipervizörü imajlar için `VMDK <https://developercenter.vmware.com/web/sdk/60/vddk>`_ (Sanal Makine Diski) biçimini kullanır.

source: Verify the libvirt default network is running
de: Überprüfen Sie, ob das libvirt-Standardnetzwerk läuft
id: Verifikasi jaringan default libvirt sedang berjalan
tr_tr: Libvirt öntanımlı ağının çalıştığından emin olun

source: Virtual machine images come in different formats, some of which are described below.
de: Virtuelle Maschinenbilder kommen in verschiedenen Formaten, von denen einige unten beschrieben werden.
tr_tr: Sanal makine imajları değişik biçimlerde gelir, bazıları aşağıda tanımlanmıştır.

source: VirtualBox uses the `VDI <https://forums.virtualbox.org/viewtopic.php?t=8046>`_ (Virtual Disk Image) format for image files. None of the OpenStack Compute hypervisors support VDI directly, so you will need to convert these files to a different format to use them with OpenStack.
de: VirtualBox verwendet das `VDI <https://forums.virtualbox.org/viewtopic.php?t=8046> `_ (Virtual Disk Image) Format für Abbilddateien. Keiner der OpenStack Compute Hypervisors unterstützt VDI direkt, also musst du diese Dateien in ein anderes Format umwandeln, um sie mit OpenStack zu nutzen.
tr_tr: VirtualBox imaj dosyaları için `VDI <https://forums.virtualbox.org/viewtopic.php?t=8046>`_ (Sanal Disk İmajı) kullanır. OpenStack Hesaplama hipervizörlerinin hiçbiri VDI için doğal destek vermez, yani bu dosyaları OpenStack ile kullanabilmek için başka bir biçime dönüştürmeniz gerekir.

source: Visit the `Fedora download site <https://getfedora.org/>`_.
de: Besuchen Sie die `Fedora Download-Website <https://getfedora.org/> `_.
id: Kunjungi `Laman unduh Fedora <https://getfedora.org/>`_.
tr_tr: `Fedora indirme sitesini <https://getfedora.org/>`_ ziyaret edin.

source: Wait for the machine shutdown.
de: Warten Sie, bis das Gerät heruntergefahren ist.
id: Tunggu shutdown mesin.
tr_tr: Makinenin kapanmasını bekleyin.

source: Wait until the installation is complete.
de: Warten Sie, bis die Installation abgeschlossen ist.
id: Tunggu sampai penginstalan selesai.
tr_tr: Kurulum bitene kadar bekleyin.

source: We add the following line to the file and save it:
de: Wir fügen der folgenden Datei die folgende Zeile hinzu und speichern sie:
id: Kami tambahkan baris berikut ke file dan menyimpannya:
tr_tr: Dosyaya şu satırı ekliyoruz ve kaydediyoruz:

source: We are done, so we can exit using the :command:`exit` command:
de: Wir sind fertig, also können wir mit dem Befehl :command: `exit` beenden:
id: Kita selesai, sehingga kita dapat keluar dengan menggunakan perintah :command:`exit`:
tr_tr: İşimiz bitti, yani :command:`exit` komutu ile çıkabiliriz.

source: We can now view the file systems in the image using the :command:`list-filesystems` command:
de: Wir können nun die Dateisysteme im Abbild mit dem Befehl :command:`list-filesystems` ansehen:
id: Kita sekarang dapat melihat file sistem pada image yang menggunakan perintah :command:`list-filesystems`:
tr_tr: Artık imajdaki dosya sistemlerini :command:`list-filesystems` komutuyla görüntüleyebiliriz:

source: We do not recommend creating raw images by dd'ing block device files, we discuss how to create raw images later.
de: Wir empfehlen nicht, Raw-Abbilder durch dd Block Device Dateien zu erstellen, wir diskutieren, wie man Raw-Abbilder später erstellt.
tr_tr: Raw imajları blok aygıt dosyalarını dd ile kopyalayarak oluşturmanızı önermiyoruz, raw imajların oluşturulmasını ilerde tartışacağız.

source: We must first use the :command:`run` command at the guestfish prompt before we can do anything else. This will launch a virtual machine, which will be used to perform all of the file manipulations.
de: Wir müssen zuerst den :command:`run` Befehl an der guestfish-Aufforderung verwenden, bevor wir etwas anderes tun können. Dies wird eine virtuelle Maschine starten, mit der alle Dateiverwaltungen ausgeführt werden.
id: Pertama kita harus menggunakan perintah :command:`run` pada prompt guestfish sebelum kita dapat melakukan hal lain. Perintah ini akan meluncurkan mesin virtual, yang akan digunakan untuk melakukan semua manipulasi file.
tr_tr: Başka bir şey yapabilmemiz için önce :command:`run` komutunu guestfish komut ekranından kullanmamız gerek. Bu bir sanal makine başlatır, bu da tüm dosya değişikliklerini yapmakta kullanılır.

source: We need to mount the logical volume that contains the root partition:
de: Wir müssen das logische Volume anbringen, das die Root-Partition enthält:
id: Kita perlu untuk me-mount volume logis yang berisi partisi root:
tr_tr: Kök bölümü içeren mantıksal birimi bağlamamız gerekiyor:

source: We want to edit the ``ifcfg-eth0`` file to remove the ``HWADDR`` line. The :command:`edit` command will copy the file to the host, invoke your editor, and then copy the file back.
de: Wir wollen die ``ifcfg-eth0`` Datei bearbeiten, um die ``HWADDR`` Zeile zu entfernen. Der Befehl :command:`edit` wird die Datei auf den Host kopieren, den Editor aufrufen und dann die Datei wieder kopieren.
id: Kami ingin mengedit file ``ifcfg-eth0`` untuk menghapus baris ``HWADDR``. Perintah :command:`edit` akan menyalin file ke host, memanggil editor, dan kemudian menyalin file kembali.
tr_tr: ``ifcfg-eth0`` dosyasını düzenleyip ``HWADDR`` satırını kaldırmak istiyoruz. :command:`edit` komutu dosyayı sunucuya kopyalar, düzenleyicinizi başlatır, ve dosyayı geri kopyalar.

source: Web site name: ``mirror.umd.edu``
de: Name der Website: ``mirror.umd.edu``
id: Nama situs web: ``mirror.umd.edu``
tr_tr: Web sitesi ismi: ``mirror.umd.edu``

source: When building Ubuntu images :command:`cloud-init` must be explicitly configured for the metadata source in use. The OpenStack metadata server emulates the EC2 metadata service used by images in Amazon EC2.
de: Beim Aufbau von Ubuntu-Abbildern :command:`cloud-init` muss explizit für die verwendete Metadatenquelle konfiguriert sein. Der OpenStack-Metadatenserver emuliert den EC2-Metadatenservice, der von Abbildern in Amazon EC2 verwendet wird.
id: Ketika membangun image Ubuntu :command:`cloud-init` harus secara eksplisit dikonfigurasi untuk sumber metadata yang digunakan. Server metadata OpenStack mengemulasi layanan metadata EC2 yang digunakan oleh image di Amazon EC2.
tr_tr: Ubuntu imajları inşa edilirken :command:`cloud-init` kullanımdaki metaveri kaynağı için özel olarak yapılandırılmalıdır. OpenStack metaveri sunucusu Amazon EC2'deki imajlar tarafından kullanılan EC2 metaveri servisini taklit eder.

source: When converting an image file with Windows, ensure the virtio driver is installed. Otherwise, you will get a blue screen when launching the image due to lack of the virtio driver. Another option is to set the image properties as below when you update the image in the Image service to avoid this issue, but it will reduce virtual machine performance significantly.
de: Beim Umwandeln einer Abbilddatei mit Windows stellen Sie sicher, dass der virtio-Treiber installiert ist. Andernfalls bekommen Sie einen blauen Abbildschirm beim Starten des Abbildes weil der virtio Treiber fehlt. Eine weitere Möglichkeit besteht darin, die Abbildeigenschaften wie unten zu setzen, wenn Sie das Abbild im Abbilddienst aktualisieren, um dieses Problem zu vermeiden, aber es wird die Leistung der virtuellen Maschine erheblich verringern.
id: Ketika mengkonversi file image dengan Windows, pastikan bahwa driver virtio diinstal. Jika tidak, Anda akan mendapatkan layar biru ketika meluncurkan image karena kurangnya driver virtio. Pilihan lain adalah untuk mengatur properti image seperti di bawah ini ketika Anda memperbarui image di layanan Image untuk menghindari masalah ini, tetapi akan mengurangi kinerja mesin virtual secara nyata.
tr_tr: Windows ile bir imaj dosyasını dönüştürürken, virtio sürücüsünün yüklü olduğundan emin olun. Aksi halde, imajı başlatırken virtio sürücüsü olmadığından mavi ekran alırsınız. Başka bir seçenek de imajı İmaj servisinde güncellediğinizde imaj özelliklerini ayarlamaktır, ama bu sanal makine başarımını kayda değer şekilde etkiler.

source: When creating Block Storage volumes from images, also consider your configured image properties. If you alter the core image properties, you should also update your Block Storage configuration. Amend ``glance_core_properties`` in the ``/etc/cinder/cinder.conf`` file on all controller nodes to match the core properties you have set in the Image service.
de: Beim Erstellen von Blockspeicher-Volumes aus Abbildern sollten Sie auch Ihre konfigurierten Abbild-Eigenschaften berücksichtigen. Wenn Sie die Core-Image-Eigenschaften ändern, sollten Sie auch die Konfiguration des Blockspeichers aktualisieren. Ändern Sie ``glance_core_properties`` in der ``/etc/cinder/cinder.conf`` Datei auf allen Controller-Knoten, um die Core-Eigenschaften zu entsprechen, die Sie im Image Service eingestellt haben.
id: Ketika pembuatan volume Block Storage dari image, Anda juga mempertimbangkan properti image yang dikonfigurasi. Jika Anda mengubah properti image inti (core), Anda juga harus memperbarui konfigurasi Block Storage Anda. Mengubah ``glance_core_properties`` di file ``/etc/cinder/cinder.conf`` pada semua node controller untuk mencocokkan properti inti yang telah Anda tetapkan dalam pelayanan Image.
tr_tr: İmajlardan Blok Depolama birimleri oluştururken, yapılandırılmış imaj özelliklerinizi de dikkate alın. Çekirdek imaj özellikleriyle oynarsanız, Blok Depolama yapılandırmanızı da güncellemeniz gerekir. Tüm kontrol düğümlerinizdeki ``/etc/cinder/cinder.conf`` dosyası içindeki ``glance_core_properties`` değerini değiştirerek İmaj servisinde ayarladığınız çekirdek özelliklerle eşleştirin.

source: When prompted about the optional ``doc``, ``games``, ``lib32``, ``ports``, and ``src`` system components, select only those that you need. It is possible to have a fully functional installation without selecting additional components selected. As noted previously, a minimal system with a 1 GB virtual disk supports ``doc``, ``games``, and ``lib32`` inclusive. The ``ports`` collection requires at least 1 GB additional space and possibly more if you plan to install many ports. The ``src`` collection requires an additional 512 MB.
de: Wenn Sie dazu aufgefordert werden für die optionalen ``doc``, ``games``, ``lib32``, ``ports`` und ``src`` Systemkomponenten, wählen Sie nur diejenigen, die Sie benötigen. Es ist möglich, eine voll funktionsfähige Installation zu haben, ohne zusätzliche Komponenten auszuwählen. Wie bereits erwähnt, unterstützt ein minimales System mit einem virtuellen 1 GB-Laufwerk ``doc``, ``games`` und ``lib32`` inklusive. Die ``ports`` Kollektion benötigt mindestens 1 GB zusätzlichen Platz und eventuell mehr, wenn Sie planen, viele Ports zu installieren. Die ``src`` Kollektion benötigt zusätzlich 512 MB.
id: Ketika diminta tentang komponen sistem opsional ``doc``, ``games``, ``lib32``, ``ports``, dan ``src``, pilih hanya mereka yang Anda butuhkan. Hal ini dimungkinkan untuk memiliki instalasi berfungsi penuh tanpa memilih komponen tambahan yang dipilih. Seperti dijelaskan sebelumnya, sistem minimal dengan disk virtual 1 GB mendukung ``doc``, ``games``, dan ``lib32`` inklusif. Koleksi ``ports`` memerlukan setidaknya 1 GB ruang tambahan dan mungkin lebih jika Anda berencana untuk menginstal banyak port. Koleksi ``src`` membutuhkan tambahan 512 MB.
tr_tr: İsteğe bağlı ``doc``, ``games``, ``lib32``, ``ports``, ve ``src`` sistem bileşenleri sorulduğunda, yalnızca ihtiyacınız olanları seçin. Seçili ek bileşenler seçilmeden de tamamen işlevsel bir kuruluma sahip olunabilir. Daha önce belirtildiği gibi, 1 GB diske sahip asgari bir sistem ``doc``, ``games``, ve ``lib32`` destekler. ``ports`` koleksiyonu en az 1 GB ek alan gerektirir ve başka türevler de yüklemeyi düşünüyorsanız muhtemelen daha çok gerekcektir. ``src`` koleksiyonu ek 512 MB gerektirir.

source: When prompted, choose to run the ISO in :guilabel:`Install` mode.
de: Wenn Sie dazu aufgefordert werden, wählen Sie die ISO in :guilabel: `Install` Modus.
id: Bila diminta, pilih untuk menjalankan ISO dalam mode :guilabel:`Install`.
tr_tr: Sorulduğunda, ISO'yu :guilabel:`Kurulum` kipinde çalıştırın.

source: When the installation is done, in the :guilabel:`Complete the Cloudbase-Init Setup Wizard` window, select the :guilabel:`Run Sysprep` and :guilabel:`Shutdown` check boxes and click :guilabel:`Finish`.
de: Wenn die Installation abgeschlossen ist, im Fenster :guilabel: `Complete the Cloudbase-Init Setup Wizards` , wählen Sie die :guilabel:` Run Sysprep` und :guilabel: `Shutdown` Kontrollkästchen und klicken Sie auf :guilabel:`Finish`.
id: Ketika instalasi selesai, di jendela :guilabel:`Complete the Cloudbase-Init Setup Wizard`, pilih kotak centang :guilabel:`Run Sysprep` dan :guilabel:`Shutdown` dan klik :guilabel:`Finish`.
tr_tr: Kurulum tamamlandığında, :guilabel:`Cloudbase-Init Kurulum Sihirbazını Tamamla` penceresinde, :guilabel:`Sysprep'i Çalıştır` ve :guilabel:`Kapat` onay kutularını işaretleyin ve :guilabel:`Bitir` tıklayın.

source: When using qcow2 format images, you should check the option ``Customize configuration before install``, go to disk properties and explicitly select the :guilabel:`qcow2` format. This ensures the virtual machine disk size will be correct.
de: Bei der Verwendung von qcow2-Format-Abbildern sollten Sie die Option ``Anpassen der Konfiguration vor der Installation``, auf Festplatten-Eigenschaften belassen und explizit die :guilabel:`qcow2`-Format wählen. Dadurch wird sichergestellt, dass die Größe der virtuellen Maschine korrekt ist.
id: Saat menggunakan image format qcow2, Anda harus mencentang opsi ``Customize configuration before install``, masuk ke properti disk dan secara eksplisit pilih format :guilabel:`qcow2`. Ini memastikan ukuran disk mesin virtual akan benar.
tr_tr: Qcow2 imajlarını kullanırken, ``Kurulumdan önce yapılandırmayı özelleştir`` seçmelisiniz, disk özelliklerine gidin ve :guilabel:`qcow2` biçimini özellikle seçin. Bu sanal makine disk boyutunun doğru olduğundan emin olmanızı sağlar.

source: When using the libvirt ``default`` network, libvirt will connect the virtual machine's interface to a bridge called ``virbr0``. There is a dnsmasq process managed by libvirt that will hand out an IP address on the 192.168.122.0/24 subnet, and libvirt has iptables rules for doing NAT for IP addresses on this subnet.
de: Bei der Verwendung des libvirt ``default`` Netzwerkes verbindet libvirt die Schnittstelle der virtuellen Maschine mit einer Bridge namens ``virbr0``. Es gibt einen dnsmasq Prozess, der von libvirt verwaltet wird, der eine IP-Adresse auf dem 192.168.122.0/24 Subnetz ausgibt und libvirt hat iptables Regeln für das NAT für IP-Adressen in diesem Subnetz.
id: Bila menggunakan jaringan ``default`` libvirt, libvirt akan menghubungkan antarmuka mesin virtual ke sebuah jembatan yang disebut ``virbr0``. Ada proses dnsmasq yang dikelola oleh libvirt yang akan membagikan alamat IP pada subnet 192.168.122.0/24, dan libvirt memiliki aturan iptables untuk melakukan NAT untuk alamat IP di subnet ini.
tr_tr: Libvirt ``öntanımlı`` ağını kullanırken, libvirt sanal makinenin arayüzünü ``virbr0`` isimli köprüye bağlar. Libvirt tarafından yönetilen bir dnsmasq süreci 192.168.122.0/24 alt ağında IP adresi dağıtır, ve libvirt bu alt ağda IP adresleri için NAT kuralları olan iptables içerir.

source: When you add an image to the Image service, you can specify its disk and container formats.
de: Wenn Sie dem Abbilddienst ein Abbild hinzufügen, können Sie die Festplatten- und Containerformate angeben.
tr_tr: İmaj servisine bir imaj eklediğinizde, disk ve kapsayıcı biçimlerini belirtebilirsiniz.

source: When you are done, clean up:
de: Wenn Sie fertig sind, räumen Sie auf:
id: Ketika Anda selesai, bersihkan:
tr_tr: İşiniz bittiğinde, temizlik yapın:

source: When you boot for the first time after install, it may ask you about authentication tools, you can just choose :guilabel:`Exit`. Then, log in as root using the root password you specified.
tr_tr: Kurulumdan sonra ilk defa önyükleme yaptığınızda, kimlik doğrulama araçlarıyla ilgili sorular çıkabilir, :guilabel:`Çıkış`ı seçebilirsiniz. Ardından root parolası için belirlediğiniz parolayla root olarak giriş yapın.

source: When you create a Linux image, you must decide how to partition the disks. The choice of partition method can affect the resizing functionality, as described in the following sections.
de: Wenn Sie ein Linux-Abbild erstellen, müssen Sie entscheiden, wie die Festplatten partitioniert werden sollen. Die Wahl der Partitionsmethode kann die Größenänderungsfunktionalität beeinflussen, wie in den folgenden Abschnitten beschrieben.
id: Ketika Anda membuat image Linux, Anda harus memutuskan bagaimana cara partisi disk. Pilihan metode partisi dapat mempengaruhi fungsi perubahan ukuran, seperti yang dijelaskan di bagian berikut.
tr_tr: Bir Linux imajı oluşturduğunuzda, diskleri nasıl bölümleyeceğinize karar vermelisiniz. Bölümleme yöntemi seçini yeniden boyutlandırma işlevselliğini etkileyebilir, aşağıdaki kısımlarda bu anlatılıyor.

source: When you create a new virtual machine image, you will need to connect to the graphical console of the hypervisor, which acts as the virtual machine's display and allows you to interact with the guest operating system's installer using your keyboard and mouse. KVM can expose the graphical console using the `VNC <https://en.wikipedia.org/wiki/Virtual_Network_Computing>`_ (Virtual Network Computing) protocol or the newer `SPICE <http://spice-space.org>`_ protocol. We will use the VNC protocol here, since you are more likely to find a VNC client that works on your local desktop.
de: Wenn Sie ein neues virtuelles Maschinenimage erstellen, müssen Sie eine Verbindung zur grafischen Konsole des Hypervisor herstellen, die als Anzeige der virtuellen Maschine fungiert und Ihnen ermöglicht, mit dem Installateur des Gastbetriebssystems über Tastatur und Maus zu interagieren. KVM kann die grafische Konsole mit dem `VNC aussetzen <https://en.wikipedia.org/wiki/Virtual_Network_Computing> `_ (Virtual Network Computing) Protokoll oder die neuere` SPICE <http://spice-space.org> `_ Protokoll Wir werden das VNC-Protokoll hier verwenden, da Sie eher einen VNC-Client finden, der auf Ihrem lokalen Desktop funktioniert.
id: Bila Anda membuat image mesin virtual baru, Anda perlu untuk menghubungkan ke konsol grafis dari hypervisor, yang bertindak sebagai layar (display) mesin virtual dan memungkinkan Anda untuk berinteraksi dengan installer sistem operasi guest (tamu) menggunakan keyboard dan mouse. KVM dapat mengekspos konsol grafis menggunakan `VNC <https://en.wikipedia.org/wiki/Virtual_Network_Computing>`_ protokol (Virtual Network Computing) atau protocol lebih baru `SPICE <http://spice-space.org>`_. Kami akan menggunakan protokol VNC di sini, karena Anda lebih mungkin untuk menemukan klien VNC yang bekerja di desktop lokal Anda.
tr_tr: Yeni bir sanal makine imajı oluşturduğunuzda, hipervizörün grafik konsoluna bağlanmanız gerekir, bu sanal makinenin ekranı gibi davranır ve misafir işletim sisteminin kurucusuyla klavye ve fare kullanarak etkileşebilmenizi sağlar. KVM grafik konsolu `VNC <https://en.wikipedia.org/wiki/Virtual_Network_Computing>`_ (Sanal Ağ Hesaplama) iletişim kuralı ile veya daha yeni `SPICE <http://spice-space.org>`_ iletişim kuralı ile sunabilir. Burda VNC iletişim kuralını kullanacağız, çünkü yerel masaüstünüzde VNC istemcisi bulma ihtimaliniz daha yüksek.

source: With these packages installed, the image performs the root partition resize on boot. For example, in the ``/etc/rc.local`` file.
de: Wenn diese Pakete installiert sind, führt das Abbild die Grössenänderung der Root-Partition beim Booten aus. Zum Beispiel in der ``/etc/rc.local`` Datei.
id: Dengan paket ini terinstal, image melakukan partisi root resize saat boot. Misalnya, di file ``/etc/rc.local``.
tr_tr: Bu paketler yüklü olduğunda, imaj kök bölümün yeniden boyutlandırılmasını önyüklemede yapar. Örneğin ``/etc/rc.local`` dosyasında.

source: With this service you can define:
de: Mit diesem Service können Sie definieren:
id: Dengan layanan ini Anda dapat menentukan:
tr_tr: Bu servisle şunları tanımlayabilirsiniz:

source: Write a custom script to fetch the public key
de: Schreiben Sie ein benutzerdefiniertes Skript, um den öffentlichen Schlüssel abzurufen
id: Tulis skrip khusus untuk mengambil kunci publik
tr_tr: Açık anahtarı çekmek için özel bir betik yazın

source: Write a script to fetch the public key (if no cloud-init)
de: Schreiben Sie ein Skript, um den öffentlichen Schlüssel abzurufen (wenn kein Cloud-init)
id: Tulis skrip untuk mengambil kunci publik (jika tidak ada cloud-init)
tr_tr: Açık anahtarı getirecek bir betik yazın (cloud-init yoksa)
