Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: The ``-f format`` flag is optional. If omitted, ``qemu-img`` will try to infer the image format.
de: Das ``-f format`` Flag ist optional. Wenn Sie es weggelassen, wird `` qemu-img`` versuchen, das Abbildformat zu schließen.
id: Flag ``-f format`` adalah opsional. Jika dihilangkan, ``qemu-img`` akan mencoba untuk menduga format image.
tr_tr: ``-f format`` biçim bayrağı isteğe bağlıdır. Eğer verilmezse ``qemu-img`` imaj biçimini çıkarmaya çalışır.

source: The ``-u`` tells Oz to do the customization (install extra packages, run the commands) once it does the initial install.
de: Die ``-u`` Option erklärt Oz die Anpassung während der initialen Installation (extra Pakete installieren, Kommandos ausführen)
id: ``-u`` mengatakan bahwa Oz melakukan kustomisasi (menginstal paket tambahan, menjalankan perintah) setelah Oz itu melakukan instalasi awal.
tr_tr: ``-u`` Oz'a ilk kurulumu bitirdikten sonra özelleştirmeyi yapmasını söyler (ek paketleri yüklemek, komutları çalıştırmak).

source: The ``-x`` flag tells Oz what filename to use to write out a libvirt XML file (otherwise it will default to something like ``centos64Apr_03_2013-12:39:42``).
de: Die ``-x`` Option sagt Oz, welchen Dateinamen Sie verwenden müssen, um eine libvirt-XML-Datei zu schreiben (sonst wird es standardmäßig so etwas wie `` centos64Apr_03_2013-12:39:42`` verwenden).
id: Flag ``-x`` mengatakan Oz dengan nama file yang digunakan untuk menulis file XML libvirt (jika tidak maka defaultnya akan ke sesuatu seperti ``centos64Apr_03_2013-12:39:42``).
tr_tr: ``-x`` bayrağı Oz'a libvirt XML dosyası yazmak için hangi dosya ismini kullanması gerektiğini söyler (aksi halde öntanımlı bir dosya olacaktır, örneğin ``centos64Apr_03_2013-12:39:42``).

source: The ``cloud-init`` package automatically fetches the public key from the metadata server and places the key in an account. Install ``cloud-init`` inside the CentOS guest by running:
de: Das ``cloud-init``-Paket holt automatisch den öffentlichen Schlüssel vom Metadatenserver und platziert den Schlüssel in ein Konto. Installieren Sie `` cloud-init`` innerhalb des CentOS-Gastes, indem Sie:
id: Paket ``cloud-init`` secara otomatis mengambil kunci publik dari server metadata dan menempatkan kunci di akun. Install ``cloud-init`` di dalam CentOS guest dengan menjalankan:
tr_tr: ``cloud-init`` paketi açık anahtarı otomatik olarak metaveri sunucusundan çeker ve anahtarı bir hesaba yerleştirir. Şu komutu çalıştırarak CentOS misafiri içinde ``cloud-init`` kurun:

source: The ``cloud-init`` package automatically fetches the public key from the metadata server and places the key in an account. Install ``cloud-init`` inside the Fedora guest by running:
de: Das ``cloud-init``-Paket holt automatisch den öffentlichen Schlüssel vom Metadatenserver und platziert den Schlüssel in ein Konto. Installieren Sie ``cloud-init`` innerhalb des Fedora-Gastes, indem Sie:
id: Paket ``cloud-init`` secara otomatis mengambil kunci publik dari server metadata dan menempatkan kunci di akun. Install ``cloud-init`` di dalam Fedora guest dengan menjalankan:
tr_tr: ``cloud-init``paketi otomatik olarak açık anahtarı metaveri sunucusundan çeker ve anahtarı hesaba ekler. Fedora misafirin şunu çalıştırarak ``cloud-init`` kurun:

source: The ``cloud-init`` package automatically fetches the public key from the metadata server and places the key in an account. The account varies by distribution. On Ubuntu-based virtual machines, the account is called ``ubuntu``, on Fedora-based virtual machines, the account is called ``fedora``, and on CentOS-based virtual machines, the account is called ``centos``.
de: Das ``cloud-init``-Paket holt automatisch den öffentlichen Schlüssel vom Metadatenserver und platziert den Schlüssel in ein Konto. Das Konto variiert je nach Verteilung. Auf Ubuntu-basierten virtuellen Maschinen heißt das Konto ``ubuntu``, auf Fedora-basierten virtuellen Maschinen, das Konto heißt ``fedora``, und auf CentOS-basierten virtuellen Maschinen wird das Konto ``centos`` genannt.
id: Paket ``cloud-init`` secara otomatis mengambil kunci publik dari server metadata dan menempatkan kunci di akun. Akunnya bervariasi menurut distribusi. Pada mesin virtual berbasis Ubuntu, akun ini disebut ``ubuntu``, pada mesin virtual berbasis Fedora, akunnya disebut ``fedora``, dan pada mesin virtual berbasis CentOS, akun tersebut disebut ``centos` `.
tr_tr: ``cloud-init`` paketi otomatik olarak açık anahtarı metaveri sunucusundan getirir ve anahtarı hesaba ekler. Hesap dağıtıma göre değişiklik gösterir. Ubuntu tabanlı sanal makinelerde, hesap ismi ``ubuntu`` olur, Fedora tabanlı sanal makinelerde, hesap ismi ``fedora`` ve CentOS tabanlı sanal makinelerde hesap ismi ``centos`` olur.

source: The ``guestfish`` program is a tool from the `libguestfs <http://libguestfs.org/>`_ project that allows you to modify the files inside of a virtual machine image.
de: Das ``guestfish`` Programm ist ein Werkzeug aus den `libguestfs <http://libguestfs.org/> `_ Projekt, das Ihnen erlaubt, die Dateien innerhalb eines virtuellen Maschinenbildes zu ändern.
id: Program ``guestfish`` adalah alat dari proyek `libguestfs <http://libguestfs.org/>`_ yang memungkinkan Anda untuk memodifikasi file dalam image mesin virtual.
tr_tr: ``guestfish`` programı `libguestfs <http://libguestfs.org/>`_ projesi ile gelen ve bir sanal makine imajındaki dosyaları değiştirmenizi sağlayan bir araçtır.

source: The ``raw`` image format is the simplest one, and is natively supported by both KVM and Xen hypervisors. You can think of a raw image as being the bit-equivalent of a block device file, created as if somebody had copied, say, ``/dev/sda`` to a file using the :command:`dd` command.
de: Das ``raw`` Abbildformat ist das einfachste und wird von KVM und Xen Hypervisoren nativ unterstützt. Sie können sich ein Rohbild als das Bit-Äquivalent einer Block-Device-Datei ansehen, die so erstellt wurde, als ob jemand kopiert hätte, sagen wir ``/dev/sda`` in eine Datei mit dem Befehl: Befehl: `dd`.
tr_tr: ``raw`` imaj biçimi en basit olandır, ve hem KVM hem Xen hipervizörler tarafından doğal olarak desteklenir. raw imajını bir blok aygıt dosyasının bit-eşiti olarak düşünebilirsiniz, sanki biri ``/dev/sda`` yı :command:`dd` komutuyla dosyaya kopyalamış gibi.

source: The `libguestfs <http://libguestfs.org/>`_ project has a number of other useful tools, including:
de: Das `libguestfs <http://libguestfs.org/> `_ Projekt hat eine Reihe von anderen nützlichen Tools, einschließlich:
id: Proyek `libguestfs <http://libguestfs.org/>`_ memiliki sejumlah alat yang berguna lainnya, termasuk:
tr_tr: `libguestfs <http://libguestfs.org/>`_ projesi bir takım faydalı araç içerir, bazıları:

source: The account varies by distribution. On CentOS-based virtual machines, the account is called ``centos``.
de: Das Konto variiert je nach Verteilung. Auf CentOS-basierten virtuellen Maschinen heißt das Konto ``centos``.
id: Akunnya bervariasi menurut distribusi. Pada mesin virtual berbasis CentOS, akun tersebut disebut ``centos``.
tr_tr: Hesap dağıtımdan dağıtıma değişir. CentOS tabanlı sanal makinelerde, hesap ismi ``centos``dur.

source: The account varies by distribution. On Fedora-based virtual machines, the account is called ``fedora``.
de: Das Konto variiert je nach Distribution. Auf Fedora-basierten virtuellen Maschinen heißt das Konto ``fedora``.
id: Akunnya bervariasi menurut distribusi. Pada mesin virtual berbasis Fedora, akun tersebut disebut ``fedora``.
tr_tr: Hesap dağıtımdan dağıtıma değişir. Fedora tabanlı sanal makinelerde, hesap ``fedora`` olarak adlandırılır.

source: The account varies by distribution. On Ubuntu-based virtual machines, the account is called ``ubuntu``. On Fedora-based virtual machines, the account is called ``ec2-user``.
de: Das Konto variiert je nach Verteilung. Auf Ubuntu-basierten virtuellen Maschinen heißt das Konto ``ubuntu``. Bei Fedora-basierten virtuellen Maschinen heißt das Konto ``ec2-user``.
id: Akun bervariasi menurut distribusi. Pada mesin virtual berbasis Ubuntu, akun ini disebut ``ubuntu``. Pada mesin virtual berbasis Fedora, akun ini disebut ``ec2-user``.
tr_tr: Hesap dağıtımdan dağıtıma değişir. Ubuntu tabanlı sanal makinelerde, hesap ismi ``ubuntu`` olur. Fedora tabanlı sanal makinelerde, hesap ismi ``ec2-user`` olur.

source: The container format indicates whether the virtual machine image is in a file format that also contains metadata about the actual virtual machine.
de: Das Containerformat gibt an, ob sich das virtuelle Maschinenbild in einem Dateiformat befindet, das auch Metadaten über die eigentliche virtuelle Maschine enthält.
tr_tr: Kapsayıcı biçimi sanal makine imajının asıl sanal makine hakkında metaveri içeren bir dosya biçiminde olup olmadığını gösterir.

source: The default Ethernet setting is ``OFF``. Change the setting of the Ethernet form ``OFF`` to ``ON``. In particular, ensure that ``IPv4 Settings' Method`` is ``Automatic (DHCP)``, which is the default.
de: Die Standard-Ethernet-Einstellung ist ``OFF``. Ändern Sie die Einstellung der Ethernet-Form ``OFF`` auf ``ON``. Stellen Sie insbesondere sicher, dass ``IPv4 Settings' Methode`` ``Automatic (DHCP)`` ist, was der Standard ist.
id: Pengaturan Ethernet standar adalah ``OFF``. Ubah pengaturan dari keadaan Ethernet ``OFF`` ke ``ON``. Secara khusus, pastikan bahwa ``IPv4 Settings' Method`` adalah ``Automatic (DHCP)``, yang merupakan default.
tr_tr: Öntanımlı Ethernet ayarı ``Kapalı``dır. Ethernet ayarını ``Kapalı``dan ``Açık``a getirin. Özellikle, ``IPv4 Ayarlarının Yöntemini`` öntanımlı değeri olan ``Otomatik (DHCP)`` olarak bırakın.

source: The default mirror proposed by the installer should be fine.
de: Der von dem Installer vorgeschlagene Standard-Mirror sollte gut sein.
id: Mirror default yang diusulkan oleh installer harus baik.
tr_tr: Yükleyici tarafından tavsiye edilen öntanımlı yansı iyidir.

source: The disk format of a virtual machine image is the format of the underlying disk image. Virtual appliance vendors have different formats for laying out the information contained in a virtual machine disk image.
de: Das Festplattenformat eines virtuellen Maschinenbildes ist das Format des zugrunde liegenden Festplattenbildes. Virtuelle Appliance-Anbieter haben unterschiedliche Formate für die Auslegung der Informationen, die in einem virtuellen Maschinen-Disk-Image enthalten sind.
tr_tr: Bir sanal makine imajının disk biçimi altta yatan disk imajının biçimidir. Sanal gereç üreticilerinin sanal makine disk imajında bulunan bilgiyi yaymak için değişik biçimleri bulunur.

source: The disk is not detected by default by the Windows installer. When requested to choose an installation target, click :guilabel:`Load driver` and browse the file system to select the ``E:\virtio-win-0.1XX\viostor\w7\amd64`` folder. The Windows installer displays a list of drivers to install. Select the :guilabel:`VirtIO SCSI` and :guilabel:`network drivers` and continue the installation.
tr_tr: Disk öntanımlı olarak Windows yükleyici tarafından algılanmaz. Kurulum hedefi seçilmesi istendiğinde, :guilabel:`Sürücü yükle`ye tıklayın ve dosya sistemini tarayarak ``E:\virtio-win-0.1XX\viostor\w7\amd64`` dizinini seçin. Windows yükleyici kurulacak sürücülerin listesini görüntüler. :guilabel:`VirtIO SCSI` ve :guilabel:`ağ sürücüleri` ni seçin ve kuruluma devam edin.

source: The disk on the image has only one partition.
de: Die Festplatte auf dem Abbild hat nur eine Partition.
id: Disk pada image hanya memiliki satu partisi.
tr_tr: İmajdaki diskte yalnızca bir bölüm vardır.

source: The easiest way to support this type of functionality is to install the ``cloud-init`` package into your image, which is configured by default to treat user data as an executable script, and sets the host name.
de: Der einfachste Weg, diese Art von Funktionalität zu unterstützen, besteht darin, das ``cloud-init``-Paket in Ihr Abbild zu installieren, das standardmäßig so konfiguriert ist, dass es Benutzerdaten als ausführbares Skript behandelt und den Hostnamen festlegt.
id: Cara termudah untuk mendukung tipe fungsi adalah dengan menginstal paket ``cloud-init`` ke image Anda, dimana image dikonfigurasi secara default untuk memperlakukan data pengguna sebagai skrip executable, dan menetapkan nama host.
tr_tr: Bu tür bir işlevselliği sağlamanın en kolay yolu imajınıza ``cloud-init`` paketini kurmaktır, bu da öntanımlı olarak kullanıcı verisini çalıştırılabilir betik olarak ele alır ve makine adını ayarlar.

source: The file system for the image fills the original size of the image.
de: Das Dateisystem für das Abbild füllt die Originalgröße des Abbildes.
id: Sistem file untuk image mengisi ukuran image asli.
tr_tr: İmaj için dosya sistemi imajın asıl boyutunu doldurur.

source: The file system on the one partition is ext3 or ext4.
de: Das Dateisystem auf der einen Partition ist ext3 oder ext4.
id: Sistem file pada satu partisi adalah ext3 atau ext4.
tr_tr: Tek bölümdeki dosya sistemi ext3 veya ext4'dür.

source: The following command uses the minimum amount of RAM, which is 256 MB:
de: Der folgende Befehl verwendet die minimale RAM-Menge, die 256 MB beträgt:
id: Perintah berikut menggunakan jumlah minimum RAM, jumlah itu adalah 256 MB:
tr_tr: Aşağıdaki komut en düşüm RAM miktarını kullanır, 256 MB:

source: The following example shows how to use the :command:`qemu-img` command to create an empty image file, and :command:`virt-install` command to start up a virtual machine using that image file. As root:
de: Das folgende Beispiel zeigt, wie Sie den Befehl :command:`qemu-img` verwenden, um eine leere Abbilddatei zu erstellen, und :command:`virt-install` Befehl zum Starten einer virtuellen Maschine mit dieser Abbilddatei. Als root:
id: Contoh berikut menunjukkan bagaimana menggunakan perintah :command:`qemu-img` untuk membuat file image kosong, dan perintah :command:`virt-install` untuk memulai mesin virtual menggunakan file image. Sebagai root:
tr_tr: Aşağıdaki örnek :command:`qemu-img` komutunu kullanarak boş bir imaj dosyası oluşturmayı, ve :command:`virt-install` komutu ile bu imaj dosyasını kullanarak bir sanal makine başlatmayı gösteriyor. Root olarak:

source: The following figure shows a completed partition table with a 1 GB virtual disk:
de: Die folgende Abbildung zeigt eine abgeschlossene Partitionstabelle mit einem virtuellen 1 GB-Laufwerk:
id: Gambar berikut menunjukkan tabel partisi lengkap dengan disk virtual 1 GB:
tr_tr: Aşağıdaki şekil 1 GB sanal diske sahip tamamlanmış bir bölümlendirme tablosu gösterir:

source: The following procedure is a workflow for image sharing after image creation.
de: Das folgende Verfahren ist ein Workflow für die Abbildfreigabe nach der Abbilderstellung.
id: Prosedur berikut adalah alur kerja untuk berbagi image setelah penciptaan image.
tr_tr: Aşağıdaki yordam imaj oluşturduktan sonra imaj paylaşımı için bir iş akışını gösterir.

source: The image does not have a container or metadata envelope.
de: Das Abbild hat keine Container- oder Metadatenhülle.
tr_tr: İmajın bir kapsayıcı veya metaveri kılıfı yok.

source: The installer allows you to choose a host name. The default (``localhost.localdomain``) is fine. You install the ``cloud-init`` package later, which sets the host name on boot when a new instance is provisioned using this image.
de: Mit dem Installateur können Sie einen Hostnamen auswählen. Die Voreinstellung (``localhost.localdomain``) ist in Ordnung. Sie installieren das ``cloud-init`` Paket später, das den Hostnamen beim Booten setzt, wenn eine neue Instanz mit diesem Abbild bereitgestellt wird.
id: Installer memungkinkan Anda memilih nama host. Default (``localhost.localdomain``) baik-baik saja. Anda menginstal paket ``cloud-init`` nanti, yang menetapkan nama host saat boot saat instance baru disiapkan menggunakan image ini.
tr_tr: Yükleyici bir makine adı seçmenize izin verir. Öntanımlı (``localhost.localdomain``) iyidir. Daha sonra kurduğunuz ``cloud-init`` paketi yeni bir sunucu bu imajı kullanarak hazırlandığında makine adını ayarlar.

source: The installer may ask you to choose a host name. The default (``ubuntu``) is fine. We will install the cloud-init package later, which will set the host name on boot when a new instance is provisioned using this image.
de: Der Installer kann Sie bitten, einen Hostnamen zu wählen. Die Voreinstellung (``ubuntu``) ist in Ordnung. Wir werden das cloud-init-Paket später installieren, das den Hostnamen beim Booten festlegt, wenn eine neue Instanz mit diesem Abbild bereitgestellt wird.
id: Installer akan meminta Anda untuk memilih nama host. Default (``ubuntu``) akan baik-baik saja. Kami akan menginstal paket cloud-init kemudian, dimana kami akan mengatur nama host pada boot ketika image baru ditetapkan menggunakan image ini.
tr_tr: Yükleyici bir makine adı seçmenizi isteyebilir. Öntanımlı (``ubuntu``) iyidir. cloud-init paketini daha sonra kuracağız, bu imajı kullanarak yeni sunucu hazırlandığında önyükleme sırasında makine adını ayarlayacak.

source: The member status can be used to filter the consumer's image list.
de: Der Status des Mitglieds kann verwendet werden, um die Abbildliste des Verbrauchers zu filtern.
id: Status anggota dapat digunakan untuk menyaring daftar image konsumen.
tr_tr: Üye durumu tüketicinin imaj listesini süzmek için kullanılabilir.

source: The member status controls whether image appears in the consumer's image list. If the image member status is ``accepted``, the image appears in the consumer's image list. Otherwise, the image does not appear in the image list. The image may still be used as long as the consumer knows the image ID.
de: Der Status des Mitglieds steuert, ob das Abbild in der Abbildliste des Verbrauchers erscheint. Wenn der Abbildmitgliedstatus ``accepted`` ist, erscheint das Abbild in der Abbildliste des Verbrauchers. Andernfalls erscheint das Abbild nicht in der Abbildliste. Das Abbild kann noch verwendet werden, solange der Verbraucher die Abbild-ID kennt.
id: Status anggota mengontrol apakah image akan muncul di daftar image konsumen. Jika status anggota image adalah `` accepted``, imageakan muncul di daftar image konsumen. Jika tidak, image tidak muncul dalam daftar image. Image masih dapat digunakan asalkan konsumen mengetahui ID image.
tr_tr: Üye durumu imajın tüketicinin imaj listesinde görünüp görünmediğini kontrol eder. İmaj üye durumu ``kabul edildi`` ise imaj tüketicinin imaj listesinde görünür. Aksi halde, imaj imaj listesinde belirmez. Tüketici imaj kimliğini bildiği sürece imaj hala kullanılabilirdir.

source: The member status lets the producer know whether the consumer has seen and acted on the shared image. If the status is ``accepted`` or ``rejected``, the consumer has definitely seen the shared image. If the status is ``pending``, the consumer may not be aware that an image was shared.
de: Der Mitgliedsstatus lässt den Hersteller wissen, ob der Verbraucher das geteilte Abbild gesehen und gehandelt hat. Wenn der Status ``accepted`` oder ``rejected`` ist, hat der Verbraucher das geteilte Abbild definitiv gesehen. Wenn der Status ``pending`` ist, kann der Verbraucher nicht wissen, dass ein Abbild geteilt wurde.
id: Status anggota memungkinkan produsen mengetahui apakah konsumen telah melihat dan bertindak pada image bersama. Jika status adalah ``accepted`` atau ``rejected``, konsumen pasti telah melihat image bersama. Jika status adalah ``pending``, konsumen mungkin tidak menyadari bahwa image telah dibagi.
tr_tr: Üye durumu üreticinin, tüketicinin paylaşılan imajı görüp buna göre eyleme geçip geçmediğini bilmesini sağlar. Durum ``kabul edildi`` veya ``reddedildi`` ise, tüketici kesinlikle paylaşılan imajı görmüştür. Durum ``beklemede`` ise tüketici kendisiyle paylaşılan imajı görmemiş olabilir.

source: The minimum supported disk size for FreeBSD is 1 GB. Because the goal is to make the smallest possible base image, the example uses that minimum size. This size is sufficient to include the optional ``doc``, ``games``, and ``lib32`` collections. To include the ``ports`` collection, add another 1 GB. To include ``src``, add 512 MB.
de: Die minimale Festplattengröße für FreeBSD beträgt 1 GB. Weil das Ziel ist, das kleinstmögliche Basisbild zu machen, verwendet das Beispiel diese minimale Größe. Diese Größe reicht aus, um die optionalen `` doc``, `` games`` und `` lib32`` Ports einzuschließen. Um die ``ports`` Sammlung einzuschließen, fügen Sie noch 1 GB hinzu. Um ``src`` hinzuzufügen, fügen Sie 512 MB hinzu.
id: Ukuran disk minimum dukungan untuk FreeBSD adalah 1 GB. Karena tujuannya adalah untuk membuat image dasar sekecil mungkin, contoh ini menggunakan ukuran minimum itu. Ukuran ini cukup untuk mencakup opsional ``doc``, ``games``, dan koleksi ``lib32``. Untuk menyertakan koleksi ``ports``, tambahkan lagi 1 GB. Untuk menyertakan ``src``, tambahkan 512 MB.
tr_tr: FreeBSD için desteklenen en küçük disk boyutu 1 GB'dır. Amaç mümkün olan en küçük taban imajı oluşturmak olduğundan, bu örnek bu asgari boyutu kullanır. Bu boyut isteğe bağlı ``doc``, ``games``, ve ``lib32`` koleksiyonlarını içermeye yeter. ``ports`` koleksiyonunu içermesi için, 1 GB daha ekleyin. ``src``yi eklemek için 512 MB ekleyin.

source: The name of your virtual machine image is ``centos``; you need this name when you use :command:`virsh` commands to manipulate the state of the image.
de: Der Name Ihres virtuellen Maschinenbildes ist ``centos``; Sie benötigen diesen Namen, wenn Sie :command: `virsh` Befehle verwenden, um den Zustand des Abbildes zu manipulieren.
id: Nama image mesin virtual Anda adalah ``centos``; Anda perlu nama ini ketika Anda menggunakan perintah :command: `virsh` untuk memanipulasi keadaan image.
tr_tr: Sanal makine imajınızın ismi ``centos``; bu isme imaj durumunu değiştirmek için :command:`virsh` komutları kullanırken ihtiyaç duyarsınız.

source: The name of your virtual machine image is ``fedora``; you need this name when you use :command:`virsh` commands to manipulate the state of the image.
de: Der Name Ihres virtuellen Maschinenbildes ist ``fedora``; Sie benötigen diesen Namen, wenn Sie :command: `virsh` Befehle verwenden, um den Zustand des Abbildes zu manipulieren.
id: Nama image mesin virtual Anda adalah ``fedora``; Anda memerlukan nama ini saat Anda menggunakan perintah :command:`virsh` untuk memanipulasi keadaan image.
tr_tr: Sanal makinenizin adı ``fedora``; bu isme :command:`virsh` komutlarını kullanarak imaj durumuna müdahele etmek istediğinizde ihtiyaç duyacaksınız.

source: The object may optionally define required properties under the semantic understanding that if you use the object, you should provide all required properties.
de: Das Objekt kann optional die erforderlichen Eigenschaften unter dem semantischen Verständnis definieren, dass bei Verwendung des Objekts alle erforderlichen Eigenschaften bereitgestellt werden sollen.
id: Objek secara opsional dapat mendefinisikan properti yang diperlukan di bawah pemahaman semantik bahwa jika Anda menggunakan objek, Anda harus menyediakan semua properti yang dibutuhkan.
tr_tr: Nesne isteğe bağlı olarak gerekli özellikleri nesneyi kullanmanız durumunda gerekli tüm özellikleri sağlamanızın gerektiği anlamsal yapıyla tanımlayabilir.

source: The openSUSE community provides images for `openSUSE <http://download.opensuse.org/repositories/Cloud:/Images:/>`_.
tr_tr: openSUSE topluluğu `openSUSE <http://download.opensuse.org/repositories/Cloud:/Images:/>`_ için imajları sağlar.
