Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: ``guestfish`` does not mount the image directly into the local file system. Instead, it provides you with a shell interface that enables you to view, edit, and delete files. Many of :command:`guestfish` commands, such as :command:`touch`, :command:`chmod`, and :command:`rm`, resemble traditional bash commands.
de: ``guestfish`` platziert das Abbild nicht direkt in das lokale Dateisystem. Stattdessen bietet es Ihnen eine Shell-Schnittstelle, mit der Sie Dateien anzeigen, bearbeiten und löschen können. Viele von :command:`guestfish` Befehle, wie zB :command:`touch`,:command:`chmod` und :command:` rm`, ähneln traditionellen bash-Befehlen.
id: ``guestfish`` tidak me-mount image langsung ke sistem file lokal. Sebaliknya, ia menyediakan Anda dengan antarmuka shell yang memungkinkan Anda untuk melihat, mengedit, dan menghapus file. Banyak dari perintah :command:`guestfish`, seperti :command:`touch`, :command:`chmod`, dan :command:`rm`, menyerupai bash command tradisional.
tr_tr: ``guestfish`` imajı doğrudan yerel dosya sistemine bağlamaz. Bunun yerine, dosyaları görüntülemenizi, düzenlemenizi ve silmenizi sağlayan bir kabuk arayüzü sağlar. Çoğu :command:`guestfish` komutu, örneğin :command:`touch`, :command:`chmod`, ve :command:`rm` geleneksel bash komutlarını andırır.

source: `image-bootstrap <https://github.com/hartwork/image-bootstrap>`_ is a command line tool that generates bootable virtual machine images with support of Arch, Debian, Gentoo, Ubuntu, and is prepared for use with OpenStack.
de: `image-bootstrap <https://github.com/hartwork/image-bootstrap> `_ ist ein Befehlszeilentool, das bootfähige virtuelle Maschinenbilder mit Unterstützung von Arch, Debian, Gentoo, Ubuntu erzeugt und für den Einsatz mit OpenStack vorbereitet ist.
id: `image-bootstrap <https://github.com/hartwork/image-bootstrap>`_ adalah alat command line yang menghasilkan image mesin virtual bootable dengan dukungan dari Arch, Debian, Gentoo, Ubuntu, dan siap untuk digunakan dengan OpenStack.
tr_tr: `image-bootstrap <https://github.com/hartwork/image-bootstrap>`_ Arch, Debian, Gentoo, Ubuntu destekli ön yüklenebilir sanal makine imajları üreten bir komut satırı aracıdır, ve OpenStack ile kullanıma hazırdır.

source: `imagefactory <http://imgfac.org/>`_ is a newer tool designed to automate the building, converting, and uploading images to different cloud providers. It uses Oz as its back-end and includes support for OpenStack-based clouds.
de: 'imagefactory' <http://imgfac.org/> `_ ist ein neueres Werkzeug, das entworfen ist, um das Bauen zu automatisieren, umzuwandeln und Abbilder auf verschiedene Cloud-Anbieter hochzuladen. Es nutzt Oz als Back-End und beinhaltet Unterstützung für OpenStack-basierte Clouds.
id: `imagefactory <http://imgfac.org/>`_ adalah alat baru yang dirancang untuk mengotomatisasi bangunan, mengubah, dan meng-upload image ke provider cloud yang berbeda. Menggunakan Oz sebagai back-end dan termasuk dukungan untuk cloud berbasis OpenStack.
tr_tr: `imagefactory <http://imgfac.org/>`_ imajların farklı bulut sağlayıcılar için inşa edilmesi, dönüştürülmesi ve yüklenmesini otomatikleştirmek için tasarlanan daha yeni bir araçtır. Arka ucunda Oz kullanır ve OpenStack tabanlı bulutları da destekler.

source: `virt-df <http://libguestfs.org/virt-df.1.html>`_ for displaying free space inside of an image.
de: `virt-df <http://libguestfs.org/virt-df.1.html> `_ zum Anzeigen von freiem Speicherplatz innerhalb eines Abbildes.
id: `virt-df <http://libguestfs.org/virt-df.1.html>`_ untuk menampilkan ruang bebas di dalam sebuah image.
tr_tr: Bir imaj içinde boş alanı görüntülemek için `virt-df <http://libguestfs.org/virt-df.1.html>`_.

source: `virt-edit <http://libguestfs.org/virt-edit.1.html>`_ for editing a file inside of an image.
de: `virt-edit` <http://libguestfs.org/virt-edit.1.html> `_ zum Bearbeiten einer Datei innerhalb eines Abbildes.
id: `virt-edit <http://libguestfs.org/virt-edit.1.html>`_ untuk mengedit file dalam sebuah image.
tr_tr: Bir imaj içinden dosya düzenlemek için `virt-edit <http://libguestfs.org/virt-edit.1.html>`_ .

source: `virt-p2v <http://libguestfs.org/virt-v2v/>`_ for converting a physical machine to an image that runs on KVM.
de: `virt-p2v <http://libguestfs.org/virt-v2v/> `_ für die Umwandlung eines physischen Rechners in ein Abbild, das auf KVM läuft.
id: `virt-p2v <http://libguestfs.org/virt-v2v/>`_ untuk mengkonversi mesin fisik menjadi image yang berjalan pada KVM.
tr_tr: Bir fiziksel makineyi KVM üzerinde çalışan bir imaja çevirmek için `virt-p2v <http://libguestfs.org/virt-v2v/>`_.

source: `virt-resize <http://libguestfs.org/virt-resize.1.html>`_ for resizing an image.
de: `virt-resize` <http://libguestfs.org/virt-resize.1.html> `_ zur Größenänderung eines Abbildes.
id: `virt-resize <http://libguestfs.org/virt-resize.1.html>`_ untuk mengubah ukuran image.
tr_tr: Bir imajı boyutlandırmak için `virt-resize <http://libguestfs.org/virt-resize.1.html>`_.

source: `virt-sparsify <http://libguestfs.org/virt-sparsify.1.html>`_ for making an image sparse.
de: `virtu-sparsify <http://libguestfs.org/virt-sparsify.1.html>`_ für ein Abbild sparsam zu halten
id: `virt-sparsify <http://libguestfs.org/virt-sparsify.1.html>`_ untuk membuat image yang tipis.
tr_tr: Bir imajı seyrekleştirmek için `virt-sparsify <http://libguestfs.org/virt-sparsify.1.html>`_.

source: `virt-sysprep <http://libguestfs.org/virt-sysprep.1.html>`_ for preparing an image for distribution (for example, delete SSH host keys, remove MAC address info, or remove user accounts).
de: `virt-sysprep <http://libguestfs.org/virt-sysprep.1.html> `_ für die Vorbereitung eines Abbildes für die Verteilung (z. B. löschen SSH-Host-Schlüssel, entfernen MAC-Adresse info, oder entfernen Sie Benutzerkonten).
id: `virt-sysprep <http://libguestfs.org/virt-sysprep.1.html>`_ untuk persiapan image untuk distribusi (misalnya, menghapus kunci host SSH, menghapus info alamat MAC, atau menghapus akun pengguna).
tr_tr: Bir imajı dağıtım için hazırlamak için (örneğin, SSH sunucu anahtarlarını silmek, MAC adres bilgisini silmek, veya kullanıcı hesaplarını silmek) `virt-sysprep <http://libguestfs.org/virt-sysprep.1.html>`_.

source: `virt-v2v <http://libguestfs.org/virt-v2v/>`_ for converting Xen and VMware images to KVM images.
de: `virt-v2v <http://libguestfs.org/virt-v2v/>`_ für die Umwandlung von Xen und VMware Abbildern in KVM Abbilder.
id: `virt-v2v <http://libguestfs.org/virt-v2v/>`_ untuk mengkonversi image Xen dan VMware ke image KVM.
tr_tr: Xen ve VMware imajlarını KVM imajlarına çevirmek için `virt-v2v <http://libguestfs.org/virt-v2v/>`_.

source: if you use Fedora, CentOS 7, or RHEL 7, the ``cloud-utils-growpart`` package, which contains the ``growpart`` tool for extending partitions,
de: wenn Sie Fedora, CentOS 7 oder RHEL 7 verwenden, wird das ``cloud-utils-growpart``-Paket, das das ``growpart``-Tool enthält, um Partitionen zu erweitern,
id: Jika Anda menggunakan Fedora, CentOS 7, atau RHEL 7, paket ``cloud-utils-growpart``, yang berisi alat ``growpart`` untuk memperluas partisi,
tr_tr: Fedora, CentOS 7 veya RHEL 7 kullanıyorsanız, ``cloud-utils-growpart`` paketi, bölümleri genişletmeye yarayan ``growpart`` aracını da içerir,

source: if you use Ubuntu or Debian, the `cloud-initramfs-growroot <https://launchpad.net/cloud-initramfs-tools>`_ package , which supports resizing root partition on the first boot.
de: wenn Sie Ubuntu oder Debian benutzen, ist das `cloud-initramfs-growroot` <https://launchpad.net/cloud-initramfs-tools> `_ -Paket, das die Größe der Root-Partition beim ersten Start unterstützt.
id: jika anda menggunakan Ubuntu atau Debian, paket `cloud-initramfs-growroot <https://launchpad.net/cloud-initramfs-tools>`_ , dimana mendukung resizing partisi root pada boot pertama.
tr_tr: Ubuntu veya Debian kullanıyorsanız, `cloud-initramfs-growroot <https://launchpad.net/cloud-initramfs-tools>`_ paketi, ilk önyüklemede kök bölümü yendien boyutlandırmayı destekler.

source: none
de: keiner
id: none (tidak ada)
tr_tr: hiçbiri

source: openSUSE and SUSE Linux Enterprise Server
de: openSUSE und SUSE Linux Enterprise Server
id: openSUSE dan SUSE Linux Enterprise Server
tr_tr: openSUSE ve SUSE Linux Kurumsal Sunucu

source: qemu-img convert: raw, qcow2, qed, vdi, vmdk, vhd
de: qemu-img konvertieren: roh, qcow2, qed, vdi, vmdk, vhd
id: Konversi qemu-img: raw, qcow2, qed, vdi, vmdk, vhd
tr_tr: qemu-img dönüştür: raw, qcow2, qed, vdi, vmdk, vhd

source: qemu-img format strings
id: string format qemu-img
tr_tr: qemu-img biçim karakter dizileri

source: space
de: Platz
tr_tr: boşluk

source: the `cloud-init <https://launchpad.net/cloud-init>`__ package,
de: das `cloud-init` <https://launchpad.net/cloud-init> `__ Paket,
id: Paket `cloud-init <https://launchpad.net/cloud-init>`__,
tr_tr: `cloud-init <https://launchpad.net/cloud-init>`__ paketi,

source: the `cloud-utils <https://launchpad.net/cloud-utils>`_ package, which, on Ubuntu and Debian, also contains the ``growpart`` tool for extending partitions,
de: das `cloud-utils` <https://launchpad.net/cloud-utils> `_ Paket, das auf Ubuntu und Debian auch das ``growpart`` Werkzeug für das Erweitern von Partitionen enthält,
id: Paket `cloud-utils <https://launchpad.net/cloud-utils>`_, dimana, pada Ubuntu dan Debian, juga berisi alat ``growpart`` untuk memperluas partisi,
tr_tr: `cloud-utils <https://launchpad.net/cloud-utils>`_ paketi, Ubuntu ve Debian'da ayrıca bölümleri genişletmeye yarayan ``growpart`` aracını da içerir,

source: the guestfish prompt looks like a fish: ``><fs>``.
de: Der guestfish sieht wie ein Fisch aus: ``><fs>``.
id: Prompt guestfish terlihat seperti ini fish: ``><fs>``.
tr_tr: guestfish ekranı bir balık gibi görünür: ``><fs>``.

source: virt-* tools
de: virt-* Werkzeuge
tr_tr: virt-* araçları

source: Download the signed VirtIO drivers ISO from the `Fedora website <https://docs.fedoraproject.org/en-US/quick-docs/creating-windows-virtual-machines-using-virtio-drivers/index.html>`_.
de: Laden Sie das signierten VirtIO-Treiber-ISO von der `Fedora-Website herunter <https://docs.fedoraproject.org/en-US/quick-docs/creating-windows-virtual-machines-using-virtio-drivers/index.html>`_.
id: Unduh driver Virtio yang sudah ditandatangani ISO dari `Fedora website <https://docs.fedoraproject.org/en-US/quick-docs/creating-windows-virtual-machines-using-virtio-drivers/index.html>`_.

source: If your deployment uses QEMU or KVM, we recommend using the images in qcow2 format. The most recent 64-bit qcow2 image as of this writing is `cirros-0.4.0-x86_64-disk.img <http://download.cirros-cloud.net/0.4.0/cirros-0.4.0-x86_64-disk.img>`_.
de: Wenn Ihre Bereitstellung QEMU oder KVM verwendet, empfehlen wir die Verwendung der Abbilder im qcow2-Format. Das jüngste 64-Bit-qcow2-Abbild von diesem Schreiben ist `cirros-0.4.0-x86_64-disk.img <http://download.cirros-cloud.net/0.4.0/cirros-0.4.0-x86_64-disk.img>`_.

source: In a CirrOS image, the login account is ``cirros``. The password is ``gocubsgo``.
de: In einem CirrOS-Abbild ist das Login-Konto ``cirros``. Das Passwort ist ``gocubsgo``.

source: In an openSUSE cloud image, the login account is ``opensuse``.
de: In einem openSUSE-Cloudabbild ist das Login-Konto ``opensuse``.
id: Dalam sebuah openSUSE cloud image, akun login adalah ``opensuse``.

source: The openSUSE community provides images for `openSUSE <https://software.opensuse.org/distributions/leap#jeos-ports>`_.
de: Die openSUSE-Community bietet Abbilder für `openSUSE <https://software.opensuse.org/distributions/leap#jeos-ports>`_.

source: This example creates the image as before, but for arm architecture. More elements are available in the `git source directory <https://opendev.org/openstack/diskimage-builder/src/branch/master/diskimage_builder/elements>`_ and documented in the `diskimage-builder elements documentation <https://docs.openstack.org/diskimage-builder/latest/elements.html>`_.
de: Dieses Beispiel erschafft das Abbild wie bisher, aber für die Arm-Architektur. Weitere Elemente stehen im `git Quellverzeichnis zur Verfügung <https://opendev.org/openstack/diskimage-builder/src/branch/master/diskimage_builder/elements>`_ und dokumentiert in der` diskimage-builder elements documentation <https://docs.openstack.org/diskimage-builder/latest/elements.html> `_.
id: Contoh ini membuat gambar seperti sebelumnya, tetapi untuk arsitektur lengan (arm architecture). Lebih banyak elemen tersedia di direktori `git source <https://opendev.org/openstack/diskimage-builder/src/branch/master/diskimage_builder/elements>` _ dan didokumentasikan dalam dokumentasi `diskimage-builder elements documentation <https: //docs.openstack.org/diskimage-builder/latest/elements.html>`_.

source: To build an image, type this:
de: Um ein Abbild zu erstellen, geben Sie ein:
id: Untuk membuat image, ketikkan ini:

source: To create an image for the Database service, see `Building Guest Images for OpenStack Trove <https://docs.openstack.org/trove/latest/admin/building_guest_images.html>`_.
de: Um ein Abbild für den Datenbankdienst zu erstellen, siehe `Building Guest Images für OpenStack Trove <https://docs.openstack.org/trove/latest/admin/building_guest_images.html> `_.
id: Untuk membuat image untuk layanan Database, lihat `Building Guest Images for OpenStack Trove <https://docs.openstack.org/trove/latest/admin/building_guest_images.html>`_.

source: `Diskimage-builder <https://docs.openstack.org/diskimage-builder/latest/>`_ is an automated disk image creation tool that supports a variety of distributions and architectures. Diskimage-builder (DIB) can build images for Fedora, Red Hat Enterprise Linux, Ubuntu, Debian, CentOS, and openSUSE. DIB is organized in a series of elements that build on top of each other to create specific images.
de: `Diskimage-Builder <https://docs.openstack.org/diskimage-builder/latest/> `_ ist ein automatisiertes Festplatten-Image-Erstellungswerkzeug, das eine Vielzahl von Distributionen und Architekturen unterstützt. Diskimage-Builder (DIB) kann Abbilder für Fedora, Red Hat Enterprise Linux, Ubuntu, Debian, CentOS und openSUSE erstellen. DIB ist in einer Reihe von Elementen organisiert, die aufeinander aufbauen, um bestimmte Abbilder zu erstellen.
id: `Diskimage-builder <https://docs.openstack.org/diskimage-builder/latest/>`_ adalah alat pembuatan image disk otomatis yang mendukung berbagai distribusi dan arsitektur. Diskimage-builder (DIB) dapat membangun image untuk Fedora, Red Hat Enterprise Linux, Ubuntu, Debian, CentOS, dan openSUSE. DIB disusun dalam serangkaian elemen yang saling membangun untuk menciptakan citra yang spesifik.

source: Adding metadata to an image
id: Menambahkan metadata ke image

source: Assume that the name of your virtual machine image is ``ubuntu-18.04``, which you need to know when you use :command:`virsh` commands to manipulate the state of the image.
id: Asumsikan bahwa nama image mesin virtual Anda adalah ``ubuntu-18.04``, yang perlu Anda ketahui ketika Anda menggunakan perintah :command:`virsh` untuk memanipulasi keadaan image.

source: Because VNC is a standard protocol, there are multiple clients available that implement the VNC spec, including `TigerVNC <https://tigervnc.org/>`_ (multiple platforms), `TightVNC <http://tightvnc.com/>`_ (multiple platforms), `RealVNC <http://realvnc.com/>`_ (multiple platforms), `Chicken <http://sourceforge.net/projects/chicken/>`_ (Mac OS X), `Krde <http://userbase.kde.org/Krdc>`_ (KDE), `Vinagre <https://wiki.gnome.org/Apps/Vinagre>`_ (GNOME).
id: Karena VNC adalah protokol standar, ada beberapa klien yang tersedia yang mengimplementasikan spesifikasi VNC, termasuk `TigerVNC <https://tigervnc.org/>`_ (multiple platforms), `TightVNC <http://tightvnc.com/>`_ (multiple platforms), `RealVNC <http://realvnc.com/>`_ (multiple platforms), `Chicken <http://sourceforge.net/projects/chicken/>`_ (Mac OS X), `Krde <http://userbase.kde.org/Krdc>`_ (KDE), `Vinagre <https://wiki.gnome.org/Apps/Vinagre>`_ (GNOME).

source: Because the goal is to make the smallest possible base image, this example uses the network installation ISO. The Ubuntu 64-bit 18.04 network installation ISO is at the `Ubuntu download page <http://archive.ubuntu.com/ubuntu/dists/bionic/main/installer-amd64/current/images/netboot/mini.iso>`_.
id: Karena tujuannya adalah untuk membuat image dasar sekecil mungkin, contoh ini menggunakan ISO instalasi jaringan. ISO instalasi jaringan Ubuntu 64-bit 18.04 ada di `Ubuntu download page <http://archive.ubuntu.com/ubuntu/dists/bionic/main/installer-amd64/current/images/netboot/mini.iso>`_.

source: Canonical maintains an official set of `Ubuntu-based images <https://cloud-images.ubuntu.com/>`_.
id: Canonical mempertahankan set resmi `Ubuntu-based images <https://cloud-images.ubuntu.com/>`_.

source: Click :guilabel:`Load driver` and browse the file system, and select the ``E:\NETKVM\2k12\amd64`` folder.
id: Click :guilabel:`Load driver` dan telusuri sistem file, dan pilih folder ``E:\NETKVM\2k12\amd64``,

source: Cloudbase Solutions provides the last available trial version of `Windows Server 2012 R2 <https://cloudbase.it/windows-cloud-images/>`_. This image includes cloudbase-init plus VirtIO drivers on KVM. You can build your own image based on Windows Server 2016, 2019, Windows 10 etc) with `Cloudbase Imaging Tools <https://github.com/cloudbase/windows-openstack-imaging-tools/>`_.
id: Cloudbase Solutions menyediakan versi uji coba terakhir dari `Windows Server 2012 R2 <https://cloudbase.it/windows-cloud-images/>` _. Image ini termasuk cloudbase-init plus driver VirtIO di KVM. Anda dapat membangun image Anda sendiri berdasarkan Windows Server 2016, 2019, Windows 10 dll) dengan `Cloudbase Imaging Tools <https://github.com/cloudbase/windows-openstack-imaging-tools/>`_.

source: Common image properties are also specified in the ``/etc/glance/schema-image.json`` file. Other useful property keys and values, are listed in the `Useful image properties <https://docs.openstack.org/glance/latest/admin/useful-image-properties.html>`_ section of the Glance Administration Guide.
id: Properti image umum juga ditentukan dalam file ``/etc/glance/schema-image.json``. Kunci dan nilai properti berguna lainnya, tercantum di bagian `Useful image properties <https://docs.openstack.org/glance/latest/admin/useful-image-properties.html>`_ bagian dari Glance Administration Guide.

source: Compute's ``ImagePropertiesFilter`` value is specified in the ``enabled_filters`` value in the ``[filter_scheduler]`` section of the ``/etc/nova/nova.conf`` file.
id: Nilai ``ImagePropertiesFilter`` Compute ditentukan dalam nilai ``enabled_filters`` di bagian ``[filter_scheduler]`` pada file ``/etc/nova/nova.conf``.

source: Define a password for the administrator when prompted.
id: Tetapkan kata sandi untuk administrator saat diminta.

source: Enable the VirtIO drivers. By default, the Windows installer does not detect the disk.
id: Aktifkan driver VirtIO. Secara default, penginstal Windows tidak mendeteksi disk.

source: For more information about the OpenStack Metadefs catalog, see:
id: Untuk informasi lebih lanjut tentang katalog OpenStack Metadefs, lihat:

source: ISO files for Windows 10 are available on `Microsoft Windows 10 Downloadpage <https://www.microsoft.com/en-us/software-download/windows10>`_ and `Microsoft Evaluation Center <https://www.microsoft.com/evalcenter/evaluate-windows-10-enterprise>`_.
id: File ISO untuk Windows 10 tersedia di `Microsoft Windows 10 Downloadpage <https://www.microsoft.com/en-us/software-download/windows10>`_ dan `Microsoft Evaluation Center <https://www.microsoft.com/evalcenter/evaluate-windows-10-enterprise>`_.

source: If your deployment uses QEMU or KVM, we recommend using the images in qcow2 format, with name ending in ``.img``. The most recent version of the 64-bit amd64-arch QCOW2 image for Ubuntu 18.04 is `bionic-server-cloudimg-amd64-disk.img <https://cloud-images.ubuntu.com/bionic/current/bionic-server-cloudimg-amd64.img>`_.
id: Jika penyebaran Anda menggunakan QEMU atau KVM, kami sarankan untuk menggunakan images dalam format qcow2, dengan nama yang berakhiran `` .img``. Versi terbaru dari gambar QCOW2 amd64-arch 64-bit untuk Ubuntu 18.04 adalah `bionic-server-cloudimg-amd64-disk.img <https://cloud-images.ubuntu.com/bionic/current/bionic-server -cloudimg-amd64.img> `_.

source: If your deployment uses QEMU or KVM, we recommend using the images in qcow2 format. The most recent 64-bit qcow2 image as of this writing is `cirros-0.5.1-x86_64-disk.img <http://download.cirros-cloud.net/0.5.1/cirros-0.5.1-x86_64-disk.img>`_.
id: Jika penyebaran Anda menggunakan QEMU atau KVM, sebaiknya gunakan images dalam format qcow2. Image qcow2 64-bit terbaru saat tulisan ini dibuat adalah `cirros-0.5.1-x86_64-disk.img <http://download.cirros-cloud.net/0.5.1/cirros-0.5.1-x86_64- disk.img> `_.

source: Image metadata (also known as "image properties") provide information about the virtual disk stored by the Image service. The metadata is stored as part of the image record associated with the image data by the Image service. Image metadata can help end users determine the nature of an image, and is used by associated OpenStack components and drivers which interface with the Image service.
id: Metadata image (juga dikenal sebagai "image properties") memberikan informasi tentang disk virtual yang disimpan oleh layanan Image. Metadata disimpan sebagai bagian dari rekaman image yang terkait dengan data image oleh layanan Image. Metadata image dapat membantu pengguna akhir menentukan sifat suatu image, dan digunakan oleh komponen dan driver OpenStack terkait yang berinteraksi dengan layanan Image.

source: Image metadata can also determine the scheduling of hosts. If specific metadata are set on an image (possible metadata are architecture, hypervisor type, and virtual machine mode), and Compute is configured so that the ``ImagePropertiesFilter`` scheduler filter is enabled (default), then the scheduler only considers compute hosts that satisfy the specified properties.
id: Metadata image juga dapat menentukan penjadwalan host. Jika metadata tertentu ditetapkan pada image (metadata yang mungkin adalah arsitektur, tipe hypervisor, dan mode mesin virtual), dan Compute dikonfigurasikan sehingga filter penjadwal ``ImagePropertiesFilter`` diaktifkan (default), maka penjadwal hanya mempertimbangkan penghitungan host host yang memenuhi properti yang ditentukan.

source: Images are arranged by Ubuntu release, and by image release date, with ``current`` being the most recent. For example, the page that contains the most recently built image for Ubuntu 18.04 Bionic Beaver is `Ubuntu 18.04 LTS (Bionic Beaver) Daily Build <https://cloud-images.ubuntu.com/bionic/current/>`_. Scroll to the bottom of the page for links to the images that can be downloaded directly.
id: Images diatur oleh rilis Ubuntu, dan menurut tanggal rilis image, dengan ``current`` menjadi yang terbaru. Misalnya, halaman yang berisi image yang paling baru dibuat untuk Ubuntu 18,04 Bionic Beaver adalah `Ubuntu 18,04 LTS (Bionic Beaver) Daily Build <https://cloud-images.ubuntu.com/bionic/current/>` _. Scroll ke bagian bawah halaman untuk tautan ke images yang dapat diunduh secara langsung.
