Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: If you leave out the ``-u`` flag, or you want to edit the file to do additional customizations, you can use the :command:`oz-customize` command, using the libvirt XML file that :command:`oz-install` creates. For example:
de: Wenn Sie die ``-u`` Option weglassen oder wenn Sie die Datei bearbeiten möchten, um zusätzliche Anpassungen zu machen, können Sie den Befehl :command: `oz-customize` verwenden, erschaffen wird die libvirt XML Datei mit :command:` oz -install` Beispielsweise:
id: Jika Anda meninggalkan keluar flag ``-u``, atau Anda ingin mengedit file untuk melakukan kustomisasi tambahan, Anda dapat menggunakan perintah :command:`oz-customize`, penggunaan file XML libvirt dimana :command:`oz-install` membuatnya. Sebagai contoh:
tr_tr: ``-u`` bayrağını kullanmazsanız, veya dosyayı düzenleyerek ek özelleştirmeler yapmak isterseniz, :command:`oz-install` komutunun oluşturduğu libvirt XML dosyasını kullanarak :command:`oz-customize` komutunu kullanabilirsiniz. Örneğin:

source: If you modify this example, the root partition, which is mounted on ``/``, must be the last partition on the drive so that it can expand at run time to the disk size that your instance type provides. Also note that ``bsd-cloudinit`` currently has a hard-coded assumption that this is the second partition.
de: Wenn Sie dieses Beispiel ändern, muss die Root-Partition, die auf ``/`` montiert wird, die letzte Partition auf dem Laufwerk sein, damit sie zur Laufzeit auf die Festplattengröße erweitern kann, die Ihr Instanztyp bereitstellt. Beachten Sie auch, dass ``bsd-cloudinit`` derzeit eine hartcodierte Annahme hat, dass dies die zweite Partition ist.
id: Jika Anda mengubah contoh ini, partisi root, yang dipasang (mounted) di ``/ ``, harus menjadi partisi terakhir pada drive sehingga drive dapat memperluasnya sejalan dengan perluasan disk dimana jenis instance Anda menyediakannya. Juga perhatikan bahwa `` bsd-cloudinit`` saat ini memiliki asumsi hard-coded dimana partisi root adalah partisi kedua.
tr_tr: Bu örneği değiştirirseniz, ``/`` yoluna bağlı kök bölüm aygıttaki son bölüm olmalıdır böylece çalışma zamanında sunucu türünüzün sağladığı disk boyutuna genişleyebilir. Ayrıca ``bsd-cloudinit``in şu an bu bölümün son bölüm olduğunu varsaydığını not edin.

source: If you plan to create a virtual machine image on a machine that can run X11 applications, the simplest way to do so is to use the :command:`virt-manager` GUI, which is installable as the ``virt-manager`` package on both Fedora-based and Debian-based systems. This GUI has an embedded VNC client that will let you view and interact with the guest's graphical console.
de: Wenn Sie planen, ein virtuelles Maschinenbild auf einer Maschine zu erstellen, die X11-Anwendungen ausführen kann, ist der einfachste Weg, um dies zu tun der Befehl :command:`virt-manager` GUI, der als` `virt-manager` installiert werden kann und im Paket auf Fedora-basierten und Debian-basierten Systemen enthalten ist. Diese GUI verfügt über einen eingebetteten VNC-Client, mit dem Sie die grafische Konsole des Gastes anzeigen und interagieren können.
id: Jika Anda berencana untuk membuat image mesin virtual pada mesin yang dapat menjalankan aplikasi X11, cara paling sederhana untuk melakukannya adalah dengan menggunakan GUI :command: `virt-manager`, yang diinstal sebagai paket ``virt-manager`` pada sistem berbasis Fedora dan berbasis Debian. GUI ini memiliki klien VNC yang tertanam dimana akan membiarkan Anda melihat dan berinteraksi dengan konsol grafis guest.
tr_tr: X11 uygulamaları çalıştırabilen bir makinede sanal makine imajı oluşturmayı planlıyorsanız, bunu yapmanın en kolay yolu :command:`virt-manager` GUI'yi kullanmaktır, bu paket Fedora ve Debian tabanlı sistemlerde ``virt-manager`` paketinin kurulmasıyla elde edilir. Bu GUI misafirin grafik konsolunu görüntüleyebilmeniz ve etkileşime geçebilmeniz için gömülü bir VNC istemcisine sahiptir.

source: If you use LVM, you can add a new LVM entry to the partition table, create a new LVM physical volume, add it to the volume group, and extend the logical partition with the root volume.
de: Wenn Sie LVM verwenden, können Sie der Partitionstabelle einen neuen LVM-Eintrag hinzufügen, ein neues LVM-Volume erstellen, die Volume-Gruppe hinzufügen und die logische Partition mit dem Root-Volume erweitern.
id: Jika Anda menggunakan LVM, Anda dapat menambahkan entri LVM baru ke dalam tabel partisi, membuat volume fisik LVM baru, tambahkan ke grup volume, dan memperluas partisi logical dengan root volume.
tr_tr: LVM kullanıyorsanız, bölüm tablosuna yeni bir LVM girdisi ekleyebilir, yeni bir LVM fiziksel birimi oluşturabilir, onu bir birim grubuna ekleyebilir, ve mantıksal bölümü kök birimle genişletebilirsiniz.

source: If you use the :command:`virt-install` command, the commands should look something like this:
de: Wenn Sie den Befehl :command:`virt-install` verwenden, sollten die Befehle so aussehen:
id: Jika Anda menggunakan perintah :command: `virt-install`, perintah harus terlihat seperti ini:
tr_tr: :command:`virt-install` komutunu kullanırsanız, komutlar şöyle görünmelidir:

source: If you use the OpenStack XenAPI driver, the Compute service automatically adjusts the partition and file system for your instance on boot. Automatic resize occurs if the following conditions are all true:
de: Wenn Sie den OpenStack XenAPI-Treiber verwenden, passt der Compute-Dienst automatisch die Partition und das Dateisystem für Ihre Instanz beim Booten an. Automatische Größenänderung tritt auf, wenn die folgenden Bedingungen zutreffen:
id: Jika Anda menggunakan driver OpenStack XenAPI, layanan Compute secara otomatis menyesuaikan partisi dan sistem file instance Anda pada saat boot. Perubahan secara otomatis terjadi jika kondisi berikut ini semua benar:
tr_tr: OpenStack XenAPI sürücüsünü kullanırsanız, Hesaplama servisi otomatik olarak sunucunuz için bölümü ve dosya sistemini ayarlar. Şu durumların hepsi karşılanıyorsa otomatik yeniden boyutlandırma yapılır:

source: If you want to modify this image to load the 8021q kernel at boot time, you must create an executable script in the ``/etc/sysconfig/modules/`` directory. You can use the :command:`touch` guestfish command to create an empty file, the :command:`edit` command to edit it, and the :command:`chmod` command to make it executable.
de: Wenn Sie dieses Abbild ändern möchten, um den 8021q-Kernel zum Booten zu laden, müssen Sie ein ausführbares Skript im Verzeichnis ``/etc/sysconfig/modules/`` erstellen. Sie können den Befehl :command:`touch` guestfish verwenden, um eine leere Datei zu erstellen, den Befehl :command:`edit`, um ihn zu bearbeiten, und den Befehl :command:`chmod`, um ihn ausführbar zu machen.
id: Jika Anda ingin memodifikasi image ini untuk memuat kernel 8021q pada saat boot, Anda harus membuat skrip yang dapat dieksekusi di direktori ``/etc/sysconfig/modules/``. Anda dapat menggunakan perintah guestfish :command:`touch` untuk membuat file kosong, perintah :command:`edit` untuk mengeditnya, dan perintah :command:`chmod` untuk membuatnya executable.
tr_tr: Bu imajı değiştirerek önyüklemede 8021q çekirdeğini yüklemek isterseniz, ``/etc/sysconfig/modules/`` dizininde çalıştırılabilir bir betik oluşturmalısınız. Boş bir dosya oluşturmak için :command:`touch` guestfish komutunu kullanabilir, :command:`edit` komutuyla dosyayı düzenleyebilir, ve :command:`chmod` komutuyla çalıştırılabilir yapabilirsiniz.

source: If you've created a VDI image using VirtualBox, you can convert it to raw format using the ``VBoxManage`` command-line tool that ships with VirtualBox. On Mac OS X, and Linux, VirtualBox stores images by default in the ``~/VirtualBox VMs/`` directory. The following example creates a raw image in the current directory from a VirtualBox VDI image.
de: Wenn Sie ein VDI-Abbild mit VirtualBox erstellt haben, können Sie es mit dem `` VBoxManage`` Befehlszeilen-Tool, das mit VirtualBox geliefert wird, in das Raw-Format umwandeln. Unter Mac OS X und Linux speichert VirtualBox standardmäßig Abbilder im Verzeichnis ``~/VirtualBox VMs / ``. Das folgende Beispiel erstellt ein Rohbild im aktuellen Verzeichnis aus einem VirtualBox-VDI-Abbild.
id: Jika Anda telah membuat image VDI menggunakan VirtualBox, Anda dapat mengkonversikan ke format baku (raw) menggunakan alat command-line ``VBoxManage`` yang dikirimkan dengan VirtualBox. Pada Mac OS X, dan Linux, VirtualBox menyimpan image secara default di direktori ``~/ VirtualBox VMs/``. Contoh berikut membuat image baku di direktori saat ini dari image VirtualBox VDI.
tr_tr: VirtualBox kullanarak bir VDI imajı oluşturduysanız, VirtualBox ile gelen ``VBoxManage`` komut satırı aracını kullanarak raw biçimine dönüştürebilirsiniz. Mac OS X ve Linux üzerinde, VirtualBox imajları öntanımlı olarak ``~/VirtualBox VMs/`` dizinine kaydeder. Aşağıdaki örnek mevcut dizinde bir VirtualBox VDI imajından raw imaj oluşturur.

source: If your deployment uses QEMU or KVM, we recommend using the images in qcow2 format. The most recent 64-bit qcow2 image as of this writing is `cirros-0.3.5-x86_64-disk.img <http://download.cirros-cloud.net/0.3.5/cirros-0.3.5-x86_64-disk.img>`_.
tr_tr: Kurulumunuz QEMU veya KVM kullanıyorsa, qcow2 biçiminde imajlar kullanmanızı öneriyoruz. Yazının yazılma tarihinde en güncel 64-bit qcow2 imajı şudur: `cirros-0.3.5-x86_64-disk.img <http://download.cirros-cloud.net/0.3.5/cirros-0.3.5-x86_64-disk.img>`_.

source: If your deployment uses QEMU or KVM, we recommend using the images in qcow2 format. The most recent version of the 64-bit QCOW2 image for Ubuntu 16.04 is `xenial-server-cloudimg-amd64-disk1.img <http://cloud-images.ubuntu.com/xenial/current/xenial-server-cloudimg-amd64-disk1.img>`_.
de: Wenn Ihre Bereitstellung QEMU oder KVM verwendet, empfehlen wir die Verwendung der Abbilder im qcow2-Format. Die neueste Version des 64-Bit-QCOW2-Abbildes für Ubuntu 16.04 ist `xenial-server-cloudimg-amd64-disk1.img` <http://cloud-images.ubuntu.com/xenial/current/xenial-server-cloudimg-amd64-disk1.img> `_.
tr_tr: Kurulumunuz QEMU veya KVM kullanıyorsa, qcow2 biçiminde imajlar kullanmanızı öneriyoruz. Ubuntu 16.04 için en yeni 64-bit QCOW2 imaj sürümü `xenial-server-cloudimg-amd64-disk1.img <http://cloud-images.ubuntu.com/xenial/current/xenial-server-cloudimg-amd64-disk1.img>`_ adresindedir.

source: If your image uses ``grub2`` as the boot loader, there should be a line in the grub configuration file. For example, ``/boot/grub/grub.cfg``, which looks something like this:
de: Wenn Ihr Abbild ``grub2`` als Bootloader verwendet, sollte es eine Zeile in der Grub-Konfigurationsdatei geben. Zum Beispiel, ``/boot/grub/grub.cfg``, was so aussieht:
id: Jika image Anda menggunakan ``grub2`` sebagai boot loader, baris grub ini harus ada di file konfigurasi grub. Sebagai contoh,``/boot/grub/grub.cfg``, yang terlihat seperti ini:
tr_tr: İmajınız önyükleyici olarak ``grub2`` kullanıyorsa, grub yapılandırma dosyasında bir satır bulunmalı. Örneğin ``/boot/grub/grub.cfg`` dosyasında şu şekilde bir şey:

source: If your partitions are managed with LVM, use :command:`losetup` and :command:`kpartx` commands as in the previous example to expose the partitions to the host.
de: Wenn Ihre Partitionen mit LVM verwaltet werden, verwenden Sie :command: `losetup` und :command:` kpartx` Befehle wie im vorherigen Beispiel, um die Partitionen dem Host auszusetzen.
id: Jika partisi Anda dikelola dengan LVM, penggunaan perintah :command:`losetup` and :command:`kpartx` seperti dalam contoh sebelumnya untuk mengekspos partisi ke host.
tr_tr: Bölümleriniz LVM ile yönetiliyorsa, :command:`losetup` ve :command:`kpartx` komutlarını bölümleri önceki örnekteki gibi sunucu için ortaya çıkarmak için kullanın.

source: Image cache management configuration options
de: Image-Cache-Management-Konfigurationsoptionen
id: Opsi konfigurasi manajemen cache image
tr_tr: İmaj önbelleği yönetim yapılandırma seçenekleri

source: Image consumers can boot from any image shared by the image producer, regardless of the member status, as long as the consumer knows the image ID.
de: Abbildverbraucher können von jedem Abbild, das vom Abbildhersteller geteilt wird, unabhängig vom Status des Mitglieds booten, solange der Verbraucher die Abbild-ID kennt.
id: Konsumen image dapat boot dari setiap image bersama dengan produser image, terlepas dari status anggota, asalkan konsumen mengetahui ID image.
tr_tr: İmaj tüketicileri imaj üreticisi tarafından herhangi bir paylaşılmış imajdan imaj kimliğini bildiği sürece üye durumundan bağımsız olarak önyükleme yapabilir.

source: Image consumers change their own member status, but they may not add or remove themselves as an image member.
de: Abbildverbraucher ändern ihren eigenen Status, aber sie dürfen sich nicht als Abbildmitglied hinzufügen oder entfernen.
id: Konsumen image mengubah status anggota mereka sendiri, tetapi mereka mungkin tidak menambah atau menghapus diri sebagai anggota image.
tr_tr: İmaj tüketicileri kendi üye durumlarını değiştirir, ama kendilerini bir imaj üyesi olarak ekleyip çıkaramazlar.

source: Image format
de: Abbildformat
id: Format image
tr_tr: İmaj biçimi

source: Image is complete
de: Abbild ist komplett
id: Image lengkap
tr_tr: İmaj tamamlandı

source: Image metadata
de: Abbild-Metadaten
id: Metadata image
tr_tr: İmaj metaverisi

source: Image metadata can help end users determine the nature of an image, and is used by associated OpenStack components and drivers which interface with the Image service.
de: Abbild-Metadaten können Endbenutzern helfen, die Art eines Abbildes zu bestimmen und wird von zugehörigen OpenStack-Komponenten und Treibern verwendet, die mit dem Image-Dienst verbunden sind.
tr_tr: İmaj metaverisi son kullanıcılara bir imajın doğasını anlamada yardımcı olabilir, ve İmaj servisiyle arayüzü olan ilişkili OpenStack bileşenleri ve sürücüleri tarafından kullanılır.

source: Image producers add members to images, or remove members from images, but they may not modify the member status of an image member.
de: Abbildhersteller fügen Mitglieder zu Abbildern hinzu oder entfernen Mitglieder aus Abbildern, aber sie dürfen den Mitgliedsstatus eines Abbildmitglieds nicht ändern.
id: Produsen image menambahkan anggota ke image, atau menghapus anggota dari image, tetapi mereka mungkin tidak mengubah status anggota dari anggota image.
tr_tr: İmaj üreticileri üyeleri imajlara ekler, veya üyeleri imajlardan kaldırır, ama bir imaj üyesinin üye durumunu değiştiremezler.

source: Image producers and consumers are both OpenStack users, or projects. Image producers create and share images with image consumers, allowing the consumers to use the shared image when booting a server. The producer shares an image with the consumer by making the consumer a member of that image. The consumer then accepts or rejects the image by changing the image member status. After it is accepted, the image appears in the consumer's image list. As long as the consumer is a member of the image, the consumer can use the image, regardless of the image member status, if the consumer knows the image ID.
de: Abbildhersteller und Konsumenten sind sowohl OpenStack-Nutzer als auch Projekte. Abbildhersteller erstellen und teilen Abbilder mit Abbildkonsumenten, so dass die Verbraucher das geteilte Abbild beim Booten eines Servers nutzen können. Der Produzent teilt ein Abbild mit dem Verbraucher, indem er den Verbraucher als Mitglied dieses Abbildes macht. Der Verbraucher akzeptiert oder lehnt das Abbild ab, indem er den Status des Abbildmitglieds ändert. Nachdem es angenommen wurde, erscheint das Abbild in der Abbildliste des Verbrauchers. Solange der Verbraucher ein Mitglied des Abbildes ist, kann der Verbraucher das Abbild verwenden, unabhängig vom Status des Abbildmitglieds, wenn der Verbraucher die Abbild-ID kennt.
id: Produsen image dan konsumen adalah kedua pengguna OpenStack, atau proyek. Produsen image membuat dan berbagi image dengan konsumen image, yang memungkinkan konsumen untuk menggunakan image bersama saat booting server. Produsen berbagai image dengan konsumen dengan pembuatan konsumen anggota dari image itu. Konsumen kemudian menerima atau menolak image dengan mengubah status anggota image. Setelah itu diterima, image akan muncul di daftar image konsumen. Selama konsumen menjadi anggota dari image, konsumen dapat menggunakan image, terlepas dari status anggota image, selama konsumen mengetahui ID image.
tr_tr: Hem imaj üreticileri hem de tüketicileri OpenStack kullanıcıları veya projeleridir. İmaj üreticileri imaj tüketicileri için imaj oluşturur ve paylaşırlar, kullanıcıların bir sunucu başlatırken paylaşılan imajı kullanabilmesini sağlarlar. Üretici tüketiciyi bu imaj için bir üye olarak ayarlayarak imajı paylaşır. Tüketici imajı imaj üye durumunu değiştirerek kabul eder ya da reddeder. Kabul edildikten sonra, imaj tüketicinin imaj listesinde belirir. Tüketici imajın üyelerinden biri olduğu sürece, imaj üye durumundan bağımsız olarak tüketici imaj kimliğini biliyorsa imajı kullanabilir.

source: Image producers and consumers have different abilities and responsibilities regarding image sharing, which the following list shows.
de: Abbildhersteller und Konsumenten haben unterschiedliche Fähigkeiten und Verantwortlichkeiten bezüglich der Abbildverteilung, die die folgende Liste zeigt.
id: Produsen image dan konsumen memiliki kemampuan yang berbeda dan tanggung jawab mengenai pembagian image, dimana daftar berikut menunjukkan.
tr_tr: İmaj üreticileri ve tüketicileri imaj paylaşma konusunda farklı yeteneklere ve sorumluluklara sahiptir, aşağıdaki liste bunları gösterir.

source: Image producers and consumers view the status of image members. When listing image members, the producers see all the image members, and the consumers see only themselves.
de: Abbildhersteller und Konsumenten sehen den Status der Abbildmitglieder an. Bei der Auflistung der Abbildmitglieder sehen die Produzenten alle Abbildmitglieder, und die Konsumenten sehen nur sich selbst.
id: Produsen image dan konsumen melihat status anggota image. Ketika mendaftar anggota image, produsen melihat semua anggota image, dan konsumen hanya melihat diri mereka.
tr_tr: İmaj üreticileri ve tüketicileri imaj üyelerinin durumunu görüntüler. İmaj üyeleri listelenirken, üreticiler tüm imaj üyelerini görür, tüketiciler yalnızca kendilerini görür.

source: Image requirements
de: Abbildanforderungen
id: Persyaratan image
tr_tr: İmaj gereksinimleri

source: Image sharing
de: Abbild teilen
id: Berbagi image
tr_tr: İmaj paylaşımı

source: Images are arranged by Ubuntu release, and by image release date, with ``current`` being the most recent. For example, the page that contains the most recently built image for Ubuntu 16.04 Xenial Xerus is `Ubuntu 16.04 LTS (Xenial Xerus) Daily Build <https://cloud-images.ubuntu.com/xenial/current/>`_. Scroll to the bottom of the page for links to the images that can be downloaded directly.
de: Abbilder werden nach Ubuntu-Version und nach dem Abbild-Release-Datum arrangiert, wobei ``current`` das jüngste ist. Zum Beispiel ist die Seite, die das zuletzt erstellte Abbild für Ubuntu 16.04 Xenial Xerus enthält, `Ubuntu 16.04 LTS (Xenial Xerus) Daily Build <https://cloud-images.ubuntu.com/xenial/current/> `_. Scrollen Sie zum unteren Rand der Seite für Links zu den Abbildern, die direkt heruntergeladen werden können.
tr_tr: İmajlar Ubuntu yayınına ve imaj yayın tarihine göre düzenlenir, ``current`` en yeni olandır. Örneğin Ubuntu 16.04 Xenial Xerus için en yeni inşa edilmiş imajı içeren sayfa `Ubuntu 16.04 LTS (Xenial Xerus) Günlük İnşa <https://cloud-images.ubuntu.com/xenial/current/>`_ sayfasındadır. Doğrudan indirilebilir imajlara bağlantılar için sayfanın altına doğru kaydırın.

source: In FreeBSD 10.1 the :command:`fetch` command verifies SSL peers by default, so you need to install the ``ca_root_nss`` package that contains certificate authority root certificates and tell :command:`fetch` where to find them. For FreeBSD 10.1 run these commands:
de: In FreeBSD 10.1 überprüft :command:`fetch` standardmäßig SSL-Peers, also müssen Sie das ``ca_root_nss`` -Paket installieren, das Zertifikatsautorisierungszertifikate enthält und :command:` fetch` zeigt, wo es zu finden ist. Für FreeBSD 10.1 führen Sie diese Befehle aus:
id: Dalam FreeBSD 10.1 perintah :command:`fetch` memverifikasi SSL peer secara default, sehingga Anda perlu menginstal paket ``ca_root_nss`` yang berisi certificate authority (CA) root certificates (sertifikat root CA) dan memberitahu :command:`fetch` dimana menemukan mereka. Untuk FreeBSD 10,1 jalankan perintah ini:
tr_tr: FreeBSD 10.1'de :command:`fetch` komutu SSL eşlerini öntanımlı olarak doğrular, yani sertifika otoritesi kök sertifikalarını içeren ``ca_root_nss`` paketini kurmalı ve :command:`fetch` komutuna onları nerde bulabileceğini söylemelisiniz. FreeBSD 10.1 için şu komutları çalıştırın:

source: In a CentOS cloud image, the login account is ``centos``.
de: In einem CentOS-Cloud-Image ist das Login-Konto ``centos``.
id: Dalam CentOS cloud image, akun login adalah ``centos``.
tr_tr: CentOS bulut imajında giriş hesabı ``centos`` olur.

source: In a CirrOS image, the login account is ``cirros``. The password is ``cubswin:)``.
tr_tr: Bir CirrOS imajında, giriş hesabı ``cirros``dur. Parola ise ``cubswin:)``.

source: In a Debian image, the login account is ``debian``.
de: In einem Debian-Abbild ist das Login-Konto ``debian``.
id: Dalam image Debian, akun login adalah ``debian``.
tr_tr: Debian imajlarda giriş hesabı ``debian``dır.

source: In a Fedora cloud image, the login account is ``fedora``.
de: In einem Fedora-Cloud-Abbild ist das Login-Konto ``fedora``.
id: Dalam image cloud Fedora, akun login adalah ``fedora``.
tr_tr: Fedora bulut imajlarında giriş hesabı ``fedora``dır.

source: In a RHEL cloud image, the login account is ``cloud-user``.
de: In einem RHEL-Cloud-Abbild ist das Login-Konto `` cloud-user``.
id: Dalam image cloud RHEL, akun login adalah ``cloud-user``.
tr_tr: RHEL bulut imajlarında, giriş hesabı ``cloud-user`` olur.

source: In addition to the ssh public key, an image might need additional information from OpenStack, such as to povide user data to instances, that the user submitted when requesting the image. For example, you might want to set the host name of the instance when it is booted. Or, you might wish to configure your image so that it executes user data content as a script on boot.
de: Zusätzlich zum ssh-öffentlichen Schlüssel kann ein Abbild zusätzliche Informationen von OpenStack benötigen, um Benutzerdaten auf Instanzen zu verschieben, die der Benutzer bei der Anforderung des Abbildes übermittelt hat. Beispielsweise möchten Sie den Hostnamen der Instanz beim Booten festlegen. Oder Sie möchten Ihr Abbild so konfigurieren, dass es Benutzerdateninhalte als Skript beim Booten ausführt.
id: Selain kunci publik ssh, image mungkin memerlukan informasi tambahan dari OpenStack, seperti memasukkan data pengguna kepada instance, yang dikirimkan pengguna saat meminta image. Misalnya, Anda mungkin ingin menetapkan nama host instance saat di-boot. Atau, Anda mungkin ingin mengkonfigurasi image Anda sehingga konten data pengguna dijalankan sebagai script saat booting.
tr_tr: Ssh açık anahtara ek olarak bir imaj OpenStack'den daha fazla bilgiye ihtiyaç duyabilir, örneğin kullanıcının imajı isterken gönderdiği kullanıcı verisinin sunuculara sağlanması. Sunucu önyüklenirken sunucunun makine adını ayarlamak isteyebilirsiniz. Veya imajı kullanıcı verisini önyüklemeden betik olarak çalıştıracak şekilde yapılandırabilirsiniz.

source: In an Ubuntu cloud image, the login account is ``ubuntu``.
de: In einem Ubuntu-Cloudabbild ist das Login-Konto ``ubuntu``.
id: Dalam image cloud Ubuntu, akun login adalah ``ubuntu``.
tr_tr: Bir Ubuntu bulut imajında, giriş hesabı ``ubuntu``dur.
