Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: Sometimes you must modify a virtual machine image to remove any traces of the MAC address that was assigned to the virtual network interface card when the image was first created. This is because the MAC address is different when the virtual machine images boots. This example shows how to use the ``guestfish`` to remove references to the old MAC address by deleting the ``/etc/udev/rules.d/70-persistent-net.rules`` file and removing the ``HWADDR`` line from the ``/etc/sysconfig/network-scripts/ifcfg-eth0`` file.
de: Manchmal müssen Sie ein virtuelles Maschinenbild ändern, um alle Spuren der MAC-Adresse zu entfernen, die der virtuellen Netzwerkschnittstellenkarte zugewiesen wurde, als das Abbild zuerst erstellt wurde. Dies ist, weil die MAC-Adresse anders ist, wenn die virtuellen Maschine Abbilder bootet. In diesem Beispiel wird gezeigt, wie Sie den ``guestfish`` verwenden, um Verweise auf die alte MAC-Adresse zu entfernen, indem Sie die Datei ``/etc/udev/rules.d/70-persistent-net.rules` löschen und die ``HWADDR`` Zeile aus der ``/etc/sysconfig/network-scripts/ifcfg-eth0`` Datei entfernen.
id: Kadang-kadang Anda harus mengubah image mesin virtual untuk menghilangkan jejak dari alamat MAC yang ditugaskan untuk interface card jaringan virtual ketika image pertama kali diciptakan. Penghilangan jejak ini karena alamat MAC ini berbeda ketika image mesin virtual boot. Contoh ini menunjukkan bagaimana menggunakan ``guestfish`` untuk menghapus referensi ke alamat MAC lama dengan menghapus file ``/etc/udev/rules.d/70-persistent-net.rules`` dan menghapus baris ``HWADDR`` dari file ``/etc/sysconfig/network-scripts/ifcfg-eth0``.
tr_tr: Bazen imaj oluşturulurken sanal ağ arayüzü kartına atanmış MAC adresinin izlerini silmek için bir sanal makine imajını değiştirmeniz gerekir. Bunun sebebi sanal makine imajı yüklenirken MAC adresinin farklı olmasıdır. Bu örnek ``guestfish`` kullanarak ``/etc/udev/rules.d/70-persistent-net.rules`` dosyasını silerek ve ``/etc/sysconfig/network-scripts/ifcfg-eth0`` dosyasından ``HWADDR`` satırını kaldırarak eski MAC adresinin başvurularını kaldırmayı gösteriyor.

source: Specifies the access controls for everything defined in the namespace. These access controls determine who can define and use the definitions in the namespace.
de: Gibt die Zugriffskontrollen für alles an, was im Namespace definiert ist. Diese Zugriffskontrollen bestimmen, wer die Definitionen im Namensraum definieren und verwenden kann.
id: Tentukan kontrol akses untuk segala sesuatu yang didefinisikan dalam namespace. Kontrol akses ini mentapkan siapa yang dapat menentukan dan menggunakan definisi dalam namespace.
tr_tr: İsim uzayında tanımlanan herşey için erişim kontrollerini belirtir. Bu erişim kontrolleri isim uzayındaki tanımları kimin tanımlayıp kullanabileceini kontrol eder.

source: Specifies the relationship between resource types and the namespaces that are applicable to them. This information can be used to drive UI and CLI views. For example, the same namespace of objects, properties, and tags may be used for images, snapshots, volumes, and flavors. Or a namespace may only apply to images.
de: Gibt die Beziehung zwischen Ressourcentypen und den Namespaces an, die für sie gelten. Diese Informationen können verwendet werden, um UI- und CLI-Ansichten zu fahren. Beispielsweise kann derselbe Namensraum von Objekten, Eigenschaften und Tags für Abbilder,Schattenkopien, Datenträger und Varianten verwendet werden. Oder ein Namensraum darf nur für Abbilder gelten.
id: Tentukan hubungan antara tipe sumber daya dan namespace yang berlaku untuk mereka. Informasi ini dapat digunakan untuk menggerakkan tampilan UI dan CLI. Misalnya, namespace yang sama dari objek, properti, dan tag dapat digunakan untuk image, snapshot (foto), volume, dan flavor. Atau namespace hanya berlaku untuk image.
tr_tr: Kaynak türleri ve onlara uygulanabilir isim uzayları arasındaki ilişkiyi tanımlar. Bu bilgi UI ve CLI görünümlerini kullanmak için kullanılabilir. Örneğin, nesneler, özellikler, ve etiketlerin aynı isim uzayı imajlar, anlık görüntüler, birimler ve nitelikler için kullanılabilir. Ya da bir isim uzayı sadece imajlara uygulanabilir.

source: Start the Windows Server 2012 installation with the :command:`virt-install` command:
de: Starten Sie die Installation von Windows Server 2012 mit dem Befehl :command: `virt-install`:
id: Mulailah instalasi Windows Server 2012 dengan perintah :command:`virt-install`:
tr_tr: :command:`virt-install` komutu ile Windows Sunucu 2012 kurulumunu başlatın.

source: Start the installation process
de: Starten Sie den Installationsvorgang
id: Memulai proses instalasi
tr_tr: Kurulum sürecini başlatın

source: Start the installation process by using either :command:`virt-manager` or :command:`virt-install` as described in the previous section. If you use :command:`virt-install`, do not forget to connect your VNC client to the virtual machine.
de: Starten Sie den Installationsprozess, indem Sie entweder :command:`virt-manager` oder :command:` virt-install` wie im vorherigen Abschnitt beschrieben verwenden. Wenn Sie :command:`virt-install` verwenden, vergessen Sie nicht, Ihren VNC-Client mit der virtuellen Maschine zu verbinden.
id: Mulailah proses instalasi dengan menggunakan :command:`virt-manager` atau :command:`virt-install` seperti yang dijelaskan di bagian sebelumnya. Jika Anda menggunakan :command:`virt-install`, jangan lupa untuk menghubungkan klien VNC Anda ke mesin virtual.
tr_tr: Önceki kısımda tanımlandığı gibi kurulum sürecini :command:`virt-manager` veya :command:`virt-install` ile başlatın. :command:`virt-install` kullanırsanız sanal makineye VNC istemcinizi bağlamayı unutmayın.

source: Start the installation process using either the :command:`virt-manager` or the :command:`virt-install` command as described previously. If you use the :command:`virt-install` command, do not forget to connect your VNC client to the virtual machine.
de: Starten Sie den Installationsvorgang entweder mit :command:*virt-manager` oder :command:`virt-install` wie oben beschrieben. Wenn Sie :command:`virt-install` verwenden, vergessen Sie nicht, Ihren VNC-Client mit der virtuellen Maschine zu verbinden.
id: Mulai proses instalasi dengan perintah :command:`virt-manager` ataupun :command:`virt-install` seperti yang dijelaskan sebelumnya. Jika Anda menggunakan perintah :command:`virt-install`, jangan lupa hubungkan klien VNC Anda ke mesin virtual.
tr_tr: Kurulum sürecini ya :command:`virt-manager` ya da :command:`virt-install` komutu ile daha önce açıklandığı şekilde başlatın. :command:`virt-install` komutunu kullanırsanız VNC istemcinizi sanal makineye bağlamayı unutmayın.

source: Step through the install
de: Schritte durch die Installation
id: Ikuti seluruh langkah instalasi
tr_tr: Kurulum adımlarını geçin

source: Step through the install, using the default options. When prompted for a user name, the default (``ubuntu``) is fine.
de: Gehen Sie durch die Installation, mit den Standard-Optionen. Wenn Sie nach einem Benutzernamen aufgefordert werden, ist die Voreinstellung (``ubuntu``) in Ordnung.
id: Ikuti seluruh langkah instalasi, menggunakan opsi default. Ketika diminta untuk nama pengguna, default (``ubuntu``) ini baik-baik saja.
tr_tr: Öntanımlı seçenekleri kullanarak kurulum adımlarını geçin. Kullanıcı adı sorulduğunda, öntanımlı (``ubuntu``) kullanın.

source: Step through the installation
de: Schritt durch die Installation
id: Langkah keseluruhan instalasi
tr_tr: Kurulum adımını geçin

source: Step through the installation, using the default options. The simplest thing to do is to choose the ``Minimal Install`` install, which installs an SSH server.
de: Schritt durch die Installation, mit den Standard-Optionen. Die einfachste Sache dies zu tun ist, die ``Minimal Install`` Installation zu wählen, die einen SSH Server installiert.
id: Lakukan sekuruh langkah instalasi, gunakan opsi default. Hal paling sederhana untuk dilakukan adalah memilih instal ``Minimal Install``, yang menginstal server SSH.
tr_tr: Kurulum adımını öntanımlı seçeneklerle geçin. Yapılacak en basit şey ``Asgari Kurulum`` kurulumunu seçmektir, bu da bir SSH sunucu kurar.

source: Storage devices
de: Speichergeräte
id: Perangkat penyimpanan
tr_tr: Depolama aygıtları

source: Storage is fully allocated at instance start. The ``$instance_dir/`` images are `fallocated <http://www.kernel.org/doc/man-pages/online/pages/man2/fallocate.2.html>`_ to immediately determine if enough space is available, and to possibly improve VM I/O performance due to ongoing allocation avoidance, and better locality of block allocations.
de: Die Speicherung ist bei Instanzstart vollständig vergeben. Die ``$instance_dir/`` Abbilder sind `fallocated <http://www.kernel.org/doc/man-pages/online/pages/man2/fallocate.2.html> `_ um sofort festzustellen, ob genügend Platz vorhanden ist, und möglicherweise die VM I/O-Leistung aufgrund der fortlaufenden Zuweisungsvermeidung und der besseren Lokalisierung von Blockzuweisungen zu verbessern.
id: Penyimpanan sepenuhnya dialokasikan pada instance awal. Image ``$instance_dir/`` adalah `fallocated <http://www.kernel.org/doc/man-pages/online/pages/man2/fallocate.2.html>`_ untuk segera menentukan apakah cukup ruang tersedia, dan untuk kemungkinan meningkatkan kinerja VM I/O karena menghindari alokasi yang sedang berlangsung, dan lokalitas yang lebih baik dari alokasi blok.
tr_tr: Depolama sunucu başlangıcında tamamen ayrılmış. ``$instance_dir/`` imajları yeterli alanın var olup olmadığına anında karar vermek üzere `fallocate edilmiş <http://www.kernel.org/doc/man-pages/online/pages/man2/fallocate.2.html>`_, ve muhtemel sanal makine I/O başarımını devam eden ayırmadan kaçınma sebebiyle artırmış, ve daha iyi yerel blok ayırma sağlanmış.

source: Support for snapshots.
de: Unterstützung für Schattenkopien.
tr_tr: Anlık görüntüleri destekler.

source: Supported by VirtualBox virtual machine monitor and the QEMU emulator.
de: Unterstützt von VirtualBox Virtual Machine Monitor und dem QEMU Emulator.
tr_tr: VirtualBox sanal makine izleyici ve QEMU öykünücüsü tarafından desteklenir.

source: Supported by the QEMU emulator that can expand dynamically and supports Copy on Write.
de: Unterstützt durch den QEMU Emulator, der sich dynamisch erweitern kann und Copy on Write unterstützt.
tr_tr: QEMU öykünücüsü tarafından desteklenir Yazma anında Kopyalama destekler ve dinamik genişleyebilir.

source: The :command:`cloud-init` script starts on instance boot and will search for a metadata provider to fetch a public key from. The public key will be placed in the default user account for the image.
de: Der Befehl: `cloud-init` beginnt bei Instanzstart und sucht nach einem Metadatenanbieter, um einen öffentlichen Schlüssel abzurufen. Der öffentliche Schlüssel wird im Standardbenutzerkonto für das Abbild platziert.
id: Skrip :command:`cloud-init` memulai pada instance boot dan akan mencari penyedia metadata untuk mengambil kunci publik. Kunci publik akan ditempatkan di akun pengguna default untuk image.
tr_tr: :command:`cloud-init` betiği sunucu önyüklenirken başlar ve açık anahtarı çekmek için metaveri sağlayıcısını arar. Açık anahtar imajın öntanımlı kullanıcı hesabına yerleştirilir.

source: The :command:`qemu-img convert` command can do conversion between multiple formats, including ``qcow2``, ``qed``, ``raw``, ``vdi``, ``vhd``, and ``vmdk``.
de: Mit :command:`qemu-img convert` kann die Umwandlung zwischen mehreren Formaten, einschließlich` `qcow2``,` `qed``,` `raw``,` `vdi``,` `vhd`` und `` vmdk`` erfolgen
id: Perintah :command:`qemu-img convert` dapat melakukan konversi antar berbagai format, termasuk ``qcow2``, ``qed``, ``raw``, ``vdi``, ``vhd``, and ``vmdk``.
tr_tr: :command:`qemu-img convert` komutu ``qcow2``, ``qed``, ``raw``, ``vdi``, ``vhd``, ve ``vmdk`` dahil bir çok biçimi dönüştürmek için kullanılabilir.

source: The CentOS project maintains official images for direct download.
de: Das CentOS-Projekt unterhält offizielle Abbilder zum direkten Download.
id: Proyek CentOS memelihara image resmi (official image) untuk mendownload secara langsung.
tr_tr: CentOS projesi indirmeye hazır resmi imajlar sunar.

source: The Fedora project maintains a list of official cloud images at `Fedora download page <https://alt.fedoraproject.org/cloud/>`_.
de: Das Fedora-Projekt unterhält eine Liste der offiziellen Cloud-Abbilder auf der Fedora-Download-Seite <https://alt.fedoraproject.org/cloud/> `_.
id: Proyek Fedora menyimpan daftar image awan resmi di `Fedora download page <https://alt.fedoraproject.org/cloud/>`_.
tr_tr: Fedora projesi `Fedora indirme sayfasında <https://alt.fedoraproject.org/cloud/>`_ resmi bulut imajları listesini tutar.

source: The Image service and other OpenStack projects do not currently support the container format. It is safe to specify ``bare`` as the container format if you are unsure.
de: Der Image-Service und andere OpenStack-Projekte unterstützen derzeit nicht das Containerformat. Es ist sicher, ``bare`` als Containerformat anzugeben, wenn Sie unsicher sind.
tr_tr: İmaj servisi ve diğer OpenStack projeleri şu an kapsayıcı biçimini desteklemiyor. Emin değilseniz kapsayıcı biçimi olarak ``bare`` belirtebilirsiniz.

source: The Image service has predefined namespaces for the metadata definitions catalog. To load files from this directory into the database:
de: Der Image-Service hat vordefinierte Namespaces für den Metadaten-Definitions-Katalog. Um Dateien aus diesem Verzeichnis in die Datenbank zu laden:
id: Layanan Image telah menyediakan namespace untuk katalog definisi metadata. Untuk memuat file dari direktori ini ke dalam database:
tr_tr: İmaj servisinin metaveri tanımlamaları kataloğu için öntanımlı isim uzayları vardır. Bu dizinden dosyaları veritabanına yüklemek için:

source: The KVM hypervisor starts the virtual machine with the libvirt name, ``centos``, with 1024 MB of RAM. The virtual machine also has a virtual CD-ROM drive associated with the ``/data/isos/CentOS-7-x86_64-NetInstall-1611.iso`` file and a local 10 GB hard disk in qcow2 format that is stored in the host at ``/tmp/centos.qcow2``. It configures networking to use libvirt default network. There is a VNC server that is listening on all interfaces, and libvirt will not attempt to launch a VNC client automatically nor try to display the text console (``--no-autoconsole``). Finally, libvirt will attempt to optimize the configuration for a Linux guest running a CentOS 7 distribution.
de: Der KVM-Hypervisor startet die virtuelle Maschine mit dem libvirt-Namen, `` centos``, mit 1024 MB RAM. Die virtuelle Maschine verfügt auch über ein virtuelles CD-ROM-Laufwerk, das mit der Datei ``/data/isos/CentOS-7-x86_64-NetInstall-1611.iso`` und einer lokalen 10-GB-Festplatte im qcow2-Format auf dem Host ``/tmp/centos.qcow2`` verknüpft ist. Es konfiguriert das Netzwerk, um das libvirt-Standardnetzwerk zu verwenden. Es gibt einen VNC-Server, der auf allen Schnittstellen abhört, und libvirt wird nicht versuchen, einen VNC-Client automatisch zu starten, noch versuchen, die Textkonsole anzuzeigen (``--no-autoconsole``). Schließlich wird libvirt versuchen, die Konfiguration für einen Linux-Gast mit einer CentOS 7-Distribution zu optimieren.
id: Hypervisor KVM memulai mesin virtual dengan nama libvirt, ``centos``, dengan RAM 1024 MB. Mesin virtual juga memiliki drive CD-ROM virtual yang terkait dengan file ``/data/isos/CentOS-7-x86_64-NetInstall-1611.iso`` dan hard disk lokal 10 GB dalam format qcow2 yang tersimpan di host di ``/tmp/centos.qcow2``. Ini mengonfigurasi jaringan untuk menggunakan jaringan default libvirt. Ada server VNC yang mendengarkan semua antarmuka, dan libvirt tidak akan mencoba meluncurkan klien VNC secara otomatis atau mencoba menampilkan konsol teks (`` --no-autoconsole``). Akhirnya, libvirt akan mencoba untuk mengoptimalkan konfigurasi untuk Linux guest yang menjalankan distribusi CentOS 7.
tr_tr: KVM hipervizörü sanal makineyi libvirt ismiyle, ``centos``, 1024 MB RAM ile başlatır. Sanal makinenin ayrıca ``/data/isos/CentOS-7-x86_64-NetInstall-1611.iso`` dosyasıyla ilişkili sanal bir CD-ROM sürücüsü ve qcow2 biçiminde ``/tmp/centos.qcow2`` konumunda kayıtlı 10 GB sabit diski bulunur. Ağı libvirt öntanımlı ağını kullanacak şekilde yapılandırır. Tüm arayüzlerden dinleyen bir VNC sunucusu da bulunur, libvirt otomatik olarak bir VNC istemcisi açmaya veya metin konsolunu (``--no-autoconsole``) görüntülemeye çalışmaz. Son olarak libvirt CentOS 7 dağıtımı çalıştıran bir Linux misafiri için yapılandırmayı iyileştirmeye çalışır.

source: The OVF container format.
de: Das OVF-Containerformat.
tr_tr: OVF kapsayıcı biçimi.

source: The Ubuntu installer will ask how you want to manage upgrades on your system. This option depends on your specific use case. If your virtual machine instances will be connected to the Internet, we recommend "Install security updates automatically".
de: Der Ubuntu-Installer wird fragen, wie Sie Upgrades auf Ihrem System verwalten möchten. Diese Option hängt von Ihrem speziellen Anwendungsfall ab. Wenn Ihre virtuellen Maschineninstanzen mit dem Internet verbunden sind, empfehlen wir Ihnen, "Updates automatisch installieren".
id: Ubuntu installer akan bertanya bagaimana Anda ingin mengelola upgrade pada sistem Anda. Pilihan ini tergantung pada kasus penggunaan (use case) spesifik Anda. Jika instance mesin virtual Anda akan terhubung ke Internet, kami merekomendasikan "Install security updates automatically".
tr_tr: Ubuntu yükleyici sistem güncellemelerinizi nasıl yönetmek istediğinizi soracaktır. Bu seçenek özel kullanım durumunuza göre değişir. Sanal makine sunucularınız İnternete bağlı olacaksa, "Güvenlik güncellemelerini otomatik olarak kur" seçmenizi öneririz.

source: The VHD disk format, a common disk format used by virtual machine monitors from VMware, Xen, Microsoft, VirtualBox, and others.
de: Das VHD-Datenträgerformat, ein gemeinsames Datenträgerformat, das von virtuellen Maschinenmonitoren von VMware, Xen, Microsoft, VirtualBox und anderen verwendet wird.
tr_tr: VHD disk biçimi, VMware, Xen, Microsoft, VirtualBox ve diğerlerinden gelen sanal makine izleyicileri tarafından kullanılan disk biçimi.

source: The VHDX disk format, an enhanced version of the VHD format, which supports larger disk sizes among other features.
de: Das VHDX-Festplattenformat, eine erweiterte Version des VHD-Formats, die größere Festplattengrößen unter anderem unterstützt.
tr_tr: VHDX disk biçimi, VHD biçiminin iyileştirilmiş halidir, diğer özelliklerin yanında daha büyük disk boyutlarını destekler.

source: The `AKI/AMI/ARI <http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AMIs.html>`_ format was the initial image format supported by Amazon EC2. The image consists of three files:
de: Die AKI/AMI/ARI <http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AMIs.html> `_ Formate waren das ursprüngliche Abbildformat, das von Amazon EC2 unterstützt wurde. Das Abbild besteht aus drei Dateien:
tr_tr: `AKI/AMI/ARI <http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/AMIs.html>` biçimi Amazon EC2 tarafından desteklenen ilk imaj biçimiydi. İmaj üç dosyadan oluşur:

source: The `ISO <http://www.ecma-international.org/publications/standards/Ecma-119.htm>`_ format is a disk image formatted with the read-only ISO 9660 (also known as ECMA-119) filesystem commonly used for CDs and DVDs. While we do not normally think of ISO as a virtual machine image format, since ISOs contain bootable filesystems with an installed operating system, you can treat them the same as you treat other virtual machine image files.
de: Das ISO <http://www.ecma-international.org/publications/standards/Ecma-119.htm> `_ Format ist ein Disk-Image, das mit dem schreibgeschützten ISO 9660 (auch bekannt als ECMA-119) Dateisystem formatiert wird, das üblicherweise für CDs und DVDs verwendet wird. Während wir normalerweise nicht an ISO als virtuelles Maschinenbildformat denken, da ISOs bootfähige Dateisysteme mit einem installierten Betriebssystem enthalten, können Sie sie genauso behandeln wie Sie andere virtuelle Maschinenbilddateien behandeln.
tr_tr: `ISO <http://www.ecma-international.org/publications/standards/Ecma-119.htm>`_ biçimi genellikle CD'ler ve DVD'ler için kullanılan salt-okunur ISO 9660 (ECMA-119 olarak da bilinir) diski imaj biçimidir. ISO'yu normalde sanal makine imaj biçimi olarak düşünmesek de, ISO'lar önyüklenebilir dosya sistemleri içerdiğinden, kurulu bir işletim sistemiyle herhangi bir sanal makine imaj dosyasına davrandığınız gibi davranabilirsiniz.

source: The `KIWI OS image builder <http://github.com/openSUSE/kiwi>`_ provides an operating system image builder for various Linux supported hardware platforms as well as for virtualization and cloud systems. It allows building of images based on openSUSE, SUSE Linux Enterprise, and Red Hat Enterprise Linux. The `openSUSE Documentation <https://doc.opensuse.org/#kiwi-doc>`_ explains how to use KIWI.
de: Der `KIWI OS Abbildbauer <http://github.com/openSUSE/kiwi> `_ bietet einen Betriebssystem-Image-Builder für verschiedene Linux-unterstützte Hardware-Plattformen sowie für Virtualisierungs- und Cloud-Systeme. Es ermöglicht den Aufbau von Abbildern auf Basis von openSUSE, SUSE Linux Enterprise und Red Hat Enterprise Linux. Die `openSUSE Dokumentation <https://doc.opensuse.org/#kiwi-doc> `_ erklärt, wie man KIWI benutzt.
id: The `KIWI OS image builder <http://github.com/openSUSE/kiwi>`_ menyediakan image builder sistem operasi untuk berbagai Linux yang didukung platform perangkat keras serta untuk virtualisasi dan cloud sistem. Image builder ini memungkinkan pembangunan image berdasarkan openSUSE, SUSE Linux Enterprise, dan Red Hat Enterprise Linux. `openSUSE Documentation <https://doc.opensuse.org/#kiwi-doc>`_ menjelaskan bagaimana menggunakan KIWI.
tr_tr: `KIWI OS imaj yapıcı <http://github.com/openSUSE/kiwi>`_ çeşitli Linux destekli donanım platformlarının yanında sanallaştırma ve bulut sistemleri için de bir işlemi sistemi imajı sağlar. openSUSE, SUSE Linux Kurumsal, ve Red Hat Kurumsal Linux tabanlı imajların inşa edilmesine izin verir. `openSUSE Belgelendirmesi <https://doc.opensuse.org/#kiwi-doc>`_ KIWI kullanımını açıklar.

source: The `QCOW2 <http://en.wikibooks.org/wiki/QEMU/Images>`_ (QEMU copy-on-write version 2) format is commonly used with the KVM hypervisor. It has some additional features over the raw format, such as:
de: Das `QCOW2 <http://en.wikibooks.org/wiki/QEMU/Images> `_ (QEMU copy-on-write Version 2) Format wird häufig mit dem KVM Hypervisor verwendet. Es hat einige zusätzliche Features über das Raw-Format, wie zum Beispiel:
tr_tr: `QCOW2 <http://en.wikibooks.org/wiki/QEMU/Images>`_ (QEMU yazma anında kopyalama sürüm 2) yaygın olarak KVM hipervizörü ile kullanılır. Raw biçimine göre ek özellikleri bulunur, örneğin:

source: The ``-X`` flag passed to ssh will enable X11 forwarding over ssh. If this does not work, try replacing it with the ``-Y`` flag.
de: Das ``-X``-Flag, das an ssh übergeben wird, ermöglicht die X11-Weiterleitung über ssh. Wenn dies nicht funktioniert, versuchen Sie es mit dem ``-Y``-Flag zu ersetzen.
id: Flag ``-X`` dilewatkan ke ssh akan mengaktifkan X11 forwarding lewat ssh. Jika usaha ini tidak berhasil, cobalah menggantinya dengan flag ``-Y``.
tr_tr: Ssh sürecine ``-X`` bayrağını geçirmek ssh üzerinden X11 yönlendirmeyi etkinleştirir. Bu çalışmazsa, ``-Y`` bayrağıyla değiştirmeyi deneyin.

source: The ``-d3`` flag tells Oz to show status information as it runs.
de: Die ``-d3 `` Option erklärt Oz die Statusinformationen während des Laufs anzuzeigen.
id: Flag ``-d3`` mengatakan bahwa Oz menampilkan status informasi sebagaimana Oz berjalan.
tr_tr: ``-d3`` bayrağı Oz'a çalışırken durum bilgisi göstermesini söyler.
