Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: Because VNC is a standard protocol, there are multiple clients available that implement the VNC spec, including `TigerVNC <http://sourceforge.net/apps/mediawiki/tigervnc/ index.php?title=Welcome_to_TigerVNC>`_ (multiple platforms), `TightVNC <http://tightvnc.com/>`_ (multiple platforms), `RealVNC <http://realvnc.com/>`_ (multiple platforms), `Chicken <http://sourceforge.net/projects/chicken/>`_ (Mac OS X), `Krde <http://userbase.kde.org/Krdc>`_ (KDE), `Vinagre <https://wiki.gnome.org/Apps/Vinagre>`_ (GNOME).
tr_tr: VNC standart bir iletişim kuralı olduğundan, VNC özelliklerini uygulayan bir çok istemci bulunur, `TigerVNC <http://sourceforge.net/apps/mediawiki/tigervnc/ index.php?title=Welcome_to_TigerVNC>`_ (birden çok platformda), `TightVNC <http://tightvnc.com/>`_ (multiple platforms), `RealVNC <http://realvnc.com/>`_ (birden çok platformda), `Chicken <http://sourceforge.net/projects/chicken/>`_ (Mac OS X), `Krde <http://userbase.kde.org/Krdc>`_ (KDE), `Vinagre <https://wiki.gnome.org/Apps/Vinagre>`_ (GNOME) gibi.

source: Because qcow2 is sparse, qcow2 images are typically smaller than raw images. Smaller images mean faster uploads, so it is often faster to convert a raw image to qcow2 for uploading instead of uploading the raw file directly.
de: Weil qcow2 sparsam ist, sind qcow2 Abbilder typischerweise kleiner als Raw-Abbilder. Kleinere Abbilder bedeuten schnellere Uploads, also ist es oft schneller, ein Raw-Abbild in qcow2 zum Hochladen zu konvertieren, anstatt die Raw-datei direkt hochzuladen.
tr_tr: qcow2 seyrek olduğundan, qcow2 imajları genellikle raw imajlardan küçüktür. Küçük imajlar daha hızlı yüklemeler demektir, yani genellikle bir raw imajı qcow2 imajına dönüştürüp yüklemek doğrudan raw dosyayı yüklemekten hızlıdır.

source: Because raw images do not support snapshots, OpenStack Compute will automatically convert raw image files to qcow2 as needed.
de: Da Raw-Abbilder keine Schnappschüsse unterstützen, wird OpenStack Compute automatisch rohe Abbilddateien nach Bedarf in qcow2 konvertieren.
tr_tr: Raw imajlar anlık görüntüleri desteklemediğinden, OpenStack Hesaplama raw imajları otomatik olarak ihtiyaç duyuldukça qcow2 biçimine dönüştürür.

source: Because the default does not work, you must select manual partitioning. The partition editor should list only one block device. If you use virtio for the disk device driver, it is named ``vtbd0``. Select this device and run the :command:`create` command three times:
de: Da die Voreinstellung nicht funktioniert, müssen Sie die manuelle Partitionierung auswählen. Der Partitionseditor sollte nur ein Blockgerät auflisten. Wenn Sie virtio für den Festplatten-Gerätetreiber verwenden, heißt es ``vtbd0``. Wählen Sie dieses Gerät aus und führen Sie den Befehl :command: `create` dreimal aus:
id: Karena default tidak bekerja, Anda harus memilih partisi manual. Editor partisi hanya mendaftar satu perangkat blok. Jika Anda menggunakan virtio untuk driver perangkat disk, ia dinamai ``vtbd0``. Pilih perangkat ini dan menjalankan perintah tiga kali :command:`create`:
tr_tr: Öntanımlı çalışmadığından, elle bölümlendirmeyi seçmelisiniz. Bölümlendirme düzenleyici yalnızca bir blok aygıt listelemelidir. Disk aygıt sürücüsü için virtio kullanırsanız, ismi ``vtbd0`` olacaktır. Bu aygıtı seçin ve :command:`create` komutunu üç kere çalıştırın:

source: Because the goal is to make the smallest possible base image, this example uses the network installation ISO. The Ubuntu 64-bit 14.04 network installation ISO is at the `Ubuntu download page <http://archive.ubuntu.com/ubuntu/dists/trusty/main/installer-amd64/current/images/netboot/mini.iso>`_.
tr_tr: Hedef mümkün olan en küçük taban imajı oluşturmak olduğundan, bu örnek ağ kurulum ISO'sunu kullanır. Ubuntu 64-bit 14.04 ağ kurulum ISO'su `Ubuntu indirme sayfasındadır <http://archive.ubuntu.com/ubuntu/dists/trusty/main/installer-amd64/current/images/netboot/mini.iso>`_

source: Before starting a virtual machine with libvirt, verify that the libvirt ``default`` network has started. This network must be active for your virtual machine to be able to connect out to the network. Starting this network will create a Linux bridge (usually called ``virbr0``), iptables rules, and a dnsmasq process that will serve as a DHCP server.
de: Bevor Sie eine virtuelle Maschine mit libvirt starten, stellen Sie sicher, dass das libvirt `` default`` Netzwerk gestartet wurde. Dieses Netzwerk muss für Ihre virtuelle Maschine aktiv sein, um eine Verbindung zum Netzwerk herzustellen. Wenn Sie dieses Netzwerk starten, wird eine Linux-Bridge (in der Regel `` virbr0``), iptables-Regeln und ein dnsmasq-Prozess erstellt, der als DHCP-Server dient.
id: Sebelum memulai mesin virtual dengan libvirt, lakukan verifikasi bahwa jaringan ``default`` libvirt telah dimulai. Jaringan ini harus aktif untuk mesin virtual Anda untuk dapat terhubung ke jaringan. Pembuakaan jaringan ini akan menciptakan sebuah jembatan Linux (biasanya disebut `` virbr0``), aturan iptables, dan proses dnsmasq yang akan berfungsi sebagai server DHCP.
tr_tr: Libvirt ile bir sanal makine başlatmadan çnce, libvirt ``öntanımlı`` ağının başladığını doğrulayın. Bu ağ sanal makinenizin ağa bağlanabilmesi için etkin olmalıdır. Bu ağı başlatmak bir Linux köprüsü (genellikle ``virbr0``), iptables kuralları, ve DHCP sunucusu olarak görev yapacak bir dnsmasq süreci oluşturur.

source: By default, files are loaded from and exported to the Image service's ``/etc/glance/metadefs`` directory.
de: Standardmäßig werden Dateien aus dem Verzeichnis ``/etc/glance/metadefs`` des Image-Dienstes geladen und exportiert.
id: Secara default, file dimuat dari dan diekspor ke directori layanan Image ``/etc/glance/metadefs``.
tr_tr: Öntanımlı olarak, dosyalar İmaj servisinin ``/etc/glance/metadefs`` dizininden yüklenir ve buraya aktarılır.

source: By using the same hypervisor, you can ensure that you emulate the same devices that exist in production. However, if you use full hardware virtualization instead of paravirtualization, you do not need to use the same hypervisor; you must use the same type of virtualized hardware because FreeBSD device names are related to their drivers. If the name of your root block device or primary network interface in production differs than the names used during image creation, errors can occur.
de: Mit dem gleichen Hypervisor können Sie sicherstellen, dass Sie die gleichen Geräte emulieren, die in der Produktion vorhanden sind. Allerdings, wenn Sie vollständige Hardware-Virtualisierung statt Paravirtualisierung verwenden, müssen Sie nicht den gleichen Hypervisor verwenden; Sie müssen die gleiche Art von virtualisierten Hardware verwenden, da FreeBSD-Gerätenamen mit ihren Treibern verwandt sind. Wenn der Name Ihres Root-Block-Geräts oder der primären Netzwerkschnittstelle in der Produktion unterschiedlich ist als die bei der Erstellung von Abbildern verwendeten Namen, können Fehler auftreten.
id: Dengan menggunakan hypervisor yang sama, Anda dapat memastikan bahwa Anda meniru perangkat yang sama dengan yang ada di produksi. Namun, jika Anda menggunakan virtualisasi hardware penuh bukannya paravirtualization, Anda tidak perlu menggunakan hypervisor yang sama; Anda harus menggunakan jenis yang sama dari perangkat keras virtualisasi karena nama perangkat FreeBSD terkait dengan driver mereka. Jika nama perangkat blok akar atau antarmuka jaringan utama dalam produksi berbeda dari nama yang digunakan selama pembuatan image, kesalahan bisa terjadi.
tr_tr: Aynı hipervizörü kullanarak, üretimde olan aygıtların aynısını taklit ettiğinizden emin olabilirsiniz. Ancak paravirtualization yerine tam donanımsal sanallaştırma kullanırsanız aynı hipervizörü kullanmanıza gerek kalmaz; aynı tür sanallaştırma donanımı kullanmanız gerekir çünkü FreeBSD aygıt isimleri sürücüleriyle ilişkilidir. Kök blok aygıtınızın ismi veya üretimdeki ana ağ arayüzünün ismi imaj oluşturulurkenki isimlerden farklıysa, hatalar oluşabilir.

source: Canonical maintains an official set of `Ubuntu-based images <http://cloud-images.ubuntu.com/>`_.
de: Canonical unterhält einen offiziellen Satz von Ubuntu-basierten Abbildern <http://cloud-images.ubuntu.com/> `_.
tr_tr: Canonical resmi `Ubuntu-tabanlı imajlar <http://cloud-images.ubuntu.com/>`_ kümesi tutar.

source: CentOS directory: ``centos/7/os/x86_64``
de: CentOS-Verzeichnis: ``centos/7/os/x86_64``
id: Direktori CentOS: ``centos/7/os/x86_64``
tr_tr: CentOS dizini: ``centos/7/os/x86_64``

source: Change the Ethernet status
de: Ändern Sie den Ethernet-Status
id: Ubah status Ethernet
tr_tr: Ethernet durumunu değiştirin

source: Choose :guilabel:`OpenSSH server` so that you will be able to SSH into the virtual machine when it launches inside of an OpenStack cloud.
de: Wählen Sie :guilabel: `OpenSSH Server`, damit Sie SSH in die virtuelle Maschine laden können, wenn es in eine OpenStack Cloud startet.
id: Pilih :guilabel: `OpenSSH server` sehingga Anda akan dapat SSH ke mesin virtual ketika peluncran dalam cloud OpenStack.
tr_tr: OpenStack bulutunda açıldığında sanal makineye SSH çekebilmek için :guilabel:`OpenSSH server` paketini seçin.

source: Choose the ISO image you want to download.
de: Wählen Sie das ISO-Image, das Sie herunterladen möchten.
id: Pilih citra ISO yang ingin anda unduh.
tr_tr: İndirmek istediğiniz ISO imajını seçin.

source: CirrOS (test)
tr_tr: CirrOS (deneme)

source: CirrOS is a minimal Linux distribution that was designed for use as a test image on clouds such as OpenStack Compute. You can download a CirrOS image in various formats from the `CirrOS download page <http://download.cirros-cloud.net>`_.
de: CirrOS ist eine minimale Linux-Distribution, die für den Einsatz als Testabbild auf Clouds wie OpenStack Compute entwickelt wurde. Sie können ein CirrOS-Abbild in verschiedenen Formaten von der `CirrOS Download-Seite herunterladen <http://download.cirros-cloud.net> `_.
id: CirrOS adalah distribusi Linux minimal yang dirancang untuk digunakan sebagai image tes di cloud seperti OpenStack Compute. Anda dapat men-download image CirrOS dalam berbagai format dari `CirrOS download page <http://download.cirros-cloud.net>`_.
tr_tr: CirrOS OpenStack Hesaplama gibi bulutlar üzerinde deneme imajı olarak kullanılmak üzere tasarlanmış asgari bir Linux dağıtımıdır. `CirrOS indirme sayfasından <http://download.cirros-cloud.net>`_ çeşitli biçimlerde CirrOS imajları indirebilirsiniz.

source: Clean up (remove MAC address details)
de: Aufräumen (MAC-Adressdaten entfernen)
id: Bersihkan (hapus detail alamat MAC)
tr_tr: Temizlik (MAC adres ayrıntılarını kaldır)

source: Clean up when you are done:
de: Aufräumen wenn Sie fertig sind:
id: Bersihkan setelah Anda selesai:
tr_tr: İşiniz bittiğinde temizlik yapın:

source: Click one of the ``HTTP`` links in the right-hand column next to one of the mirrors.
de: Klicken Sie auf einen der ``HTTP`` Links in der rechten Spalte neben einem der Mirror.
id: Klik salah satu link ``HTTP`` di kolom right-hand di sebelah salah satu mirrors.
tr_tr: Yansılardan birinin yanındaki sağ sütunlardan birindeki ``HTTP`` bağlantılarına tıklayın.

source: Click the :guilabel:`Create a new virtual machine` button at the top-left, or go to :menuselection:`File --> New Virtual Machine`. Then, follow the instructions.
de: Klicken Sie auf die Schaltfläche :guilabel: `Erstellen Sie eine neue virtuelle Maschine` oben links oder gehen Sie zu :menuselection:`Datei --> Neue virtuelle Maschine`. Dann folgen Sie den Anweisungen.
id: Klik tombol :guilabel:`Create a new virtual machine` di kiri atas, atau buka: menuelection:` File -> New Virtual Machine`. Lalu, ikuti instruksinya.
tr_tr: Sol üstteki :guilabel:`Yeni bir sanal makine oluştur` düğmesine tıklayın, veya :menuselection:`Dosya --> Yeni Sanal Makine` takip edin. Ardından yönergeleri takip edin.

source: Click the ``isos/`` folder link.
de: Klicken Sie auf den ``isos/`` Ordner-Link.
id: Klik link folder ``isos/``
tr_tr: ``isos/`` dizin bağlantısına tıklayın.

source: Click the ``x86_64/`` folder link for 64-bit images.
de: Klicken Sie auf die ``x86_64/`` Ordner-Link für 64-Bit-Abbilder.
id: Klik link folder ``x86_64/`` untuk image 64-bit.
tr_tr: 64-bit imajlar için ``x86_64/`` dizin bağlantısına tıklayın.

source: Click the folder link of the CentOS version that you want to use. For example, ``7/``.
de: Klicken Sie auf den Ordner-Link der CentOS-Version, die Sie verwenden möchten. Zum Beispiel ``7 /``.
id: Klik link folder dari versi CentOS dimana Anda ingin gunakan. Misalnya, ``7/``.
tr_tr: Kullanmak istediğiniz CentOS sürümünün dizin bağlantısına tıklayın. Örneğin, ``7/``.

source: Click the netinstall ISO image that you want to download. For example, ``CentOS-7-x86_64-NetInstall-1611.iso`` is a good choice because it is a smaller image that downloads missing packages from the Internet during installation.
de: Klicken Sie auf das netinstall ISO-Image, das Sie herunterladen möchten. Zum Beispiel ist ``CentOS-7-x86_64-NetInstall-1611.iso`` eine gute Wahl, weil es ein kleineres Abbild ist, das fehlende Pakete aus dem Internet während der Installation herunterlädt.
id: Klik netinstall ISO image yang ingin anda download. Misalnya, ``CentOS-7-x86_64-NetInstall-1611.iso`` adalah pilihan yang baik karena ini adalah gambar yang lebih kecil yang mendownload paket hilang dari Internet saat penginstalan.
tr_tr: İndirmek istediğiniz ağ kurulum ISO imajına tıklayın. Örneğin, ``CentOS-7-x86_64-NetInstall-1611.iso`` iyi bir seçimdir çünkü daha küçük bir imajdır ve eksik paketleri kurulum sırasında internetten indirir.

source: Cloudbase Solutions hosts `Windows Cloud Images <https://cloudbase.it/windows-cloud-images/>`_ that runs on Hyper-V, KVM, and XenServer/XCP.
tr_tr: Cloudbase Çözümleri Hyper-V, KVM, ve XenServer/XCP üzerinde çalışan `Windows Bulut İmajlarını <https://cloudbase.it/windows-cloud-images/>`_ sunar.

source: Common disk format supported by many common virtual machine monitors.
de: Gemeinsames Festplattenformat, das von vielen gängigen virtuellen Maschinenmonitoren unterstützt wird.
tr_tr: Yaygın sanal makine izleyicileri tarafından desteklenen genel disk biçimi.

source: Common image properties are also specified in the ``/etc/glance/schema-image.json`` file. For a complete list of valid property keys and values, refer to the `OpenStack Command-Line Reference <https://docs.openstack.org/cli-reference/glance.html#image-service-property-keys>`_.
tr_tr: Yaygın imaj özellikleri de ayrıca ``/etc/glance/schema-image.json`` dosyasında belirtilir. Geçerli özellik anahtarları ve değerlerinin tam listesi için `OpenStack Komut-Satırı Başvurusuna <https://docs.openstack.org/cli-reference/glance.html#image-service-property-keys>`_ göz atın.

source: Communications between the image producer and the consumer, such as those described in this example, must be arranged independently of the OpenStack Image API. The consumer and producer can send notifications by using email, phone, Twitter, or other channels.
de: Die Kommunikation zwischen dem Abbildhersteller und dem Verbraucher, wie sie in diesem Beispiel beschrieben ist, muss unabhängig von der OpenStack Image API angeordnet sein. Der Verbraucher und Produzent können Benachrichtigungen per Email, Telefon, Twitter oder anderen Kanälen senden.
id: Komunikasi antara produsen image dan konsumen, seperti yang dijelaskan dalam contoh ini, harus diatur secara independen dari OpenStack Image API. Konsumen dan produsen dapat mengirim pemberitahuan dengan menggunakan email, telepon, Twitter, atau saluran lainnya.
tr_tr: Örnekte gösterilen gibi, imaj üretici ve tüketici arasındaki iletişim OpenStack İmaj API'sinden bağımsız ayarlanmalıdır. Tüketici ve üretici eposta, telefon, Twitter, veya diğer kanallardan ileti gönderebilir.

source: Complete the VirtIO drivers installation by running the following command:
de: Füllen Sie die Installation des VirtIO-Treibers aus, indem Sie den folgenden Befehl ausführen:
id: Lengkapi instalasi driver VirtIO dengan menjalankan perintah berikut:
tr_tr: Aşağıdaki komutları çalıştırarak VirtIO sürücüleri kurulumunu tamamlayın:

source: Compute's ``ImagePropertiesFilter`` value is specified in the ``scheduler_default_filter`` value in the ``/etc/nova/nova.conf`` file.
tr_tr: Hesaplama'nın ``ImagePropertiesFilter`` değeri ``/etc/nova/nova.conf`` dosyasında ``scheduler_default_filter`` değeri ile belirtilmiştir.

source: Configuration option=Default value
de: Konfigurationsoption = Standardwert
tr_tr: Yapılandırma seçeneği=Öntanımlı değer

source: Configure cloud-init to fetch metadata
de: Konfigurieren Cloud-init, um Metadaten abzurufen
id: Konfigurasi cloud-init untuk mengambil metadata
tr_tr: cloud-init'i metaveriyi getirmesi için yapılandırın

source: Configure console
de: Konfigurieren der Konsole
id: Mengkonfigurasi konsol
tr_tr: Konsolu yapılandırın

source: Configure the primary network interface to use DHCP. In this example, which uses a virtio network device, this interface is named ``vtnet0``.
de: Konfigurieren Sie die primäre Netzwerkschnittstelle, um DHCP zu verwenden. In diesem Beispiel, das ein virtio Netzwerkgerät verwendet, heißt diese Schnittstelle ``vtnet0``.
id: Lakukan konfigurasi antarmuka jaringan utama untuk menggunakan DHCP. Dalam contoh ini, contoh menggunakan perangkat jaringan virtio, antarmuka ini bernama ``vtnet0``.
tr_tr: Ana ağ arayüzünü DHCP kullanacak şekilde yapılandırın. virtio ağ sürücüsünü kullanan bu örnekte, bu arayüzün adı ``vtnet0``dır.

source: Configure to fetch metadata
de: Konfigurieren, um Metadaten abzurufen
id: Konfigurasi untuk mengambil metadata
tr_tr: Metaveri getirmek için yapılandırın

source: Consider using other mirrors as an alternative to ``mirror.umd.edu``.
de: Betrachten Sie die Verwendung anderer Mirror als Alternative zu `` mirror.umd.edu``.
id: Pertimbangkan untuk menggunakan mirror lainnya sebagai alternatif untuk ``mirror.umd.edu``.
tr_tr: ``mirror.umd.edu`` adresine alternatif olarak başka yansılar kullanmayı düşünün.

source: Container formats
de: Containerformate
tr_tr: Kapsayıcı biçimleri

source: Contains metadata definitions.
de: Enthält Metadatendefinitionen.
id: Isi (contain) definisi metadata.
tr_tr: Metaveri tanımlarını içerir.

source: Contents
de: Inhalt
id: Contents (isi)
tr_tr: İçerikler

source: Converting between image formats
de: Umwandlung zwischen Abbildformaten
id: Konversi antara format image
tr_tr: İmaj biçimleri arasında dönüştürme

source: Converting images from one format to another is generally straightforward.
de: Das Konvertieren von Abbildern von einem Format in ein anderes ist im Allgemeinen einfach.
id: Mengkonversi image dari satu format ke yang lain umumnya mudah.
tr_tr: İmajları bir biçimden diğerine dönüştürmek genellikle kolaydır.

source: Create a 15 GB qcow2 image:
de: Erstellen Sie ein 15 GB qcow2 Abbild:
id: Buat image qcow2 15 GB:
tr_tr: 15 GB qcow2 imajı oluşturun:

source: Create a new LVM partition with the additional space. For example, ``parted /dev/sda --script "mkpart lvm ..."``.
de: Erstellen Sie eine neue LVM-Partition mit dem zusätzlichen Speicherplatz. Zum Beispiel, ``parted /dev/sda --script "mkpart lvm ... "``.
id: Buat partisi LVM baru dengan ruang tambahan. Sebagai contoh, ``parted /dev/sda --script "mkpart lvm ..."``.
tr_tr: Ek alana sahip yeni bir LVM bölümü oluşturmalı. Örneğin, ''parted /dev/sda --script "mkpart lvm ..."``.

source: Create a new physical volume. For example, ``pvcreate /dev/sda6``.
de: Erstellen Sie einen neuen physischen Datenträger. Zum Beispiel, ``pvcreate /dev/sda6``.
id: Buat volume fisik baru. Sebagai contoh, ``pvcreate /dev/sda6``.
tr_tr: Yeni bir fiziksel birim oluşturmalı. Örneğin, ``pvcreate /dev/sda6``.

source: Create a template file called ``centos64.tdl`` with the following contents. The only entry you will need to change is the ``<rootpw>`` contents.
de: Erstellen Sie eine Vorlagendatei mit dem Namen ``centos64.tdl`` mit folgendem Inhalt. Der einzige Eintrag, den Sie ändern müssen, ist der ``<rootpw> `` Inhalt.
id: Buat file template yang disebut ``centos64.tdl`` dengan konten berikut. Satu-satunya entri yang perlu Anda ubah adalah isi ``<rootpw> ``.
tr_tr: ``centos64.tdl`` isimli ve aşağıdaki içeriğe sahip bir şablon dosya oluşturun. Değiştirmeniz gereken tek girdi ``<rootpw>`` içeriğidir.

source: Create images manually
de: Erstellen Sie Abbilder manuell
id: Membuat image secara manual
tr_tr: İmajları elle oluştur

source: Create two partitions:
de: Erstellen Sie zwei Partitionen:
id: Buat dua partisi:
tr_tr: İki bölüm oluşturun:

source: Creating a new image is a step done outside of your OpenStack installation. You create the new image manually on your own system and then upload the image to your cloud.
de: Das Erstellen eines neuen Abbildes ist ein Schritt außerhalb der OpenStack-Installation. Sie erstellen das neue Abbild manuell auf Ihrem eigenen System und laden dann das Abbild in Ihre Cloud hoch.
id: Pembuatan image baru merupakan langkah yang dilakukan di luar instalasi OpenStack Anda. Anda membuat image baru secara manual pada sistem Anda sendiri dan kemudian meng-upload image ke cloud Anda.
tr_tr: Yeni bir imaj oluşturma OpenStack kurulumunuz dışında yapılan bir iştir. İmajı yerel sisteminizde kendiniz oluşturursunuz ve imajı buluta yüklersiniz.

source: Depending on the version of CentOS, the net installer requires the user to specify either a URL or the web site and a CentOS directory that corresponds to one of the CentOS mirrors. If the installer asks for a single URL, a valid URL might be ``http://mirror.umd.edu/centos/7/os/x86_64``.
de: Abhängig von der Version von CentOS fordert der Netzinstallateur den Benutzer auf, entweder eine URL oder die Website und ein CentOS-Verzeichnis anzugeben, das einem der CentOS-Mirror entspricht. Wenn der Installateur nach einer einzigen URL fragt, kann eine gültige URL ``http://mirror.umd.edu/centos/7/os/x86_64`` sein.
id: Tergantung pada versi CentOS, installer bersih mengharuskan pengguna untuk menentukan URL atau situs web dan direktori CentOS yang sesuai dengan salah satu mirror CentOS. Jika installer meminta URL tunggal, URL yang valid mungkin ada di ``http://mirror.umd.edu/centos/7/os/x86_64``.
tr_tr: CentOS sürümüne bağlı olarak, ağ yükleyici kullanıcının bir URL ya da web sitesi ve CentOS yansılarından biriyla bağlantılı CentOS dizini belirtmesini gerektirir. Yükleyici tek bir URL sorarsa, ``http://mirror.umd.edu/centos/7/os/x86_64`` geçerli bir URL olabilir.

source: Depending on your distribution, the simplest way to support this is to install in your image:
de: Je nach Distribution ist der einfachste Weg, dies zu unterstützen, in Ihrem Abbild zu installieren:
id: Bergantung pada distribusi Anda, cara termudah untuk mendukungnya adalah memasang di image Anda:
tr_tr: Dağıtımınıza göre, bunu desteklemenin en basit yolu imajınızda şunları kurmaktır:

source: Describes a group of one to many properties and their primitive constraints. Each property in the group can only be a primitive type. For example, string, integer, number, boolean, or array.
de: Beschreibt eine Gruppe von ein bis vielen Eigenschaften und ihre primitiven Einschränkungen. Jede Eigenschaft in der Gruppe kann nur ein primitiver Typ sein. Zum Beispiel String, Integer, Number, Boolean oder Array.
id: Menggambarkan satu kelompok ke banyak properti dan primitive constraint (pembatas primitif) mereka. Setiap properti dalam kelompok hanya dapat menjadi tipe primitif. Misalnya, string, integer, number (angka), boolean, atau array.
tr_tr: Birden çoka özellik grubu ve ilk kısıtlamalarını tanımlar. Gruptaki her özellik yalnızca bir ilk tür olabilir. Örneğin karakter dizisi, tamsayı, numara, bool veya dizi.

source: Detach the CD-ROM and reboot
de: Trennen Sie die CD-ROM und starten Sie neu
id: Lepaskan CD-ROM dan reboot
tr_tr: CD-ROM'u ayırın ve yeniden başlatın
