Repository: openstack/openstack-manuals
Catalog: doc/image-guide/source/locale/*/LC_MESSAGES/image-guide.po
Languages: de, id, tr_tr

source: The operating system records the MAC address of the virtual Ethernet card in locations such as ``/etc/sysconfig/network-scripts/ifcfg-eth0`` during the instance process. However, each time the image boots up, the virtual Ethernet card will have a different MAC address, so this information must be deleted from the configuration file.
de: Das Betriebssystem speichert die MAC-Adresse der virtuellen Ethernet-Karte an Orten wie ``/etc/sysconfig/network-scripts/ifcfg-eth0`` während des Instanzprozesseses. Jedoch wird jedes Mal, wenn das Abbild hochgefahren wird, die virtuelle Ethernet-Karte eine andere MAC-Adresse haben, so dass diese Informationen aus der Konfigurationsdatei gelöscht werden müssen.
id: Sistem operasi mencatat alamat MAC dari kartu Ethernet virtual di lokasi seperti ``/etc/sysconfig/network-scripts/ifcfg-eth0`` selama proses instance. Namun, setiap kali image boot up, kartu Ethernet virtual akan memiliki alamat MAC yang berbeda, jadi informasi ini harus dihapus dari file konfigurasi.
tr_tr: İşletim sistemi sunucu sürecinde sanal Ethernet kartının MAC adresini ``/etc/sysconfig/network-scripts/ifcfg-eth0`` gibi konumlarda kaydeder. Ancak imaj her ön yüklendiğinde, sanal Ethernet kartı farklı MAC adresine sahip olacaktır, yani bu bilgi yapılandırma dosyasından silinmelidir.

source: The operating system records the MAC address of the virtual Ethernet card in locations such as ``/etc/udev/rules.d/70-persistent-net.rules`` during the installation process. However, each time the image boots up, the virtual Ethernet card will have a different MAC address, so this information must be deleted from the configuration file.
de: Das Betriebssystem zeichnet die MAC-Adresse der virtuellen Ethernet-Karte an Orten wie ``/etc/udev/rules.d/70-persistent-net.rules`` während des Installationsvorgangs auf. Jedoch wird jedes Mal, wenn das Abbild hochgefahren wird, die virtuelle Ethernet-Karte eine andere MAC-Adresse haben, so dass diese Informationen aus der Konfigurationsdatei gelöscht werden müssen.
id: Sistem operasi mencatat alamat MAC dari kartu Ethernet virtual dalam lokasi seperti ``/etc/udev/rules.d/70-persistent-net.rules`` selama proses instalasi. Namun, setiap kali image boot up, kartu Ethernet virtual akan memiliki alamat MAC yang berbeda, sehingga informasi ini harus dihapus dari file konfigurasi.
tr_tr: İşletim sistemi kurulum sırasında ``/etc/udev/rules.d/70-persistent-net.rules`` gibi konumlarda sanal Ethernet kartının MAC adresini kaydeder. Ancak imaj her önyüklendiğinde, sanal Ethernet kartı farklı bir MAC adresi alır, yani bu bilginin yapılandırma dosyasından silinmesi gerekir.

source: The partition table for the image describes the original size of the image.
de: Die Partitionstabelle für das Abbild beschreibt die Originalgröße des Abbildes.
id: Tabel partisi untuk image menggambarkan ukuran image asli.
tr_tr: İmaj için bölüm tablosu imajın asıl boyutunu tanımlar.

source: The previous script only gets the ssh public key from the metadata server. It does not get user data, which is optional data that can be passed by the user when requesting a new instance. User data is often used to run a custom script when an instance boots.
de: Das vorherige Skript erhält nur den ssh-public Key vom Metadatenserver. Es gibt keine Benutzerdaten, die optionale Daten sind, die vom Benutzer beim Anfordern einer neuen Instanz übergeben werden können. Benutzerdaten werden häufig verwendet, um ein benutzerdefiniertes Skript auszuführen, wenn eine Instanz startet.
id: Skrip sebelumnya hanya mendapatkan ssh public key dari server metadata. Tidak mendapatkan data pengguna, yang merupakan data opsional yang dapat dilalui oleh pengguna ketika meminta instance baru. Data pengguna sering digunakan untuk menjalankan skrip khusus ketika sebuah instance melakukan boot.
tr_tr: Önceki betik yalnızca ssh açık anahtarını metaveri sunucusundan alır. Kullanıcı verisini almaz, bu kullanıcı tarafından yeni bir sunucu istenirken geçirilebilecek isteğe bağlı veridir. Kullanıcı verisi genellikle sunucu ön yüklenirken çalıştırılacak özel bir betik için kullanılır.

source: The producer posts the availability of specific images for consumers to review.
de: Der Produzent platziert die Verfügbarkeit von spezifischen Abbildern für die Verbraucher zur Überprüfung.
id: Produser menampilkan (post) ketersediaan image tertentu bagi konsumen untuk ditinjau.
tr_tr: Üretici belirli imajları kullanılabilirlik durumlarını tüketicilerin görüşüne sunar.

source: The producer shares the image with the consumer, by using the ``Create image member`` API operation.
de: Der Produzent teilt das Abbild mit dem Verbraucher, indem er die ``Create image member`` API-Operation verwendet.
id: Produser berbagi image dengan konsumen, dengan menggunakan operasi API ``Create image member``.
tr_tr: Üretici ``İmaj üyesi oluştur`` API işlemini kullanarak imajı tüketiciyle paylaşır.

source: The simplest way to obtain a virtual machine image that works with OpenStack is to download one that someone else has already created. Most of the images contain the ``cloud-init`` package to support the SSH key pair and user data injection. Because many of the images disable SSH password authentication by default, boot the image with an injected key pair. You can ``SSH`` into the instance with the private key and default login account. See `Configure access and security for instances <https://docs.openstack.org/horizon/latest/user/configure-access-and-security-for-instances.html>`_ for more information on how to create and inject key pairs with OpenStack.
de: Der einfachste Weg, um ein virtuelles Maschinenabbild zu erhalten, das mit OpenStack arbeitet, ist, eines herunterzuladen, das jemand anderes bereits erstellt hat. Die meisten Abbilder enthalten das ``cloud-init``-Paket, um das SSH-Schlüsselpaar und die Benutzerdaten-Injektion zu unterstützen. Weil viele der Abbilder die SSH-Kennwortauthentifizierung standardmäßig deaktivieren, booten Sie das Abbild mit einem eingegebenen Schlüsselpaar. Sie können sich mit ``SSH`` in die Instanz mit dem privaten Schlüssel und Standard-Login-Konto einloggen. Siehe `Konfigurieren von Zugriff und Sicherheit für Instanzen <https://docs.openstack.org/horizon/latest/user/configure-access-and-security-for-instances.html> `_ für weitere Informationen zum Erstellen und Einspielen von Schlüsselpaaren mit OpenStack.
id: Cara termudah untuk mendapatkan image mesin virtual yang bekerja dengan OpenStack adalah mendownload yang telah dibuat orang lain. Sebagian besar image berisi paket ``cloud-init`` untuk mendukung pasangan kunci SSH dan injeksi data pengguna. Karena banyak image yang menonaktifkan otentikasi kata sandi SSH secara default, boot image dengan pasangan kunci yang disuntikkan. Anda bisa `` SSH`` masuk ke instance dengan kunci private dan akun login default. Lihat `Configure access and security for instances <https://docs.openstack.org/horizon/latest/user/configure-access-and-security-for-instances.html>`_ untuk informasi lebih lanjut tentang cara membuat dan menyuntikkan pasangan kunci dengan OpenStack.
tr_tr: OpenStack ile çalışan bir sanal makine imajı elde etmenin en kolay yolu başka birinin oluşturduğu bir taneyi indirmektir. Çoğu imaj SSH anahtar çiftini ve kullanıcı verisi yerleştirmeyi destekleyecek şekilde ``cloud-init`` paketini içerir. Çoğu imaj SSH parolasıyla kimlik doğrulamayı öntanımlı olarak kapattığından, imajı yerleştirdiğiniz anahtar çiftiyle önyükleyin. Özel anahtar ve öntanımlı giriş hesabıyla sunucuya ``SSH`` yapabilirsiniz. OpenStack ile anahtar çiftleri oluşturma ve yerleştirmeyle ilgili daha fazla bilgi için `Sunucular için erişimi ve güvenliği yapılandırmaya <https://docs.openstack.org/horizon/latest/user/configure-access-and-security-for-instances.html>`_ göz atın.

source: The size of the disk in a virtual machine image is determined when you initially create the image. However, OpenStack lets you launch instances with different size drives by specifying different flavors. For example, if your image was created with a 5 GB disk, and you launch an instance with a flavor of ``m1.small``. The resulting virtual machine instance has, by default, a primary disk size of 20 GB. When the disk for an instance is resized up, zeros are just added to the end.
de: Die Größe der Festplatte in einem virtuellen Maschinenbild wird bestimmt, wenn Sie das Abbild zunächst erstellen. Allerdings können Sie mit OpenStack Instanzen mit verschiedenen Größenlaufwerken starten, indem Sie verschiedene Varianten angeben. Zum Beispiel, wenn Ihr Abbild mit einer 5 GB Festplatte erstellt wurde, und Sie starten eine Instanz mit einer Variante von ``m1.small``. Die resultierende virtuelle Maschineninstanz hat standardmäßig eine primäre Plattengröße von 20 GB. Wenn die Festplatte für eine Instanz geändert wird, werden Nullen nur zum Ende hinzugefügt.
id: Ukuran disk pada image mesin virtual ditentukan saat Anda awalnya membuat image. Namun, OpenStack memungkinkan Anda meluncurkan instance dengan drive ukuran berbeda dengan menentukan rasa yang berbeda. Misalnya, jika image Anda dibuat dengan disk 5 GB, dan Anda meluncurkan sebuah instance dengan rasa ``m1.small``. Contoh mesin virtual yang dihasilkan memiliki, secara default, ukuran disk utama sebesar 20 GB. Ketika disk untuk sebuah instance diubah ukurannya, angka nol akan ditambahkan sampai akhir.
tr_tr: Bir sanal makine imajındaki diskin boyutu ilk olarak imajı oluşturduğunuzda kararlaştırılır. Ancak OpenStack farklı nitelikler belirterek farklı boyutta sürücülerle sunucular başlatmanıza izin verir. Örneğin imajınız 5 GB diskle oluşturulduysa, ve ``m1.small`` niteliğinde bir sunucu başlatırsanız. Sonuçta elde edilen sanal makine sunucusunun öntanımlı olarak 20 GB bir diski olur. Bir sunucu diski yukarı boyutlandırıldığında, sadece sonuna sıfırlar eklenir.

source: The typical way that users access virtual machines running on OpenStack is to ssh using public key authentication. For this to work, your virtual machine image must be configured to download the ssh public key from the OpenStack metadata service or config drive, at boot time.
de: Die typische Art, wie Benutzer auf virtuelle Maschinen zugreifen, die auf OpenStack laufen, ist ssh mit Public Key Authentifizierung. Damit dies funktioniert, muss Ihr virtuelles Maschinenbild so konfiguriert sein, dass der ssh-Public-Key aus dem OpenStack-Metadatendienst oder dem Config-Laufwerk zum Booten heruntergeladen wird.
id: Cara khas dimana pengguna mengakses mesin virtual yang berjalan pada OpenStack adalah dengan penggunaan ssh dalam otentikasi kunci publik. Untuk dapat berjalan, image mesin virtual Anda harus dikonfigurasi untuk men-download kunci publik ssh dari layanan metadata OpenStack atau drive yang terkonfigurasi, pada saat boot.
tr_tr: OpenStack'de çalışan sanal makinelere erişmek için kullanıcılar genellikle ssh ile açık anahtarlı kimlik doğrulama kullanır. Bunun çalışması için, sanal makine imajınız önyükleme sırasında ssh açık anahtarını OpenStack metaveri servisinden veeya yapılandırma sürücüsünden indirecek şekilde yapılandırılmalıdır.

source: The underlying image file that you created with the :command:`qemu-img create` command is ready to be uploaded. For example, you can upload the ``/tmp/centos.qcow2`` image to the Image service by using the :command:`openstack image create` command. For more information, see the `python-openstackclient command list <https://docs.openstack.org/python-openstackclient/latest/cli/command-objects/image.html>`__.
de: Die zugrunde liegende Abbilddatei, die Sie mit dem Befehl :command: `qemu-img create` erstellt haben, ist bereit, hochgeladen zu werden. Zum Beispiel können Sie das ``/tmp/centos.qcow2``-Abbild in den Abbilddienst laden, indem Sie den Befehl :command:`openstack image create` verwenden. Weitere Informationen finden Sie in der Befehlsliste 'python-openstackclient' <https://docs.openstack.org/python-openstackclient/latest/cli/command-objects/image.html> `__.
id: File gambar yang mendasari yang Anda buat dengan perintah :command:`qemu-img create` siap di upload. Misalnya, Anda bisa mengupload image ``/tmp/centos.qcow2`` ke layanan Image dengan menggunakan perintah :command:`openstack image create`. Untuk informasi lebih lanjut, lihat `python-openstackclient command list <https://docs.openstack.org/python-openstackclient/latest/cli/command-objects/image.html>`__.
tr_tr: :command:`qemu-img create` komutuyla oluşturduğunuz temel imaj dosyası yüklenmek için hazır. Örneğin :command:`openstack image create` komutunu kullanarak ``/tmp/centos.qcow2`` imajını İmaj servisine yükleyebilirsiniz. Daha fazla bilgi için, `python-openstackclient komut listesine <https://docs.openstack.org/python-openstackclient/latest/cli/command-objects/image.html>`__ göz atın.

source: The underlying image file that you created with the :command:`qemu-img create` command is ready to be uploaded. For example, you can upload the ``/tmp/fedora.qcow2`` image to the Image service by using the :command:`openstack image create` command. For more information, see the `python-openstackclient command list <https://docs.openstack.org/python-openstackclient/latest/cli/command-objects/image.html>`__.
de: Die zugrunde liegende Abbilddatei, die Sie mit dem Befehl :command: `qemu-img create` erstellt haben, ist bereit, hochgeladen zu werden. Zum Beispiel können Sie das Abbild ``/tmp/fedora.qcow2`` auf den Abbilddienst laden, indem Sie den Befehl :command: `openstack image create` verwenden. Weitere Informationen finden Sie in der Befehlsliste `python-openstackclient <https://docs.openstack.org/python-openstackclient/latest/cli/command-objects/image.html>`__.
id: File image yang mendasari yang Anda buat dengan perintah :command:`qemu-img create` siap di upload Misalnya, Anda bisa mengupload image ``/tmp/fedora.qcow2`` ke layanan Image dengan menggunakan perintah :command:`openstack image create`. Untuk informasi lebih lanjut, lihat `python-openstackclient command list <https://docs.openstack.org/python-openstackclient/latest/cli/command-objects/image.html>`__.
tr_tr: :command:`qemu-img create` komutuyla oluşturduğunuz temel imaj dosyası yüklenmeye hazır. Örneğin :command:`openstack image create` komutuyla ``/tmp/fedora.qcow2`` imajını İmaj servisine yükleyebilirsiniz. Daha fazla bilgi için, `python-openstackclient komut listesine <https://docs.openstack.org/python-openstackclient/latest/cli/command-objects/image.html>`__ göz atın.

source: The underlying image file that you created with the :command:`qemu-img create` command, such as ``/tmp/trusty.qcow2``, is now ready for uploading to the Image service by using the :command:`openstack image create` command. For more information, see the `Glance User Guide <https://docs.openstack.org/glance/latest/user/index.html>`__.
tr_tr: :command:`qemu-img create` komutuyla oluşturduğunuz ``/tmp/trusty.qcow2`` gibi imaj dosyanız artık :command:`openstack image create` komutuyla İmaj servisine yüklenmeye hazır. Daha fazla bilgi için `Glance Kullanıcı Kılavuzuna <https://docs.openstack.org/glance/latest/user/index.html>`__ göz atın.

source: The version of Hyper-V that ships with Microsoft Server 2012 uses the newer `VHDX <http://technet.microsoft.com/en-us/library/hh831446.aspx>`_ format, which has some additional features over VHD such as support for larger disk sizes and protection against data corruption during power failures.
de: Die Version von Hyper-V, die mit Microsoft Server 2012 geliefert wird, verwendet den neueren `VHDX <http://technet.microsoft.com/en-us/library/hh831446.aspx> `_ Format, das einige zusätzliche Features über VHD wie Unterstützung für größere Festplattengrößen und Schutz gegen Datenverfälschung bei Stromausfällen hat.
tr_tr: Microsoft Sunucu 2012 ile gelen Hyper-V sürümü VHD'ye ek olarak daha büyük disk boyutları için destek ve güç kesintilerinde veri kaybına karşı koruma özellikleriyle gelen daha yeni `VHDX <http://technet.microsoft.com/en-us/library/hh831446.aspx>`_ biçimini kullanır.

source: The virtualized CMOS almost always stores its time in UTC, so unless you know otherwise, select UTC.
de: Der virtualisierte CMOS speichert fast immer seine Zeit in UTC, also, wenn Sie nicht anders wissen, wählen Sie UTC.
id: CMOS virtual hampir selalu menyimpan waktu dalam UTC, jadi kalau Anda ragu, pilih UTC.
tr_tr: Sanallaştırılmış CMOS nerdeyse her zaman zamanı UTC'de tutar, aksi hakkında bilginiz yoksa, UTC seçin.

source: Then we set to executable:
de: Dann setzen wir auf ausführbar:
id: Kemudian kita atur ke executable:
tr_tr: Ardından çalıştırılabilir yapıyoruz:

source: Then, during the boot process, you must:
de: Dann müssen Sie während des Bootvorgangs:
id: Kemudian, selama proses boot, Anda harus:
tr_tr: Ardından, önyükleme sürecinde, şunları yapmalısınız:

source: There are different options for partitioning the disks. The default installation uses LVM partitions, and creates three partitions (``/boot``, ``/``, ``swap``), which works fine. Alternatively, you might want to create a single ext4 partition that is mounted to ``/``, which also works fine.
de: Es gibt verschiedene Optionen für die Partitionierung der Festplatten. Die Standardinstallation verwendet LVM-Partitionen und erstellt drei Partitionen (``/boot``, ``/``, ``swap``), was gut funktioniert. Alternativ möchten Sie vielleicht eine einzelne ext4-Partition erstellen, die auf `` /`` montiert ist, was auch gut funktioniert.
id: Ada beberapa pilihan untuk partisi disk. Instalasi default menggunakan partisi LVM, dan menciptakan tiga partisi (``/boot``, ``/``, ``swap``), yang bekerja dengan baik. Atau, Anda mungkin ingin membuat partisi ext4 tunggal yang dipasang untuk ``/ ``, yang juga bekerja dengan baik.
tr_tr: Diskleri bölümlendirmek için farklı seçenekler bulunur. Öntanımlı kurulum LVM bölümleri kullanır, ve üç bölüm oluşturur (``/boot``, ``/``, ``swap``), bu yeterlidir. Alternatif olarak ``/`` konumuna bağlı tek bir ext4 bölümü de oluşturabilirsiniz, bu da yeterlidir.

source: There are different options for partitioning the disks. The default installation will use LVM partitions, and will create three partitions (``/boot``, ``/``, swap), and this will work fine. Alternatively, you may wish to create a single ext4 partition, mounted to "``/``", should also work fine.
de: Es gibt verschiedene Optionen für die Partitionierung der Festplatten. Die Standardinstallation verwendet LVM-Partitionen und erstellt drei Partitionen (``/boot``, ``/``, swap), und das wird gut funktionieren. Alternativ können Sie auch eine einzelne ext4-Partition erstellen, die auf "``/``" montiert ist, sollte auch gut funktionieren.
id: Ada berbagai pilihan untuk partisi disk. Instalasi default akan menggunakan partisi LVM, dan akan menciptakan tiga partisi (``/boot``, ``/``, swap), dan partisi ini akan bekerja dengan baik. Atau, Anda mungkin ingin membuat partisi tunggal ext4, dipasang (mount) pada "``/``", juga akan bekerja dengan baik.
tr_tr: Diskleri bölümlendirmek için farklı seçenekler bulunur. Öntanımlı kurulum LVM bölümleri kullanacaktır ve üç bölüm (``/boot``, ``/``, swap) oluşturur, bu sorunsuz çalışır. Alternatif olarak, "``/``" noktasına bağlı tek bir ext4 bölüm oluşturabilirsiniz.

source: There are several tools that are designed to automate image creation.
de: Es gibt mehrere Werkzeuge, die entworfen sind, um die Abbilderstellung zu automatisieren.
id: Ada beberapa alat yang dirancang untuk mengotomatisasi pembuatan image
tr_tr: İmaj oluşturmayı otomatikleştirmek için çeşitli araçlar tasarlanmıştır.

source: There is a known bug in Ubuntu 14.04; when you select ``Continue``, the virtual machine will shut down, even though it says it will reboot.
tr_tr: Ubuntu 14.04'de bilinen bir hata var, ``Devam et``i seçtiğinizde, yeniden başlatılacak demesine rağmen sanal makine kapatılacak.

source: There is a utility called :command:`virt-sysprep`, that performs various cleanup tasks such as removing the MAC address references. It will clean up a virtual machine image in place:
de: Es gibt ein Dienstprogramm namens :command:`virt-sysprep`, das verschiedene Aufräumaufgaben wie das Entfernen der MAC-Adressenreferenzen ausführt. Es wird ein virtuelles Maschinenabbild aufräumen:
id: Ada utilitas yang disebut :command:`virt-sysprep`, yang melakukan berbagai tugas pembersihan seperti menghapus referensi alamat MAC. Utilitas Ini akan membersihkan image mesin virtual di tempat:
tr_tr: Mac adresi referanslarının silinmesi gibi çeşitli temizlik işlerini yapan :command:`virt-sysprep` adlı bir araç bulunur. Bir sanal makine imajını yerinde temizler:

source: There is an enormous amount of functionality in guestfish and a full treatment is beyond the scope of this document. Instead, we recommend that you read the `guestfs-recipes <http://libguestfs.org/guestfs-recipes.1.html>`_ documentation page for a sense of what is possible with these tools.
de: Es gibt eine enorme Menge an Funktionalität in guestfish und eine vollständige Behandlung geht über den Rahmen dieses Dokuments hinaus. Stattdessen empfehlen wir Ihnen, die `guestfs-rezepte zu lesen <http://libguestfs.org/guestfs-recipes.1.html> `_ Dokumentations-Seite für eine Vorstellung, was mit diesen Werkzeugen möglich ist.
id: Ada sejumlah besar fungsi di guestfish dan perawatan penuh (full treatment) adalah di luar lingkup dokumen ini. Sebaliknya, kami sarankan Anda membaca halaman dokumentasi `guestfs-recipes <http://libguestfs.org/guestfs-recipes.1.html>`_ untuk rasa apapun yang mungkin dengan alat ini.
tr_tr: guestfish'in oldukça fazla işlevselliği vardır ama bunlar bu belgenin kapsamı dışında kalıyor. Bunun yerine bu araçlar ile neler yapabileceğinizi kavramak için `guestfs-recipes <http://libguestfs.org/guestfs-recipes.1.html>`_ belgelendirme sayfasını okumanızı tavsiye ediyoruz.

source: Therefore, if you use Xen, we recommend that when you create your images, you create a single ext3 or ext4 partition (not managed by LVM). Otherwise, read on.
de: Wenn Sie Xen verwenden, empfehlen wir Ihnen, bei der Erstellung Ihrer Abbilder eine einzelne ext3- oder ext4-Partition (nicht von LVM verwaltet) zu erstellen. Ansonsten weiterlesen.
id: Oleh karena itu, jika Anda menggunakan Xen, kami sarankan bahwa ketika Anda membuat image Anda, Anda membuat satu partisi ext3 atau ext4 (tidak dikelola oleh LVM). Jika tidak, akan membaca terus.
tr_tr: Böylece, Xen kullanıyorsanız, imajlarınız oluşturduğunuzda tek bir ext3 veya ext4 bölüm oluşturmanızı öneriyoruz (LVM ile yönetilmeyen). Aksi halde, okumaya devam edin.
