Repository: openstack/openstack-manuals
Catalog: doc/glossary/locale/*.po
Languages: fr

source: A Block Storage component that creates, attaches, and detaches persistent storage volumes.
fr: Composant de stockage par blocs qui créé, attache, et détache des volumes de stockage persistants.

source: A Block Storage node that runs the <systemitem class="service">cinder-volume</systemitem> daemon.
fr: Un node de stockage par blocs qui exécute le daemon <systemitem class="service">cinder-volume</systemitem>.

source: A Compute RabbitMQ setting that determines whether a message exchange is automatically created when the program starts.
fr: Paramètre RabbitMQ de Compute qui détermine si un échange de message est créé automatiquement quand le programme démarre.

source: A Compute component that provides users access to the consoles of their VM instances through VNC or VMRC.
fr: Composant Compute qui permet aux utilisateurs d’accéder aux consoles de leurs instances via VNC ou VMRC.

source: A Compute process that determines the suitability of the VM instances for a job for a particular host. For example, not enough RAM on the host, too many CPUs on the host, and so on.
fr: Process Compute qui détermine l'aptitude des instances de VM pour un travail sur un host particulier. Par example, pas assez de RAM sur le host, trop de CPUs sur le host, et ainsi de suite.

source: A Debian-based Linux distribution.
fr: Une distribution Linux basé sur Debian.

source: A Java program that can be embedded into a web page.
fr: Un programme Java pouvant être embarqué dans une page web.

source: A Linux distribution compatible with OpenStack.
fr: Distribution Linux compatible avec OpenStack

source: A Linux distribution that is compatible with OpenStack.
fr: Distribution Linux compatible avec OpenStack.

source: A Networking plug-in for Cisco devices and technologies, including UCS and Nexus.
fr: Un plug-in réseau pour les devices et technologies Cisco , incluant UCS et Nexus.

source: A SQLite database that contains Object Storage accounts and related metadata and that the accounts server accesses.
fr: Une base de données SQLite qui contient des comptes Stockages d'Objets et les métadonnées associées et auquel le serveur de comptes accède.

source: A VM image that does not save changes made to its volumes and reverts them to their original state after the instance is terminated.
fr: Image de VM qui ne sauvegarde pas les changements faits à ses volumes et les remet à leur état d'origine quand la VM est terminée.

source: A VM state where no changes occur (no changes in memory, network communications stop, etc); the VM is frozen but not shut down.
fr: L'état d'une VM où aucun changement ne s'exécute (aucune modification de la mémoire, arrêt des échanges réseau, etc.) ; la VM est gelée mais pas arrêtée.

source: A Windows project providing guest initialization features, similar to cloud-init.
fr: Projet windows permettant l'initialisation de VM guest, similaire à cloud-init.

source: A bit is a single digit number that is in base of 2 (either a zero or one). Bandwidth usage is measured in bits per second.
fr: Un bit est un nombre a un seul chiffre en base 2 (soit zéro ou un). L'utilisation de la bande passante est mesurée en bits par seconde.

source: A collection of hypervisors grouped together through host aggregates.
fr: Collection d'hyperviseurs groupés ensemble par des agrégats d'hôtes.

source: A collection of specifications used to access a service, application, or program. Includes service calls, required parameters for each call, and the expected return values.
fr: Un ensemble de spécification utilisées pour accéder à un service, une application ou un programme. Cela inclut les appels aux services, les paramètres requis sur chaque appel, ainsi que les valeurs renvoyées attendues.

source: A compute service that creates VPNs on a per-project basis.
fr: Service Compute qui créé des VPNs par projet.

source: A core OpenStack project that provides block storage services for VMs.
fr: Projet OpenStack qui fournit les services de stockage par bloc pour les VMs.

source: A core project that provides the OpenStack Image service.
fr: Projet qui fournit le service d'images OpenStack

source: A disk storage protocol tunneled within Ethernet.
fr: Protocole de stockage disque tunnelé à travers Ethernet.

source: A group of fixed and/or floating IP addresses that are assigned to a project and can be used by or assigned to the VM instances in a project.
fr: Un groupe d'adresses fixes et/ou flottantes qui peuvent être assignées à un projet et peuvent être utilisées ou assignées aux instances de VM dans un projet.

source: A group of related button types within horizon. Buttons to start, stop, and suspend VMs are in one class. Buttons to associate and disassociate floating IP addresses are in another class, and so on.
fr: Un groupe de boutons en rapport dans horizon. Les boutons pour démarrer, arrêter ou suspendre les VMs sont dans une classe. Les boutons pour associer et désassocier les adresses IP sont dans une autre classe, et ainsi de suite.

source: A group of users; used to isolate access to Compute resources. An alternative term for a project.
fr: Un groupe d'utilisateurs; utilisé pour isoler l'accès aux ressources Compute. Une autre expression pour projet.

source: A grouped release of projects related to OpenStack that came out in February of 2011. It included only Compute (nova) and Object Storage (swift).
fr: Livraison groupée de projets en rapport avec OpenStack sortis en Février 2011. Étaient inclus seulement Compute (nova) et Stockage d'Objets (swift).

source: A grouped release of projects related to OpenStack that came out in the fall of 2011, the fourth release of OpenStack. It included Compute (nova 2011.3), Object Storage (swift 1.4.3), and the Image service (glance).
fr: Livraison groupée de projets OpenStack sortie à l'automne 2011, la quatrième version d'OpenStack. Elle incluait Compute (nova 2011.3), Stockage d'objets (swift 1.4.3), et le service d'Images (glance).

source: A list of API endpoints that are available to a user after authentication with the Identity service.
fr: Liste des API disponibles pour un utilisateur après son authentification auprès du service d'identité.

source: A list of permissions attached to an object. An ACL specifies which users or system processes have access to objects. It also defines which operations can be performed on specified objects. Each entry in a typical ACL specifies a subject and an operation. For instance, the ACL entry <code>(Alice, delete)</code> for a file gives Alice permission to delete the file.
fr: Liste de permissions attachées à un objet. Une ACL spécifie quels utilisateurs ou processus system ont accès aux objets. Elle définit aussi quelles opérations peuvent être réalisées sur les objets spécifiés. Chaque entrée dans une ACL typique spécifie un sujet et une opération. Par exemple, l'entrée ACL <code>(Alice, delete)</code> pour un fichier donne à Alice la permission de supprimer le fichier.

source: A mechanism that allows IPv6 packets to be transmitted over an IPv4 network, providing a strategy for migrating to IPv6.
fr: Un mécanisme permettant aux paquets IPv6 d'être transmis sur un réseau IPv4 qui fournit un procédé de migration vers IPv6.

source: A message that is stored in memory and is lost after the server is restarted.
fr: Un message qui stocké dans la mémoire et qui est perdu après un redémarrage du serveur.

source: A method of VM live migration used by KVM to evacuate instances from one host to another with very little downtime during a user-initiated switchover. Does not require shared storage. Supported by Compute.
fr: Méthode de déplacement à chaud des VMs utilisée par KVM pour évacuer les instances d'un hôtes vers un autre avec très peu d'indisponibilité lorsque l'action est initiée par l'utilisateur. Ne nécessite pas de stockage partagé. Supporté par Compute.

source: A minimal Linux distribution designed for use as a test image on clouds such as OpenStack.
fr: CirrOS

source: A model that enables access to a shared pool of configurable computing resources, such as networks, servers, storage, applications, and services, that can be rapidly provisioned and released with minimal management effort or service provider interaction.
fr: Modèle qui permet l'accès à un ensemble de ressources informatiques partagées configurables, comme des réseaux, des serveurs, du stockage, des applications, et des services, qui peuvent être provisionnées et libérées rapidement avec un minimum d'effort de gestion ou d'interaction avec le fournisseur de service.

source: A node that runs Object Storage account, container, and object services.
fr: Un nœud qui exécute le compte Object Storage, conteneur et les services d'objet.

source: A node that runs network, volume, API, scheduler, and image services. Each service may be broken out into separate nodes for scalability or availability.
fr: Un nœud qui fait tourner les services réseau, volume, API, scheduler et image. Chaque service peut être éclaté sur des nœuds séparés pour la scalabilité ou la disponibilité.

source: A notification driver that monitors VM instances and updates the capacity cache as needed.
fr: Un driver de notification qui supervise les instances de VM et met à jour le cache de capacité au besoin.

source: A package commonly installed in VM images that performs initialization of an instance after boot using information that it retrieves from the metadata service, such as the SSH public key and user data.
fr: Package généralement installé dans les images de VM qui effectue l'initialisation d'une instance après son boot en utilisant les informations récupérées du service metadata, comme la clé public SSH et les user data.

source: A person who plans, designs, and oversees the creation of clouds.
fr: Une personne qui planifie, designe et supervise la création d'un cloud.

source: A piece of software that makes available another piece of software over a network.
fr: Morceau de logiciel qui rend accessible un autre morceau de logiciel à travers le réseau.

source: A project that is not officially endorsed by the OpenStack Foundation. If the project is successful enough, it might be elevated to an incubated project and then to a core project, or it might be merged with the main code trunk.
fr: Projet qui n'est pas officiellement approuvé par la Fondation OpenStack. Si le projet réussi assez, il pourra être élevé au rang de projet incubé puis de projet principal, ou bien il peut être fusionné avec le tronc de code principal.

source: A project that ports the shell script-based project named DevStack to Python.
fr: Un projet de réécriture de DevStack, écrit en shell-script, en python.

source: A scheduling method used by Compute that randomly chooses an available host from the pool.
fr: Méthode de planification utilisée par Compute qui choisit aléatoirement un host disponible dans le pool.

source: A scripting language that is used to build web pages.
fr: Langage de script utilisé pour construire les pages web.

source: A string of text provided to the client after authentication. Must be provided by the user or process in subsequent requests to the API endpoint.
fr: Une chaine de caractères fournie au client après authentification. Elle doit être fournie par l'utilisateur ou le processus lors de ses prochaines requêtes au point de terminaison API.

source: A subset of API calls that are accessible to authorized administrators and are generally not accessible to end users or the public Internet. They can exist as a separate service (keystone) or can be a subset of another API (nova).
fr: Un sous-ensemble d'appels API qui sont accessibles par les administrateurs authorisés et qui ne sont généréralement pas accessibles aux utilisateurs finaux ou sur l'internet public. ils peuvent exister sous forme de service séparé (keystone) ou comme sous-ensemble d'une autre API (nova).

source: API (application programming interface)
fr: API (interface de programmation applicative)

source: API endpoint
fr: Point de terminaison d'API

source: API extension
fr: extension API

source: API extension plug-in
fr: Greffon d'extension d'API

source: API key
fr: Clé d'API

source: API server
fr: Serveur d'API

source: API token
fr: Jeton d'API

source: API version
fr: Version d'API

source: ATA over Ethernet (AoE)
fr: ATA sur Ethernet (AoE)

source: Address Resolution Protocol (ARP)
fr: Protocole de Résolution d'Adresse (ARP)

source: Advanced Message Queuing Protocol (AMQP)
fr: Protocole avancé de mise en file d'attente de messages (AMQP)

source: All OpenStack core projects are provided under the terms of the Apache License 2.0 license.
fr: Tous les projets principaux d'OpenStack sont proposés selon les termes de la licence Apache License 2.0.

source: Alternative name for the Block Storage API.
fr: Autre nom pour l'API de stockage par blocs.

source: Alternative term for a Networking plug-in or Networking API extension.
fr: Terme alternatif pour greffon de Réseau ou une extension d'API de Réseau.

source: Alternative term for a VM instance type.
fr: Autre expression pour type d'instance de VM

source: Alternative term for a VM or guest.
fr: Autre expression pour une VM ou un invité.

source: Alternative term for a cloud controller node.
fr: Autre terme pour nœud contrôleur de cloud.

source: Alternative term for a fixed IP address.
fr: Autre expression pour une adresse IP fixe.

source: Alternative term for a non-durable <phrase role="keep-together">exchange</phrase>.
fr: Autre expression pour un <phrase role="keep-together">exchange</phrase> bref.

source: Alternative term for a non-durable queue.
fr: Autre expression pour une brève file d'attente.

source: Alternative term for a virtual network.
fr: Autre expression pour un réseau virtuelle.

source: Alternative term for a volume plug-in.
fr: Autre terme désignant un plug-in de volume.

source: Alternative term for an API token.
fr: Autre terme désignant un jeton d'API

source: Alternative term for an Identity service default token.
fr: Autre terme pour un jeton par défaut du service d'Identité.

source: Alternative term for an Object Storage authorization node.
fr: Autre mot pour nœud d'autorisation de Stockage Objet.

source: Alternative term for an image.
fr: Autre expression pour une image.

source: Alternative term for non-durable.
fr: Autre expression pour bref.

source: Alternative term for tenant.
fr: Autre terme désignant un locataire/un tenant.

source: An API on a separate endpoint for attaching, detaching, and creating block storage for compute VMs.
fr: Une API sur un point de terminaison séparé pour attacher, détacher, et créer du stockage par blocs pour les VMs de compute.

source: An API that is accessible to tenants.
fr: Une API qui est accessible aux projets.

source: An Amazon EC2 concept of an isolated area that is used for fault tolerance. Do not confuse with an OpenStack Compute zone or cell.
fr: Concept Amazon EC2 d'une zone isolée utilisée pour la tolérance de panne. Ne pas confondre avec les zones compute ou les cellules d'OpenStack.

source: An IP address that is accessible to end-users.
fr: Une adresse IP accessible aux utilisateurs finaux.

source: An Identity service component that manages and validates tokens after a user or tenant has been authenticated.
fr: Composant du service d'Identité qui gère et valide les jetons après qu'un utilisateur ou un tenant ait été authentifié.

source: An Identity service that lists API endpoints that are available to a user after authentication with the Identity service.
fr: Un service d'Identité qui liste les API disponibles pour un utilisateur après son authentification auprès du service d'identité.

source: An Image service container format that indicates that no container exists for the VM image.
fr: Format de conteneur du service d'Image qui indique qu'aucun conteneur n'existe pour cette image de VM.

source: An Internet Protocol (IP) address configured on the load balancer for use by clients connecting to a service that is load balanced. Incoming connections are distributed to back-end nodes based on the configuration of the load balancer.
fr: Adresse IP (Internet Protocol) configurée sur le load balancer pour être utilisée par les clients se connectant au service qui est load balancé. La distribution des connexions entrantes aux noeuds en arrière plan est basée sur la configuration du load balancer.

source: An Object Storage node that provides authorization services.
fr: Noeud de stockage objet qui fournit les services d'autorisation.

source: An OpenStack core project that provides object storage services.
fr: Projet OpenStack qui fournit les services de stockage objets.

source: An OpenStack grouped release of projects that came out in the spring of 2011. It included Compute (nova), Object Storage (swift), and the Image service (glance).
fr: Une livraison groupée de projets OpenStack sortie au printemps 2011. Cette livraison incluait Compute (nova), Stockage d'objets (swift), et le service d'Images (glance).

source: An OpenStack-provided image.
fr: Une image fournie par OpenStack.

source: An OpenStack-supported hypervisor.
fr: Hyperviseur supporté par OpenStack

source: An alpha-numeric string of text used to access OpenStack APIs and resources.
fr: Chaîne de texte alpha-numérique utilisée pour l'accès aux APIs et resources OpenStack.

source: An iSCSI authentication method supported by Compute.
fr: Méthode d'authentification iSCSI supportée par Compute.

source: An object within Object Storage that is larger than 5GB.
fr: Un objet du Stockage Objet qui est plus grand que 5GB.

source: An open source SQL toolkit for Python, used in OpenStack.
fr: Une boite à outil SQL open source pour Python, utilisé par OpenStack.

source: An operating system configuration-management tool supported by OpenStack.
fr: Un outil de configuration du système d'exploitation supporté par OpenStack

source: An operating system instance running under the control of a hypervisor.
fr: Une instance de système d'exploitation tournant sous le contrôle d'un hyperviseur.

source: An operating system instance that runs on top of a hypervisor. Multiple VMs can run at the same time on the same physical host.
fr: Instance d'un système d'exploitation qui tourne par dessus un hyperviseur. Plusieurs VMs peuvent tourner en même temps sur le même host physique.

source: Any client software that enables a computer or device to access the Internet.
fr: Tout client logiciel qui permet à un ordinateur ou un périphérique d'accéder à internet.

source: Apache License 2.0
fr: Licence Apache 2.0

source: Apache Web Server
fr: Serveur Web Apache

source: Application Programming Interface (API)
fr: API (Application Programming Interface), interface de programmation d'application

source: Application Service Provider (ASP)
fr: Fournisseur de Service d'Application (ASP)

source: Application catalog
fr: Catalogue d'applications

source: Application programming interface.
fr: Interface de programmation applicative.

source: Association of an interface ID to a logical port. Plugs an interface into a port.
fr: Association entre un ID d'interface et un port logique. Branche l'interface sur le port.

source: Asynchronous JavaScript and XML (AJAX)
fr: Asynchrone JavaScript et XML (AJAX)

source: Attachment point where a virtual interface connects to a virtual network.
fr: Point de jonction où une interface virtuelle se connecte à un réseau virtuel.

source: Authentication and identity service by Microsoft, based on LDAP. Supported in OpenStack.
fr: Service d'authentification et d'identité de Microsoft, basé sur LDAP. Supporté dans OpenStack.

source: Authentication method that uses keys rather than passwords.
fr: Une méthode d'authentification par clé plutôt que par mots de passe.

source: Bare metal service
fr: Service bare metal

source: Bell-LaPadula model
fr: modèle Bell-LaPadula

source: Benchmark service
fr: Service de Benchmark

source: Bexar is the code name for the second release of OpenStack. The design summit took place in San Antonio, Texas, US, which is the county seat for Bexar county.
fr: Bexar est le nom de code de la deuxième livraison d'OpenStack. Le sommet de design a pris place à San Antonio, au Texas, qui est le siège de comté pour le comté du Bexar.

source: Block Storage
fr: Stockage de Bloc

source: Block Storage API
fr: API de stockage par blocs

source: Bootstrap Protocol (BOOTP)
fr: Protocole Bootstrap (BOOTP)

source: Both a VM container format and disk format. Supported by Image service.
fr: A la fois un format de conteneur de VM et un format de disque. Supporté par le service d'Image.

source: Cactus is a city in Texas, US and is the code name for the third release of OpenStack. When OpenStack releases went from three to six months long, the code name of the release changed to match a geography nearest the previous summit.
fr: Cactus est une ville au Texas, Etats-Unis et c'est le nom de code de la troisième livraison d'OpenStack. Quand les livraisons d'OpenStack sont passées de 3 à 6 mois, le nom de code de la livraison a changé pour correspondre à un point géographique plus proche du sommet précédent.

source: Checks for missing replicas and incorrect or corrupted objects in a specified Object Storage account by running queries against the back-end SQLite database.
fr: Recherche des replicas manquants et des objets incorrects ou corrompus dans un compte spécifique de stockage d'objets en interrogeant la base de donnée SQLite.

source: Cisco neutron plug-in
fr: Extension Cisco pour neutron

source: Code name for the OpenStack project that provides the Containers Service.
fr: Nom de code pour le projet OpenStack qui fournit le service de Conteneurs.

source: Code name of the key management service for OpenStack.
fr: Nom de code du service de gestion des clés d'OpenStack.

source: Companies that rent specialized applications that help businesses and organizations provide additional services with lower cost.
fr: Compagnies qui louent des applications spécialisées pour aider les entreprises et les organisations à fournir des services additionnels à moindre coût.

source: Compute API
fr: API Compute

source: Compute service
fr: Le service Calcul

source: Configuration setting within RabbitMQ that enables or disables message acknowledgment. Enabled by default.
fr: Paramètre de configuration dans RabbitMQ qui active ou désactive l'acquittement des messages. Activé par défaut.

source: Containers service
fr: Service de conteneurs

source: Contains the output from a Linux VM console in Compute.
fr: Contient la sortie console d'une VM Linux dans Compute.

source: Custom modules that extend some OpenStack core APIs.
fr: Modules personnalisés qui étendent les APIs principales d'OpenStack.

source: DHCP agent
fr: Agent de relais DHCP

source: DNS record
fr: enregistrement DNS

source: DNS records
fr: enregistrements DNS

source: DNS service
fr: service DNS

source: Data processing service
fr: Service de traitement des données

source: Data that is only known to or accessible by a user and used to verify that the user is who he says he is. Credentials are presented to the server during authentication. Examples include a password, secret key, digital certificate, and fingerprint.
fr: Donnée seulement connue ou accessible par un utilisateur et utilisée pour vérifier qu'un utilisateur est qui il dit qu'il est. Les accréditations sont présentées au serveur pendant l'authentification. Ça peut être, par exemple, un mot de passe, une clé secrété, un certificat digital, et une empreinte digitale.

source: Database service
fr: Service de base de données
