Repository: openstack/openstack-manuals
Catalog: doc/glossary/locale/*.po
Languages: fr

source: account auditor
fr: auditeur de compte

source: account database
fr: compte base de donnée

source: account reaper
fr: faucheur de compte

source: account server
fr: serveur de compte

source: account service
fr: service de compte

source: accounting
fr: Comptabilisation

source: accounts
fr: comptes

source: active/active configuration
fr: configuration actif/actif

source: active/passive configuration
fr: configuration actif/passive

source: address pool
fr: groupe d'adresses

source: admin API
fr: API d'administration

source: admin server
fr: serveur administrateur

source: alert
fr: alerte

source: alerts
fr: alertes

source: allocate
fr: allouer

source: allocate, definition of
fr: allouer, définition de

source: applet
fr: appliquette

source: application server
fr: serveur d'application

source: application servers
fr: serveurs d'application

source: arptables
fr: tables arp

source: associate
fr: associé

source: associate, definition of
fr: associé, définition de

source: attach
fr: attacher

source: attach, definition of
fr: attacher, définition de

source: attachment (network)
fr: attachement (réseau)

source: auditing
fr: audition

source: auditor
fr: auditeur

source: auth node
fr: node d'authentification

source: authentication
fr: authentification

source: authentication token
fr: jeton d'authentification

source: authentication tokens
fr: jetons d'authentification

source: authorization
fr: autorisation

source: authorization node
fr: nœud d'autorisation

source: availability zone
fr: zone de disponibilité

source: back end
fr: Sauvegarde

source: back-end catalog
fr: catalogue de sauvegarde

source: back-end interactions
fr: interactions de sauvegarde

source: bandwidth
fr: bande passante

source: bare
fr: vide

source: bare, definition of
fr: vide, définition de

source: base image
fr: image de base

source: binary
fr: binaire

source: bits per second (BPS)
fr: bits par seconde (BPS)

source: bits, definition of
fr: bits, définition de

source: block device
fr: périphérique de bloc

source: block migration
fr: migration de bloc

source: bootable disk image
fr: image de disque bootable

source: browser
fr: navigateur

source: browsers, definition of
fr: navigateurs, définition de

source: button class
fr: classe de boutons

source: button classes
fr: classes de boutons

source: byte
fr: octet

source: bytes, definition of
fr: octet, définition de

source: capability
fr: capacités

source: capacity updater
fr: actualiseur de capacité

source: catalog
fr: catalogue

source: catalog service
fr: catalogue de service

source: cell
fr: cellule

source: cells
fr: cellules

source: changes since
fr: changements depuis

source: child cell
fr: cellule enfant

source: child cells
fr: cellules enfant

source: cloud architect
fr: architecte cloud

source: cloudpipe image
fr: image cloudpipe

source: code name
fr: nom de code

source: command filter
fr: filtre de commande

source: command filters
fr: filtres de commande

source: community project
fr: projet communautaire

source: community projects
fr: projets communautaire

source: compute host
fr: Hôte de Compute

source: compute node
fr: nœud de compute

source: compute nodes
fr: nœuds de compute

source: console log
fr: journal de la console

source: console logs
fr: journaux de la console

source: container
fr: conteneur

source: container format
fr: format de conteneur

source: container service
fr: service de conteneur

source: containers
fr: conteneurs

source: controller node
fr: nœud de contrôle

source: controller nodes
fr: nœud de contrôles

source: core API
fr: API principale

source: cost
fr: coût

source: credentials
fr: accréditation

source: customer
fr: client

source: customers
fr: clients

source: customization module
fr: module de personnalisation

source: dashboard
fr: tableau de bord

source: data
fr: donnée

source: data encryption
fr: chiffrement des données

source: databases
fr: bases de données

source: deallocate
fr: désallouer, désassocier

source: deallocate, definition of
fr: désallouer, désassocier, définition de

source: deduplication
fr: déduplication

source: default panel
fr: page par défaut

source: default panels
fr: pages par défaut

source: default tenant
fr: locataire par défaut

source: default tenants
fr: locataires par défaut

source: default token
fr: jeton par défaut

source: default tokens
fr: jetons par défaut

source: definition of
fr: définition de

source: definitions of
fr: définitions de

source: delivery mode
fr: mode de livraison

source: denial of service (DoS)
fr: Déni de service (DoS)

source: developer
fr: développeur

source: device ID
fr: ID du Périphérique

source: disassociate
fr: Dissocier

source: disk encryption
fr: Chiffrement de disque

source: disk format
fr: format de disque

source: domain
fr: domaine

source: domain, definition of
fr: domaine, définition de

source: download
fr: téléchargement

source: download, definition of
fr: téléchargement, définition de

source: drivers
fr: pilotes

source: encryption
fr: chiffrement

source: encryption, definition of
fr: chiffrement, définition de

source: endpoint
fr: Point de terminaison

source: endpoints
fr: points de terminaison

source: ephemeral image
fr: image éphémère

source: ephemeral images
fr: images éphémère

source: ephemeral volume
fr: volume éphémère

source: evacuate
fr: évacuer

source: evacuation, definition of
fr: évacuation, définition de

source: exchange
fr: échange

source: exchange type
fr: type d'échange

source: exchange types
fr: types d'échange

source: extended attributes (xattr)
fr: attributs étendus (xattr)

source: external network
fr: réseau externe

source: external network, definition of
fr: réseau externe, définition de

source: extra specs
fr: spécifications supplémentaires

source: extra specs, definition of
fr: spécifications supplémentaires, définition de

source: filter
fr: filtre

source: filtering
fr: filtrage

source: firewall
fr: Pare-feu

source: firewalls
fr: pare-feux

source: fixed
fr: fixé

source: fixed IP address
fr: adresse IP fixe.

source: fixed IP addresses
fr: adresses IP fixes.

source: flavor
fr: gabarit

source: flavor ID
fr: ID du gabarit

source: floating
fr: flottante

source: floating IP address
fr: adresse IP flottante

source: gateway
fr: passerelle

source: hard reboot
fr: redémarrage matériel

source: high availability (HA)
fr: Haute disponibilité (HA)

source: host aggregate
fr: agrégat d'hôte

source: hosts, definition of
fr: hôtes, définition de

source: hybrid cloud
fr: cloud hybride

source: hyperlink
fr: lien hypertexte

source: hypervisor
fr: hyperviseur

source: hypervisors
fr: hyperviseurs

source: iSCSI protocol
fr: protocole iSCSI

source: image owner
fr: propriétaire de l'image

source: image status
fr: statut de l'image

source: instance ID
fr: ID de l'instance

source: instance UUID
fr: UUID de l'instance

source: instance state
fr: statut de l'instance

source: instance type
fr: type d'instance

source: live migration
fr: migration à chaud

source: load balancer
fr: répartiteur de charge

source: load balancing
fr: répartition de charge

source: multi-factor authentication
fr: authentification multi-facteur

source: network ID
fr: ID de réseau

source: network IDs
fr: IDs de réseau

source: networks
fr: réseaux

source: neutron API
fr: API neutron

source: node
fr: noeud

source: object
fr: objet

source: objects
fr: objets

source: operator
fr: opérateur

source: orphan
fr: orphelin

source: orphans
fr: orphelins

source: private IP address
fr: adresse IP privée

source: private image
fr: image privée

source: private network
fr: réseau privé

source: private networks
fr: réseaux privés

source: project
fr: projet

source: projects
fr: projets

source: proxy server
fr: serveur proxy

source: proxy servers
fr: serveurs proxy

source: public API
fr: API publique

source: public APIs
fr: APIs publiques

source: public IP address
fr: adresse IP publique

source: public image
fr: image publique

source: public images
fr: images publiques

source: public key authentication
fr: authentification par clé publique

source: public network
fr: réseau public

source: quarantine
fr: quarantaine

source: reboot
fr: redémarrage

source: record
fr: enregistrement

source: records
fr: enregistrements

source: reference architecture
fr: architecture de référence

source: region
fr: région

source: resize
fr: redimensionner

source: resizing
fr: redimensionnement

source: role
fr: rôle

source: roles
fr: rôles

source: secret key
fr: clé secrète

source: secret keys
fr: clés secrètes

source: security group
fr: groupe de sécurité

source: security groups
fr: groupes de sécurité

source: servers
fr: serveurs

source: service ID
fr: ID du service

source: session persistence
fr: persistance de session

source: session storage
fr: stockage de session

source: shared
fr: partagé

source: shared IP address
fr: adresse IP partagée

source: shared IP group
fr: groupe IP partagé

source: shared IP groups
fr: groupes IP partagées

source: shared storage
fr: stockage partagé

source: snapshot
fr: instantané

source: soft reboot
fr: redémarrage logiciel

source: stack
fr: pile

source: static
fr: statique

source: static IP address
fr: adresse IP statique

source: static IP addresses
fr: adresses IP statiques

source: storage
fr: stockage

source: storage manager
fr: gestionnaire de stockage

source: storage node
fr: nœud de stockage

source: storage nodes
fr: nœuds de stockage

source: storage services
fr: services de stockage

source: strategy
fr: stratégie

source: subdomain
fr: sous domaine

source: subdomains
fr: sous domaines

source: subnet
fr: sous-réseau

source: suspend
fr: suspendre

source: suspend, definition of
fr: suspendre, définition de

source: swap, definition of
fr: swap, définition de

source: swift proxy server
fr: serveur de proxy rapide

source: swift storage node
fr: nœud de stockage rapide

source: swift storage nodes
fr: nœuds de stockage rapide

source: sync point
fr: point de synchro

source: tenant
fr: projet

source: tenant ID
fr: ID du projet

source: tenant endpoint
fr: point d'accès du projet

source: tenants
fr: locataires

source: token
fr: jeton

source: token services
fr: services de jeton

source: tokens
fr: jetons

source: topic publisher
fr: éditeur de sujet

source: transaction ID
fr: ID de la transaction

source: transaction IDs
fr: ID des transactions

source: transient
fr: transitoire

source: transient exchange
fr: échange transitoire

source: transient exchanges
fr: échanges transitoires

source: transient message
fr: message transitoire

source: transient messages
fr: messages transitoires

source: transient queue
fr: File d'attente transitoire

source: transient queues
fr: Files d'attente transitoires

source: translator-credits
fr: Olivier Buisson <olivier@obn.me>, 2012 | Cloudwatt Team <contact@cloudwatt.com>, 2013

source: unscoped token
fr: jeton hors-scope

source: updater
fr: actualiseur

source: updaters
fr: actualisateurs

source: user
fr: utilisateur

source: user data
fr: donnée utilisateur

source: users, definition of
fr: utilisateur, définition de

source: virtual
fr: virtuel

source: virtual IP
fr: IP virtuel

source: virtual VLAN
fr: VLAN virtuel

source: virtual machine (VM)
fr: machine virtuel (VM)

source: virtual network
fr: réseau virtuel

source: virtual networking
fr: réseau virtuel

source: virtual port
fr: port virtuel

source: virtual server
fr: serveur virtuel

source: virtual servers
fr: serveurs virtuels

source: virtual switch (vSwitch)
fr: commutateur virtuel (vSwitch)

source: volume ID
fr: ID du volume

source: volume controller
fr: contrôleur de volume

source: volume driver
fr: pilote de volume

source: volume manager
fr: gestionnaire de volume

source: volume node
fr: nœud d'un volume

source: weight
fr: poids

source: weighted cost
fr: coût pondéré

source: weighting
fr: pondération
