Repository: openstack/openstack-manuals
Catalog: doc/glossary/locale/*.po
Languages: fr

source: Defines resources for a cell, including CPU, storage, and networking. Can apply to the specific services within a cell or a whole cell.
fr: Définie les ressources allouées à une cellule, incluant CPU, stockage, et réseau. Peut s'appliquer à un service spécifique à l'intérieur d'une cellule ou à l'ensemble de la cellule.

source: Depending on context, the core API is either the OpenStack API or the main API of a specific core project, such as Compute, Networking, Image service, and so on.
fr: En fonction du contexte, l'API core est soit l'API OpenStack ou l'API principale d'un projet spécifique, comme Compute, Réseau, service d'Image, etc...

source: Disk-based data storage generally represented as an iSCSI target with a file system that supports extended attributes; can be persistent or ephemeral.
fr: Stockage de donnée sur disque généralement représenté par une target iSCSI avec un système de fichier qui supporte les attributs étendus; peut être persistant ou éphémère.

source: Disk-based virtual memory used by operating systems to provide more memory than is actually available on the system.
fr: Mémoire virtuelle basée sur disque utilisée par le système d'exploitation pour fournir plus de mémoire qu'il y en a effectivement.

source: Dynamic Host Configuration Protocol (DHCP)
fr: Protocole de configuration d'hôte dynamique (DHCP)

source: EC2 API
fr: API EC2

source: ESX hypervisor
fr: Hyperviseur ESX

source: ESXi hypervisor
fr: Hyperviseur ESXi

source: Elastic Block Storage (EBS)
fr: Bloc de Stockage Élastique (EBS)

source: Folsom is the code name for the sixth release of OpenStack. The design summit took place in San Francisco, California, US and Folsom is a nearby city.
fr: Folsom est le nom de code pour la sixième livraison d'OpenStack. Le sommet de design a pris place à San Francisco, Californie, US et Folsom est une ville des environs.

source: Glossary
fr: Glossaire

source: High-performance 64-bit file system created by Silicon Graphics. Excels in parallel I/O operations and data consistency.
fr: Système de fichier 64-bit haute performance créé par Silicon Graphics. Excelle dans les opérations d'I/O parallèles et la consistance des données.

source: IP address
fr: Adresse IP

source: IP addresses
fr: adresses IP

source: Identity
fr: Identité

source: If a requested resource such as CPU time, disk storage, or memory is not available in the parent cell, the request is forwarded to its associated child cells. If the child cell can fulfill the request, it does. Otherwise, it attempts to pass the request to any of its children.
fr: Si une ressource demandée comme le temps CPU, le stockage disque, ou la mémoire n'est pas disponible dans la cellule parent, la requête est transférée aux cellules enfants associées. Si la cellule enfant peut répondre à la requête, elle le fait. Sinon, elle essaie de passer la requête à un de ses enfants.

source: Image service
fr: Service d'Image

source: Image service API
fr: API du Service d'Image

source: Impassable limits for guest VMs. Settings include total RAM size, maximum number of vCPUs, and maximum disk size.
fr: Limites maximum pour les VMs hôtes. Les paramètres comprennent la taille totale de la RAM, le nombre maximum de vCPUs et la taille disque maximum.

source: In Compute, conductor is the process that proxies database requests from the compute process. Using conductor improves security because compute nodes do not need direct access to the database.
fr: Dans Compute, le conductor est le processus qui proxifie les requêtes vers la base de données. Utiliser le conductor améliore la sécurité parce que les nœuds de compute n'ont pas besoin d'accès direct à la base de donnée.

source: In OpenStack, the API version for a project is part of the URL. For example, <filename>example.com/nova/v1/foobar</filename>.
fr: Dans OpenStack, la version d'API pour un projet est une partie de l'URL. Par exemple, <filename>example.com/nova/v1/foobar</filename>.

source: In a high-availability setup with an active/active configuration, several systems share the load together and if one fails, the load is distributed to the remaining systems.
fr: Dans un environnement haute-disponibilité avec une configuration actif/actif, la charge est répartie sur plusieurs systèmes, si l'un d'entre eux fait défaut la charge est répartie sur les systèmes restants.

source: In a high-availability setup with an active/passive configuration, systems are set up to bring additional resources online to replace those that have failed.
fr: Dans un environnement haute-disponibilité avec une configuration actif/actif, les systèmes sont configurés pour fournir des ressources supplémentaires pour remplacer celles qui seraient indisponibles.

source: Information that consists solely of ones and zeroes, which is the language of computers.
fr: Information composée uniquement de zéros et de uns, ce qui est le langages des ordinateurs.

source: Interactions and processes that are obfuscated from the user, such as Compute volume mount, data transmission to an iSCSI target by a daemon, or Object Storage object integrity checks.
fr: Interactions et processus qui sont cachés à l'utilisateur, comme le montage des volumes Compute, la transmission des données à une target iSCSI par un daemon, ou les vérifications d'intégrité d'un objet du Stockage d'Objet.

source: Key management service
fr: Service de gestion des clés

source: Load-Balancer-as-a-Service (LBaaS)
fr: Répartition-de-charge-en-tant-que-service (LBaaS)

source: Lower power consumption CPU often found in mobile and embedded devices. Supported by OpenStack.
fr: Microprocesseur (CPU) basse consommation souvent trouvé dans les périphériques mobiles ou embarqués. Supporté par OpenStack.

source: Message queue software supported by OpenStack. An alternative to RabbitMQ. Also spelled 0MQ.
fr: Logiciel de mise en file de messages supporté par OpenStack. Une alternative à RabbitMQ. Également épelé 0MQ.

source: Method to access VM instance consoles using a web browser. Supported by Compute.
fr: Méthode pour accéder aux consoles d'instance VM en utilisant un navigateur. Supporté par Compute.

source: Name for the Compute component that manages VMs.
fr: Nom du composant Compute qui gère les VMs.

source: Networking
fr: Réseaux

source: Networking API
fr: API de réseau

source: Nova API
fr: API Nova

source: Numbers
fr: Nombres

source: Object Storage API
fr: API du Stockage d'Objets

source: One of the VM image disk formats supported by Image service.
fr: Un des formats de disque d'image de VM supporté par le service d'Image.

source: One of the default roles in the Compute RBAC system. Grants complete system access.
fr: Un des rôles par défaut dans le système RBAC de Compute. Donne les accès complets au système.

source: One of the hypervisors supported by OpenStack, generally used for development purposes.
fr: Un des hyperviseurs supportés par OpenStack, généralement utilisé pour le développement.

source: One of the hypervisors supported by OpenStack.
fr: Un des hyperviseurs supportés par OpenStack.

source: Open source GUI and CLI tools used for remote console access to VMs. Supported by Compute.
fr: Outils GUI et CLI open source utilisés pour l'accès distant aux consoles des VMs. Supportés par Compute.

source: OpenStack Networking agent that provides DHCP services for virtual networks.
fr: Agent réseau OpenStack qui fournit les services DHCP pour les réseaux virtuels.

source: OpenStack code name
fr: Nom de code d'OpenStack

source: OpenStack glossary
fr: Glossaire OpenStack

source: OpenStack project that provides a dashboard, which is a web interface.
fr: Projet OpenStack qui fournit un tableau de bord, sous forme d'interface web.

source: OpenStack project that provides a framework for performance analysis and benchmarking of individual OpenStack components as well as full production OpenStack cloud deployments. The code name of the project is rally.
fr: Projet OpenStack qui fournit un framework pour l'analyse de performance et le benchmarking de composant individuels OpenStack aussi bien que de déploiement d'un cloud OpenStack complet de production. Le nom de code du projet est rally.

source: OpenStack project that provides a message service to applications.
fr: Projet OpenStack fournissant un service de messages aux applications.

source: OpenStack project that provides a set of services for management of application containers in a multi-tenant cloud environment. The code name of the project name is magnum.
fr: Projet OpenStack qui fournit un ensemble de services pour la gestion de conteneurs d'application dans un environnement cloud multi-tenant. Le nom de code du projet est magnum.

source: OpenStack project that provides database services to applications.
fr: Le projet OpenStack qui fournit des services de base de données à des applications.

source: OpenStack project that provides the Governance service.
fr: Projet OpenStack qui fournit le service de Gouvernance.

source: OpenStack project that provisions bare metal, as opposed to virtual, machines. The code name for the project is ironic.
fr: Projet OpenStack pour provisionner des machines physiques, par opposition aux machines virtuelles. Le nom de code du projet est ironic.

source: OpenStack-on-OpenStack program. The code name for the OpenStack Deployment program.
fr: Programme OpenStack-on-OpenStack. Le nom de code pour le programme OpenStack Deployment.

source: Passed to API requests and used by OpenStack to verify that the client is authorized to run the requested operation.
fr: Passé dans une requête à une API et utilisé par OpenStack pour vérifier que les clients sont autorisés à exécuter l'opération demandée.

source: Physical host dedicated to running compute nodes.
fr: Serveur physique dédié pour faire tourner des nœuds de compute.

source: Programming language used extensively in OpenStack.
fr: Le langage de programmation utilisé majoritairement dans OpenStack.

source: Provides support for VMware NSX in Neutron.
fr: Fournit le support de VMware NSX dans Neutron.

source: QEMU is a generic and open source machine emulator and virtualizer.
fr: QEMU est un émulateur et un virtualiseur de machines générique et open source.

source: RESTful web services
fr: Services web RESTful

source: Reducing the size of files by special encoding, the file can be decompressed again to its original content. OpenStack supports compression at the Linux file system level but does not support compression for things such as Object Storage objects or Image service VM images.
fr: Réduire la taille des fichiers par un encodage spécial. Le fichier peut ensuite être décompressé vers son contenu d'origine. OpenStack supporte la compression au niveau du système de fichier Linux mais ne supporte pas la compression pour des choses comme les objets du Stockage d'Objet ou les images de VM du service d'Image.

source: S3 storage service
fr: S3 service stockage

source: See access control list.
fr: Voir la liste du contrôle d'accès.

source: Set of bits that make up a single character; there are usually 8 bits to a byte.
fr: Ensemble de bits composant un caractère; il y a en général 8 bits dans un octet.

source: Sheepdog
fr: Chien de berger

source: Software that runs on a host or node and provides the features and functions of a hardware-based network switch.
fr: Logiciel qui s’exécute sur un hôte ou un nœud et fournit les caractéristiques et fonctionnalités d'une switch réseau matériel.

source: Subdivides physical CPUs. Instances can then use those divisions.
fr: Subdivise des CPUs physiques. Les instances peuvent ensuite utiliser ces divisions.

source: Supports interaction with VMware products in Compute.
fr: Supporte l'intégration avec les produits VMware dans Compute.

source: Telemetry
fr: Télémétrie

source: Tenant API
fr: API Projet

source: The <systemitem class="service">nova-api</systemitem> daemon provides access to nova services. Can communicate with other APIs, such as the Amazon EC2 API.
fr: Le daemon <systemitem class="service">nova-api</systemitem> fournit l'accès aux services nova. Il peut communiquer avec d'autres APIs, comme l'API Amazon EC2.

source: The Border Gateway Protocol is a dynamic routing protocol that connects autonomous systems. Considered the backbone of the Internet, this protocol connects disparate networks to form a larger network.
fr: Border Gateway Protocol est un protocole de routage dynamique qui connecte des systèmes autonomes. Considéré comme le backbone d'internet, ce protocole connecte des réseaux disparates pour former un réseau plus large.

source: The Compute component that chooses suitable hosts on which to start VM instances.
fr: Composant compute qui choisit les hosts adéquates pour démarrer les instances de VMs.

source: The Compute component that contains a list of the current capabilities of each host within the cell and routes requests as appropriate.
fr: Le composant Compute qui contient une liste des capacités courantes de chaque hôte à l'intérieur d'une cellule et dirige les requêtes en fonction.

source: The Compute component that runs on each compute node and manages the VM instance life cycle, including run, reboot, terminate, attach/detach volumes, and so on. Provided by the <systemitem class="service">nova-compute</systemitem> daemon.
fr: Composant Compute qui tourne sur chaque node compute et gère le cycle de vie des VMs, comme l'exécution, le reboot, la terminaison, attacher/détacher les volumes, etc... Fourni par le daemon <systemitem class="service">nova-compute</systemitem>.

source: The Compute service can send alerts through its notification system, which includes a facility to create custom notification drivers. Alerts can be sent to and displayed on the horizon dashboard.
fr: Le service Compute peut envoyer des alertes via son système de notification, qui inclut un système de création de pilotes de notification personnalisés. Les alertes peuvent être envoyées et affichées sur le tableau de bord d'horizon.

source: The Identity component that provides high-level authorization services.
fr: Composant de gestion des identités qui fournit les services d'autorisation de haut niveau.

source: The Identity service component that provides authentication services.
fr: Le composant service d'identité qui fournit les services d'authentification.

source: The Object Storage component that provides container services, such as create, delete, list, and so on.
fr: Composant du Stockage d'Objet qui fournit les services de conteneur, comme créer, supprimer, lister, etc...

source: The Object Storage context of an account. Do not confuse with a user account from an authentication service, such as Active Directory, /etc/passwd, OpenLDAP, OpenStack Identity, and so on.
fr: Le contexte Stockage d'Objets d'un compte. Ne pas confondre avec un compte utilisateur venant d'un service d'authentification, comme Active Directory, /etc/passwd, OpenLDAP, OpenStack Identity, ou autre.

source: The OpenStack core project that enables management of volumes, volume snapshots, and volume types. The project name of Block Storage is cinder.
fr: Le projet OpenStack pour la gestion des volumes, capture instantanées de volume et types de volume. Le nom du projet de stockage par blocs est cinder.

source: The OpenStack core project that provides compute services. The project name of Compute service is nova.
fr: Le projet OpenStack qui fournit les services de compute. Le nom du projet de Compute est nova.

source: The POSIX-compliant file system provided by Ceph.
fr: Le système de fichiers compatible POSIX fournit par Ceph.

source: The Xen administrative API, which is supported by Compute.
fr: API d'administration de Xen, supportée par Compute.

source: The act of verifying that a user, process, or client is authorized to perform an action.
fr: L'action de vérifier qu'un utilisateur, un processus, ou un client est autorisé à réaliser une action.

source: The amount of time it takes for a new Object Storage object to become accessible to all clients.
fr: Temps qu'il faut pour qu'un nouvel objet du Stockage d'Objet devienne accessible à tous les clients.

source: The code name for the initial release of OpenStack. The first design summit took place in Austin, Texas, US.
fr: Nom de code de la livraison initiale d'OpenStack. Le premier sommet de design a pris place à Austin, au Texas, US.

source: The code name for the ninth release of OpenStack. The design summit took place in Hong Kong and Ice House is a street in that city.
fr: Nom de code de la neuvième livraison d'OpenStack. Le sommet de design a pris place à Honk Kong et Ice House est une rue de cette ville.

source: The code name for the thirteenth release of OpenStack. The design summit will take place in Tokyo, Japan. Mitaka is a city in Tokyo.
fr: Nom de code de la treizième livraison d'OpenStack. Le sommet de design se tiendra à Tokyo, Japon. Mitaka est une cité de Tokyo.

source: The collaboration site for OpenStack.
fr: Le site de collaboration pour OpenStack.

source: The fibre channel protocol tunneled within Ethernet.
fr: Protocol fibre channel tunnelé à travers Ethernet.

source: The most common web server software currently used on the Internet.
fr: Le logiciel de serveur web le plus couramment utilisé sur Internet.

source: The open standard messaging protocol used by OpenStack components for intra-service communications, provided by RabbitMQ, Qpid, or ZeroMQ.
fr: Protocole ouvert et standard d'échange de messages utilisé par les composants d'OpenStack pour les communications au sein des services, fournis par RabbitMQ, Qpid, or ZeroMQ.

source: The persistent data store used to save and retrieve information for a service, such as lists of Object Storage objects, current state of guest VMs, lists of user names, and so on. Also, the method that the Image service uses to get and store VM images. Options include Object Storage, local file system, S3, and HTTP.
fr: Stockage de donnée persistent utilisé pour sauvegarder et récupérer les informations pour un service, comme la liste des objets du Stockage d'Objets, l'état actuel des VMs, la liste des utilisateurs, etc... Désigne aussi la méthode qu'utilise le service Image pour obtenir et stocker les images de VMs. Les options possibles incluent Stockage d'Objets, système de fichier local, S3, et HTTP.

source: The person responsible for planning and maintaining an OpenStack installation.
fr: La personne responsable de l'organisation et de la maintenance d'une installation OpenStack.

source: The practice of utilizing a secondary environment to elastically build instances on-demand when the primary environment is resource constrained.
fr: Le fait d'utiliser un second environnement pour démarrer des instances à la demande de façon élastique quand le premier environnement est à court de ressources.

source: The process associating a Compute floating IP address with a fixed IP address.
fr: Le processus associant une adresse IP flottante de Compute avec une adresse IP fixe.

source: The process of taking a floating IP address from the address pool so it can be associated with a fixed IP on a guest VM instance.
fr: Processus qui consiste à prendre une adresse IP flottante du pool d'adresses pour l'associer avec une IP fixe sur une VM invitée.

source: The process that confirms that the user, process, or client is really who they say they are through private key, secret token, password, fingerprint, or similar method.
fr: Processus qui confirme que l'utilisateur, le processus ou le client est vraiment qui il dit qu'il est grâce à une clé privée, un jeton secret, un mot de passe, une empreinte digitale ou une méthode similaire.

source: The project name for the Telemetry service, which is an integrated project that provides metering and measuring facilities for OpenStack.
fr: Nom du projet intégré pour le service de télémétrie, qui fournit les outils de mesures pour OpenStack.

source: The protocol by which layer-3 IP addresses are resolved into layer-2 link local addresses.
fr: Protocol par lequel les adresses IP de niveau-3 sont résolues en lien d'adresses locales de niveau-2.

source: The protocol that tells browsers where to go to find information.
fr: Protocole qui indique aux navigateurs où aller pour trouver l'information.

source: The storage method used by the Identity service catalog service to store and retrieve information about API endpoints that are available to the client. Examples include a SQL database, LDAP database, or KVS back end.
fr: Méthode de stockage utilisée par le catalogue de service du service d'Identité pour stocker et récupérer les informations au sujet des points de terminaison API qui sont disponibles pour le client. Par exemple, une base de donnée SQL, un base de donnée LDAP, ou un back-end KVS.

source: The sum of each cost used when deciding where to start a new VM instance in Compute.
fr: Sommes de tous les coûts utilisée pour décider où démarrer une nouvelle instance de VM dans Compute.

source: The transfer of data, usually in the form of files, from one computer to another.
fr: Transfert de données, en général sous forme de fichiers, d'une ordinateur à un autre.

source: The universal measurement of how quickly data is transferred from place to place.
fr: La mesure universelle de vitesse de transfert des données d'un endroit à un autre.

source: This glossary offers a list of terms and definitions to define a vocabulary for OpenStack-related concepts.
fr: Ce glossaire offre une liste de termes et de définitions pour définir un vocabulaire relatif aux concepts OpenStack.

source: UUID used by Image service to uniquely identify each VM image.
fr: UUID utilisé par le service d'Image pour identifier de façon unique chaque image de VM.

source: Unique ID applied to each storage volume under the Block Storage control.
fr: ID unique appliqué à chaque volume de stockage sous le contrôle du Stockage par Blocs.

source: Unique ID assigned to each Networking VIF.
fr: ID unique assignée à chaque Réseau VIF.

source: Unique ID assigned to each Object Storage request; used for debugging and <phrase role="keep-together">tracing</phrase>.
fr: ID unique assigné à chaque requête de Stockage Objet; utilisé pour débuggage et <phrase role="keep-together">tracing</phrase>.

source: Unique ID assigned to each tenant within the Identity service. The project IDs map to the tenant IDs.
fr: ID unique assigné à chaque tenant dans le service d'Identité. L'ID de projet correspond à l'ID du tenant.

source: Use this glossary to get definitions of OpenStack-related words and phrases.
fr: Utilisez ce glossaire pour obtenir des définitions sur des mots et expressions liés à OpenStack.

source: Used to mark Object Storage objects that have been deleted; ensures that the object is not updated on another node after it has been deleted.
fr: Utilisé pour marquer les objets de stockage d'objets qui ont été supprimés; afin de s'assurer que l'objet n'est pas mis à jour sur un autre nœud après sa suppression.

source: VLAN manager
fr: gestionnaire VLAN

source: VLAN network
fr: réseau VLAN

source: VM disk (VMDK)
fr: disque VM (VMDK)

source: VM image
fr: image VM

source: VMware API
fr: API VMware

source: VMware NSX Neutron plug-in
fr: Plug-in WMware NSX pour Neutron

source: VNC proxy
fr: proxy VNC

source: Virtual Hard Disk (VHD)
fr: Disque dur virtuel (VHD)

source: Volume API
fr: API de volume

source: Xen API
fr: API Xen

source: Xen Storage Manager Volume Driver
fr: Pilote du Gestionnaire de Stockage Xen

source: XenServer hypervisor
fr: hyperviseur XenServer

source: absolute limit
fr: limite absolue

source: access control list
fr: liste du contrôle d'accès

source: access control list (ACL)
fr: Liste contrôle d'accès (ACL)

source: access key
fr: clef d’accès

source: account
fr: compte
