Repository: openstack/openstack-manuals
Catalog: doc/ha-guide/source/locale/*/LC_MESSAGES/ha-guide.po
Languages: ja, tr_tr

source: Memcached uses a timeout value, which should always be set to a value that is higher than the heartbeat value set for Telemetry.
ja: Memcached は、タイムアウト値を使用します。これは、Telemetry 向けに設定されたハートビート値よりも大きい値を常に設定されるべきです。
tr_tr: Memcached her zaman Telemetri için ayarlanan kalp atışı değerinden yüksek olması gereken bir zaman aşımı değeri kullanır.

source: Memory
ja: メモリー
tr_tr: Bellek

source: Memory caching is managed by `oslo.cache <http://specs.openstack.org/openstack/oslo-specs/specs/kilo/oslo-cache-using-dogpile.html>`_ so the way to use multiple memcached servers is the same for all projects.
ja: メモリーキャッシュは `oslo.cache <http://specs.openstack.org/openstack/oslo-specs/specs/kilo/oslo-cache-using-dogpile.html>`_ により管理されています。そのため、複数の memcached サーバーを使用する方法が、すべてのプロジェクトで同じになります。

source: Minimum number of network nodes to use for the HA router. A new router can be created only if this number of network nodes are available.
ja: HA ルーターのために使用するネットワークノードの最小数。この数だけのネットワークノードを利用できる場合のみ、新規ルーターを作成できます。
tr_tr: HA yönlendirici için kullanılacak asgari ağ düğümü sayısı. Yeni bir yönlendirici ancak bu sayıda ağ düğümü kullanılabilirse oluşturulabilir.

source: Mirrored queues in RabbitMQ improve the availability of service since it is resilient to failures.
ja: RabbitMQ のキューミラーは、障害耐性があるので、サービスの可用性を改善します。
tr_tr: RabbitMQ'de yansılı kuyruklar arızalara dayanıklı olduklarından servisin kullanılabilirliğini artırır.

source: More information is available in the RabbitMQ documentation:
ja: 詳細は RabbitMQ のドキュメントにあります。
tr_tr: RabbitMQ belgelendirmesinde daha fazla bilgi bulunur:

source: Most OpenStack services can use memcached to store ephemeral data such as tokens. Although memcached does not support typical forms of redundancy such as clustering, OpenStack services can use almost any number of instances by configuring multiple hostnames or IP addresses. The memcached client implements hashing to balance objects among the instances. Failure of an instance only impacts a percentage of the objects and the client automatically removes it from the list of instances.
ja: ほとんどの OpenStack サービスは、トークンなどの一時データを保存するために memcached を使用できます。memcached はクラスターなどの一般的な形式の冗長化をサポートしませんが、OpenStack サービスは複数のホスト名や IP アドレスを設定することにより、ほぼ任意の数のインスタンスを使用できます。Memcached クライアントは、インスタンス間でオブジェクトを分散するハッシュ機能を持ちます。インスタンスの障害は、オブジェクトの使用率のみに影響します。クライアントは、インスタンスの一覧から自動的に削除されます。

source: Most distributions ship an example configuration file (:file:`corosync.conf.example`) as part of the documentation bundled with the Corosync package. An example Corosync configuration file is shown below:
ja: ほとんどのディストリビューションは、Corosync パッケージに同梱されているドキュメントの一部として、サンプル設定ファイル (:file:`corosync.conf.example`) を同梱しています。
tr_tr: Çoğu dağıtım Corosync paketiyle beraber bir yapılandırma dosyası (:file:`corosync.conf.example`) dağıtır. Örnek bir Corosync yapılandırma dosyası aşağıda gösterilmiştir:

source: Most high availability systems fail in the event of multiple independent (non-consequential) failures. In this case, most implementations favor protecting data over maintaining availability.
ja: 多くの高可用性システムは、複数の独立した (不連続な) 障害が発生すると停止します。この場合、多くのシステムは可用性の維持よりデータを保護することを優先します。
tr_tr: Çoğu yüksek kullanılabilir sistem birden fazla bağımsız arıza durumunda başarısız olur (takip etmeyen). Bu durumda çoğu uygulama kullanılabilirliği sağlamaktan ziyade veriyi korumayı ön plana alır.

source: Most high availability systems guarantee protection against system downtime and data loss only in the event of a single failure. However, they are also expected to protect against cascading failures, where a single failure deteriorates into a series of consequential failures. Many service providers guarantee :term:`Service Level Agreement (SLA)` including uptime percentage of computing service, which is calculated based on the available time and system downtime excluding planned outage time.
ja: 多くの高可用性システムは、単一障害事象のみにおいて、システム停止時間やデータ損失に対する保護を保証します。しかしながら、単一障害が一連の障害を悪化させていく、段階的な障害に対しても保護されることが期待されます。多くのサービスプロバイダーは、コンピューティングサービスの稼働率などの :term:`Service Level Agreement (SLA)` を保証します。それは、計画停止を除くシステム停止時間と稼働時間に基づいて計算されます。

source: Most of this guide concerns the control plane of high availability: ensuring that services continue to run even if a component fails. Ensuring that data is not lost is the data plane component of high availability; this is discussed here.
ja: このガイドのほとんどは、コントロールプレーンの高可用性を取り扱います。コンポーネントが故障した場合でも、そのサービスが動作しつづけることを保証します。データ失われないことを保証することは、データプレーンのコンポーネントの高可用性です。それは、ここで議論します。

source: Multicast groups (``mcastaddr``) must not be reused across cluster boundaries. In other words, no two distinct clusters should ever use the same multicast group. Be sure to select multicast addresses compliant with `RFC 2365, "Administratively Scoped IP Multicast" <http://www.ietf.org/rfc/rfc2365.txt>`_.
ja: マルチキャストグループ (``mcastaddr``) は、クラスターの境界を越えて再利用できません。別の言い方をすると、2 つの独立したクラスターは、同じマルチキャストグループを使用すべきではありません。選択したマルチキャストアドレス をきちんと`RFC 2365, "Administratively Scoped IP Multicast" <http://www.ietf.org/rfc/rfc2365.txt>`_ に準拠させてください。

source: MySQL databases, including MariaDB and Percona XtraDB, manage their configurations using a ``my.cnf`` file, which is typically located in the ``/etc`` directory. Configuration options available in these databases are also available in Galera Cluster, with some restrictions and several additions.
ja: MariaDB や Percona XtraDB を含む、MySQL は ``my.cnf`` ファイルを使用して設定を管理します。一般的に ``/etc`` ディレクトリーにあります。これらのデータベースにおいて利用できる設定オプションは、Galera Cluster においても利用できます。いくつかの制約や追加があります。
tr_tr: MariaDB ve Percona XtraDB dahil MySQL veritabanları yapılandırmalarını genellikle ``/etc`` dizininde bulunan bir ``my.cnf`` dosyasında yönetirler. Bu veritabanlarında bulunan yapılandırma seçenekleri bazı kısıtlamalar ve bir çok ek ile Galera Kümesinde de kullanılabilir.

source: Network components
ja: ネットワークコンポーネント

source: Network components, such as switches and routers
ja: スイッチやルーターなどのネットワークの構成要素
tr_tr: Ağ bileşenleri, örneğin anahtarlar ve yönlendiriciler

source: Neutron L2 agent. Note that the L2 agent cannot be distributed and highly available. Instead, it must be installed on each data forwarding node to control the virtual network drivers such as Open vSwitch or Linux Bridge. One L2 agent runs per node and controls its virtual interfaces.
ja: Neutron L2 エージェント。L2 エージェントは分散させることはできず、高可用構成にはできません。その代わり、 L2 エージェントを各データ転送ノードにインストールして、 Open vSwitch や Linux ブリッジなどの仮想ネットワークドライバーを制御します。ノードあたり 1 つの L2 エージェントが動作し、そのノードの仮想インターフェースの制御を行います。

source: Neutron agents shuld be described for active/active; deprecate single agent's instances case.
ja: Neutron エージェントは、アクティブ/アクティブ向けにすべきです。シングルエージェントのインスタンスは推奨されません。

source: Neutron-lbaas-agent as a single point of failure
ja: 単一障害点としての neutron-lbaas-agent

source: No firewalls between the hosts;
ja: ホスト間にファイアウォールがないこと。

source: No high availability, when the service can only work in active/passive mode.
ja: このサービスがアクティブ/パッシブモードのみで動作する場合、高可用性はありません。

source: No native feature is available to make this service highly available. At this time, the Active/Passive solution exists to run the neutron metadata agent in failover mode with Pacemaker.
ja: このサービスを高可用化するための組み込み機能はありません。現状、アクティブ/パッシブのソリューションが存在し、Pacemaker を用いてフェイルオーバーモードで neutron メタデータエージェントを実行します。

source: Node type
ja: ノード種別
tr_tr: Düğüm türü

source: Note that the particular key value in this command varies depending on which database software repository you want to use.
ja: このコマンドの具体的なキーは、使用したいデータベースのソフトウェアリポジトリーにより異なります。

source: Note the following about the recommended interface configuration:
ja: インターフェースの推奨設定に関する注意事項がいくつかあります。
tr_tr: Önerilen arayüz yapılandırmasıyla ilgili şunları not edin:

source: Note the following:
ja: 以下に注意してください。
tr_tr: Şunları unutmayın:

source: Notes from planning outline:
ja: 計画の概要からのメモ:

source: Occurs when a user-facing service is unavailable beyond a specified maximum amount of time.
ja: 指定された最大時間を超えて、ユーザーサービスが利用不可能になること。

source: Of these options, the second one is highly recommended. Although Galera supports active/active configurations, we recommend active/passive (enforced by the load balancer) in order to avoid lock contention.
ja: これらの選択肢のうち、2 番目が強く推奨されます。Galera はアクティブ/アクティブ設定をサポートしますが、ロック競合を避けるために、(ロードバランサーにより強制される) アクティブ/パッシブを推奨します。

source: On CentOS, RHEL, openSUSE, and SLES:
ja: CentOS、RHEL、openSUSE、SLES の場合:
tr_tr: CentOS, RHEL, openSUSE ve SLES üzerinde:

source: On RHEL-based systems, you should create resources for cinder's systemd agents and create constraints to enforce startup/shutdown ordering:
ja: RHEL 系のシステムでは、cinder の systemd エージェント向けリソースを作成して、起動と停止の順番を強制する制約を作成すべきです。

source: On Ubuntu, it is configured by default.
ja: Ubuntu の場合、デフォルトで設定されています。

source: On ``3306``, Galera Cluster uses TCP for database client connections and State Snapshot Transfers methods that require the client, (that is, ``mysqldump``).
ja: ``3306`` では、Galera Cluster がデータベースクライアント接続のために TCP を使用します。また、クライアント 、つまり ``mysqldump`` を必要とする State Snapshot Transfers メソッドを使用します。
tr_tr: ``3306`` üzerinde, Galera Kümesi veritabanı istemci bağlantıları ve istemciyi gerektiren Durum Anlık Görüntü Aktarımları için TCP kullanır, (yani ``mysqldump``).

source: On ``4444`` Galera Cluster uses TCP for all other State Snapshot Transfer methods.
ja: ``4444`` では、Galera Cluster が他のすべての State Snapshot Transfer メソッドのために TCP を使用します。

source: On ``4567`` Galera Cluster uses TCP for replication traffic. Multicast replication uses both TCP and UDP on this port.
ja: ``4567`` では、Galera Cluster が複製通信のために TCP を使用します。マルチキャストレプリケーションは、このポートで TCP と UDP を使用します。

source: On ``4568`` Galera Cluster uses TCP for Incremental State Transfers.
ja: ``4568`` では、Galera Cluster が Incremental State Transfers のために TCP を使用します。

source: On a RHEL-based system, it should look something like:
ja: RHEL 系システムの場合、次のようになるでしょう。

source: On any host that is meant to be part of a Pacemaker cluster, you must first establish cluster communications through the Corosync messaging layer. This involves installing the following packages (and their dependencies, which your package manager usually installs automatically):
ja: Pacemaker クラスターに参加させる各ホストで、まず Corosync メッセージレイヤーでクラスター通信を行う必要があります。これには、以下のパッケージをインストールする必要があります (依存パッケージも含みます。依存パッケージは通常パッケージマネージャーにより自動的にインストールされます)。

source: On each target node, verify the correct owner, group, and permissions of the file :file:`erlang.cookie`.
ja: 各ターゲットノードにおいて、 :file:`erlang.cookie` の所有者、所有グループ、パーミッションが正しいことを確認します。

source: On the infrastructure layer, the SLA is the time for which RabbitMQ cluster reassembles. Several cases are possible. The Mnesia keeper node is the master of the corresponding Pacemaker resource for RabbitMQ; when it fails, the result is a full AMQP cluster downtime interval. Normally, its SLA is no more than several minutes. Failure of another node that is a slave of the corresponding Pacemaker resource for RabbitMQ results in no AMQP cluster downtime at all.
ja: インフラ層では、SLA は RabbitMQ クラスターが再構成されるまでの時間です。いくつかの場合では実現できます。Mnesia keeper ノードは、対応する RabbitMQ 用 Pacemaker リソースのマスターです。停止したとき、結果として AMQP クラスターの停止時間になります。通常、その SLA は、数分間より長くなることはありません。対応する RabbitMQ 用 Pacemaker リソースのスレーブになっている、他のノードの停止により AMQP クラスターが停止することはありません。

source: Once completed, commit your configuration changes by entering :command:`commit` from the :command:`crm configure` menu. Pacemaker then starts the Block Storage API service and its dependent resources on one of your nodes.
ja: これらの手順の完了後、:command:`crm configure` メニューから :command:`commit` と入力し、設定の変更をコミットします。Pacemaker は Block Storage API サービスおよび依存するリソースを同じノードに起動します。
tr_tr: Tamamlandığında, yapılandırma değişikliklerinizi :command:`crm configure` menüsünden :command:`commit` girerek kaydedin. Pacemaker ardından Blok Depolama API servisini ve bağımlı kaynaklarını düğümlerinizden birinde başlatır.

source: Once completed, commit your configuration changes by entering :command:`commit` from the :command:`crm configure` menu. Pacemaker then starts the Shared File Systems API service and its dependent resources on one of your nodes.
ja: これらの手順の完了後、:command:`crm configure` メニューから :command:`commit` と入力し、設定の変更をコミットします。Pacemaker は Shared File Systems API サービスおよび依存するリソースを同じノードに起動します。

source: Once configured (see example file below), add HAProxy to the cluster and ensure the VIPs can only run on machines where HAProxy is active:
ja: 設定すると (以下のサンプルファイル参照)、HAProxy をクラスターに追加して、仮想 IP が HAProxy の動作しているマシンにおいてのみ動作できることを確認してください。

source: Once created, the :file:`corosync.conf` file (and the :file:`authkey` file if the secauth option is enabled) must be synchronized across all cluster nodes.
ja: 作成後、 :file:`corosync.conf` ファイル (および、secauth オプションが有効化されている場合、 :file:`authkey`ファイル) が、すべてのクラスターノードにわたり同期されている必要があります。

source: Once the database server starts, check the cluster status using the ``wsrep_cluster_size`` status variable. From the database client, run the following command:
ja: データベースサーバーが起動すると、``wsrep_cluster_size`` 状態変数を使用して、クラスター状態を確認します。データベースクライアントから、以下のコマンドを実行します。
tr_tr: Veritabanı başladıktan sonra ``wsrep_cluster_size`` durum değişkenini kullanarak küme durumunu kontrol edin. Veritabanı istemcisinden şu komutları çalıştırın:

source: One physical server can support multiple nodes, each of which supports almost any number of network interfaces.
ja: 1 台の物理サーバーで複数のノードを構築できます。各ノードは複数のネットワークインターフェースを持てます。
tr_tr: Bir fiziksel sunucu her biri istenen sayıda ağ arayüzüne sahip birden çok düğümü destekleyebilir.

source: One uses a cluster manager such as Pacemaker or Veritas to co-ordinate the actions of the various services across a set of machines. Since we are focused on FOSS, we will refer to this as the Pacemaker architecture.
ja: あるものは、Pacemaker や Veritas などのクラスターマネージャーを使用して、複数のマシンにまたがるさまざまなサービスの動作を調整します。私たちは FOSS に注力しているため、Pacemaker のアーキテクチャーを参照します。

source: OpenStack APIs, these are HTTP(s) stateless services written in python, easy to duplicate and mostly easy to load balance.
ja: OpenStack API。これらは HTTP のステートレスサービスです。Python で書かれていて、簡単に冗長化でき、かなり簡単に負荷分散できます。

source: OpenStack High Availability Guide
ja: OpenStack 高可用性ガイド
tr_tr: OpenStack Yüksek Kullanılırlık Kılavuzu

source: OpenStack Identity (keystone) is the Identity service in OpenStack that is used by many services. You should be familiar with `OpenStack identity concepts <http://docs.openstack.org/liberty/install-guide-ubuntu/common/get_started_identity.html>`_ before proceeding.
ja: OpenStack Identity (keystone) は、多くのサービスにより使用される OpenStack の Identity サービスです。続行する前に `OpenStack Identity の概念 <http://docs.openstack.org/liberty/install-guide-ubuntu/common/get_started_identity.html>`_ に慣れておくべきです。

source: OpenStack currently meets such availability requirements for its own infrastructure services, meaning that an uptime of 99.99% is feasible for the OpenStack infrastructure proper. However, OpenStack does not guarantee 99.99% availability for individual guest instances.
ja: OpenStack 自体のインフラストラクチャーは、現在その可用性要件を満たせます。つまり、適切な OpenStack インフラストラクチャーの 99.99% の稼働率が実現可能です。しかしながら、OpenStack は個々のゲストインスタンスの可用性 99.99% を保証できません。
tr_tr: OpenStack şu anda bu kullanılırlık gereksinimlerini kendi alt yapı servislerinde sağlayabiliyor, yani düzgün bir OpenStack alt yapısında 99.99% çalışma zamanı elde edilebilir. Ancak OpenStack bağımsız misafir sunucular için 99.99% kullanılırlık garanti etmez.

source: OpenStack is a set of multiple services exposed to the end users as HTTP(s) APIs. Additionally, for own internal usage OpenStack requires SQL database server and AMQP broker. The physical servers, where all the components are running are often called controllers. This modular OpenStack architecture allows to duplicate all the components and run them on different controllers. By making all the components redundant it is possible to make OpenStack highly-available.
ja: OpenStack は、HTTP(s) API としてエンドユーザーに公開される、複数のサービス群です。さらに、その内部利用のために、OpenStack は SQL データベースサーバーと AMQP ブローカーを必要とします。すべてのコンポーネントが動作している、物理サーバーはよくコントローラーと呼ばれます。このモジュール型の OpenStack アーキテクチャーにより、すべてのコンポーネントを複製して、それらを別々のコントローラーで実行できます。すべてのコンポーネントを冗長にすることにより、OpenStack の高可用性を実現できます。

source: OpenStack network nodes
ja: OpenStack ネットワークノード

source: OpenStack network nodes contain:
ja: OpenStack ネットワークノードでは、以下のものが動作します。
tr_tr: OpenStack ağ düğümü şunu içerir:

source: OpenStack services are configured with the list of these IP addresses so they can select one of the addresses from those available.
ja: OpenStack サービスは、利用できるものから 1 つを選択できるよう、これらの IP アドレスの一覧を用いて設定されます。
tr_tr: OpenStack servisleri bu IP adreslerinin listesiyle yapılandırılır yani bu kullanılabilir olanlardan bir adresi seçebilirler.

source: OpenStack supports a single-controller high availability mode that is managed by the services that manage highly available environments but is not actually highly available because no redundant controllers are configured to use for failover. This environment can be used for study and demonstration but is not appropriate for a production environment.
ja: OpenStack は、シングルコントローラーの高可用性モードをサポートします。これは、高可用性環境を管理するソフトウェアにより、サービスが管理されますが、コントローラーがフェイルオーバーのために冗長化設定されていないため、実際には高可用性ではありません。この環境は、学習やデモのために使用できますが、本番環境としては適していません。
tr_tr: OpenStack arıza durumunda yer değiştirme için yapılandırılmış yedekleme denetleyicileri olmadığı için aslında yüksek kullanılabilir olmayan yüksek kullanılırlık ortamlarını yönetmek için tek-denetleyicili yüksek kullanılabilirlik kipini destekler. Bu ortam çalışma ve gösterim amaçlı kullanılabilir ama üretim ortamları için uygun değildir.

source: Overview of high availability storage
ja: 高可用性ストレージの概要

source: Overview of highly-available compute nodes
ja: 高可用性コンピュートノードの概要

source: Overview of highly-available controllers
ja: 高可用性コントローラーの概要

source: Pacemaker cluster stack
ja: Pacemaker クラスタースタック
tr_tr: Pacemaker küme yığını

source: Pacemaker does not inherently (need or want to) understand the applications it manages. Instead, it relies on resource agents (RAs), scripts that encapsulate the knowledge of how to start, stop, and check the health of each application managed by the cluster.
ja: Pacemaker は、管理するアプリケーションを本質的に理解してません (必要ありません)。代わりに、リソースエージェント (RA) に依存します。これは、クラスターにより管理される各アプリケーションの起動、停止、ヘルスチェック方法に関する知識を隠蔽するスクリプトです。

source: Pacemaker relies on the `Corosync <http://corosync.github.io/corosync/>`_ messaging layer for reliable cluster communications. Corosync implements the Totem single-ring ordering and membership protocol. It also provides UDP and InfiniBand based messaging, quorum, and cluster membership to Pacemaker.
ja: Pacemaker は、高信頼なクラスター通信のために `Corosync <http://corosync.github.io/corosync/>`_ メッセージング層に依存します。Corosync は、Totem シングルリングによる順番制御とメンバーシッププロトコルを実装します。また、UDP や InfiniBand ベースのメッセージング、クォーラム、クラスターメンバーシップを Pacemaker に提供します。

source: Pacemaker ships with a large set of OCF agents (such as those managing MySQL databases, virtual IP addresses, and RabbitMQ), but can also use any agents already installed on your system and can be extended with your own (see the `developer guide <http://www.linux-ha.org/doc/dev-guides/ra-dev-guide.html>`_).
ja: Pacemaker は、(MySQL データベース、仮想 IP アドレス、RabbitMQ などの) OCF エージェントをたくさん同梱していますが、お使いのシステムにインストールした任意のエージェントも使用できます。また、自身で拡張することもできます (`developer guide <http://www.linux-ha.org/doc/dev-guides/ra-dev-guide.html>`_ 参照)。
tr_tr: Pacemaker büyük bir OCF aracı kümesiyle gelir (MySQL veritabanlarını, sanal IP adreslerini ve RabbitMQ'yi yönetenler gibi), ama sisteminizde kurulu herhangi bir aracıyı da kullanabilir ve kendi aracılarınızla genişletilebilir (bknz `geliştirici kılavuzu <http://www.linux-ha.org/doc/dev-guides/ra-dev-guide.html>`_).

source: Pacemaker uses an event-driven approach to cluster state processing. The ``cluster-recheck-interval`` parameter (which defaults to 15 minutes) defines the interval at which certain Pacemaker actions occur. It is usually prudent to reduce this to a shorter interval, such as 5 or 3 minutes.
ja: Pacemaker は、クラスターの状態を処理するために、イベントドリブンのアプローチを使用します。 ``cluster-recheck-interval`` パラメーター (デフォルトは 15 分) が、ある Pacemaker のアクションが発生する間隔を定義します。通常、5 分や 3 分など、より短い間隔に減らすことは慎重になるべきです。
tr_tr: Pacemaker küme durumu işlemede olay güdümlü bir yaklaşım kullanır. ``cluster-recheck-interval`` (öntanımlı olarak 15 dakikadır) parametresi belli Pacemaker eylemlerinin oluş aralığını tanımlar. Bunu 5 veya 3 dakikalık daha kısa bir aralığa kısaltmak mantıklıdır.

source: Packages in the Galera Cluster Debian repository are now available for installation on your system.
ja: これで Galera Cluster Debian リポジトリーにあるパッケージがお使いのシステムで利用できます。

source: Packages in the Galera Cluster Red Hat repository are not available for installation on your system.
ja: これで Galera Cluster Red Hat リポジトリーにあるパッケージがお使いのシステムで利用できます。

source: Packages in the Galera Cluster SUSE repository are now available for installation.
ja: これで Galera Cluster SUSE リポジトリーにあるパッケージがお使いのシステムで利用できます。

source: Parameter
ja: パラメーター
tr_tr: Parametre

source: Persistent block storage can survive instance termination and can also be moved across instances like any external storage device. Cinder also has volume snapshots capability for backing up the volumes.
ja: 永続ブロックストレージは、インスタンス終了後に残存して、任意の外部ストレージデバイスのようにインスタンスを越えて移動できます。Cinder は、ボリュームをバックアップするために、ボリュームスナップショット機能も持ちます。
tr_tr: Kalıcı blok depolama sunucu sonlandırmasından kurtulabilir ve ayrıca herhangi bir harici depolama sürücüsü gibi sunucular arasında taşınabilir. Cinder ayrıca birimleri yedeklemek için birim anlık görüntü yeteneğine sahiptir.

source: Persistent storage exists outside all instances. Two types of persistent storage are provided:
ja: 永続ストレージは、すべてのインスタンスの外部にあります。2 種類の永続ストレージが提供されます。
tr_tr: Kalıcı depolama tüm sunucuların dışında mevcuttur. İki tür kalıcı depolama sağlanmıştır:

source: Possible options are:
ja: 利用できるオプションは次のとおりです。
tr_tr: Muhtemel seçenekler:

source: Preventing single points of failure can depend on whether or not a service is stateless.
ja: 単一障害点をなくせるかは、サービスがステートレスであるかに依存する場合があります。

source: Processor
ja: プロセッサー

source: Production servers should run (at least) three RabbitMQ servers; for testing and demonstration purposes, it is possible to run only two servers. In this section, we configure two nodes, called ``rabbit1`` and ``rabbit2``. To build a broker, we need to ensure that all nodes have the same Erlang cookie file.
ja: 本番サーバーは、(少なくとも) 3 つの RabbitMQ サーバーを実行すべきです。テストやデモの目的の場合、サーバーを 2 つだけ実行することもできます。このセクションでは、``rabbit1`` と ``rabbit2`` という 2 つのノードを設定します。ブローカーを構築するために、すべてのノードがきちんと同じ Erlang クッキーファイルを持つ必要があります。

source: Proxy server
ja: プロキシーサーバー
tr_tr: Vekil sunucu

source: Query the quorum status
ja: クォーラム状態を問い合わせます
tr_tr: Yetersayı durumunu sorgula

source: RAID drives
ja: RAID ドライブ
tr_tr: RAID sürücüler

source: RabbitMQ HA cluster host:port pairs:
ja: RabbitMQ HA クラスターの「ホスト:ポート」のペア:

source: RabbitMQ nodes fail over both on the application and the infrastructure layers.
ja: RabbitMQ ノードは、アプリケーションとインフラ層の両方においてフェイルオーバーします。

source: Rather than configuring neutron here, we should simply mention physical network HA methods such as bonding and additional node/network requirements for L3HA and DVR for planning purposes.
ja: ここで neutron を設定する代わりに、単にボンディングや物理的なネットワークの HA について言及します。また、計画するために L3HA と DVR の追加ノードとネットワーク要件について言及します。

source: Receive notifications of quorum state changes
ja: クォーラムの状態変更の通知を受け付けます
tr_tr: Yetersayı durum değişikliklerinde bildirileri al

source: Recommended for testing.
ja: テスト向けの推奨。
tr_tr: Deneme amaçlı önerilir.

source: Recommended solution by the Tooz project.
ja: Tooz プロジェクトによる推奨ソリューション。
tr_tr: Tooz projesi tarafından önerilen çözüm.

source: Redundancy and failover
ja: 冗長性とフェールオーバー
tr_tr: Yedeklilik ve arıza ele alma

source: Refresh ``zypper``:
ja: ``zypper`` を最新化します。

source: Regardless of which flavor you choose, it is recommended that the clusters contain at least three nodes so that we can take advantage of `quorum <quorum_>`_.
ja: 選択したフレーバーに関わらず、`quorum <quorum_>`_ の利点を得るために、少なくとも 3 ノードを持つクラスターを推奨します。

source: Remote backup facilities
ja: リモートバックアップ機能
