Repository: openstack/openstack-manuals
Catalog: doc/ha-guide/source/locale/*/LC_MESSAGES/ha-guide.po
Languages: ja, tr_tr

source: OpenStack is a set of services exposed to the end users as HTTP(s) APIs. Additionally, for your own internal usage, OpenStack requires an SQL database server and AMQP broker. The physical servers, where all the components are running, are called controllers. This modular OpenStack architecture allows you to duplicate all the components and run them on different controllers. By making all the components redundant, it is possible to make OpenStack highly available.
tr_tr: OpenStack son kullanıcılara HTTP(s) API'leri olarak ortaya çıkan servisler kümesidir. Ek olarak, dahili kullanımınız için, OpenStack bir SQL veritabanı sunucusu ve AMQP aracısı gerektirir. Tüm bileşenlerin çalıştığı fiziksel sunuculara denetleyiciler denir. Bu modüler OpenStack mimarisi tüm bileşnleri çoğaltabilmenize farklı denetleyiciler üzerinde çalıştırabilmenize izin verir. Tüm bileşenleri yedekli yaparak, OpenStack'i yüksek kullanılır hale getirmek mümkündür.

source: Overview of highly available controllers
tr_tr: Yüksek kullanılabilir denetleyicilerin genel görünümü

source: Pacemaker does not inherently understand the applications it manages. Instead, it relies on resource agents (RAs) that are scripts that encapsulate the knowledge of how to start, stop, and check the health of each application managed by the cluster.
tr_tr: Pacemaker yönettiği uygulamaları doğuştan anlamaz. Bunun yerine küme tarafından yönetilen her bir uygulamanın başlatma, durdurma ve sağlığını kontrol etme bilgisini içeren betiklerden oluşan kaynak aracılarına (RA'lar) güvenir.

source: Pacemaker now starts the OpenStack Identity service and its dependent resources on all of your nodes.
tr_tr: Pacemaker artık OpenStack Kimlik servisini ve tüm bağımlı kaynakları tüm düğümlerinizde başlatır.

source: Pacemaker now starts the Shared File Systems API service and its dependent resources on one of your nodes.
tr_tr: Pacemaker şimdi Paylaşımlı Dosya Sistemleri API servisini ve bağımlı olduğu kaynakları düğümlerinizden birinde başlatır.

source: Pacemaker relies on the `Corosync <https://corosync.github.io/corosync/>`_ messaging layer for reliable cluster communications. Corosync implements the Totem single-ring ordering and membership protocol. It also provides UDP and InfiniBand based messaging, quorum, and cluster membership to Pacemaker.
tr_tr: Pacemaker güvenilir küme iletişimi için `Corosync <https://corosync.github.io/corosync/>`_ mesajlaşma katmanına güvenir. Corosync Totem tek-halka sıralama ve abonelik iletişim kuralını uygular. Ayrıca Pacemaker'e UDP ve InfiniBand tabanlı mesajlaşma, yetersayı ve küme üyeliği sağlar.

source: Pacemaker then starts the OpenStack Image API service and its dependent resources on one of your nodes.
tr_tr: Pacemaker ardından OpenStack İmaj API servisini ve bağımlı olduğu kaynakları düğümlerinizden birinde başlatır.

source: Prerequisites
tr_tr: Giriş koşulları

source: Processor Cores
tr_tr: İşlemci Çekirdekleri

source: Production servers should run (at least) three RabbitMQ servers for testing and demonstration purposes, however it is possible to run only two servers. In this section, we configure two nodes, called ``rabbit1`` and ``rabbit2``. To build a broker, ensure that all nodes have the same Erlang cookie file.
tr_tr: Üretim sunucuları deneme ve gösterim amaçlı (en az) üç RabbitMQ sunucusu çalıştırmalıdır, ancak iki sunucu çalıştırmak da mümkündür. Bu kısımda, ``rabbit1`` ve ``rabbit2`` isimli iki düğüm yapılandırıyoruz. Bir aracı inşa etmek için tüm düğümlerin aynı Erlang çerez dosyasına sahip olduğundan emin olun.

source: Provider networks: See the *Overview -> Networking Option 1: Provider networks* section of the `Install Tutorials and Guides <https://docs.openstack.org/ocata/install>`_ depending on your distribution.
tr_tr: Sağlayıcı ağlar: Dağıtımınıza göre `Kurulum Öğreticileri ve Kılavuzlarındaki <https://docs.openstack.org/ocata/install>`_ *Genel Görünüm -> Ağ Seçeneği 1: Sağlayıcı ağlar* kısmına göz atın.

source: Quorum becomes important when a failure causes the cluster to split in two or more partitions. In this situation, you want the majority members of the system to ensure the minority are truly dead (through fencing) and continue to host resources. For a two-node cluster, no side has the majority and you can end up in a situation where both sides fence each other, or both sides are running the same services. This can lead to data corruption.
tr_tr: Yetersayı bir arızanın kümenin iki ya da daha fazla parçaya bölünmesine sebep olduğu arıza durumlarında önemli hale gelir. Bu durumda, sistem üyelerinin çoğunluğunun azınlığın gerçekten ölü (parmaklıklarla) olduğundan emin olarak kaynakları sunmayı devam ettirmesini istersiniz. İki düğümlü bir kümede, hiçbir taraf çoğunluğu oluşturmaz, iki tarafın da birbirini yalıttığı ya da iki tarafın da aynı servisleri çalıştırdığı bir durumla karşılaşabilirsiniz. Bu veri bozukluğuna yol açabilir.

source: RabbitMQ HA cluster Transport URL using ``[user:pass@]host:port`` format:
tr_tr: ``[kullanıcı:parola@]sunucu:bağlantınoktası`` biçimini kullanan RabbitMQ HA küme Aktarım URL'si:

source: RabbitMQ nodes fail over on the application and the infrastructure layers.
tr_tr: RabbitMQ düğümleri uygulama ve altyapı katmanlarında arıza giderme yapar.

source: Regardless of which flavor you choose, we recommend that clusters contain at least three nodes so that you can take advantage of `quorum <quorum_>`_.
tr_tr: Hangi niteliği seçtiğinizden bağımsız olarak, `yetersayıdan <quorum_>`_ faydalanabilmek için kümelerin en az üç düğüm içermesini öneriyoruz.

source: Replace ``RABBIT_USER`` with RabbitMQ username and ``RABBIT_PASS`` with password for respective RabbitMQ host. For more information, see `oslo messaging transport <https://docs.openstack.org/developer/oslo.messaging/transport.html>`_.
tr_tr: ``RABBIT_USER`` anahtarını RabbitMQ kullanıcı adıyla ve ``RABBIT_PASS`` anahtarını ilgili RabbitMQ sunucu parolasıyla değiştirin. Daha fazla bilgi için `oslo mesajlaşma aktarımına <https://docs.openstack.org/developer/oslo.messaging/transport.html>`_ göz atın.

source: Restart the HAProxy service.
tr_tr: HAProxy servisini yeniden başlatın.

source: Restart the host or, to make changes work immediately, invoke:
tr_tr: Değişikliklerin hemen etkin olması için sunucuyu yeniden başlatın, ya da şunu çalıştırın:

source: Retry connecting with RabbitMQ:
tr_tr: RabbitMQ ile bağlanmayı yeniden dene:

source: Run Networking DHCP agent
tr_tr: Ağ DHCP aracısını çalıştır

source: Run Networking L3 agent
tr_tr: Ağ L3 aracısı çalıştır

source: Run the following commands to download the OpenStack Identity resource to Pacemaker:
tr_tr: OpenStack Kimlik kaynağını Pacemaker'e indirmek için şu komutları çalıştırın:

source: SELinux and AppArmor set to permit access to ``mysqld``
tr_tr: SELinux ve AppArmor ``mysqld``ye izin verecek şekilde ayarlanmış

source: SUSE Enterprise Linux and SUSE-based distributions, such as openSUSE, use a set of OCF agents for controlling OpenStack services.
tr_tr: SUSE Kurumsal Linux ve SUSE tabanlı dağıtımlar, örneğin openSUSE, OpenStack servislerini kontrol etmek için bir takım OCF aracıları kullanır.

source: Security-Enhanced Linux is a kernel module for improving security on Linux operating systems. It is commonly enabled and configured by default on Red Hat-based distributions. In the context of Galera Cluster, systems with SELinux may block the database service, keep it from starting, or prevent it from establishing network connections with the cluster.
tr_tr: Gelişmiş-Güvenlikli Linux Linux işletim sistemlerinde güvenliği artıran bir çekirdek modülüdür. Genellikle etkindir ve Red Hat tabanlı dağıtımlarda öntanımlı olarak yapılandırılır. Galera Kümesi kapsamında, SELinux'a sahip sistemler veritabanı servisini engelleyerek başlamasını ya da küme ile ağ bağlantısı kurmasını önleyebilirler.

source: Segregated
tr_tr: Ayrılmış

source: Self-service networks: See the *Overview -> Networking Option 2: Self-service networks* section of the `Install Tutorials and Guides <https://docs.openstack.org/ocata/install>`_ depending on your distribution.
tr_tr: Kendine-servis ağlar: Dağıtımınıza göre `Kurulum Öğreticileri ve Kılavuzlarındaki <https://docs.openstack.org/ocata/install>`_ *Genel Görünüm -> Ağ Seçeneği 2: Kendine-servis ağlar* kısmına göz atın.

source: Services like RabbitMQ and Galera have complicated boot-up sequences that require co-ordination, and often serialization, of startup operations across all machines in the cluster. This is especially true after a site-wide failure or shutdown where you must first determine the last machine to be active.
tr_tr: RabbitMQ ve Galera gibi servislerin genellikle kümedeki tüm makineler arasında başlangıç koordinasyonu ve yaygın olarak serileştirme gerektiren karmaşık önyükleme düzenleri bulunur. Bu özellikle ilk önce etkin olacak son makineye karar vermenizi gerektiren site genelinde bir arıza ya da kapatma durumunda doğrudur.

source: Set a password for hacluster user on each host:
tr_tr: Hacluster kullanıcısı için her bir sunucuda parola ayarlayın:

source: Set up the cluster with pcs
tr_tr: Kümeyi pcs ile ayarla

source: Setting ``last_man_standing`` to 1 enables the Last Man Standing (LMS) feature. By default, it is disabled (set to 0). If a cluster is on the quorum edge (``expected_votes:`` set to 7; ``online nodes:`` set to 4) for longer than the time specified for the ``last_man_standing_window`` parameter, the cluster can recalculate quorum and continue operating even if the next node will be lost. This logic is repeated until the number of online nodes in the cluster reaches 2. In order to allow the cluster to step down from 2 members to only 1, the ``auto_tie_breaker`` parameter needs to be set. We do not recommended this for production environments.
tr_tr: ``last_man_standing`` anahtarını 1 olarak ayarlamak Ayakta Kalan Son Adam (LMS) özelliğini etkinleştirir. Öntanımlı olarak kapalıdır (0 olarak ayarlıdır). Bir küme ``last_man_standing_window`` parametresinden daha uzun süre yetersayı sınırındaysa (``expected_votes:`` 7; ``online nodes:`` 4 olarak ayarlıysa) küme yetersayıyı tekrar hesaplayıp sonraki düğüm kaybolsa bile işlemeye devam edebilir. Bu mantık kümedeki çevrimiçi düğüm sayısı 2'yi bulana kadar devam eder. Kümenin 2 üyeden 1 üyeye düşebilmesi için ``auto_tie_breaker`` parametresinin ayarlanması gerekir. Bunu üretim ortamları için önermiyoruz.

source: Setting the ``pe-warn-series-max``, ``pe-input-series-max``, and ``pe-error-series-max`` parameters to 1000 instructs Pacemaker to keep a longer history of the inputs processed and errors and warnings generated by its Policy Engine. This history is useful if you need to troubleshoot the cluster.
tr_tr: ``pe-warn-series-max``, ``pe-input-series-max``, ve ``pe-error-series-max`` parametrelerini 1000 olarak ayarlamak Pacemaker'e işlenen girdilerin ve İlke Motoru tarafından üretilen hata ve uyarıların daha uzun bir geçmişini tutmasını söyler. Bu geçmiş kümede arıza tesbiti yapmak isterseniz faydalıdır.

source: Setting this parameter to ``1`` or ``2`` can improve performance, but it introduces certain dangers. Operating system failures can erase the last second of transactions. While you can recover this data from another node, if the cluster goes down at the same time (in the event of a data center power outage), you lose this data permanently.
tr_tr: Bu parametreyi ``1`` veya ``2`` yapmak başarımı iyileştirebilir ama bazı tehlikelere yol açar. İşletim sistemi arızaları aktarımların son saniyesini silebilir. Bu veriyi başka bir düğümden kurtarabilirsiniz, ama küme aynı zamanda erişilemez olursa (örneğin veri merkezi güç kaybında) veriyi tamamen kaybedersiniz.

source: Since all API access is directed to the proxy, adding or removing nodes has no impact on the configuration of other services. This can be very useful in upgrade scenarios where an entirely new set of machines can be configured and tested in isolation before telling the proxy to direct traffic there instead.
tr_tr: Tüm API erişimi vekile yönlendirildiğinden, düğüm ekleme ve çıkarmanın diğer servis yapılandırmaları üzerinde etkisi yoktur. Bu tamamen yeni bir makine kümesinin yalıtılarak yapılandırılıp denendiği ve ardından vekile trafik yönlendirmesinin söylendiği güncelleme senaryolarında oldukça faydalıdır.

source: Since the cluster is a single administrative domain, it is acceptable to use the same password on all nodes.
tr_tr: Küme tek bir yönetim alanında olduğundan, tüm düğümlerde aynı parolayı kullanmak kabul edilebilir.

source: Specifying ``corosync_votequorum`` enables the votequorum library. This is the only required option.
tr_tr: ``corosync_votequorum`` votequorum kitaplığını etkinleştirir. Bu gerekli tek seçenektir.

source: Start ``corosync`` with systemd unit file:
tr_tr: ``corosync``i systemd birim dosyasıyla başlat:

source: Start ``corosync`` with the LSB init script:
tr_tr: ``corosync`` i LSB başlangıç betiğiyle başlat:

source: Start ``corosync`` with upstart:
tr_tr: ``corosync`` i upstart ile başlat:

source: Start ``pacemaker`` with the LSB init script:
tr_tr: ``pacemaker``i LSB başlangıç betiğiyle başlatın:

source: Start ``pacemaker`` with the systemd unit file:
tr_tr: ``pacemaker``i systemd birim dosyasıyla başlatın:

source: Start ``pacemaker`` with upstart:
tr_tr: ``pacemaker``i upstart ile başlatın:

source: Start the message queue service on all nodes and configure it to start when the system boots. On Ubuntu, it is configured by default.
tr_tr: Tüm düğümlerde ileti kuyruğu servisini başlatın ve sistem önyüklenirken başlayacak şekilde yapılandırın. Ubuntu üzerinde öntanımlı olarak yapılandırılır.

source: Stateful services can be configured as active/passive or active/active, which are defined as follows:
tr_tr: Durumsal servisler etkin/pasif veya etkin/etkin olarak yapılandırılabilirler, şu şekilde tanımlayabiliriz:

source: Stateless versus stateful services
tr_tr: Durumsuz karşısında durumsal servisler

source: Stop RabbitMQ and copy the cookie from the first node to each of the other node(s):
tr_tr: RabbitMQ'yu durdurun ve çerezi ilk düğümden diğer düğüm(ler)e dağıtın:

source: System downtime: Occurs when a user-facing service is unavailable beyond a specified maximum amount of time.
tr_tr: Sistem kapalı süresi: Kullanıcı taraflı bir servisin belirli bir azami süreden daha fazla kullanılamaz olduğu durumlardır.

source: Telemetry
tr_tr: Telemetri

source: Telemetry polling agent
tr_tr: Telemetri yoklama aracısı

source: The :command:`crm configure` command supports batch input. Copy and paste the lines in the next step into your live Pacemaker configuration and then make changes as required.
tr_tr: :command:`crm configure` komutu çoklu girdi destekler. Sonraki adımdaki satırları kopyalayın ve canlı Pacemaker yapılandırmanıza yapıştırarak gerekli değişiklikleri yapın.

source: The :command:`crm configure` supports batch input. Copy and paste the lines in the next step into your live Pacemaker configuration and then make changes as required.
tr_tr: :command:`crm configure` çoklu girdiyi destekler. Sonraki adımdaki satırları kopyalayın ve canlı Pacemaker yapılandırmanıza yapıştırın ardından gerekli değişiklikleri yapın.

source: The :command:`crm configure` supports batch input. You may have to copy and paste the above lines into your live Pacemaker configuration, and then make changes as required.
tr_tr: :command:`crm configure` toplu giriş destekler. Yukarıdaki satırları canlı Pacemaker yapılandırmanıza kopyalayıp yapıştırmanız, ve gerektikçe değişiklikler yapmanız gerekebilir.

source: The Block Storage service (cinder) that can use LVM or Ceph RBD as the storage back end.
tr_tr: Depolama arka ucu olarak LVM veya Ceph RBD kullanan Blok Depolama servisi (cinder).

source: The Image service (glance) that can use the Object Storage service (swift) or Ceph RBD as the storage back end.
tr_tr: Nesne Depolama servisini (swift) ya da Ceph RBD'yi depolama arka ucu olarak kullanabilen İmaj servisi (glance).

source: The L2 agent cannot be distributed and highly available. Instead, it must be installed on each data forwarding node to control the virtual network driver such as Open vSwitch or Linux Bridge. One L2 agent runs per node and controls its virtual interfaces.
tr_tr: L2 aracısı dağıtılamaz ve yüksek kullanılabilir değildir. Bunun yerine Open vSwitch veya Linux Köprüsü gibi sanal ağ sürücüsünü kontrol etmek için her bir veri yönlendiren düğüm üzerinde yüklenmelidir. Düğüm başına bir L2 aracısı çalışır ve sanal arayüzlerini kontrol eder.

source: The Memcached client implements hashing to balance objects among the instances. Failure of an instance impacts only a percentage of the objects and the client automatically removes it from the list of instances. The SLA is several minutes.
tr_tr: Memcached istemcisi nesneleri sunucular arasında dengelemek için özetleme uygular. Bir sunucu arızası yalnızca nesnelerin belli bir yüzdesini etkiler ve istemci otomatik olarak bu sunucuyu listeden çıkarır. SLA birkaç dakikadır.

source: The Memcached client implements hashing to balance objects among the instances. Failure of an instance only impacts a percentage of the objects, and the client automatically removes it from the list of instances.
tr_tr: Memcached istemcisi nesneleri sunucular arasında dengelemek için özetleme uygular. Bir sunucu arızası yalnızca nesnelerin belirli bir yüzdesini etkiler, ve istemci otomatik olarak sunucu listesinden bu sunucuyu çıkarır.

source: The Networking (neutron) service L3 agent is scalable, due to the scheduler that supports Virtual Router Redundancy Protocol (VRRP) to distribute virtual routers across multiple nodes. For more information about the VRRP and keepalived, see `Linux bridge: High availability using VRRP <https://docs.openstack.org/newton/networking-guide/config-dvr-ha-snat.html>`_ and `Open vSwitch: High availability using VRRP <https://docs.openstack.org/newton/networking-guide/deploy-ovs-ha-vrrp.html>`_.
tr_tr: Ağ (neutron) servis L3 aracısı birden çok düğüm arasında sanal yönlendiriciler dağıtmak için Sanal Yönlendirici Yedeklilik İletişim Kuralı (VRRP) destekleyen zamanlayıcı sebebiyle ölçeklenebilirdir. VRRP ve keepalived hakkında daha fazla bilgi için `Linux köprüsü: VRRP kullanarak yüksek kullanılırlık <https://docs.openstack.org/newton/networking-guide/config-dvr-ha-snat.html>`_ ve `Open vSwitch: VRRP kullanarak yüksek kullanılırlık <https://docs.openstack.org/newton/networking-guide/deploy-ovs-ha-vrrp.html>`_ belgelerine göz atın.

source: The OpenStack HA community holds `weekly IRC meetings <https://wiki.openstack.org/wiki/Meetings/HATeamMeeting>`_ to discuss a range of topics relating to HA in OpenStack. Everyone interested is encouraged to attend. The `logs of all previous meetings <http://eavesdrop.openstack.org/meetings/ha/>`_ are available to read.
tr_tr: OpenStack HA topluluğu OpenStack'de HA konulu birçok başlığı tartışmak için `haftalık IRC buluşmaları <https://wiki.openstack.org/wiki/Meetings/HATeamMeeting>`_ yapar. İlgisini çeken herkes katılabilir. `Önceki tüm buluşmaların kayıtları <http://eavesdrop.openstack.org/meetings/ha/>`_ okunabilir.

source: The OpenStack HA team is based on voluntary contributions from the OpenStack community. You can contact the HA community directly in the #openstack-ha channel on Freenode IRC, or by sending mail to the openstack-dev or openstack-doc mailing list with the [HA] prefix in the subject header.
tr_tr: OpenStack HA takımı OpenStack topluluğundan gönüllü katkılara dayanır. HA topluluğuna Freenode IRC üzerinde #openstack-ha kanalıyla, veya openstack-dev veya openstack-doc eposta listelerine konu başlığına [HA] öneki ekleyerek doğrudan ulaşabilirsiniz.

source: The OpenStack Image service offers a service for discovering, registering, and retrieving virtual machine images. To make the OpenStack Image API service highly available in active/passive mode, you must:
tr_tr: OpenStack İmaj servisi sanal makine imajlarını keşfetmek, kaydetmek ve almak için bir servis sağlar. OpenStack İmaj API servisini etkin/pasif kipte yüksek kullanılır yapmak için şunları yapmalısınız:

source: The OpenStack Installation Tutorials and Guides also include a list of the services that use passwords with important notes about using them.
tr_tr: OpenStack Kurulum Öğreticileri ve Kılavuzları ayrıca parolalar kullanan servislerin listesini onları kullanmakla ilgili önemli notlarla birlikte içerir.

source: The OpenStack Networking (neutron) service has a scheduler that lets you run multiple agents across nodes. The DHCP agent can be natively highly available.
tr_tr: OpenStack Ağ (neutron) servisi düğümler arasında birden fazla aracı çalıştırmanızı sağlayan bir zamanlayıcıya sahiptir. DHCP aracısı yerel olarak yüksek kullanılır olabilir.

source: The SQL relational database server provides stateful type consumed by other components. Supported databases are MySQL, MariaDB, and PostgreSQL. Making the SQL database redundant is complex.
tr_tr: SQL ilişkisel veritabanı sunucusu diğer bileşenler tarafından tüketilen durumsal türü sağlar. Desteklenen veritabanları MySQL, MariaDB, ve PostgreSQL'dir. SQL veritabanını yedekli hale getirmek karmaşıktır.

source: The Telemetry API service configuration does not have the ``option httpchk`` directive as it cannot process this check properly.
tr_tr: Telemetri API servis yapılandırması bu kontrolü düzgün işleyemediğinden ``option httpchk`` yönergesine sahip değildir.

source: The Telemetry polling agent can be configured to partition its polling workload between multiple agents. This enables high availability (HA).
tr_tr: Telemetri yoklama aracısı yoklama iş yükünü birçok aracı arasında dağıtacak şekilde yapılandırılabilir. Bu yüksek kullanılırlığı etkinleştirir (HA).

source: The `Installation Tutorials and Guides <https://docs.openstack.org/ocata/install/>`_ provide instructions for installing multiple compute nodes. To make the compute nodes highly available, you must configure the environment to include multiple instances of the API and other services.
tr_tr: `Kurulum Öğreticileri ve Kılavuzları <https://docs.openstack.org/ocata/install/>`_ birden çok hesaplama düğümü kurulumuna göre yönergeler içerir. Hesaplama düğümlerini yüksek kullanılabilir hale getirmek için, ortamı API ve diğer servislerin de birden çok sunucuda bulunduğu duruma getirmelisiniz.

source: The `Telemetry service <https://docs.openstack.org/admin-guide/common/get-started-telemetry.html>`_ provides a data collection service and an alarming service.
tr_tr: `Telemetri servisi <https://docs.openstack.org/admin-guide/common/get-started-telemetry.html>`_ veri toplama servisi ve uyarı servisi sağlar.

source: The `Tooz <https://pypi.python.org/pypi/tooz>`_ library provides the coordination within the groups of service instances. It provides an API above several back ends that can be used for building distributed applications.
tr_tr: `Tooz <https://pypi.python.org/pypi/tooz>`_ kitaplığı servis sunucuları grupları içindeki eşgüdümü sağlar. Dağıtık uygulamalar inşa etmek için kullanılabilecek birçok arka uç üzerinde bir API sağlar.

source: The ``-p`` option is used to give the password on command line and makes it easier to script.
tr_tr: ``-p`` seçeneği komut satırından parola vermek için kullanılır ve betiklerde kolaylık sağlar.
