Repository: openstack/openstack-manuals
Catalog: doc/ha-guide/source/locale/*/LC_MESSAGES/ha-guide.po
Languages: ja, tr_tr

source: **Cluster Address** List the IP addresses for each cluster node.
ja: **クラスターアドレス** 各クラスターノードの IP アドレスを表示します。

source: **Cluster Name** Define an arbitrary name for your cluster.
ja: **クラスター名** 任意のクラスターの名前を定義します。

source: **Corosync configuration file fragment for unicast (corosync.conf)**
ja: **ユニキャスト向け Corosync 設定ファイルの断片 (corosync.conf)**

source: **Data loss**
ja: **データロス**

source: **Example Corosync configuration file for multicast (corosync.conf)**
ja: **マルチキャスト用の Corosync 設定ファイル例 (corosync.conf)**

source: **Node Address** Define the IP address of the cluster node.
ja: **ノードアドレス** クラスターノードの IP アドレスを定義します。

source: **Node Name** Define the logical name of the cluster node.
ja: **ノード名** クラスターノードの論理名を定義します。

source: **System downtime**
ja: **システムの停止時間**

source: **wsrep Provider** The Galera Replication Plugin serves as the wsrep Provider for Galera Cluster. It is installed on your system as the ``libgalera_smm.so`` file. You must define the path to this file in your ``my.cnf``.
ja: **wsrep Provider** Galera Replication Plugin は、Galera Cluster の wsrep Provider として動作します。お使いのシステムに ``libgalera_smm.so`` ファイルとしてインストールされます。このファイルへのパスを ``my.cnf`` に定義する必要があります。

source: /etc/neutron/neutron.conf parameters for high availability
ja: 高可用性のための /etc/neutron/neutron.conf のパラメーター
tr_tr: Yüksek kullanılırlık için /etc/neutron/neutron.conf parametreleri

source: 2 or more
ja: 2 以上
tr_tr: 2 veya fazla

source: :command:`# service corosync start` (LSB, alternate)
ja: :command:`# service corosync start` (LSB, 別の方法)

source: :command:`# service pacemaker start` (LSB, alternate)
ja: :command:`# service pacemaker start` (LSB, 別の方法)

source: :command:`crm configure` supports batch input so you may copy and paste the above lines into your live Pacemaker configuration, and then make changes as required. For example, you may enter edit ``p_ip_keystone`` from the :command:`crm configure` menu and edit the resource to match your preferred virtual IP address.
ja: :command:`crm configure` はバッチ入力をサポートします。そのため、現在の pacemaker 設定の中に上をコピー・ペーストし、適宜変更を反映できます。例えば、お好みの仮想 IP アドレスに一致させるために、:command:`crm configure` メニューから ``edit p_ip_keystone`` と入力し、リソースを編集できます。

source: :ref:`Configure OpenStack services to use Rabbit HA queues <rabbitmq-services>`
ja: :ref:`RabbitMQ HA キューを使用するための OpenStack サービスの設定 <rabbitmq-services>`

source: :ref:`Configure RabbitMQ for HA queues<rabbitmq-configure>`
ja: :ref:`高可用性 キュー用の RabbitMQ の設定 <rabbitmq-configure>`
tr_tr: :ref:`HA kuyrukları için RabbitMQ yapılandırması<rabbitmq-configure>`

source: :ref:`Install RabbitMQ<rabbitmq-install>`
ja: :ref:`RabbitMQ のインストール<rabbitmq-install>`
tr_tr: :ref:`RabbitMQ kurulumu<rabbitmq-install>`

source: :ref:`Neutron DHCP agent<dhcp-agent>`
ja: :ref:`Neutron DHCP エージェント <dhcp-agent>`

source: :ref:`Neutron L3 agent<neutron-l3>`
ja: :ref:`Neutron L3 エージェント <neutron-l3>`

source: :ref:`Neutron LBaaS<neutron-lbaas>` (Load Balancing as a Service) agent
ja: :ref:`Neutron LBaaS<neutron-lbaas>` (Load Balancing as a Service) エージェント

source: :ref:`Neutron metadata agent<neutron-metadata>`
ja: :ref:`Neutron メタデータエージェント <neutron-metadata>`

source: :term:`Advanced Message Queuing Protocol (AMQP)` provides OpenStack internal stateful communication service.
ja: :term:`Advanced Message Queuing Protocol (AMQP)` は、OpenStack 内部のステートフルな通信サービスを提供します。
tr_tr: :term:`Gelişmiş İleti Kuyruklama İletişim Kuralı (AMQP)` OpenStack'e dahili durumsal iletişim servisi sağlar.

source: :term:`active/active configuration`
ja: :term:`アクティブ/アクティブ設定 <active/active configuration>`
tr_tr: :term:`etkin/etkin yapılandırma`

source: :term:`active/passive configuration`
ja: :term:`アクティブ/パッシブ設定 <active/passive configuration>`
tr_tr: :term:`etkin/pasif yapılandırma`

source: A crucial aspect of high availability is the elimination of single points of failure (SPOFs). A SPOF is an individual piece of equipment or software that causes system downtime or data loss if it fails. In order to eliminate SPOFs, check that mechanisms exist for redundancy of:
ja: 高可用性の重要な側面は、単一障害点 (SPOF) を減らすことです。SPOF は、障害が発生した場合にシステム停止やデータ損失を引き起こす、設備やソフトウェアの個々の部品です。SPOF を削減するために、以下の冗長性に対するメカニズムを確認します。
tr_tr: Yüksek kullanılırlığın önemli bir yönü tek bir arıza noktasını elemesidir (SPOF'lar). SPOF arızalandığında sistemin kapalı kalmasına ya da veri kaybına yol açan ekipman parçasıdır. SPOF'ları elemek için, aşağıdakiler için yedekleme yöntemleriniz olduğundan emin olun:

source: A sample votequorum service configuration in the :file:`corosync.com` file is:
ja: :file:`corosync.com` ファイルの votequorum サービス設定例:

source: A service that provides a response after your request and then requires no further attention. To make a stateless service highly available, you need to provide redundant instances and load balance them. OpenStack services that are stateless include ``nova-api``, ``nova-conductor``, ``glance-api``, ``keystone-api``, ``neutron-api`` and ``nova-scheduler``.
ja: リクエストに応答して、その後さらなる注意を必要としないサービス。ステートレスなサービスを高可用化するために、複数のインスタンスを配備して、負荷分散する必要があります。ステートレスな OpenStack サービスに ``nova-api``、``nova-conductor``、``glance-api``、``keystone-api``、``neutron-api``、``nova-scheduler`` があります。

source: A service where subsequent requests to the service depend on the results of the first request. Stateful services are more difficult to manage because a single action typically involves more than one request, so simply providing additional instances and load balancing does not solve the problem. For example, if the horizon user interface reset itself every time you went to a new page, it would not be very useful. OpenStack services that are stateful include the OpenStack database and message queue. Making stateful services highly available can depend on whether you choose an active/passive or active/active configuration.
ja: 最初のリクエストの結果に応じて、後続のリクエストがあるサービス。ステートフルサービスは、あるアクションが一般的に複数のリクエストに影響するため、管理することが難しいです。そのため、単純に追加インスタンスを配備して負荷分散するだけでは、問題を解決できません。例えば、horizon ユーザーインターフェースが、新しいページを開くたびに毎回リセットされると、ほとんど役に立たないでしょう。ステートフルな OpenStack サービスには、OpenStack のデータベース、メッセージキューがあります。ステートレスなサービスの高可用化には、アクティブ/パッシブまたはアクティブ/アクティブな設定のどちらを選択するかに依存する可能性があります。

source: A shared implementation and calculation of `quorum <http://en.wikipedia.org/wiki/Quorum_(Distributed_Systems)>`_.
ja: `クォーラム <http://en.wikipedia.org/wiki/Quorum_(Distributed_Systems)>`_ の共有実装と計算

source: A typical active/active installation for a stateful service includes redundant services, with all instances having an identical state. In other words, updates to one instance of a database update all other instances. This way a request to one instance is the same as a request to any other. A load balancer manages the traffic to these systems, ensuring that operational systems always handle the request.
ja: 一般的にステートレスサービスをアクティブ / アクティブにインストールすることは、すべてのインスタンスが同じ状態を持つ冗長なサービスになることを含みます。別の言い方をすると、あるインスタンスのデータベースの更新は、他のすべてのインスタンスも更新されます。このように、あるインスタンスへのリクエストは、他へのリクエストと同じです。ロードバランサーがこれらのシステムのトラフィックを管理し、利用可能なシステムが常にリクエストを確実に処理します。
tr_tr: Durumsal bir servis için genel bir etkin/etkin kurulumu tüm sunucuların aynı durumda olduğu yedekli servisler içerir. Başka bir deyişle, bir veritabanı sunucusuna yapılan güncelleme diğer tüm sunucuları da günceller. Bu yolla bir sunucuya yapılan istek herhangi başka birine yapılanla aynı olur. Bir yük dengeleyici bu sistemlere trafiği yönetir, işlevsel sistemlerin her zaman isteği ele aldığından emin olur.

source: A typical active/passive installation for a stateful service maintains a replacement resource that can be brought online when required. Requests are handled using a :term:`virtual IP` address (VIP) that facilitates returning to service with minimal reconfiguration. A separate application (such as Pacemaker or Corosync) monitors these services, bringing the backup online as necessary.
ja: 一般的にステートレスサービスをアクティブ / パッシブにインストールすると、必要に応じてオンラインにできる置換リソースを維持します。リクエストは、サービスの最小限の再設定により返す機能を持つ :term:`仮想 IP <virtual IP>` アドレス (VIP) を使用して処理されます。 独立したアプリケーション (Pacemaker や Corosync など) がこれらのサービスを監視し、必要に応じてバックアップ側をオンラインにします。

source: API isolation
ja: API 分離
tr_tr: API yalıtımı

source: Ability to take periodic "snap shots" throughout the installation process and "roll back" to a working configuration in the event of a problem.
ja: インストールプロセス以降、定期的な「スナップショット」を取得する機能、および問題発生時に動作する設定に「ロールバック」する機能があります。

source: Abstract
ja: 概要
tr_tr: Özet

source: Access to RabbitMQ is not normally handled by HAproxy. Instead, consumers must be supplied with the full list of hosts running RabbitMQ with ``rabbit_hosts`` and turn on the ``rabbit_ha_queues`` option.
ja: RabbitMQ へのアクセスは、通常 HAproxy により取り扱われません。利用者は代わりに、 ``rabbit_hosts`` を用いて RabbitMQ を実行しているホストの一覧を指定して、 ``rabbit_ha_queues`` オプションを有効化する必要があります。

source: Access to memcached is not handled by HAproxy because replicated access is currently only in an experimental state. Instead OpenStack services must be supplied with the full list of hosts running memcached.
ja: 重複アクセスは現在実験的な位置づけのため、memcached へのアクセスは HAproxy を利用しません。代わりに、OpenStack のサービスは memcached を実行しているホストをすべて指定する必要があります。

source: Access via an HAProxy virtual IP, for services such as HTTPd that are accessed via a TCP socket that can be load balanced
ja: HAProxy 仮想 IP 経由のアクセス、負荷分散できる TCP ソケット経由でアクセス可能な HTTPd などのサービス向け。

source: Accidental deletion or destruction of data.
ja: 意図しないデータの削除や破損。

source: Active/Passive vs Active/Active
ja: アクティブ/パッシブとアクティブ/アクティブ

source: Add Block Storage API resource to Pacemaker
ja: Block Storage API リソースの Pacemaker への追加
tr_tr: Pacemaker'e Blok Depolama API kaynağı ekleyin

source: Add OpenStack Identity resource to Pacemaker
ja: OpenStack Identity リソースの Pacemaker への追加
tr_tr: OpenStack Kimlik kaynağını Pacemaker'e ekleyin

source: Add OpenStack Image API resource to Pacemaker
ja: OpenStack Image API リソースの Pacemaker への追加
tr_tr: OpenStack İmaj API kaynağını Pacemaker'e ekleyin

source: Add Shared File Systems API resource to Pacemaker
ja: Shared File Systems API リソースの Pacemaker への追加
tr_tr: Paylaşımlı Dosya Sistemleri API kaynağının Pacemaker'e eklenmesi

source: Add the Galera Cluster service:
ja: Galera Cluster サービスを追加します。

source: Add the GnuPG key for the database repository that you want to use.
ja: 使用したいデータベースのリポジトリーに GnuPG キーを追加します。

source: Add the repository to your sources list. Using your preferred text editor, create a ``galera.list`` file in the ``/etc/apt/sources.list.d/`` directory. For the contents of this file, use the lines that pertain to the software repository you want to install:
ja: リポジトリーをソースリストに追加します。お好きなテキストエディターを使用して、``/etc/apt/sources.list.d/`` ディレクトリーに ``galera.list`` を作成します。このファイルの内容は、インストールしたいソフトウェアリポジトリーに関する行を使用します。

source: Add the repository to your system:
ja: リポジトリーをお使いのシステムに追加します。

source: Additional parameters
ja: 追加パラメーター
tr_tr: Ek parametreler

source: After completing these steps, commit your configuration changes by entering :command:`commit` from the :command:`crm configure` menu. Pacemaker then starts the OpenStack Image API service and its dependent resources on one of your nodes.
ja: これらの手順の完了後、:command:`crm configure` メニューから :command:`commit` と入力し、設定の変更をコミットします。Pacemaker は OpenStack Image API サービスおよび依存するリソースを同じノードに起動します。

source: After installing the Corosync package, you must create the :file:`/etc/corosync/corosync.conf` configuration file.
ja: Corosync パッケージのインストール後、 :file:`/etc/corosync/corosync.conf` 設定ファイルを作成する必要があります。
tr_tr: Corosync paketini kurduktan sonra, :file:`/etc/corosync/corosync.conf` yapılandırma dosyasını oluşturmalısınız.

source: After the Corosync services have been started and you have verified that the cluster is communicating properly, you can start :command:`pacemakerd`, the Pacemaker master control process:
ja: Corosync サービスが起動して、クラスターが正常に通信していることを確認した後、Pacemaker のマスター制御プロセス :command:`pacemakerd` を起動できます。

source: After the Pacemaker services have started, Pacemaker creates a default empty cluster configuration with no resources. Use the :command:`crm_mon` utility to observe the status of Pacemaker:
ja: Pacemaker サービスの起動後、Pacemaker がリソースを持たないデフォルトの空クラスターを作成します。 :command:`crm_mon` ユーティリティーを使用して、Pacemaker の状態を確認します。

source: After you add these resources, commit your configuration changes by entering :command:`commit` from the :command:`crm configure` menu. Pacemaker then starts the OpenStack Identity service and its dependent resources on one of your nodes.
ja: これらのリソースの追加後、:command:`crm configure` メニューから :command:`commit` と入力し、設定の変更をコミットします。Pacemaker は OpenStack Identity サービスおよび依存するリソースを同じノードに起動します。

source: After you make these changes, you may commit the updated configuration.
ja: これらの変更実行後、更新した設定を範囲する必要があるかもしれません。

source: After you set up your Pacemaker cluster, you should set a few basic cluster properties:
ja: Pacemaker クラスターのセットアップ後、いくつかの基本的なクラスターのプロパティーを設定すべきです。

source: All routers are highly available by default.
ja: すべてのルーターは、デフォルトで高可用性になっています。
tr_tr: Tüm yönlendiriciler öntanımlı olarak yüksek kullanılırlığa sahip.

source: Almost all services in this stack benefit from being proxied. Using a proxy server provides:
ja: このスタックのほぼすべてのサービスは、プロキシーする恩恵を受けられます。プロキシーサーバを使用することにより、以下が提供されます。

source: Alternatively, if the database server is running, use the ``wsrep_last_committed`` status variable:
ja: 代わりに、データベースサーバーが動作している場合、 ``wsrep_last_committed`` 状態変数を使用します。
tr_tr: Alternatif olarak, veritabanı sunucusu çalışıyorsa, ``wsrep_last_committed`` durum değişkenini kullanın:

source: Alternatively, instead of using systemd agents, download and install the OCF resource agent:
ja: または、systemd エージェントを使用する代わりに、OCF リソースエージェントをダウンロードしてインストールします。
tr_tr: Alternatif olarak, systemd aracıları kullanmak yerine, OCF kaynak aracılarını indirin ve kurun:

source: An AMQP (Advanced Message Queuing Protocol) compliant message bus is required for most OpenStack components in order to coordinate the execution of jobs entered into the system.
ja: AMQP (Advanced Message Queuing Protocol) 互換メッセージバスが、システム内のジョブ実行を調整するために、ほとんどの OpenStack コンポーネントに必要となります。
tr_tr: Sisteme girilen işlerin çalıştırılmasını düzenlemek için çoğu OpenStack bileşenleri için bir AMQP (Gelişmiş İleti Kuyruklama İletişim Kuralı) uyumlu ileti yolu gereklidir.

source: An OpenStack environment includes multiple data pools for the VMs:
ja: OpenStack 環境は、仮想マシン向けの複数のデータプールがあります。
tr_tr: OpenStack ortamı sanal makineler için birçok veri havuzu içerir:

source: And the quorum could also have been set to three, just as a configuration example.
ja: また、クォーラムが、設定例にあるように 3 つに設定されているでしょう。
tr_tr: Ve yetersayı yalnızca örnek bir yapılandırma olarak üçe ayarlanmış olabilir.

source: AppArmor now permits Galera Cluster to operate.
ja: AppArmor により Galera Cluster の動作を許可されます。
tr_tr: AppArmor artık Galera Kümesinin çalışmasına izin veriyor.

source: Application Armor is a kernel module for improving security on Linux operating systems. It is developed by Canonical and commonly used on Ubuntu-based distributions. In the context of Galera Cluster, systems with AppArmor may block the database service from operating normally.
ja: Application Armor は、Linux オペレーティングシステムにおいてセキュリティーを向上するためのカーネルモジュールです。Canonical により開発され、一般的に Ubuntu 系のディストリビューションにおいて使用されています。Galera Cluster の観点では、AppArmor を有効化したシステムは、データベースサービスが正常に動作することを妨げる可能性があります。
tr_tr: Uygulama Zırhı Linux işletim sistemlerinde güvenliği artırmak için kullanılan bir çekirdek modülüdür. Canonical tarafından geliştirilmiştir ve yaygın olarak Ubuntu tabanlı dağıtımlarda kullanılır. Galera Kümesi kapsamında AppArmor'a sahip sistemlerin veritabanı servisinin normal işleyişini engelleyebileceğini söyleyebiliriz.

source: Applications and automatic service migration
ja: アプリケーションおよびサービスの自動的なマイグレーション
tr_tr: Uygulamalar ve otomatik servis göçü

source: Architecture limitations
ja: アーキテクチャーの制限

source: As another option to make RabbitMQ highly available, RabbitMQ contains the OCF scripts for the Pacemaker cluster resource agents since version 3.5.7. It provides the active/active RabbitMQ cluster with mirrored queues. For more information, see `Auto-configuration of a cluster with a Pacemaker <http://www.rabbitmq.com/pacemaker.html>`_.
ja: RabbitMQ を高可用化する別の選択肢として、RabbitMQ バージョン 3.5.7 以降、Pacemaker クラスターリソースエージェント向けの OCF スクリプトが含まれます。アクティブ/アクティブ RabbitMQ クラスターにミラーキューを提供します。詳細は `Auto-configuration of a cluster with a Pacemaker <http://www.rabbitmq.com/pacemaker.html>`_ を参照してください。

source: At its core, a cluster is a distributed finite state machine capable of co-ordinating the startup and recovery of inter-related services across a set of machines.
ja: クラスターは、その中心において、複数のセットのマシン間で関連するサービスのスタートアップとリカバリーを調整する機能を持つ、分散有限状態マシンです。
tr_tr: Özünde, bir küme, dahili ilişkili servisleri bir makine kümesi arasında başlatıp kurtarmayı düzenleme yetisine sahip dağıtık sonlu makinedir.

source: Automated recovery of failed instances
ja: 障害インスタンスの自動復旧
tr_tr: Arızalı sunucuların otomatik kurtarılması

source: Awareness of instances on other machines
ja: 他のマシンにあるインスタンスの把握
tr_tr: Diğer makinelerdeki sunuculardan haberdar olmak

source: Awareness of other applications in the stack
ja: スタックにある他のアプリケーションの認識
tr_tr: Yığındaki diğer uygulamaların farkında olmak

source: Bear in mind that the Percona repository only supports Red Hat Enterprise Linux and CentOS distributions.
ja: Percona リポジトリーは Red Hat Enterprise Linux と CentOS のみをサポートすることを心にとどめておいてください。

source: Bear in mind, leaving SELinux in permissive mode is not a good security practice. Over the longer term, you need to develop a security policy for Galera Cluster and then switch SELinux back into enforcing mode.
ja: SELinux を permissive モードにすることは、良いセキュリティー慣行ではないことを覚えておいてください。長い間、Galera Cluster のセキュリティーポリシーを開発して、SELinux を enforcing モードに切り替える必要があります。
tr_tr: SELinux'u izin veren kipte bırakmanın pek iyi bir güvenlik tercihi olmadığını unutmayın. Uzun vadede, Galera Kümesi için bir güvenlik ilkesi geliştirmeli ve SELinux'u tekrar etkin kipe geçirmelisiniz.

source: Bear in mind, while setting this parameter to ``1`` or ``2`` can improve performance, it introduces certain dangers. Operating system failures can erase the last second of transactions. While you can recover this data from another node, if the cluster goes down at the same time (in the event of a data center power outage), you lose this data permanently.
ja: このパラメーターを ``1`` か ``2`` に設定することにより、性能を改善できますが、ある種の危険性があることを覚えておいてください。オペレーティングシステムの障害が、最後の数秒のトランザクションを消去する可能性があります。このデータを他のノードから復旧することもできますが、クラスターが同時に停止した場合 (データセンターの電源障害時)、このデータを完全に失います。

source: Before you attempt this, verify that you have the following ready:
ja: これを試す前に、以下の準備ができていることを確認します。

source: Before you launch Galera Cluster, you need to configure the server and the database to operate as part of the cluster.
ja: Galera クラスターを起動する前に、クラスターの一部として動作するよう、サーバーとデータベースを設定する必要があります。
tr_tr: Galera Kümesini başlatmadan önce sunucu ve veritabanını kümenin bir parçası olarak çalışacak şekilde yapılandırmalısınız.

source: Block Storage service (cinder) can use LVM or Ceph RBD as the storage back end.
ja: Block Storage サービス (cinder) は、ストレージバックエンドとして LVM や Ceph RBD を使用できます。

source: Both the central and the compute agent can run in an HA deployment, which means that multiple instances of these services can run in parallel with workload partitioning among these running instances.
ja: 中央エージェントとコンピュートエージェントの両方は、高可用性で動作できます。これらのサービスの複数のインスタンスが、これらを実行しているインスタンス間で並行して負荷分散できることを意味します。

source: Built-in application clustering, when available from the application. Galera is one example of this.
ja: アプリケーション組み込みクラスター、アプリケーションから利用できる場合、Galera がこの例になる。

source: By default, `controller1` handles the caching service but, if the host goes down, `controller2` does the job. For more information about memcached installation, see the `OpenStack Cloud Administrator Guide <http://docs.openstack.org/admin-guide-cloud/>`_.
ja: デフォルトで、 `controller1` がキャッシュサービスを処理しますが、ホストが停止している場合、 `controller2` がジョブを実行します。memcached のインストールの詳細は `OpenStack Cloud Administrator Guide <http://docs.openstack.org/admin-guide-cloud/>`_ を参照してください。

source: By default, cluster nodes do not start as part of a Primary Component. Instead they assume that one exists somewhere and attempts to establish a connection with it. To create a Primary Component, you must start one cluster node using the ``--wsrep-new-cluster`` option. You can do this using any cluster node, it is not important which you choose. In the Primary Component, replication and state transfers bring all databases to the same state.
ja: クラスターノードは、デフォルトで Primary Component の一部として起動しません。代わりに、それがどこかに存在すると仮定し、そこへの接続を確立しようとします。1 つのクラスターノードを ``--wsrep-new-cluster``オプションを付けて起動して、Primary Component を作成する必要があります。任意のクラスターノードを使用して実行でき、どれを選択するかは重要ではありません。Primary Component において、レプリケーションと状態転送により、すべてのデータベースが同じ状態になります。

source: Ceph RBD provides object replication capabilities by storing Block Storage volumes as Ceph RBD objects; Ceph RBD ensures that each replica of an object is stored on a different node. This means that your volumes are protected against hard drive and node failures or even the failure of the data center itself.
ja: Ceph RBD は、Ceph RBD オブジェクトとして Block Storage のボリュームを保存することにより、オブジェクトレプリケーション機能を提供します。オブジェクトの各レプリカが別々のノードに保存されることを保証します。このことは、お使いのボリュームがハードディスクやノードの障害時、データセンター自体の障害時にも保護されることを意味します。

source: Certain services running on the underlying operating system of your OpenStack database may block Galera Cluster from normal operation or prevent ``mysqld`` from achieving network connectivity with the cluster.
ja: OpenStack データベースのベースとなるオペレーティングシステムで動作している特定のサービスは、Galera Cluster が通常の動作をブロックしたり、``mysqld`` がクラスターとのネットワーク接続を妨害したりする可能性があります。
tr_tr: OpenStack veritabanınızın altta yatan işletim sisteminde çalışan belli servisler Galera Kümesini normal işlemekten veya ``mysqld``yi küme ile ağ iletişimine geçmekten alıkoyabilir.

source: Change the number of expected votes for a cluster to be quorate
ja: クラスターが定数になるために期待されるボート数を変更します
tr_tr: Bir kümenin yeterli çoğunluğu almış olması için beklenen oy sayısını değiştir

source: Change the number of votes assigned to a node
ja: ノードに割り当てられたボート数を変更します
tr_tr: Bir düğüme atanan oy sayısını değiştir

source: Cinder provides 'block storage as a service' suitable for performance sensitive scenarios such as databases, expandable file systems, or providing a server with access to raw block level storage.
ja: Cinder は、データベースなどの性能を必要とするシナリオ、拡張可能なファイルシステム、ローブロックレベルストレージにアクセスするサーバーに適するサービスとして「block storage as a service」を提供します。

source: Cinder-volume as a single point of failure
ja: 単一障害点としての cinder-volume

source: Clusters and quorums
ja: クラスターとクォーラム
tr_tr: Kümeler ve yetersayılar

source: Command
ja: コマンド

source: Common deployement architectures
ja: 一般的な配備のアーキテクチャー

source: Configuration
ja: 設定
tr_tr: Yapılandırma

source: Configuration tips
ja: 設定のヒント
tr_tr: Yapılandırma ipuçları

source: Configure Block Storage API service
ja: Block Storage API サービスの設定
tr_tr: Blok Depolama API servisini yapılandırın

source: Configure NTP
ja: NTP の設定
tr_tr: NTP'yi yapılandır

source: Configure OpenStack Identity service
ja: OpenStack Identity Service の設定
tr_tr: OpenStack Kimlik servisini yapılandırın

source: Configure OpenStack Image service API
ja: OpenStack Image サービス API の設定
tr_tr: OpenStack İmaj API servisini yapılandırın

source: Configure OpenStack services to use HA Shared File Systems API
ja: 高可用性 Shared File Systems API を使用するための OpenStack サービスの設定
tr_tr: OpenStack servislerini HA Paylaşımlı Dosya Sistemleri API'sini kullanacak şekilde yapılandırın

source: Configure OpenStack services to use Rabbit HA queues
ja: RabbitMQ HA キューを使用するための OpenStack サービスの設定
tr_tr: OpenStack servislerini Rabbit HA kuyrukları kullanacak şekilde yapılandırın:

source: Configure OpenStack services to use highly available Block Storage API
ja: 高可用性 Block Storage API を使用するための OpenStack サービスの設定

source: Configure OpenStack services to use highly available OpenStack Image API
ja: 高可用性 OpenStack Image Service API を使用するための OpenStack サービスの設定
