Repository: openstack/openstack-manuals
Catalog: doc/ha-guide/source/locale/*/LC_MESSAGES/ha-guide.po
Languages: ja, tr_tr

source: Configure OpenStack services to use the highly available OpenStack Identity
ja: 高可用性 OpenStack Identity を使用するための OpenStack サービスの設定
tr_tr: OpenStack servislerini yüksek kullanılırlıklı OpenStack Kimliği kullanacak şekilde yapılandırın

source: Configure RabbitMQ for HA queues
ja: 高可用性 キュー用の RabbitMQ の設定
tr_tr: RabbitMQ'yu HA kuyrukları için yapılandır

source: Configure Shared File Systems API service
ja: Shared File Systems API サービスの設定
tr_tr: Paylaşımlı Dosya Sistemleri API servisini yapılandırın

source: Configure high availability on compute nodes
ja: コンピュートノードにおける高可用性の設定

source: Configure networking on each node. The `Networking <http://docs.openstack.org/liberty/install-guide-ubuntu/environment-networking.html>`_ section of the *Install Guide* includes basic information about configuring networking.
ja: 各ノードにおいてネットワークを設定します。ネットワーク設定に関する基本的な情報は、インストールガイドの `Networking <http://docs.openstack.org/liberty/install-guide-ubuntu/environment-networking.html>`_ セクションにあります。

source: Configure the VIP
ja: 仮想 IP の設定
tr_tr: VIP Yapılandırma

source: Configuring Block Storage to listen on the VIP address
ja: Block Storage がその仮想 IP アドレスをリッスンする設定
tr_tr: Blok Depolamayı VIP adresinde dinleyecek şekilde yapılandırmak

source: Configuring HAProxy
ja: HAProxy の設定
tr_tr: HAProxy Yapılandırması

source: Configuring InnoDB
ja: InnoDB の設定
tr_tr: InnoDB yapılandırması

source: Configuring OpenStack services to use this IP address
ja: OpenStack のサービスがこの IP アドレスを使用する設定
tr_tr: OpenStack serislerini bu IP adresini kullanacak şekilde yapılandırmak

source: Configuring RAID on the hard drives that implement storage protects your data against a hard drive failure. If, however, the node itself fails, data may be lost. In particular, all volumes stored on an LVM node can be lost.
ja: ストレージを実装するハードディスクに RAID を設定することにより、ハードディスク障害からデータを保護します。しかしながら、ノード自体が故障した場合、データが失われるかもしれません。とくに、LVM ノードに保存されている全ボリュームは失われる可能性があります。

source: Configuring Storage for high availability
ja: ストレージの高可用性の設定

source: Configuring ``mysqld``
ja: ``mysqld`` の設定

source: Configuring non-core components for high availability
ja: 非コアコンポーネントの高可用性の設定

source: Configuring the compute node for high availability
ja: コンピュートノードの高可用性の設定

source: Configuring the controller for high availability
ja: コントローラーの高可用性の設定

source: Configuring the server
ja: サーバーの設定
tr_tr: Sunucunun yapılandırılması

source: Configuring wsrep replication
ja: wsrep レプリケーションの設定
tr_tr: Wsrep yedeklemenin yapılandırılması

source: Connect an additional quorum device to allow small clusters remain quorate during node outages
ja: 追加のクォーラムデバイスを接続して、小規模なクラスターがノード障害時にクォーラムを取得できるようにします。
tr_tr: Düğüm arızalarında küçük kümelerin yeterli sayıda kalması için ek bir yetersayı aygıtı bağla

source: Contents
ja: 内容
tr_tr: İçindekiler

source: Corosync can be configured to work with either multicast or unicast IP addresses or to use the votequorum library.
ja: Corosync を動作させるための設定としては、マルチキャスト IP アドレスを使う、ユニキャスト IP アドレスを使う、 votequorum ライブラリーを使う、の選択肢があります。
tr_tr: Corosync çoklu yayın ya da tekli yayın IP adresleriyle veya votequorum kitaplığını kullanacak şekilde yapılandırılabilir.

source: Corosync is started as a regular system service. Depending on your distribution, it may ship with an LSB init script, an upstart job, or a systemd unit file. Either way, the service is usually named corosync:
ja: Corosync は通常のシステムサービスとして起動します。お使いのディストリビューションに応じて、LSB init スクリプト、upstart ジョブ、systemd ユニットファイルを同梱しているかもしれません。どちらにしても、サービスは通常 corosync という名前です。

source: Create a ``Galera.repo`` file in the local directory. For Galera Cluster for MySQL, use the following content:
ja: ローカルのディレクトリーに ``Galera.repo`` ファイルを作成します。Galera Cluster for MySQL の場合、以下の内容を使用します。

source: Create a configuration file for ``clustercheck`` at ``/etc/sysconfig/clustercheck``:
ja: ``clustercheck`` の設定ファイルを ``/etc/sysconfig/clustercheck`` に作成します。
tr_tr: ``clustercheck`` için ``/etc/sysconfig/clustercheck`` konumunda bir yapılandırma dosyası oluşturun:

source: Create a configuration file for the HAProxy monitor service, at ``/etc/xinetd.d/galera-monitor``:
ja: HAProxy モニターサービスの設定ファイルを ``/etc/xinetd.d/galera-monitor`` に作成します。
tr_tr: ``/etc/xinetd.d/galera-monitor`` konumunda HAProxy izleme servisi için yapılandırma dosyası oluşturun:

source: Create a symbolic link for the database server in the ``disable`` directory:
ja: ``disable`` ディレクトリーにデータベースサーバーへのシンボリックリンクを作成します。
tr_tr: ``disable`` dizininde veritabanı servisi için bir sembolik bağlantı oluşturun:

source: Create the cluster, giving it a name, and start it:
ja: 名前を指定してクラスターを作成し、起動します。

source: Currently, no native feature is provided to make the LBaaS agent highly available using the default plug-in HAProxy. A common way to make HAProxy highly available is to use the VRRP (Virtual Router Redundancy Protocol). Unfortunately, this is not yet implemented in the LBaaS HAProxy plug-in.
ja: 現在、デフォルトのプラグイン HAProxy を使用して、LBaaS エージェントを高可用化する組み込み機能はありません。HAProxy を高可用化する一般的な方法は、VRRP (Virtual Router Redundancy Protocol) を使用することです。残念ながら、これはまだ LBaaS HAProxy プラグインに実装されていません。

source: Data integrity through fencing (a non-responsive process does not imply it is not doing anything)
ja: フェンシングによるデータ完全性 (応答なしプロセスが何もしていないことを意味します)
tr_tr: Parmaklık ile veri bütünlüğü (yanıt vermeyen bir süreç hiçbir şey yapmadığını ima etmez)

source: Database
ja: データベース

source: Database (Galera Cluster)
ja: データベース (Galera Cluster)

source: Database configuration
ja: データベース設定
tr_tr: Veritabanı yapılandırması

source: Database hosts with Galera Cluster installed. You need a minimum of three hosts;
ja: Galera Cluster クラスターがインストールされたデータベースホスト。少なくとも 3 つのホストが必要です。

source: Define the InnoDB memory buffer pool size. The default value is 128 MB, but to compensate for Galera Cluster's additional memory usage, scale your usual value back by 5%:
ja: InnoDB メモリーバッファープールサイズを定義します。デフォルト値は 128 MB ですが、Galera Cluster の追加メモリー使用状況に対して補うために、通常の値を 5% までスケールさせてください。
tr_tr: InnoDB bellek tampon havuz boyutunu belirtin. Öntanımlı değer 128 MB'dir, ama Galera Kümesinin ek hafıza kullanımına yer açmak için genel değerinizi 5% geri ölçekleyin:

source: Depending on the method used to communicate with the service, the following availability strategies will be followed:
ja: サービスが通信するために使用するメソッドに応じて、以下の可用性の戦略に従います。

source: Deployment flavors
ja: デプロイフレーバー
tr_tr: Dağıtım nitelikleri

source: Deployment strategies
ja: デプロイ戦略
tr_tr: Kurulum stratejileri

source: Description
ja: 説明
tr_tr: Açıklama

source: Distribution
ja: ディストリビューション

source: Do not change this value. Other modes may cause ``INSERT`` statements on tables with auto-increment columns to fail as well as unresolved deadlocks that leave the system unresponsive.
ja: この値を変更してはいけません。他のモジュールが、自動インクリメントの列を用いてテーブルに ``INSERT`` ステートメントを発行するかもしれません。これは、システムが応答不可になる解決不能なデッドロックに陥ります。
tr_tr: Bu değeri değiştirmeyin. Diğer kipler otomatik artırmalı sütunlara sahip tablolardaki ``INSERT`` işlemlerinin başarısız olmasına ve sistemi yanıtsız bırakan çözülmemiş ölükilitlere yol açabilir.

source: Do this configuration on all services using RabbitMQ:
ja: RabbitMQ を使用するすべてのサービスでこの設定を行います。

source: Each configured interface must have a unique ``ringnumber``, starting with 0.
ja: 設定済みの各インターフェースは、0 から始まる一意な ``ringnumber`` を持つ必要があります。
tr_tr: Yapılandırılan her arayüzün 0 ile başlayan, benzersiz bir ``ringnumber`` değeri olmalıdır.

source: Each instance has its own IP address;
ja: 各インスタンスは、自身の IP アドレスを持ちます。

source: Each instance of HAProxy configures its front end to accept connections only from the virtual IP (VIP) address and to terminate them as a list of all instances of the corresponding service under load balancing, such as any OpenStack API service.
ja: HAProxy の各インスタンスは、仮想 IP アドレスからの接続のみを受け付け、OpenStack API サービスなど、負荷分散するサービスの全インスタンスの一覧に振り分けるよう、そのフロントエンドを設定します。

source: Each service also has a backup but manages both the main and redundant systems concurrently. This way, if there is a failure, the user is unlikely to notice. The backup system is already online and takes on increased load while the main system is fixed and brought back online.
ja: 各サービスはバックアップも持ちますが、メインと冗長システムを同時に管理します。このように、ユーザーが気が付かない障害が発生した場合、バックアップシステムはすでにオンラインであり、メインシステムが復旧され、オンラインになるまでの間は負荷が高くなります。
tr_tr: Her servis ayrıca bir yedeğe sahiptir ama hem ana hem yedek sistemleri aynı zamanda yönetir. Bu yolla, bir arıza olduğunda kullanıcı fark etmeyecektir bile. Yedek sistem zaten çevrimiçidir ve ana sistem düzeltilip tekrar çevrimiçi yapılana kadar artan yükü kaldıracaktır.

source: Edit the :file:`/etc/glance/glance-api.conf` file to configure the OpenStack image service:
ja: :file:`/etc/glance/glance-api.conf` ファイルを編集して、OpenStack Image サービスを設定します。

source: Edit the :file:`/etc/manila/manila.conf` file:
ja: `/etc/manila/manila.conf` ファイルを編集します。
tr_tr: :file:`/etc/manila/manila.conf` dosyasını düzenleyin:

source: Edit the :file:`keystone.conf` file to change the values of the :manpage:`bind(2)` parameters:
ja: :file:`keystone.conf` ファイルを編集して、 :manpage:`bind(2)` パラメーターの値を変更します。
tr_tr: :manpage:`bind(2)` parametrelerinin değerlerini değiştirmek için :file:`keystone.conf` dosyasını düzenleyin:

source: Edit the ``/etc/cinder/cinder.conf`` file:
ja: ``/etc/cinder/cinder.conf`` ファイルを編集します。

source: Enabling the repository
ja: リポジトリーの有効化

source: Enhanced failure detection
ja: 高度な障害検出
tr_tr: Gelişmiş arıza algılama

source: Ensure that the InnoDB locking mode for generating auto-increment values is set to ``2``, which is the interleaved locking mode.
ja: 自動インクリメント値を生成するための InnoDB ロックモードがをきちんと``2`` に設定してください。これは、インターリーブ・ロックモードです。

source: Ensure that the InnoDB log buffer is written to file once per second, rather than on each commit, to improve performance:
ja: パフォーマンスを改善するために、InnoDB ログバッファーが、コミットごとではなく、1 秒ごとにファイルに書き込むことを確認します。
tr_tr: Başarımı artırmak için InnoDB kayıt tampon belleğinin dosyaya her gönderide değil saniyede bir yazıldığına emin olun:

source: Ensure that the binary log format is set to use row-level replication, as opposed to statement-level replication:
ja: バイナリーログ形式が、ステートメントレベルのレプリケーションではなく、行レベルのレプリケーションに設定されていることを確認してください。
tr_tr: İkilik kayıt biçiminin açıklama-seviyesinde değil satır-seviyesinde yedekleme kullanacak şekilde yapılandırıldığından emin olun:

source: Ensure that the database server is not bound only to to the localhost, ``127.0.0.1``. Instead, bind it to ``0.0.0.0`` to ensure it listens on all available interfaces.
ja: データベースサーバーが localhost や ``127.0.0.1`` のみにバインドされていないことを確認してください。代わりに、すべてのインターフェースをきちんとリッスンするよう、 ``0.0.0.0`` にバインドしてください。

source: Ensure that the default storage engine is set to InnoDB:
ja: デフォルトのストレージエンジンをきちんと InnoDB に設定してください。
tr_tr: Öntanımlı depolama motorunun InnoDB'ye ayarlandığından emin olun:

source: Ephemeral storage is allocated for an instance and is deleted when the instance is deleted. The Compute service manages ephemeral storage. By default, Compute stores ephemeral drives as files on local disks on the Compute node but Ceph RBD can instead be used as the storage back end for ephemeral storage.
ja: 一時ストレージは、インスタンスのために割り当てられ、インスタンスの削除時に削除されます。Compute サービスが一時ストレージを管理します。Compute はデフォルトで、コンピュートノードのローカルディスクにファイルとして一時ディスクを保存します。代わりに、Ceph RBD が一時ストレージのストレージバックエンドとして使用できます。

source: Example Config File
ja: サンプル設定ファイル

source: Example configuration with two hosts:
ja: 2 ホストでの設定例

source: Facility services such as power, air conditioning, and fire protection
ja: 電源、空調、防火などに関する設備
tr_tr: Güç, havalandırma, yangın koruması gibi tesis servisleri

source: Firewall
ja: ファイアウォール
tr_tr: Güvenlik duvarı

source: For Debian and Debian-based distributions, such as Ubuntu, complete the following steps:
ja: Debian および、Ubuntu などの Debian 系のディストリビューションは、以下の手順を実行してください。

source: For Debian and Debian-based distributions, such as Ubuntu, run the following command:
ja: Debian および、Ubuntu などの Debian 系のディストリビューションは、以下のコマンドを実行してください。

source: For Galera Cluster for MySQL, using your preferred text editor, create a ``Galera.repo`` file in the ``/etc/yum.repos.d/`` directory.
ja: Galera Cluster for MySQL の場合、お好きなテキストエディターを使用して、 ``/etc/yum.repos.d/`` ディレクトリーに ``Galera.repo`` ファイルを作成します。

source: For Kilo and beyond, focus on L3HA and DVR.
ja: Kilo 以降、L3HA と DVR に注力します。

source: For Liberty, we do not have the standalone network nodes in general. We usually run the Networking services on the controller nodes. In this guide, we use the term "network nodes" for convenience.
ja: Liberty の場合、独立したネットワークノードを一般的に持ちません。よくコントローラーノードにおいて Networking サービスを実行します。このガイドでは、便宜上、「ネットワークノード」という言葉を使用します。

source: For MariaDB Galera Cluster, instead use this content:
ja: MariaDB Galera Cluster の場合、代わりに以下の内容を使用します。

source: For MariaDB Galera Cluster, using your preferred text editor, create a ``Galera.repo`` file in the ``/etc/yum.repos.d/`` directory.
ja: MariaDB Galera Cluster の場合、お好きなテキストエディターを使用して、 ``/etc/yum.repos.d/`` ディレクトリーに ``Galera.repo`` ファイルを作成します。

source: For OpenStack Compute, for example, if your OpenStack Identiy service IP address is 10.0.0.11, use the following configuration in your :file:`api-paste.ini` file:
ja: 例えば、OpenStack Compute の場合、OpenStack Image API サービスの IP アドレスが 10.0.0.11 ならば、以下の設定を :file:`api-paste.ini` ファイルに使用します。

source: For OpenStack Compute, for example, if your OpenStack Image API service IP address is 10.0.0.11 (as in the configuration explained here), you would use the following configuration in your :file:`nova.conf` file:
ja: 例えば、OpenStack Compute の場合、OpenStack Image API サービスの IP アドレスが (ここで説明されている設定のように) 10.0.0.11 ならば、以下の設定を :file:`nova.conf` ファイルに使用します。

source: For Percona XtraDB Cluster, run the following command:
ja: Percona XtraDB Cluster の場合、以下のコマンドを実行します。

source: For Red Hat Enterprise Linux and Red Hat-based Linux distributions, the process is more straightforward. In this file, only enter the text for the repository you want to use.
ja: Red Hat Enterprise Linux および Red Hat 系のディストリビューションは、手順はもっとシンプルです。このファイルに、使用したいリポジトリーのテキストを入力するだけです。

source: For Red Hat Enterprise Linux and Red Hat-based distributions, such as Fedora or CentOS, instead run this command:
ja: Red Hat Enterprise Linux および Fedora や CentOS などの Red Hat 系ディストリビューションの場合、このコマンドを代わりに実行してください。

source: For SLES 12, the packages are signed by GPG key 893A90DAD85F9316. You should verify the fingerprint of the imported GPG key before using it.
ja: SLES 12 の場合、パッケージは GPG キー 893A90DAD85F9316 により署名されています。使用する前に、インポートした GPG キーのフィンガープリントを検証すべきです。
tr_tr: SLES 12 için, paketler GPG anahtarı 893A90DAD85F9316 ile imzalanmıştır. Kullanmadan önce içe aktarılan GPG anahtarının parmakizini doğrulamalısınız.

source: For SUSE Enterprise Linux Server and SUSE-based distributions, such as openSUSE, instead run this command:
ja: SUSE Enterprise Linux Server および openSUSE などの SUSE 系ディストリビューションの場合、このコマンドを代わりに実行してください。

source: For SUSE Enterprise Linux and SUSE-based distributions, such as openSUSE binary installations are only available for Galera Cluster for MySQL and MariaDB Galera Cluster.
ja: SUSE Enterprise Linux や openSUSE などの SUSE 系ディストリビューションのバイナリーインストールの場合、Galera Cluster for MySQL と MariaDB Galera Cluster のみ利用可能です。

source: For UDPU, every node that should be a member of the membership must be specified.
ja: UDPUでは、全てのノードがメンバーシップメンバーを指定しなければなりません。
tr_tr: UDPU için, aboneliğin üyesi olması gereken her düğüm belirtilmelidir.

source: For Ubuntu, you should also enable the Corosync service in the ``/etc/default/corosync`` configuration file.
ja: Ubuntu の場合、 ``/etc/default/corosync`` 設定ファイルにおいて Corosync サービスも有効化すべきです。
tr_tr: Ubuntu için, ayrıca ``/etc/default/corosync`` yapılandırma dosyasında Corosync servisini etkinleştirmelisiniz.

source: For ``crmsh``:
ja: ``crmsh`` の場合:
tr_tr: ``crmsh`` için:

source: For ``pcs``:
ja: ``pcs`` の場合:
tr_tr: ``pcs`` için:

source: For a complete list of the available parameters, run the ``SHOW VARIABLES`` command from within the database client:
ja: 利用できるパラメーターの一覧は、データベースクライアントから ``SHOW VARIABLES`` コマンドを実行してください。
tr_tr: Kullanılabilir parametrelerin tam listesi için, veritabanı istemcisinden ``SHOW VARIABLES`` komutunu çalıştırın:

source: For backward compatibility and supporting existing deployments, the central agent configuration also supports using different configuration files for groups of service instances of this type that are running in parallel. For enabling this configuration, set a value for the partitioning_group_prefix option in the `central section <http://docs.openstack.org/liberty/ config-reference/content/ch_configuring-openstack-telemetry.html>`__ in the OpenStack Configuration Reference.
ja: 既存の環境の後方互換性とサポートのために、中央エージェントの設定は、並列で実行しているこの種のサービスインスタンスのグループのために、別の設定ファイルを使用することもサポートされます。この設定を有効化するために、OpenStack Configuration Reference の `central section <http://docs.openstack.org/liberty/ config-reference/content/ch_configuring-openstack-telemetry.html>`__ にある partitioning_group_prefix オプションの値を設定します。

source: For demonstrations and studying, you can set up a test environment on virtual machines (VMs). This has the following benefits:
ja: デモや学習の場合、仮想マシンにテスト環境をセットアップできます。これには以下の利点があります。
tr_tr: Gösterim çalışma amaçlı, sanal makineler (VM) üzerine bir deneme ortamı kurabilirsiniz. Bunun aşağıdaki faydaları bulunur:

source: For detailed instructions about installing HAProxy on your nodes, see its `official documentation <http://www.haproxy.org/#docs>`_.
ja: お使いのノードに HAProxy をインストールする方法の詳細は `公式ドキュメント <http://www.haproxy.org/#docs>`_ を参照してください。

source: For each cluster node, run the following commands, replacing ``NODE-IP-ADDRESS`` with the IP address of the cluster node you want to open the firewall to:
ja: 各クラスターノード向けに、以下のコマンドを実行します。``NODE-IP-ADDRESS`` をファイアウォールを開きたいクラスターノードの IP アドレスで置き換えます。

source: For each entry: Replace all instances of ``DISTRO`` with the distribution that you use, such as ``debian`` or ``ubuntu``. Replace all instances of ``RELEASE`` with the release of that distribution, such as ``wheezy`` or ``trusty``. Replace all instances of ``VERSION`` with the version of the database server that you want to install, such as ``5.6`` or ``10.0``.
ja: 各項目に対して、すべての ``DISTRO`` をお使いのディストリビューション ``debian`` や ``ubuntu`` などに置き換えます。すべての ``RELEASE`` をディストリビューションのリリース名 ``wheezy`` や ``trusty`` に置き換えます。すべての ``VERSION`` をインストールしたいデータベースサーバーのバージョン ``5.6`` や ``10.0`` などに置き換えます。

source: For each instance of OpenStack database in your cluster, run the following commands, replacing ``NODE-IP-ADDRESS`` with the IP address of the cluster node you want to open the firewall to:
ja: クラスターにある OpenStack データベースの各インスタンス向けに、以下のコマンドを実行します。``NODE-IP-ADDRESS`` をファイアウォールを開きたいクラスターノードの IP アドレスで置き換えます。

source: For environments that do not support multicast, Corosync should be configured for unicast. An example fragment of the :file:`corosync.conf` file for unicastis shown below:
ja: マルチキャストをサポートしていない場合、Corosync はユニキャストで設定すべきです。ユニキャスト向け :file:`corosync.conf` ファイルの設定例を以下に示します。

source: For firewall configurations, note that Corosync communicates over UDP only, and uses ``mcastport`` (for receives) and ``mcastport - 1`` (for sends).
ja: ファイアウォール設定に向け、Corosync は UDP のみで通信して、 ``mcastport`` (受信用) と ``mcastport - 1`` (送信用) を使用することに注意してください。

source: For information about the required configuration options that have to be set in the :file:`ceilometer.conf` configuration file for both the central and compute agents, see the `coordination section <http://docs.openstack.org/liberty/config-reference/content/ ch_configuring-openstack-telemetry.html>`__ in the OpenStack Configuration Reference.
ja: 中央エージェントとコンピュートエージェントの両方の :file:`ceilometer.conf` 設定ファイルに設定する必要があるオプションの詳細は、OpenStack Configuration Reference の `coordination section <http://docs.openstack.org/liberty/config-reference/content/ ch_configuring-openstack-telemetry.html>`__ を参照してください。

source: For many Linux distributions, you can configure the firewall using the ``firewall-cmd`` utility for FirewallD. To do so, complete the following steps on each cluster node:
ja: 多くの Linux ディストリビューションの場合、FirewallD 向けの ``firewall-cmd`` ユーティリティーを使用して、ファイアウォールを設定できます。そうするために、各クラスターノードに以下の手順を実行します。

source: For many Linux distributions, you can configure the firewall using the ``iptables`` utility. To do so, complete the following steps:
ja: 多くの Linux ディストリビューションの場合、``iptables`` ユーティリティーを使用してファイアウォールを設定できます。そのために、以下の手順を実行します。

source: For more information about configuring storage back ends for the different storage options, see the `Cloud Administrator Guide <http://docs.openstack.org/admin-guide-cloud/>`_.
ja: さまざまなストレージの選択肢に対して、ストレージバックエンドを設定する方法の詳細は、 `Cloud Administrator Guide <http://docs.openstack.org/admin-guide-cloud/>`_ を参照してください。

source: For more information on configuring SELinux to work with Galera Cluster, see the `Documentation <http://galeracluster.com/documentation-webpages/selinux.html>`_
ja: Galera Cluster と動作する SELinux を設定する方法の詳細は `ドキュメント <http://galeracluster.com/documentation-webpages/selinux.html>`_ を参照してください。

source: For more information on firewalls, see `Firewalls and default ports <http://docs.openstack.org/liberty/config-reference/content/firewalls-default-ports.html>`_, in the Configuration Reference.
ja: ファイアウォールの詳細は、Configuration Reference の `Firewalls and default ports <http://docs.openstack.org/liberty/config-reference/content/firewalls-default-ports.html>`_ を参照してください。

source: For more information, see the official installation manual for the distribution:
ja: 詳細はディストリビューションの公式インストールガイドを参照してください。
tr_tr: Daha fazla bilgi için, dağıtım için resmi kurulum kılavuzuna göz atın:

source: For servers that use ``systemd``, instead run these commands:
ja: ``systemd`` を使用するサーバーの場合、これらのコマンドを代わりに実行します。

source: For servers that use ``systemd``, instead run this command:
ja: ``systemd`` を使用するサーバーの場合、代わりにこのコマンドを実行します。

source: For servers that use ``systemd``, you need to save the current packet filtering to the path of the file that ``iptables`` reads when it starts. This path can vary by distribution, but common locations are in the ``/etc`` directory, such as:
ja: ``systemd`` を使用するサーバーの場合、現在のパケットフィルタリングの内容を、 ``iptables`` が起動時に参照するファイルに保存する必要があります。このパスは、ディストリビューションにより異なりますが、次のように、一般的に ``/etc`` ディレクトリーにあります。

source: For the documentation of these parameters, wsrep Provider option and status variables available in Galera Cluster, see `Reference <http://galeracluster.com/documentation-webpages/reference.html>`_.
ja: Galera Cluster において利用できる、これらのパラメーター、wsrep プロバイダーオプション、状態変数のドキュメントは、`Reference <http://galeracluster.com/documentation-webpages/reference.html>`_ を参照してください。

source: For this reason, the use of a cluster manager like `Pacemaker <http://clusterlabs.org>`_ is highly recommended.
ja: この理由により、 `Pacemaker <http://clusterlabs.org>`_ のようなクラスターマネージャーの利用が強く推奨されます。

source: Galera Cluster configuration parameters all have the ``wsrep_`` prefix. There are five that you must define for each cluster node in your OpenStack database.
ja: Galera Cluster の設定パラメーターは、すべて ``wsrep_`` プレフィックスを持ちます。OpenStack データベースにおいて、各クラスターノード向けに定義する必要があるものが 5 個あります。

source: Galera Cluster does not support non-transactional storage engines and requires that you use InnoDB by default. There are some additional parameters that you must define to avoid conflicts.
ja: Galera Cluster は、トランザクション未対応ストレージエンジンをサポートしません。デフォルトでは InnoDB を使用する必要があります。競合を避けるために定義する必要のある追加パラメーターがいくつかあります。
tr_tr: Galera Kümesi aktarımsal olmayan depolama motorlarını desteklemez ve öntanımlı olarak InnoDB kullanmanızı gerektirir. Çakışmaları önlemek için tanımlamanız gereken bazı ek parametreler bulunur.
