Repository: openstack/openstack-manuals
Catalog: doc/ha-guide/source/locale/*/LC_MESSAGES/ha-guide.po
Languages: ja, tr_tr

source: You can now add the Pacemaker configuration for the OpenStack Identity resource by running the :command:`crm configure` command to connect to the Pacemaker cluster. Add the following cluster resources:
ja: ここで OpenStack Identity リソース向けに Pacemaker の設定を追加できます。:command:`crm configure` コマンドを使用して、Pacemaker クラスターに接続します。以下のクラスターリソースを追加します。

source: You can now add the Pacemaker configuration for the OpenStack Image API resource. Use the :command:`crm configure` command to connect to the Pacemaker cluster and add the following cluster resources:
ja: ここで OpenStack Image API リソース向けに Pacemaker の設定を追加できます。:command:`crm configure` コマンドを使用して、Pacemaker クラスターに接続して、以下のクラスターリソースを追加します。

source: You can now add the Pacemaker configuration for the Shared File Systems API resource. Connect to the Pacemaker cluster with the :command:`crm configure` command and add the following cluster resources:
ja: Shared File Systems API リソース用の Pacemaker 設定を追加できます。 :command:`crm configure` を用いて Pacemaker クラスターに接続し、以下のクラスターリソースを追加します。

source: You can now check the Corosync connectivity with two tools.
ja: 2 つのツールを用いて Corosync 接続性を確認できます。

source: You can read more about these concerns on the `Red Hat Bugzilla <https://bugzilla.redhat.com/show_bug.cgi?id=1193229>`_ and there is a `psuedo roadmap <https://etherpad.openstack.org/p/cinder-kilo-stabilisation-work>`_ for addressing them upstream.
ja: これらの課題の詳細は `Red Hat Bugzilla <https://bugzilla.redhat.com/show_bug.cgi?id=1193229>`_ にあります。また、アップストリームにおいて解決するための `psuedo roadmap <https://etherpad.openstack.org/p/cinder-kilo-stabilisation-work>`_ があります。
tr_tr: Bu endişelerle ilgili daha fazla bilgiyi `Red Hat Bugzilla'sında <https://bugzilla.redhat.com/show_bug.cgi?id=1193229>`_ okuyabilirsiniz, ayrıca nasıl çözülecekleriyle ilgili bir `kalıp yol haritası <https://etherpad.openstack.org/p/cinder-kilo-stabilisation-work>`_ bulunur.

source: You must also create the OpenStack Image API endpoint with this IP address. If you are using both private and public IP addresses, you should create two virtual IP addresses and define your endpoint like this:
ja: この IP アドレスを用いて OpenStack Image API エンドポイントを作成する必要があります。プライベート IP アドレスとパブリック IP アドレスを両方使用している場合、2 つの仮想 IP アドレスを作成して、次のようにエンドポイントを定義する必要があります。

source: You must configure NTP to properly synchronize services among nodes. We recommend that you configure the controller node to reference more accurate (lower stratum) servers and other nodes to reference the controller node. For more information, see the `Install Guides <http://docs.openstack.org/#install-guides>`_.
ja: サービスをノード間で正しく同期するために、NTP を設定する必要があります。コントローラーノードをできる限り正確な（ストラタム値が小さい）サーバーに参照するように設定し、他のノードはコントローラーノードを参照するよう設定することを推奨します。詳細は `Install Guides <http://docs.openstack.org/ja/#install-guides>`_ を参照してください。

source: You must configure a supported Tooz driver for the HA deployment of the Telemetry services.
ja: Telemetry サービスの高可用性デプロイのために、サポートされる Tooz ドライバーを設定する必要があります。
tr_tr: Telemetri servislerinin HA kurulumu için desteklenen bir Tooz sürücüsü yapılandırmalısınız.

source: You must create the Block Storage API endpoint with this IP.
ja: この IP を用いて Block Storage API エンドポイントを作成する必要があります。

source: You must create the Shared File Systems API endpoint with this IP.
ja: この IP を用いて Shared File Systems API エンドポイントを作成する必要があります。
tr_tr: Paylaşımlı Dosya Sistemleri API uç noktasını bu IP ile oluşturmalısınız.

source: You must first download the OpenStack Identity resource to Pacemaker by running the following commands:
ja: まず、以下のコマンドを実行して、OpenStack Identity リソースを Pacemaker にダウンロードする必要があります。

source: You must first download the resource agent to your system:
ja: まず、お使いのシステムにリソースエージェントをダウンロードする必要があります。

source: You must select and assign a virtual IP address (VIP) that can freely float between cluster nodes.
ja: クラスターノード間で自由に移動できる仮想 IP アドレス (VIP) を選択して割り当てる必要があります。
tr_tr: Küme düğümleri arasında serbestçe kayabilen bir sanal IP adresi (VIP) seçmeli ve atamalısınız.

source: You must use the same name on every cluster node. The connection fails when this value does not match.
ja: すべてのクラスターノードにおいて同じ名前を使用する必要があります。この値が一致しない場合、接続が失敗します。
tr_tr: Her küme düğümünde aynı ismi kullanmalısınız. Bu değer eşleşmediğinde bağlantı başarısız olur.

source: You only need to do this on one cluster node. Galera Cluster replicates the user to all the others.
ja: どれか 1 つのクラスターノードにおいてのみ実行する必要があります。Galera Cluster が、他のすべてのノードにユーザーを複製します。
tr_tr: Bunu yalnızca tek bir küme düğümünde yapmanız gerekir. Galera Kümesi kullanıcıyı diğerlerine çoğaltır.

source: You should see a ``status=joined`` entry for each of your constituent cluster nodes.
ja: 構成している各クラスターノードが ``status=joined`` になっているはずです。
tr_tr: Kurucu küme düğümlerinizin her biri için bir ``durum=katıldı`` girdisi görmelisiniz.

source: You would choose this option if you prefer to have fewer but more powerful boxes.
ja: より少数の高性能なマシンを好む場合、この選択肢を選択するでしょう。
tr_tr: Bu seçeneği daha az ama daha güçlü kutuları tercih ettiğinizde seçmeniz mantıklıdır.

source: You would choose this option if you prefer to have more but less powerful boxes.
ja: より多数の低性能なマシンを好む場合、この選択肢を選択するでしょう。
tr_tr: Bu seçeneği daha fazla sayıda ama daha güçsüz kutuları tercih ettiğinizde seçmeniz mantıklıdır.

source: Your OpenStack services must now point their Block Storage API configuration to the highly available, virtual cluster IP address rather than a Block Storage API server’s physical IP address as you would for a non-HA environment.
ja: OpenStack サービスは、非 HA 環境と同じように Block Storage API サーバーの物理 IP アドレスを指定する代わりに、Block Storage API の設定が高可用性と仮想クラスター IP アドレスを指し示す必要があります。
tr_tr: OpenStack servisleriniz artık Blok Depolama API yapılandırmalarını yüksek kullanılabilir olmayan bir ortamdaki gibi Blok Depolama API sunucusunun IP adresi yerine yüksek kullanılır, sanal küme IP adresine çevirmelidir.

source: Your OpenStack services must now point their OpenStack Identity configuration to the highly available virtual cluster IP address rather than point to the physical IP address of an OpenStack Identity server as you would do in a non-HA environment.
ja: OpenStack サービスが、非 HA 環境であるような OpenStack Identity サーバーの物理 IP アドレスを指し示す代わりに、高可用性な仮想クラスター IP アドレスを指し示すように、それらの OpenStack Identity の設定を変更する必要があります。

source: Your OpenStack services must now point their OpenStack Image API configuration to the highly available, virtual cluster IP address instead of pointint to the physical IP address of an OpenStack Image API server as you would in a non-HA cluster.
ja: OpenStack サービスが、非 HA クラスターであるような OpenStack Image API サーバーの物理 IP アドレスを指し示す代わりに、高可用性な仮想クラスター IP アドレスを指し示すように、それらの OpenStack Image API の設定を変更する必要があります。

source: Your OpenStack services must now point their Shared File Systems API configuration to the highly available, virtual cluster IP address rather than a Shared File Systems API server’s physical IP address as you would for a non-HA environment.
ja: OpenStack サービスは、通常の非高可用性環境のように、Shared File Systems API サーバーの物理 IP アドレスを指定する代わりに、Shared File Systems API の設定が高可用性と仮想クラスター IP アドレスを指し示す必要があります。
tr_tr: OpenStack servisleriniz artık Paylaşımlı Dosya Sistemleri API yapılandırmalarını yüksek kullanılabilir olmayan bir ortamdaki gibi Paylaşımlı Dosya Sistemleri API sunucusunun fiziksel IP adresi yerine yüksek kullanılabilir, sanal küme IP adresine çevirmelidir.

source: `CentOS and RHEL <http://docs.openstack.org/liberty/install-guide-rdo/environment.html>`_
ja: `CentOS および RHEL <http://docs.openstack.org/liberty/install-guide-rdo/environment.html>`_

source: `Ceph RBD <http://ceph.com/>`_ is an innately high availability storage back end. It creates a storage cluster with multiple nodes that communicate with each other to replicate and redistribute data dynamically. A Ceph RBD storage cluster provides a single shared set of storage nodes that can handle all classes of persistent and ephemeral data -- glance, cinder, and nova -- that are required for OpenStack instances.
ja: `Ceph RBD <http://ceph.com/>`_ は、本質的に高可用性なストレージバックエンドです。複数のノードを用いてストレージクラスターを作成し、お互いに通信して動的にレプリケーションとデータ再配布を実行します。Ceph RBD ストレージクラスターは、OpenStack インスタンスに必要となる、すべての種類の永続データと一時データ (glance、cinder、nova) を取り扱える、単一の共有ストレージノードを提供します。

source: `Debian and Ubuntu <http://www.rabbitmq.com/install-debian.html>`_
ja: `Debian および Ubuntu <http://www.rabbitmq.com/install-debian.html>`_

source: `Galera Cluster for MySQL <http://galeracluster.com/>`_ The MySQL reference implementation from Codership, Oy;
ja: `Galera Cluster for MySQL <http://galeracluster.com/>`_ Codership, Oy による MySQL リファレンス実装

source: `MariaDB Galera Cluster <https://mariadb.org/>`_ The MariaDB implementation of Galera Cluster, which is commonly supported in environments based on Red Hat distributions;
ja: `MariaDB Galera Cluster <https://mariadb.org/>`_ Galera Cluster の MariaDB 実装、一般的に Red Hat 系ディストリビューションの環境においてサポートされます

source: `Pacemaker <http://clusterlabs.org/>`_ cluster stack is the state-of-the-art high availability and load balancing stack for the Linux platform. Pacemaker is useful to make OpenStack infrastructure highly available. Also, it is storage and application-agnostic, and in no way specific to OpenStack.
ja: `Pacemaker <http://clusterlabs.org/>`_ クラスタースタックは、Linux プラットフォーム向けの最高水準の高可用性と負荷分散を実現します。Pacemaker は OpenStack インフラを高可用化するために役立ちます。また、ストレージとアプリケーションから独立していて、OpenStack 特有の方法はありません。

source: `Percona XtraDB Cluster <http://www.percona.com/>`_ The XtraDB implementation of Galera Cluster from Percona.
ja: `Percona XtraDB Cluster <http://www.percona.com/>`_ Percona による Galera Cluster の XtraDB 実装

source: `Provider networks <http://docs.openstack.org/liberty/install-guide-ubuntu/overview.html#networking-option-1-provider-networks>`_
ja: `プロバイダーネットワーク <http://docs.openstack.org/liberty/install-guide-ubuntu/overview.html#networking-option-1-provider-networks>`_

source: `RPM based <http://www.rabbitmq.com/install-rpm.html>`_ (RHEL, Fedora, CentOS, openSUSE)
ja: `RPM ベース <http://www.rabbitmq.com/install-rpm.html>`_ (RHEL, Fedora, CentOS, openSUSE)

source: `Self-service networks <http://docs.openstack.org/liberty/install-guide-ubuntu/overview.html#networking-option-2-self-service-networks>`_
ja: `セルフサービスネットワーク <http://docs.openstack.org/liberty/install-guide-ubuntu/overview.html#networking-option-2-self-service-networks>`_

source: ``last_man_standing_window`` specifies the time, in milliseconds, required to recalculate quorum after one or more hosts have been lost from the cluster. To do the new quorum recalculation, the cluster must have quorum for at least the interval specified for ``last_man_standing_window``; the default is 10000ms.
ja: ``last_man_standing_window`` は、1 つ以上のホストがクラスターから失われた後、クォーラムを再計算するために必要となる時間をミリ秒単位で指定します。新しくクォーラムを再計算するために、クラスターは少なくとも ``last_man_standing_window`` に指定された間隔はクォーラムを保持する必要があります。デフォルトは 10000ms です。

source: ``nodeid`` is optional when using IPv4 and required when using IPv6. This is a 32-bit value specifying the node identifier delivered to the cluster membership service. If this is not specified with IPv4, the node id is determined from the 32-bit IP address of the system to which the system is bound with ring identifier of 0. The node identifier value of zero is reserved and should not be used.
ja: ``nodeid`` は、IPv4 を使用するときにオプション、IPv6 を使用するときに必須です。クラスターメンバーシップサービスに配信される、ノード識別子を指定する 32 ビットの値です。IPv4 で指定されていない場合、ノード ID は、システムがリング識別子 0 に割り当てた 32 ビットの IP アドレスになります。ノード識別子の値 0 は、予約済みであり、使用してはいけません。

source: ``ring{X}_addr`` specifies the IP address of one of the nodes. {X} is the ring number.
ja: ``ring{X}_addr`` は、1 つのノードの IP アドレスを指定します。{X} はリングの番号です。

source: `openSUSE and SUSE Linux Enterprise Server <http://docs.openstack.org/liberty/install-guide-obs/environment.html>`_
ja: `openSUSE、SUSE Linux Enterprise Server <http://docs.openstack.org/liberty/install-guide-obs/environment.html>`_

source: compute node
ja: コンピュートノード
tr_tr: hesaplama düğümü

source: controller node
ja: コントローラーノード
tr_tr: kontrol düğümü

source: fence-agents (CentOS or RHEL) or cluster-glue
ja: fence-agents (CentOS、RHEL) または cluster-glue

source: pcs (CentOS or RHEL) or crmsh
ja: pcs (CentOS、RHEL) または crmsh

source: **Cluster Address**: List the IP addresses for each cluster node.
tr_tr: **Küme Adresi**: Her küme düğümü için IP adreslerini listeleyin.

source: **Cluster Name**: Define an arbitrary name for your cluster.
tr_tr: **Küme İsmi**: Kümeniz için isteğe göre bir isim tanımlayın.

source: **Corosync configuration file fragment for unicast (``corosync.conf``)**
tr_tr: **Corosync yapılandırma dosyası tekil yayın içi parçalanır (``corosync.conf``)**

source: **Example Corosync configuration file for multicast (``corosync.conf``)**
tr_tr: **Çoklu yayın için örnek Corosync yapılandırma dosyası (``corosync.conf``)**

source: **Node Address**: Define the IP address of the cluster node.
tr_tr: **Düğüm Adresi**: Küme düğümünün IP adresini tanımlayın.

source: **Node Name**: Define the logical name of the cluster node.
tr_tr: **Düğüm İsmi**: Küme düğümünün mantıksal ismini tanımlayın.

source: **wsrep Provider**: The Galera Replication Plugin serves as the ``wsrep`` provider for Galera Cluster. It is installed on your system as the ``libgalera_smm.so`` file. Define the path to this file in your ``my.cnf``:
tr_tr: **wsrep Sağlayıcı**: Galera Çoğaltma Eklentisi Galera Kümesi için ``wsrep`` sağlayıcı olarak çalışır. Sisteminizde ``libgalera_smm.so`` dosyası olarak yüklüdür. ``my.cnf`` dosyanızda bu dosyanın yolunu tanımlayın:

source: :doc:`Networking DHCP agent<networking-ha-dhcp>`
tr_tr: :doc:`Ağ DHCP aracısı<networking-ha-dhcp>`

source: :doc:`Neutron L3 agent<networking-ha-l3>`
tr_tr: :doc:`Neutron L3 aracısı<networking-ha-l3>`

source: :ref:`Configure OpenStack services to use RabbitMQ HA queues <rabbitmq-services>`
tr_tr: :ref:`OpenStack servislerini RabbitMQ HA kuyrukları kullanacak şekilde yapılandır <rabbitmq-services>`

source: A minimum of three hosts
tr_tr: En az üç sunucu

source: A sample votequorum service configuration in the :file:`corosync.conf` file is:
tr_tr: :file:`corosync.conf` dosyasında örnek bir votequorum servis yapılandırması şöyledir:

source: A service that provides a response after your request and then requires no further attention. To make a stateless service highly available, you need to provide redundant instances and load balance them. OpenStack services that are stateless include ``nova-api``, ``nova-conductor``, ``glance-api``, ``keystone-api``, ``neutron-api``, and ``nova-scheduler``.
tr_tr: İsteğinizden sonra bir yanıt sağlayan ve ardından başka ilgi beklemeyen bir servis. Durumsuz bir servisi yüksek kullanılabilir yapmak için, yedekli sunucular kullanmalı ve yük dengelemesi kullanmalısınız. Durumsuz OpenStack servisleri ``nova-api``, ``nova-conductor``, ``glance-api``, ``keystone-api``, ``neutron-api``, ve ``nova-scheduler``i içerir.

source: A service where subsequent requests to the service depend on the results of the first request. Stateful services are more difficult to manage because a single action typically involves more than one request. Providing additional instances and load balancing does not solve the problem. For example, if the horizon user interface reset itself every time you went to a new page, it would not be very useful. OpenStack services that are stateful include the OpenStack database and message queue. Making stateful services highly available can depend on whether you choose an active/passive or active/active configuration.
tr_tr: Servise yapılan sıralı isteklerin ilk isteğin sonucuna bağlı olması. Durumsal servisleri yönetmesi daha zordur çünkü tek bir eylem genellikle bir istekten fazlasını içerir. Ek sunucular ve yük dengeleme eklemek sorunu çözmez. Örneğin horizon kullanıcı arayüzü her yeni sayfa istediğinizde kendisini sıfırlasa pek faydalı olmaz. OpenStack servislerini yüksek kullanılır yapmak etkin/pasif veya etkin/etkin yapılandırma seçmenize bağlı olarak değişebilir.

source: A shared implementation and calculation of `quorum <https://en.wikipedia.org/wiki/Quorum_(Distributed_Systems)>`_
tr_tr: `Yetersayının <https://en.wikipedia.org/wiki/Quorum_(Distributed_Systems)>`_ paylaşımlı uygulanması ve hesaplanması

source: A single application does not have sufficient context to know the difference between failure of a machine and failure of the application on a machine. The usual practice is to assume the machine is dead and continue working, however this is highly risky. A rogue process or machine could still be responding to requests and generally causing havoc. The safer approach is to make use of remotely accessible power switches and/or network switches and SAN controllers to fence (isolate) the machine before continuing.
tr_tr: Tek bir uygulama bir makinenin arızası ve makine üzerindeki uygulamanın arızası arasındaki farkı bilmek için yeterli içeriğe sahip değildir. Yaygın olarak makinenin ölü olduğu varsayılır, ancak bunun riski yüksektir. Yaramaz bir süreç veya makine hala isteklere yanıt veriyor ve büyük hasara sebep oluyor olabilir. Güvenli yaklaşım uzaktan erişilebilir güç anahtarlarını ve/veya ağ anahtalarını ve SAN denetleyicilerini kullanarak makineyi devam etmeden önce parmaklığa almaktır (yalıtım).

source: A typical active/passive installation for a stateful service maintains a replacement resource that can be brought online when required. Requests are handled using a :term:`virtual IP address (VIP)` that facilitates returning to service with minimal reconfiguration. A separate application (such as Pacemaker or Corosync) monitors these services, bringing the backup online as necessary.
tr_tr: Durumsal bir servis için tipik bir etkin/pasif kurulum gerektiğinde çevrimiçi yapılabilecek yedek bir kaynak bakımı da yapar. İstekler servise asgari yeniden yapılandırma ile dönen bir :term:`sanal IP adresi (VIP)` tarafından ele alınır. Ayrı bir uygulama (Pacemaker veya Corosync gibi) bu servisleri izler, gerektiğinde yedeği çevrimiçi yapar.

source: Access to Memcached is not handled by HAProxy because replicated access is currently in an experimental state. Instead, OpenStack services must be supplied with the full list of hosts running Memcached.
tr_tr: Memcached erişimi HAProxy tarafından ele alınmaz çünkü yedekli erişim şu an deneysel bir durumda. Bunun yerine, OpenStack servislerineMemcached çalıştıran tüm sunucuların listesi verilmelidir.

source: Access to RabbitMQ is not normally handled by HAProxy. Instead, consumers must be supplied with the full list of hosts running RabbitMQ with ``rabbit_hosts`` and turn on the ``rabbit_ha_queues`` option. For more information, read the `core issue <http://people.redhat.com/jeckersb/private/vip-failover-tcp-persist.html>`_. For more detail, read the `history and solution <http://john.eckersberg.com/improving-ha-failures-with-tcp-timeouts.html>`_.
tr_tr: RabbitMQ erişimi normalde HAProxy tarafından ele alınmaz. Bunun yerine tüketicilere RabbitMQ çalıştıran sunucuların tam listesi ``rabbit_hosts`` ile verilmeli ve ``rabbit_ha_queues`` seçeneği açık olmalıdır. Daha fazla bilgi için `okuyunuz <http://people.redhat.com/jeckersb/private/vip-failover-tcp-persist.html>`_. Daha fazla ayrıntı için, `geçmiş ve çözümü <http://john.eckersberg.com/improving-ha-failures-with-tcp-timeouts.html>`_ okuyun.

source: Active/passive versus active/active
tr_tr: Etkin/pasif karşısında etkin/etkin

source: Add HAProxy to the cluster and ensure the VIPs can only run on machines where HAProxy is active:
tr_tr: HAProxy'i kümeye ekleyin ve VIP'lerin yalnızca HAProxy'nin etkin olduğu makinelerde çalıştığından emin olun:

source: Add the Pacemaker configuration for the OpenStack Identity resource by running the following command to connect to the Pacemaker cluster:
tr_tr: OpenStack Kimlik kaynağı için Pacemaker yapılandırmasını Pacemaker kümesine bağlanmak için aşağıdaki komutları çalıştırarak ekleyin:

source: Add the Pacemaker configuration for the OpenStack Image API resource. Use the following command to connect to the Pacemaker cluster:
tr_tr: OpenStack İmaj API kaynağı için Pacemaker yapılandırmasını ekleyin. Pacemaker kümesine bağlanmak için aşağıdaki komutu kullanın:

source: Add the Pacemaker configuration for the Shared File Systems API resource. Connect to the Pacemaker cluster with the following command:
tr_tr: Paylaşımlı Dosya Sistemleri API kaynağı için Pacemaker yapılandırmasını ekleyin. Aşağıdaki komut ile Pacemaker kümesine bağlanın:

source: Add the following cluster resources:
tr_tr: Şu küme kaynaklarını ekleyin:

source: After the ``corosync`` service have been started and you have verified that the cluster is communicating properly, you can start :command:`pacemakerd`, the Pacemaker master control process. Choose one from the following four ways to start it:
tr_tr: ``corosync`` servisini başlatıp kümenin düzgün iletişim sürdürdüğünü doğruladıktan sonra, Pacemaker ana kontrol süreci :command:`pacemakerd`yi başlatabilirsiniz. Başlatmak için aşağıdaki dört yoldan birini seçin:

source: After the ``pacemaker`` service has started, Pacemaker creates a default empty cluster configuration with no resources. Use the :command:`crm_mon` utility to observe the status of ``pacemaker``:
tr_tr: ``pacemaker`` servisi başladıktan sonra, Pacemaker kaynakları olmayan öntanımlı boş bir küme yapılandırması oluşturur. ``pacemaker`` durumunu gözetlemek için :command:`crm_mon` aracını kullanın:

source: After you make these changes, commit the updated configuration.
tr_tr: Bu değişiklikleri yaptıktan sonra, güncel yapılandırmayı gönderin.

source: After you set up your Pacemaker cluster, set a few basic cluster properties:
tr_tr: Pacemaker kümenizi ayarladıktan sonra, temel birkaç küme özelliğini ayarlayın:

source: Almost all services in this stack benefit from being proxied. Using a proxy server provides the following capabilities:
tr_tr: Bu yığındaki rerdeyse tüm servisler vekillenmekten faydalanır. Vekil sunucu kullanmak şu yetenekleri sağlar:

source: Alternatively, make modifications using the ``firewall-cmd`` utility for FirewallD that is available on many Linux distributions:
tr_tr: Alternatif olarak, çoğu Linux dağıtımında kullanılabilir olan FirewallID için ``firewall-cmd`` aracını kullanarak değişiklikler yapın:

source: Alternatively, you can use a commercial load balancer, which is hardware or software. We recommend a hardware load balancer as it generally has good performance.
tr_tr: Alternatif olarak, donanımsal veya yazılımsal ticari bir yük dengeleyici kullanabilirsiniz. Genellikle daha iyi başarımı olduğundan donanımsal bir yük dengeleyici öneriyoruz.

source: Alternatively:
tr_tr: Alternatif olarak:

source: Appendix
tr_tr: Ek Bölüm

source: As another option to make RabbitMQ highly available, RabbitMQ contains the OCF scripts for the Pacemaker cluster resource agents since version 3.5.7. It provides the active/active RabbitMQ cluster with mirrored queues. For more information, see `Auto-configuration of a cluster with a Pacemaker <https://www.rabbitmq.com/pacemaker.html>`_.
tr_tr: RabbitMQ'yu yüksek kullanılır yapmak için başka bir seçenek de, RabbitMQ'nun 3.5.7 sürümünden itibaren Pacemaker küme kaynak aracıları için içerdiği OCF betikleridir. Etkin/etkin RabbitMQ kümesine yansılı kuyruklar sağlar. Daha fazla bilgi için `Pacemaker ile bir kümenin otomatik yapılandırılmasına <https://www.rabbitmq.com/pacemaker.html>`_ göz atın.
