Repository: openstack/openstack-manuals
Catalog: doc/ha-guide/source/locale/*/LC_MESSAGES/ha-guide.po
Languages: ja, tr_tr

source: While all of the configuration parameters available to the standard MySQL, MariaDB, or Percona XtraDB database servers are available in Galera Cluster, there are some that you must define an outset to avoid conflict or unexpected behavior.
tr_tr: Standart MySQL, MariaDB veya Percona XtraDB veritabanı sunucularında kullanılabilir tüm yapılandırma parametreleri Galera Kümesinde de kullanılabilir olsa da, çakışmayı ya da beklenmedik davranışları önlemek için kullanmamanız gereken bazıları vardır.

source: With ``secauth`` enabled, Corosync nodes mutually authenticates using a 128-byte shared secret stored in the :file:`/etc/corosync/authkey` file. This can be generated with the :command:`corosync-keygen` utility. Cluster communications are encrypted when using ``secauth``.
tr_tr: ``secauth`` etkin olduğunda, Corosync düğümleri karşılıklı olarak :file:`/etc/corosync/authkey` dosyasında bulunan 128-bayt paylaşımlı bir gizi kullanarak kimlik doğrular. Bu :command:`corosync-keygen` aracı ile üretilebilir. Küme iletişimi ``secauth`` kullanıldığında şifrelidir.

source: With this in mind, some vendors are restricting Pacemaker's use to services that must operate in an active/passive mode (such as ``cinder-volume``), those with multiple states (for example, Galera), and those with complex bootstrapping procedures (such as RabbitMQ).
tr_tr: Bunun yanında bazı üreticiler Pacemaker'in etkin/pasif kipinde çalışması gereken servislerlere (``cinder-volume`` gibi), çoklu duruma sahip olanlara (örneğin, Galera), ve karmaşık önyükleme yordamlarına sahip olanlarına (örneğin RabbitMQ) kullanımını kısıtlıyorlar.

source: Work is in progress on a unified approach, which combines the best aspects of existing upstream solutions. More details are available on `the HA VMs user story wiki <https://wiki.openstack.org/wiki/ProductTeam/User_Stories/HA_VMs>`_.
tr_tr: İş birleştirilmiş bir yaklaşımla sürmektedir, bu da mevcut çözümlerin en iyi yönlerini birleştirir. Daha fazla ayrıntı `Yüksek kullanılırlıklı sanal makineler kullanıcı hikayesi wiki'sinde <https://wiki.openstack.org/wiki/ProductTeam/User_Stories/HA_VMs>`_ bulunabilir.

source: You can also ensure the availability by other means, using Keepalived or Pacemaker.
tr_tr: Kullanılırlığı Keepalived veya Pacemaker kullanarak başka yollarla da sağlayabilirsiniz.

source: You can have up to 16 cluster members (this is currently limited by the ability of corosync to scale higher). In extreme cases, 32 and even up to 64 nodes could be possible. However, this is not well tested.
tr_tr: En fazla 16 küme ögesine sahip olabilirsiniz (bu şu anda corosync'in daha yukarı ölçekleme yeteneği tarafından kısıtlanıyor). Uç durumlarda, 32 ve hatta 64 düğüm mümkün olabilir. Ancak bu iyi denenmemiştir.

source: You can now check the ``corosync`` connectivity with one of these tools.
tr_tr: Artık ``corosync`` bağlantısını şu araçlardan biriyle kontrol edebilirsiniz.

source: You can take periodic snap shots throughout the installation process and roll back to a working configuration in the event of a problem.
tr_tr: Kurulum sürecinde aralıklarla anlık görüntüler alabilir ve sorun olması durumunda çalışan bir yapılandırmaya dönebilirsiniz.

source: You can use the `ping` command to find the latency between two servers.
tr_tr: İki sunucu arasındaki gecikmeyi bulmak için `ping` komutunu kullanabilirsiniz.

source: You must also create the OpenStack Image API endpoint with this IP address. If you are using both private and public IP addresses, create two virtual IP addresses and define your endpoint. For example:
tr_tr: Ayrıca OpenStack İmaj API uç noktasını da bu adresle oluşturmalısınız. Hem özel hem açık IP adresleri kullanıyorsanız, iki sanal IP adresi oluşturup uç noktanızı tanımlayın. Örneğin:

source: You must configure NTP to properly synchronize services among nodes. We recommend that you configure the controller node to reference more accurate (lower stratum) servers and other nodes to reference the controller node. For more information, see the `Installation Tutorials and Guides <https://docs.openstack.org/ocata/install/>`_.
tr_tr: Düğümler arası servisleri üzgün eşzamanlamak için NTP yapılandırmalısınız. Kontrol düğümünü daha doğru (düşük katmanlı) sunucuları diğer sunucuları ise kontrol düğümünü kaynak alacak şekilde yapılandırmanızı öneririz. Daha fazla bilgi için, `Kurulum Öğreticileri ve Kılavuzlarına <https://docs.openstack.org/ocata/install/>`_ göz atın.

source: You will need to address high availability concerns for any applications software that you run on your OpenStack environment. The important thing is to make sure that your services are redundant and available. How you achieve that is up to you.
tr_tr: OpenStack ortamınızda çalıştırdığınız tüm uygulama yazılımları için yüksek kullanılırlık endişelerini gidermeniz gerekir. Önemli olan servislerinizin yedekli ve kullanılabilir olduğundan emin olmaktır. Bunu nasıl elde edeceğiniz size kalmış.

source: Your OpenStack services must now point their OpenStack Image API configuration to the highly available, virtual cluster IP address instead of pointing to the physical IP address of an OpenStack Image API server as you would in a non-HA cluster.
tr_tr: OpenStack servisleriniz artık OpenStack İmaj API yapılandırmasını yüksek kullanılır olmayan bir ortamdaki gibi OpenStack İmaj API sunucusunun fiziksel IP adresine değil yüksek kullanılır, sanal küme IP adresine çevirmelidir.

source: Your OpenStack services now point their OpenStack Identity configuration to the highly available virtual cluster IP address.
tr_tr: OpenStack servisleriniz artık OpenStack Kimlik yapılandırmalarını yüksek kullanılırlıklı sanal küme IP adresine işaret ettiriyor.

source: [TODO: need more discussion of these parameters]
tr_tr: [YAPILACAK: bu parametrelerle ilgili daha fazla tartışmak gerek]

source: `Ceph RBD <https://ceph.com/>`_ is an innately high availability storage back end. It creates a storage cluster with multiple nodes that communicate with each other to replicate and redistribute data dynamically. A Ceph RBD storage cluster provides a single shared set of storage nodes that can handle all classes of persistent and ephemeral data (glance, cinder, and nova) that are required for OpenStack instances.
tr_tr: `Ceph RBD <https://ceph.com/>`_ doğuştan yüksek kullanılabilirliğe sahip depolama arka ucudur. Veriyi dinamik olarak birbiri arasında yeniden dağıtan birçok düğümden oluşan bir depolama kümesi oluşturur. Bir Ceph RBD depolama kümesi OpenStack sunucuları tarafından ihtiyaç duyulan her sınıf kalıcı ya da geçici (glance, cinder ve nova) veriyi ele alabilen paylaşımlı depolama düğümleri kümesini sağlar.

source: `Clustering Guide <https://www.rabbitmq.com/clustering.html>`_
tr_tr: `Kümeleme Kılavuzu <https://www.rabbitmq.com/clustering.html>`_

source: `Debian and Ubuntu <https://www.rabbitmq.com/install-debian.html>`_
tr_tr: `Debian ve Ubuntu <https://www.rabbitmq.com/install-debian.html>`_

source: `Galera Cluster for MySQL <http://galeracluster.com>`_: The MySQL reference implementation from Codership, Oy.
tr_tr: `MySQL için Galera Kümesi <http://galeracluster.com>`_: Codership, Oy'den MySQL başvuru uygulaması.

source: `Highly Available Queues <https://www.rabbitmq.com/ha.html>`_
tr_tr: `Yüksek Kullanılır Kuyruklar <https://www.rabbitmq.com/ha.html>`_

source: `IMPORTANT: MySQL Galera does *not* support SELECT ... FOR UPDATE <http://lists.openstack.org/pipermail/openstack-dev/2014-May/035264.html>`_
tr_tr: `ÖNEMLİ: MySQL Galera SELECT ... FOR UPDATE *desteklemez* <http://lists.openstack.org/pipermail/openstack-dev/2014-May/035264.html>`_

source: `MariaDB Galera Cluster <https://mariadb.org>`_: The MariaDB implementation of Galera Cluster, which is commonly supported in environments based on Red Hat distributions.
tr_tr: `MariaDB Galera Kümesi <https://mariadb.org>`_: Galera Kümesinin MariaDB uygulaması, genellikle Red Hat dağıtımı tabanlı ortamlarda desteklenir.

source: `OCF RAs <https://aspiers.github.io/openstack-summit-2016-austin-compute-ha/#/ocf-pros-cons>`_, as used by Red Hat and SUSE
tr_tr: Red Hat ve SUSE tarafından kullanılan şekliyle `OCF RA'ları <https://aspiers.github.io/openstack-summit-2016-austin-compute-ha/#/ocf-pros-cons>`_

source: `Pacemaker <http://clusterlabs.org/>`_ cluster stack is a state-of-the-art high availability and load balancing stack for the Linux platform. Pacemaker is used to make OpenStack infrastructure highly available.
tr_tr: `Pacemaker <http://clusterlabs.org/>`_ küme yığını Linux platformu için modern bir yüksek kullanılırlık ve yük dengeleme yığınıdır. Pacemaker OpenStack alt yapısını yüksek kullanılır yapmak için kullanılır.

source: `Percona XtraDB Cluster <https://www.percona.com>`_: The XtraDB implementation of Galera Cluster from Percona.
tr_tr: `Percona XtraDB Kümesi <https://www.percona.com>`_: Percona'dan Galera Kümesi için XtraDB uygulaması.

source: `RPM based <https://www.rabbitmq.com/install-rpm.html>`_ (RHEL, Fedora, CentOS, openSUSE)
tr_tr: `RPM tabanlı <https://www.rabbitmq.com/install-rpm.html>`_ (RHEL, Fedora, CentOS, openSUSE)

source: `Understanding reservations, concurrency, and locking in Nova <http://www.joinfu.com/2015/01/understanding-reservations-concurrency-locking-in-nova/>`_
tr_tr: `Nova'da yer ayırmaların, aynı anda kullanımın ve kilitlerin anlaşılması <http://www.joinfu.com/2015/01/understanding-reservations-concurrency-locking-in-nova/>`_

source: ``last_man_standing_window`` specifies the time, in milliseconds, required to recalculate quorum after one or more hosts have been lost from the cluster. To perform a new quorum recalculation, the cluster must have quorum for at least the interval specified for ``last_man_standing_window``. The default is 10000ms.
tr_tr: ``last_man_standing_window`` bir ya da daha fazla sunucu kümeden kaybolduğunda yetersayıyı tekrar hesaplamak için gerekli sürenin milisaniye cinsinden değeridir. Yeni bir yetersayı hesaplaması yapmak için, küme en az ``last_man_standing_window`` değerinde belirtilen aralık kadar beklemelidir. Öntanımlı değer 10000 ms'dir.

source: ``nodeid`` is optional when using IPv4 and required when using IPv6. This is a 32-bit value specifying the node identifier delivered to the cluster membership service. If this is not specified with IPv4, the node ID is determined from the 32-bit IP address of the system to which the system is bound with ring identifier of 0. The node identifier value of zero is reserved and should not be used.
tr_tr: ``nodeid`` IPv4 kullanırken isteğe bağlı, IPv6 kullanırken gereklidir. Küme üyelik servisine gönderilen düğüm tanımlayıcısını belirten 32-bit bir değerdir. IPv4 ile bu değer belirtilmezse, düğüm kimliği sistemin 0 halka tanımlayıcısı ile bağlı bulunduğu sistemin 32-bit IP adresinden karar verilir. Düğüm tanımlayıcı değeri olan sıfır ayrılmıştır, ve kullanılmamalıdır.

source: ``ring{X}_addr`` specifies the IP address of one of the nodes. ``{X}`` is the ring number.
tr_tr: ``ring{X}_addr`` düğümlerden birinin IP adresini belirtir. ``{X}`` halka numarasıdır.

source: `a mistral-based auto-recovery workflow <https://github.com/gryf/mistral-evacuate>`_, by Intel
tr_tr: Intel tarafından `mistral-tabanlı otomatik kurtarma iş akışı <https://github.com/gryf/mistral-evacuate>`_

source: `fence-agents` (CentOS or RHEL) or cluster-glue
tr_tr: `fence-agents` (CentOS veya RHEL) veya cluster-glue

source: `masakari <https://launchpad.net/masakari>`_, by NTT
tr_tr: NTT tarafından `masakari <https://launchpad.net/masakari>`_

source: `pcs` (CentOS or RHEL) or crmsh
tr_tr: `pcs` (CentOS veya RHEL) veya crmsh
