Repository: openstack/openstack-manuals
Catalog: doc/ha-guide/source/locale/*/LC_MESSAGES/ha-guide.po
Languages: ja, tr_tr

source: Galera Cluster is not available in the base repositories of Linux distributions. In order to install it with your package manage, you must first enable the repository on your system. The particular methods for doing so vary depending on which distribution you use for OpenStack and which database server you want to use.
ja: Galera Cluster は、Linux ディストリビューションの標準リポジトリーにおいて利用できません。パッケージ管理機能を用いてインストールするために、まずお使いのシステムにおいてリポジトリーを有効化する必要があります。具体的な手順は、OpenStack のために使用するディストリビューション、使用したいデータベースサーバーによりかなり異なります。

source: Galera Cluster is now installed on your system. You must repeat this process for each controller node in your cluster.
ja: これで Galera Cluster がお使いのシステムにインストールされました。クラスター内のすべてのコントローラーに、このプロセスを繰り返す必要があります。

source: Galera Cluster requires that you open four ports to network traffic:
ja: Galera Cluster は、ネットワーク通信のために 4 つのポートを開く必要があります。

source: Galera can be configured using one of the following strategies:
ja: Galera は、以下の方法のどれかにより設定できます。
tr_tr: Galera aşağıdaki stratejilerden biri kullanılarak yapılandırılabilir:

source: Galera runs behind HAProxy.
ja: Galera は HAProxy の後ろで動作します

source: Galera synchronous replication guarantees a zero slave lag. The failover procedure completes once HAProxy detects that the active back end has gone down and switches to the backup one, which is then marked as 'UP'. If no back ends are up (in other words, the Galera cluster is not ready to accept connections), the failover procedure finishes only when the Galera cluster has been successfully reassembled. The SLA is normally no more than 5 minutes.
ja: Galera の同期レプリケーションは、スレーブのラグがないことを保証します。フェイルオーバー手順は、アクティブなバックエンドがダウンしたことを HAProxy が検知すると、バックアップに切り替え、「UP」状態になります。バックエンドが UP にならない場合、つまり Galera クラスターが接続を受け付ける準備ができていない場合、Galera クラスターが再び正常に再構成された場合のみ、フェイルオーバー手順が完了します。SLA は、通常 5 分以内です。

source: Get a list of nodes known to the quorum service
ja: クォーラムサービスが把握しているノード一覧の取得

source: HAProxy load balances incoming requests and exposes just one IP address for all the clients.
ja: HAProxy は、受信リクエストを負荷分散して、すべてのクライアントに 1 つの IP アドレスを公開します。
tr_tr: HAProxy gelen isteklerin yükünü dengeler ve istemciler için yalnızca bir IP adresi sunar.

source: HAProxy provides a fast and reliable HTTP reverse proxy and load balancer for TCP or HTTP applications. It is particularly suited for web crawling under very high loads while needing persistence or Layer 7 processing. It realistically supports tens of thousands of connections with recent hardware.
ja: HAProxy は、TCP や HTTP ベースのアプリケーションに、高速かつ高信頼な HTTP リバースプロキシーとロードバランサーを提供します。とくに、永続性や L7 処理を必要とする、非常に高負荷な Web サイトに適しています。最近のハードウェアを用いると、数千の接続を現実的にサポートします。
tr_tr: HAProxy TCP ve HTTP uygulamalar için hızlı ve güvenilir HTTP ters vekili sağlar. Kalıcılık ve Katman 7 işleme ihtiyacı duyulan çok yüksek yüklerde web yürütmelerine özellikle uygundur. Güncel donanımla gerçekçi bir şekilde on binlerce bağlantıyı destekler.

source: HAProxy should not be a single point of failure. It is advisable to have multiple HAProxy instances running, where the number of these instances is a small odd number like 3 or 5. You need to ensure its availability by other means, such as Keepalived or Pacemaker.
ja: HAProxy は単一障害点になってはいけません。HAProxy のインスタンスは 3台 または 5台のような奇数の複数台構成にすることを推奨します。Keepalived や Pacemaker などの他の手段により、可用性を保証する必要があります。

source: Hardware considerations for high availability
ja: 高可用性のためのハードウェア考慮事項
tr_tr: Yüksek kullanılırlık için donanım etmenleri

source: Hardware setup
ja: ハードウェアのセットアップ
tr_tr: Donanım kurulumu

source: Here is an example ``/etc/haproxy/haproxy.cfg`` configuration file. You need a copy of it on each controller node.
ja: これは ``/etc/haproxy/haproxy.cfg`` 設定ファイルの例です。各コントローラーノードにコピーする必要があります。

source: High availability concepts
ja: 高可用性の概念

source: High availability for other components
ja: 他のコンポーネントの高可用性

source: High availability is not for every user. It presents some challenges. High availability may be too complex for databases or systems with large amounts of data. Replication can slow large systems down. Different setups have different prerequisites. Read the guidelines for each setup.
ja: 高可用性はあらゆるユーザー向けではありません。いくつかの挑戦を妨害します。高可用性は、大量のデータを持つデータベースやシステムをあまりに複雑にする可能性があります。レプリケーションは大規模システムをスローダウンさせる可能性があります。異なるセットアップには、異なる事前要件があります。各セットアップのガイドラインを参照してください。
tr_tr: Yüksek kullanılırlık her kullanıcı için değildir. Bazı zorlukları beraberinde getirir. Yüksek kullanılırlık veritabanları veya büyük miktarda veriye sahip sistemlerde çok karmaşık olabilir. Çoğaltma işlemi büyük sistemleri yavaşlatabilir. Farklı kurulumların farklı ön gereksinimleri bulunur. Her bir kurulum için kılavuzları okuyun.

source: High availability is turned off as the default in OpenStack setups.
ja: 高可用性は、デフォルトの OpenStack セットアップで無効化されています。
tr_tr: OpenStack kurulumlarında yüksek kullanılırlık öntanımlı olarak kapalıdır.

source: High availability strategies
ja: 高可用性の戦略

source: High availability systems seek to minimize two things:
ja: 高可用性システムは、以下の 2 つを最小にすることを目指しています。

source: High availability systems typically achieve an uptime percentage of 99.99% or more, which roughly equates to less than an hour of cumulative downtime per year. In order to achieve this, high availability systems should keep recovery times after a failure to about one to two minutes, sometimes significantly less.
ja: 高可用性システムは、一般的に 99.99% 以上の稼働率を達成します。おそよ年間 1 時間未満の停止時間になります。高可用性システムは、これを実現するために、障害発生後の復旧時間を 1 ～ 2 分以内に、ときにはさらに短く抑えるべきです。
tr_tr: Yüksek kullanılır sistemler genellikle çalışma zamanı yüzdesini 99.99% veya daha yukarıda tutar, bunun anlamı yılda bir saatten az kapalı kalma süresidir. Bunu elde etmek için, yüksek kullanılabilir sistemler arıza sonrası kurtarma sürelerini bir iki dakikada, bazen daha da aşağıda tutmalıdırlar.

source: Highly available Block Storage API
ja: 高可用性 Block Storage API
tr_tr: Yüksek kullanılır Blok Depolama API'si

source: Highly available OpenStack Image API
ja: 高可用性 OpenStack Image API

source: Highly available Shared File Systems API
ja: 高可用性 Shared File Systems API
tr_tr: Yüksek kullanılır Paylaşımlı Dosya Sistemi API'si

source: However, OpenStack does not require a significant amount of resources and the following minimum requirements should support a proof-of-concept high availability environment with core services and several instances:
ja: しかしながら、OpenStack は膨大なリソースを必要としません。以下の最小要件は、コアサービスといくつかのインスタンスを動かす検証 (POC) 環境には対応できることでしょう。

source: However, running an OpenStack environment on VMs degrades the performance of your instances, particularly if your hypervisor and/or processor lacks support for hardware acceleration of nested VMs.
ja: しかしながら、仮想マシン上で OpenStack 環境を実行すると、インスタンスの性能が悪くなります。とくに、ハイパーバイザーとプロセッサーが nested 仮想マシンのハードウェア支援機能をサポートしない場合は顕著です。

source: However, the reasons vary and are discussed under each component's heading.
ja: しかしながら、理由はさまざまであり、各コンポーネントの項目において議論されます。

source: Identity services (keystone)
ja: Identity サービス (keystone)

source: If the Block Storage service runs on the same nodes as the other services, then it is advisable to also include:
ja: Block Storage サービスが他のサービスと同じノードで実行している場合、以下も含めることを推奨します。
tr_tr: Blok Depolama servisi diğer servislerle aynı düğümlerde çalışırsa, ayrıca şunları içermesi de tavsiye edilir:

source: If the ``broadcast`` parameter is set to yes, the broadcast address is used for communication. If this option is set, the ``mcastaddr`` parameter should not be set.
ja: ``broadcast`` パラメーターが yes に設定されている場合、ブロードキャストアドレスが通信に使用されます。このオプションが設定されている場合、``mcastaddr`` パラメーターは設定すべきではありません。

source: If the cluster is working, you can create usernames and passwords for the queues.
ja: クラスターが動作していると、キューのユーザー名とパスワードを作成できます。
tr_tr: Küme çalışıyorsa, kuyruklar için kullanıcı adları ve parolalar oluşturabilirsiniz.

source: If you are using Corosync version 2 on Ubuntu 14.04, remove or comment out lines under the service stanza, which enables Pacemaker to start up. Another potential problem is the boot and shutdown order of Corosync and Pacemaker. To force Pacemaker to start after Corosync and stop before Corosync, fix the start and kill symlinks manually:
ja: Ubuntu 14.04 において Corosync バージョン 2 を使用している場合、サービスの節の下にある行を削除するかコメントアウトします。これにより、Pacemaker が起動できます。別の潜在的な問題は、Corosync と Pacemaker の起動と停止の順番です。必ず Pacemaker が Corosync の後に起動して、Corosync の前に停止させるために、start と kill のシンボリックリンクを手動で修正します。

source: If you are using Corosync version 2, use the :command:`corosync-cmapctl` utility instead of :command:`corosync-objctl`; it is a direct replacement.
ja: Corosync バージョン 2 を使用している場合、 :command:`corosync-objctl` の代わりに :command:`corosync-cmapctl` ユーティリティーを使用します。これは、そのまま置き換えられます。
tr_tr: Corosync sürüm 2 kullanıyorsanız, :command:`corosync-objctl`; yerine :command:`corosync-cmapctl` aracını kullanın, doğrudan yerine geçer.

source: If you are using both private and public IP addresses, you should create two virtual IP addresses and define your endpoint like this:
ja: プライベート IP とパブリック IP の両方を使用する場合、2 つの仮想 IP アドレスを作成し、次のようにエンドポイントを定義すべきです。

source: If you are using both private and public IP addresses, you should create two virtual IPs and define your endpoint like this:
ja: プライベート IP アドレスとパブリック IP アドレスの両方を使用する場合、2 つの仮想 IP アドレスを作成し、次のようにエンドポイントを定義すべきです。

source: If you are using both private and public IP addresses, you should create two virtual IPs and define your endpoints like this:
ja: プライベート IP アドレスとパブリック IP アドレスの両方を使用する場合、2 つの仮想 IP アドレスを作成し、次のようにエンドポイントを定義すべきです。
tr_tr: Hem özel hem açık IP adresleri kullanıyorsanız, iki sanal IP tanımlamalı ve uç noktalarınızı şu şekilde tanımlamalısınız:

source: If you are using the Block Storage service OCF agent, some settings will be filled in for you, resulting in a shorter configuration file:
ja: Block Storage サービス OCF エージェントを使用している場合、いくつかの設定は入力されていて、設定ファイルを短くできます。
tr_tr: Blok Depolama servisi OCF aracısını kullanıyorsanız, bazı ayarlar sizin için doldurulacaktır, bu da daha kısa bir yapılandırma dosyasına sebep olur.

source: If you are using the horizon dashboard, edit the :file:`local_settings.py` file to include the following:
ja: Dashboard を使用している場合、以下の内容を含めた :file:`local_settings.py` ファイルを編集します。

source: If you change the configuration from an old set-up that did not use HA queues, you should restart the service:
ja: HA キューを使用していない古いセットアップから設定を変更した場合、サービスを再起動しなければいけません。

source: If you find any or all of these limitations concerning, you are encouraged to refer to the :doc:`Pacemaker HA architecture<intro-ha-arch-pacemaker>` instead.
ja: これらの制限に関する心配がある場合、代わりに :doc:`Pacemaker HA architecture<intro-ha-arch-pacemaker>` を参照することを推奨します。

source: If you use HAProxy for load-balancing client access to Galera Cluster as described in the :doc:`controller-ha-haproxy`, you can use the ``clustercheck`` utility to improve health checks.
ja: :doc:`controller-ha-haproxy` に記載されているとおり、Galera Cluster へのクライアントアクセスを負荷分散するために、HAProxy を使用している場合、 ``clustercheck`` ユーティリティーを使用して、より良くヘルスチェックできます。

source: Image service (glance) can use the Object Storage service (swift) or Ceph RBD as the storage back end.
ja: Image サービス (glance) は、ストレージバックエンドとして Object Storage サービス (swift) や Ceph RBD を使用できます。

source: In Corosync configurations using redundant networking (with more than one interface), you must select a Redundant Ring Protocol (RRP) mode other than none. ``active`` is the recommended RRP mode.
ja: (複数のインターフェースを用いた) 冗長ネットワークを使用する Corosync 設定において、none ではなく、Redundant Ring Protocol (RRP) を選択する必要があります。``active`` が RRP の推奨モードです。

source: In Galera Cluster, the Primary Component is the cluster of database servers that replicate into each other. In the event that a cluster node loses connectivity with the Primary Component, it defaults into a non-operational state, to avoid creating or serving inconsistent data.
ja: Galera Cluster では、Primary Component が、お互いにレプリケーションするデータベースサーバーのクラスターです。クラスターノードが Primary Component との接続性を失った場合、不整合なデータの作成や処理を避けるために、デフォルトで非稼働状態になります。

source: In Red Hat Enterprise Linux or CentOS environments, this is a recommended path to perform configuration. For more information, see the `RHEL docs <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/High_Availability_Add-On_Reference/ch-clusteradmin-HAAR.html#s1-clustercreate-HAAR>`_.
ja: Red Hat Enterprise Linux や CentOS 環境の場合、設定するための推奨パスがあります。詳細は `RHEL docs <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/High_Availability_Add-On_Reference/ch-clusteradmin-HAAR.html#s1-clustercreate-HAAR>`_ を参照してください。
tr_tr: Red Hat Kurumsal Linux ve CentOS ortamlarında, bu yapılandırma yapmak için tavsiye edilen yoldur. Daha fazla bilgi için `RHEL belgelerine <https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/7/html/High_Availability_Add-On_Reference/ch-clusteradmin-HAAR.html#s1-clustercreate-HAAR>`_ göz atın.

source: In addition to Galera Cluster, you can also achieve high availability through other database options, such as PostgreSQL, which has its own replication system.
ja: Galera Cluster 以外に、独自のレプリケーションシステムを持つ PostgreSQL など、他のデータベースにより高可用性を実現することもできます。
tr_tr: Galera Kümesine ek olarak, kendi yedekleme sistemi olan PostgreSQL gibi başka veritabanı seçenekleri ile de yüksek kullanılırlığı elde edebilirsiniz.

source: In general we can divide all the OpenStack components into three categories:
ja: 一般的に、すべての OpenStack コンポーネントは 3 つのカテゴリーに分割できます。

source: In summary though:
ja: 概要:

source: In the event that you already installed the standalone version of MySQL, MariaDB or Percona XtraDB, this installation purges all privileges on your OpenStack database server. You must reapply the privileges listed in the installation guide.
ja: すでに MySQL、MariaDB、Percona XtraDB のスタンドアロン版をインストールしている場合、このインストールにより、お使いの OpenStack データベースサーバーにおいて、すべての権限が削除されます。インストールガイドにまとめられている権限を再適用する必要があります。

source: In the event that you also want to configure multicast replication, run this command as well:
ja: また、マルチキャストレプリケーションを設定したいイベントにおいて、このコマンドを同じように実行します。

source: In the event that you also want to configure mutlicast replication, run this command as well:
ja: また、マルチキャストレプリケーションを設定したいイベントにおいて、このコマンドを同じように実行します。

source: In the event that you do not know the release code-name for your distribution, you can use the following command to find it out:
ja: お使いのディストリビューションのリリースコード名がわからない場合、以下のコマンドを使用して確認できます。

source: In the event that you need to restart any cluster node, you can do so. When the database server comes back it, it establishes connectivity with the Primary Component and updates itself to any changes it may have missed while down.
ja: クラスターノードをどれか再起動する必要がある場合、実行できます。データベースサーバーが戻ってきたとき、Primary Component との接続を確立して、停止中に失った変更をすべて自身に適用します。
tr_tr: Herhangi bir küme düğümünü yeniden başlatmanız gerekirse, yapabilirsiniz. Veritabanı sunucusu geri geldiğinde, Birincil Bileşen ile bağlantıyı kurar ve kapalıyken alamadığı tüm değişikliklerle kendini günceller.

source: In the event that you use multicast replication, you also need to open ``4567`` to UDP traffic:
ja: マルチキャストレプリケーションを使用する場合、UDP の ``4567`` 番ポートも開く必要があります。

source: In the text: Replace ``DISTRO`` with the name of the distribution you use, such as ``sles`` or ``opensuse``. Replace ``RELEASE`` with the version number of that distribution.
ja: ``DISTRO`` を使用する ``sles`` や ``opensuse`` などのディストリビューションの名前で置き換えます。 ``RELEASE`` をディストリビューションのバージョン番号に置き換えます。

source: In the text: Replace ``VERSION`` with the version of MariaDB you want to install, such as ``5.6`` or ``10.0``. Replace package with the package architecture you want to use, such as ``opensuse13-amd64``.
ja: テキストにおいて、インストールしたい MariaDB のバージョン、``5.6`` や ``10.0`` などで ``VERSION`` を置き換えます。使用したいパッケージアーキテクチャー、``opensuse13-amd64`` などで package を置き換えます。

source: In theory, you can run the Block Storage service as active/active. However, because of sufficient concerns, it is recommended running the volume component as active/passive only.
ja: 理論的には、Block Storage サービスをアクティブ/アクティブとして実行できます。しかしながら、十分な課題のため、ボリュームコンポーネントをアクティブ/パッシブのみとして実行することが推奨されます。

source: In this case that is a problem though, because:
ja: この場合、以下の理由で、それは問題になります。

source: In this configuration, each service runs in a dedicated cluster of 3 or more nodes.
ja: この設定では、各サービスが 3 以上のノードの専用クラスターで動作します。
tr_tr: Bu yapılandırmada, her servis 3 veya daha fazla düğümden oluşan adanmış bir kümede çalışır.

source: In this configuration, there is a single cluster of 3 or more nodes on which every component is running.
ja: この設定では、すべてのコンポーネントが動作する、3 つ以上のノードを持つシングルクラスターがあります。

source: Individual cluster nodes can stop and be restarted without issue. When a database loses its connection or restarts, Galera Cluster brings it back into sync once it reestablishes connection with the Primary Component. In the event that you need to restart the entire cluster, identify the most advanced cluster node and initialize the Primary Component on that node.
ja: 各クラスターノードは、問題なく停止したり再起動したりできます。データベースが接続を失ったり、再起動したりしたとき、Primary Component と再接続されると、Galera Cluster は同期状態に戻ります。クラスター全体を再起動する必要があるとき、最も高度なクラスターノードを識別し、そのノードの Primary Component を初期化します。

source: Initialize the Primary Component on one cluster node. For servers that use ``init``, run the following command:
ja: 1 つのクラスターノードにおいて Primary Component を初期化します。``init`` を使用するサーバーの場合、以下のコマンドを実行します。
tr_tr: Birincil Bileşeni bir küme düğümünde ilklendirin. ``init`` kullanan sunucularda şu komutu çalıştırın:

source: Initializing the cluster
ja: クラスターの初期化
tr_tr: Kümenin başlatılması

source: Install RabbitMQ
ja: RabbitMQ のインストール
tr_tr: RabbitMQ Kurulumu

source: Install memcached
ja: memcached のインストール

source: Install operating system on each node
ja: 各ノードへのオペレーティングシステムのインストール

source: Install packages
ja: パッケージのインストール
tr_tr: Paketleri kurun

source: Installation
ja: インストール

source: Installing Galera Cluster
ja: Galera Cluster のインストール

source: Installing high availability packages
ja: 高可用性パッケージのインストール

source: Introduction to OpenStack high availability
ja: OpenStack 高可用性の概要
tr_tr: OpenStack yüksek kullanılırlığa giriş

source: It is also possible to follow a segregated approach for one or more components that are expected to be a bottleneck and use a collapsed approach for the remainder.
ja: 1 つ以上のコンポーネントに対して、別々のアプローチをとることができますが、ボトルネックになり、思い出すことが難しいアプローチを使用する可能性があります。
tr_tr: Ayrıca darboğaz oluşturması beklenen bileşenler bir ya da daha fazla bileşen için ayrık bir yaklaşım ve geri kalanlar için kapalı yaklaşım tercih edilebilir.

source: It is important to note that HAProxy has no idea that any of this is happening. As far as its process is concerned, it called ``write()`` with the data and the kernel returned success. The resolution is already understood and just needs to make its way through a review.
ja: HAProxy は、これが発生したときのアイディアがないことに、とくに注意してください。そのプロセスが関係している限り、データと一緒に ``write()`` を呼び出し、カーネルが成功を返します。この解決方法は、すでにわかっていて、ただレビューを通す必要があります。

source: It is possible to add controllers to such an environment to convert it into a truly highly available environment.
ja: コントローラーをそのような環境に追加して、それを信頼できる高可用性環境に変えられます。
tr_tr: Böyle bir ortama denetleyiciler ekleyerek gerçekten yüksek kullanılabilir bir ortama dönüştürmek mümkündür.

source: Jon Bernard writes:
ja: Jon Bernard は次のように書きました。

source: Jon Eck found the `core issue <http://people.redhat.com/jeckersb/private/vip-failover-tcp-persist.html>`_ and went into some detail regarding the `history and solution <http://john.eckersberg.com/improving-ha-failures-with-tcp-timeouts.html>`_ on his blog.
ja: Jon Eck さんは、 `コアな問題 <http://people.redhat.com/jeckersb/private/vip-failover-tcp-persist.html>`_ を発見して、彼のブログにおいて `経緯と解決策 <http://john.eckersberg.com/improving-ha-failures-with-tcp-timeouts.html>`_ に関する詳細を述べました。

source: Keepalived and network partitions
ja: Keepalived とネットワーク分割

source: Keepalived, for the HAProxy instances.
ja: Keepalived、HAProxy インスタンス向け。

source: Key
ja: キー

source: Link to `Networking Guide <http://docs.openstack.org/networking-guide/>`_ for configuration details.
ja: 設定の詳細は `Networking Guide <http://docs.openstack.org/networking-guide/>`_ を参照してください。

source: Load distribution
ja: 負荷分散
tr_tr: Yük dağıtımı

source: Log in to the database client and grant the ``clustercheck`` user ``PROCESS`` privileges.
ja: データベースクライアントにログインして、``clustercheck`` ユーザーに ``PROCESS`` 権限を与えます。

source: Make sure pcs is running and configured to start at boot time:
ja: pcs が実行中で、ブート時に起動するよう設定されていることを確認してください。

source: Make the changes persistent. For servers that use ``init``, use the :command:`save` command:
ja: 変更を永続化します。 ``init`` を使用するサーバーの場合、 :command:`save` コマンドを使用します。

source: Making the Block Storage (cinder) API service highly available in active/passive mode involves:
ja: Block Storage (cinder) API サービスのアクティブ/パッシブモードでの高可用性は、以下が関係します。

source: Making the OpenStack Identity service highly available in active / passive mode involves:
ja: OpenStack Identity Service をアクティブ / パッシブモードで高可用性にすることは、次のことが関連します。

source: Making the RabbitMQ service highly available involves the following steps:
ja: RabbitMQ サービスを高可用性にすることは、以下の手順が関連します。
tr_tr: RabbitMQ servisinin yüksek kullanılır olması şu adımları içerir:

source: Making the Shared File Systems (manila) API service highly available in active/passive mode involves:
ja: Shared File Systems (manila) API サービスのアクティブ/パッシブモードでの高可用性は、以下が関係します。
tr_tr: Paylaşımlı Dosya Sistemleri (manila) API servisini etkin/pasif kipte yüksek kullanılır yapmak şunları içerir:

source: Making this Block Storage API service highly available in active/passive mode involves:
ja: Block Storage API サービスのアクティブ/パッシブモードでの高可用性は、以下が関係します。

source: Management
ja: マネジメント
tr_tr: Yönetim

source: Managing the Block Storage API daemon with the Pacemaker cluster manager
ja: Pacemaker クラスターマネージャーを用いた Block Storge API デーモンの管理
tr_tr: Blok Depolama API artalan işini Pacemaker küme yöneticisi ile yönetmek

source: Manual recovery after a full cluster restart
ja: 完全なクラスター再起動後の手動リカバリー

source: Many services can act in an active/active capacity, however, they usually require an external mechanism for distributing requests to one of the available instances. The proxy server can serve this role.
ja: ほとんどのサービスがアクティブ/アクティブ機能で動作できます。しかしながら、通常は分散されたリクエストが利用できるインスタンスのどれかになる外部機能が必要になります。プロキシーサーバーはこの役割になれます。
tr_tr: Çoğu servis etkin/etkin kapasitede davranabilir, ancak genellikle istekleri kullanılabilir sunuculardan birine dağıtabilecek harici bir mekanizmaya ihtiyaç duyarlar. Vekil sunucu bu rolü üstlenebilir.

source: Maximum number of network nodes to use for the HA router.
ja: HA ルーターのために使用するネットワークノードの最大数
tr_tr: HA yönlendirici için kullanılacak azami ağ düğümleri sayısı.

source: Maximum retries with trying to connect to RabbitMQ (infinite by default):
ja: RabbitMQ に接続を試行する最大回数 (デフォルトで無制限):
tr_tr: RabbitMQ'ya bağlanmaya çalışırken kaç kere deneneceği (öntanımlı olarak sonsuz):

source: Memcached is a general-purpose distributed memory caching system. It is used to speed up dynamic database-driven websites by caching data and objects in RAM to reduce the number of times an external data source must be read.
ja: Memcached は汎用の分散メモリーキャッシュシステムです。データやオブジェクトをメモリーにキャッシュすることにより、外部データソースの読み込み回数を減らし、データベースを利用した動的 Web サイトを高速化するために使用されます。
tr_tr: Memcached genel amaçlı dağıtık hafıza önbellekleme sistemidir. Veri ve nesneleri RAM'de tutarak harici bir veri kaynağının okunma sıklığını düşürerek dinamik veritabanı güdümlü websitelerini hızlandırmak için kullanılır.

source: Memcached is a memory cache demon that can be used by most OpenStack services to store ephemeral data, such as tokens.
ja: Memcached は、ほとんどの OpenStack サービスがトークンなどの一時的なデータを保存するために使用できる、メモリーキャッシュのデーモンです。
tr_tr: Memcached çoğu OpenStack servisi tarafından jetonlar gibi geçici verileri tutmak için kullanılabilecek bir hafıza önbellekleme artalan işidir.
