Repository: openstack/openstack-manuals
Catalog: doc/ha-guide/source/locale/*/LC_MESSAGES/ha-guide.po
Languages: ja, tr_tr

source: The ``token`` value specifies the time, in milliseconds, during which the Corosync token is expected to be transmitted around the ring. When this timeout expires, the token is declared lost, and after ``token_retransmits_before_loss_const lost`` tokens, the non-responding processor (cluster node) is declared dead. ``token × token_retransmits_before_loss_const`` is the maximum time a node is allowed to not respond to cluster messages before being considered dead. The default for token is 1000 milliseconds (1 second), with 4 allowed retransmits. These defaults are intended to minimize failover times, but can cause frequent false alarms and unintended failovers in case of short network interruptions. The values used here are safer, albeit with slightly extended failover times.
tr_tr: ``token`` değeri Corosync jetonunun halka etrafında aktarım zamanını milisaniye türünden belirtir. Bu zaman aşıldığında, jeton kayıp olarak ilan edilir, ve ``token_retransmits_before_loss_const lost`` jeton sonra, yanıt vermeyen işletic (küme düğümü) ölü olarak ilan edilir. Bir düğümün küme iletilerine ölü olarak işaretlenmeden önce cevap vermeyebileceği azami süre ``token × token_retransmits_before_loss_const`` kadardır. Jeton için öntanımlı değer 4 tekrar gönderime izin verilecek şekilde 1000 milisaniyedir (1 saniye). Bu öntanımlılar arıza sürelerini asgariye indirmek için düşünülmüştür, ama kısa ağ kesintileri olduğunda sık sık yanlış alarm verebilir ve istenmeyen arıza bildirimlerine neden olabilir. Burada kullanılan değerler daha güvenli olsa da biraz daha uzun arıza sürelerine sahiptir.

source: The ``transport`` directive controls the transport mechanism. To avoid the use of multicast entirely, specify the ``udpu`` unicast transport parameter. This requires specifying the list of members in the ``nodelist`` directive. This potentially makes up the membership before deployment. The default is ``udp``. The transport type can also be set to ``udpu`` or ``iba``.
tr_tr: ``transport`` yönergesi aktarım yöntemini kontrol eder. Çoklu yayın kullanmaktan tamamen kaçınmak için, ``udpu`` tekli yayın aktarım parametresini belirtin. Bu, üye listesini ``nodelist`` yönergesinde belirtmeyi gerektirir. Bunun kurulumdan önce üyeliği yapma potansiyeli vardır. Öntanımlı değer ``udp`` dir. Aktarım türü ayrıca ``udpu`` veya ``iba`` olabilir.

source: The architectural challenges of instance HA and several currently existing solutions were presented in `a talk at the Austin summit <https://www.openstack.org/videos/video/high-availability-for-pets-and-hypervisors-state-of-the-nation>`_, for which `slides are also available <http://aspiers.github.io/openstack-summit-2016-austin-compute-ha/>`_.
tr_tr: Sunucu yüksek kullanılırlığının mimari zorlukları ve mevcut çeşitli çözümler `Austin zirvesindeki bir konuşmada <https://www.openstack.org/videos/video/high-availability-for-pets-and-hypervisors-state-of-the-nation>`_ sunulmuştur, `slaytlar da mevcuttur <http://aspiers.github.io/openstack-summit-2016-austin-compute-ha/>`_.

source: The architectures differ in the sets of services managed by the cluster.
tr_tr: Mimariler küme tarafından yönetilen servisler kümesinde değişiklik gösterir.

source: The availability check of the instances is provided by heartbeat messages. When the connection with an instance is lost, the workload will be reassigned within the remaining instances in the next polling cycle.
tr_tr: Sunucuların kullanılırlık kontrolleri kalp atışı iletileri ile sağlanır. Bir sunucu ile olan bağlantı kaybolduğunda, iş yükü sonraki yoklama döngüsüyle beraber kalan sunuculara yeniden atanır.

source: The code for three of these solutions can be found online at the following links:
tr_tr: Bu çözümlerden üçü için kod şu bağlantılarda çevrimiçi olarak bulunabilir:

source: The command :command:`crm configure` supports batch input, copy and paste the lines above into your live Pacemaker configuration and then make changes as required. For example, you may enter ``edit p_ip_cinder-api`` from the :command:`crm configure` menu and edit the resource to match your preferred virtual IP address.
tr_tr: :command:`crm configure` komutu toplu girişi destekler, yukarıdaki satırları kopyalayıp Pacemaker yapılandırmanıza yapıştırın ve gerekli değişiklikleri yapın. Örneğin :command:`crm configure` menüsünden ``edit p_ip_cinder-api`` girebilir ve kaynağı tercih ettiğiniz sanal IP adresi ile eşleşecek şekilde düzenleyebilirsiniz.

source: The commands for installing RabbitMQ are specific to the Linux distribution you are using.
tr_tr: RabbitMQ kurmak için kullanılan komutlar kullandığınız Linux dağıtımına özeldir.

source: The correct path to ``libgalera_smm.so`` given to the ``wsrep_provider`` parameter
tr_tr: ``wsrep_provider`` parametresine verilmiş ``libgalera_smm.so`` dosyasının doğru yolu

source: The first step in setting up your highly available OpenStack cluster is to install the operating system on each node. Follow the instructions in the *Environment* section of the `Installation Tutorials and Guides <https://docs.openstack.org/ocata/install>`_ depending on your distribution.
tr_tr: Yüksek kullanılabilir OpenStack kümenizi kurmanın ilk adımı her bir düğüme işletim sistemi kurmaktır. Dağıtımınıza uygun `Kurulum Öğreticileri ve Kılavuzlarındaki <https://docs.openstack.org/ocata/install>`_ *Ortam* kısmındaki yönergeleri takip edin.

source: The following are the definitions of stateless and stateful services:
tr_tr: Aşağıda durumsuz ve durumsal servis tanımları bulunur:

source: The following are the standard hardware requirements:
tr_tr: Aşağıdakiler standart donanım gereksinimleridir:

source: The following section(s) detail how to add the OpenStack Identity resource to Pacemaker on SUSE and Red Hat.
tr_tr: Aşağıdaki kısım(lar) OpenStack Kimlik kaynağını SUSE ve Red Hat üzerinde nasıl Pacemaker'e ekleyeceğinizi ayrıntılar.

source: The majority of services, needing no real orchestration, are handled by systemd on each node. This approach avoids the need to coordinate service upgrades or location changes with the cluster and has the added advantage of more easily scaling beyond Corosync's 16 node limit. However, it will generally require the addition of an enterprise monitoring solution such as Nagios or Sensu for those wanting centralized failure reporting.
tr_tr: Gerçek bir düzenleyiciye ihtiyaç duymayan servislerin büyük çoğunluğu her bir düğümde systemd tarafından ele alınır. Bu yaklaşım küme ile servis yükseltmeleri veya konum değişikliklerini eşgüdümleme ihtiyacını ortadan kaldırır ve Corosync'in 16 düğüm sınırının ötesine daha kolay geçme avantajınıa sahiptir. Ancak merkezi hata raporlama isteyenler için genellikle Nagios veya Sensu gibi kurumsal bir izleme çözümü ihtiyacı çıkarır.

source: The proxy can be configured as a secondary mechanism for detecting service failures. It can even be configured to look for nodes in a degraded state (such as being too far behind in the replication) and take them out of circulation.
tr_tr: Vekil servis arızalarını algılamak için ikinci bir mekanizma olarak yapılandırılabilir. Hatta artık kullanılmayan durumda olan düğümleri bulacak ve döngüden çıkaracak şekilde bile yapılandırılabilir (örneğin yedeklemede çok geride kalmak gibi sebeplerden).

source: The quorum specifies the minimal number of nodes that must be functional in a cluster of redundant nodes in order for the cluster to remain functional. When one node fails and failover transfers control to other nodes, the system must ensure that data and processes remain sane. To determine this, the contents of the remaining nodes are compared and, if there are discrepancies, a majority rules algorithm is implemented.
tr_tr: Yetersayı kümenin işlevsel kalabilmesi için yedekli düğümlerden oluşan bir kümede bulunması gereken asgari düğüm sayısını belirtir. Bir düğüm arızalandığında ve kurtarma kontrolü diğer düğümlere aktardığında, sistem veri ve süreçlerin mantıklı kaldığından emin olmalıdır. Buna karar vermek için kalan düğümlerin içerikleri karşılaştırılır ve çelişkiler varsa, çoğunluk kuralı algoritması uygulanır.

source: The service declaration for the Pacemaker service may be placed in the :file:`corosync.conf` file directly or in its own separate file, :file:`/etc/corosync/service.d/pacemaker`.
tr_tr: Pacemaker servisi için servis tanımı doğrudan :file:`corosync.conf` dosyasına veya kendine ait ayrı bir dosyaya konabilir, :file:`/etc/corosync/service.d/pacemaker`.

source: The votequorum library has been created to replace and eliminate ``qdisk``, the disk-based quorum daemon for CMAN, from advanced cluster configurations.
tr_tr: Votequorum kitaplığı gelişmiş küme yapılandırmalarından, CMAN için disk tabanlı yetersayı artalan işi olan ``qdisk``i değiştirmek veya çıkarmak için oluşturuldu.

source: The votequorum library is part of the Corosync project. It provides an interface to the vote-based quorum service and it must be explicitly enabled in the Corosync configuration file. The main role of votequorum library is to avoid split-brain situations, but it also provides a mechanism to:
tr_tr: Votequorum kitaplığı Corosync projesinin parçasıdır. Oy tabanlı yetersayı servisine bir arayüz sunar ve Corosync yapılandırma dosyasında özellikle etkinleştirilmelidir. Voteqourum kitaplığının ana rolü ayrık beyin durumlarını engellemektir, ama ayrıca şunlar için de bir yöntem sağlar:

source: This can be achieved using the :command:`iptables` command:
tr_tr: Bu :command:`iptables` komutuyla elde edilebilir:

source: This chapter describes the basic environment for high availability, such as hardware, operating system, common services.
tr_tr: Bu bölüm donanım, işletim sistemi, yaygın servisler gibi yüksek kullanılırlık için temel ortamı tanımlar.

source: This chapter describes the shared services for high availability, such as database, messaging service.
tr_tr: Bu bölüm yüksek kullanılırlık için veritabanı, ileti servisi gibi paylaşımlı servisleri tanımlar.

source: This configuration creates ``vip``, a virtual IP address for use by the API node (``10.0.0.11``).
tr_tr: Bu yapılandırma API düğümü (``10.0.0.11``) tarafından kullanılmak üzere bir sanal IP adresi ``vip`` oluşturur.

source: This document discusses some common methods of implementing highly available systems, with an emphasis on the core OpenStack services and other open source services that are closely aligned with OpenStack.
tr_tr: Bu belge OpenStack servisleri ve OpenStack ile ilgili diğer açık kaynak servisleri ön planda tutarak bazı yaygın yüksek kullanılırlık sistemleri uygulamalarını tartışır.

source: This guide describes how to install and configure OpenStack for high availability. It supplements the Installation Tutorials and Guides and assumes that you are familiar with the material in those guides.
tr_tr: Bu kılavuz OpenStack'i yüksek kullanılırlık için nasıl kurup yapılandıracağınızı açıklar. Kurulum Öğreticileri ve Kılavuzlarını destekler ve bu kılavuzlardaki içeriğe aşina olduğunuzu varsayar.

source: This guide is intended as advice only.
tr_tr: Bu kılavuz yalnıca öneri niteliğindedir.

source: This guide was last updated as of the Ocata release, documenting the OpenStack Ocata, Newton, and Mitaka releases. It may not apply to EOL releases Kilo and Liberty.
tr_tr: Bu kılavuz en son Ocata dağıtımında güncellendi, OpenStack Ocata, Newton ve Mitaka dağıtımlarını belgeler. Kilo ve Liberty gibi ömrü dolmuş dağıtımlara uygulanamayabilir.

source: This is why setting the quorum to a value less than ``floor(n/2) + 1`` is dangerous. However it may be required for some specific cases, such as a temporary measure at a point it is known with 100% certainty that the other nodes are down.
tr_tr: Yetersayıyı ``taban(n/2) + 1`` değerinden küçük bir değere ayarlamak bu yüzden tehlikelidir. Ancak bazı özel durumlarda gerekli olabilir, örneğin diğer düğümlerin 100% bozuk olduğunun bilindiği geçici önlemler için.

source: This scenario has the advantage of requiring far fewer, if more powerful, machines. Additionally, being part of a single cluster allows you to accurately model the ordering dependencies between components.
tr_tr: Bu senaryonun çok daha az, daha güçlü makineler gerektirme avantajı vardır. Ek olarak, tek bir kümenin üyesi olmak bileşenler arasındaki sıralama bağımlılıklarını daha doğru modellemenizi sağlar.

source: This value increments with each transaction, so the most advanced node has the highest sequence number and therefore is the most up to date.
tr_tr: Bu değer her bir aktarımla artar, yani en gelişmiş düğüm en yüksek sıra numarasına sahiptir böylece en güncel olandır.

source: To configure SELinux to permit Galera Cluster to operate, you may need to use the ``semanage`` utility to open the ports it uses. For example:
tr_tr: SELinux'u Galera Kümesinin işlemesine izin verecek şekilde yapılandırmak için, kullandığı bağlantı noktalarını açmak için ``semanage`` aracını kullanmanız gerekebilir. Örneğin:

source: To configure the number of DHCP agents per network, modify the ``dhcp_agents_per_network`` parameter in the :file:`/etc/neutron/neutron.conf` file. By default this is set to 1. To achieve high availability, assign more than one DHCP agent per network. For more information, see `High-availability for DHCP <https://docs.openstack.org/newton/networking-guide/config-dhcp-ha.html>`_.
tr_tr: Ağ başına DHCP aracısı sayısını yapılandırmak için :file:`/etc/neutron/neutron.conf` dosyasındaki ``dhcp_agents_per_network`` parametresini değiştirin. Öntanımlı olarak bu değer 1 olarak ayarlıdır. Yüksek kullanılırlık elde etmek için, ağ başına birden fazla DHCP aracısı atayın. Daha fazla bilgi için, `DHCP için yüksek kullanılırlık <https://docs.openstack.org/newton/networking-guide/config-dhcp-ha.html>`_ belgesine göz atın.

source: To enable high availability for configured routers, edit the :file:`/etc/neutron/neutron.conf` file to set the following values:
tr_tr: Yapılandırılan yönlendiriciler için yüksek kullanılırlığı etkinleştirmek için, :file:`/etc/neutron/neutron.conf` dosyasını düzenleyerek aşağıdaki değerleri ayarlayın:

source: To enable the compute agent to run multiple instances simultaneously with workload partitioning, the ``workload_partitioning`` option must be set to ``True`` under the `compute section <https://docs.openstack.org/ocata/config-reference/telemetry.html>`_ in the :file:`ceilometer.conf` configuration file.
tr_tr: Hesaplama aracısının iş yükünü dağıtarak birkaç sunucuyu aynı anda çalıştırmasını etkinleştirmek için, :file:`ceilometer.conf` yapılandırma dosyasında `hesaplama kısmı <https://docs.openstack.org/ocata/config-reference/telemetry.html>`_ altındaki ``workload_partitioning`` seçeneği ``True`` olarak ayarlanmalıdır.

source: To find the most advanced cluster node, you need to check the sequence numbers, or the ``seqnos``, on the last committed transaction for each. You can find this by viewing ``grastate.dat`` file in database directory:
tr_tr: En gelişmiş küme düğümünü bulmak için, her biri için son gönderilen aktarımın sıra numarasını, veya ``seqno``sunu kontrol etmelisiniz. Bunu veritabanı dizinindeki ``grastate.dat`` dosyasını görüntüleyerek bulabilirsiniz:

source: To install and configure Memcached, read the `official documentation <https://github.com/Memcached/Memcached/wiki#getting-started>`_.
tr_tr: Memecached kurulum ve yapılandırması için `resmi belgelendirmeyi <https://github.com/Memcached/Memcached/wiki#getting-started>`_ okuyun.

source: Tooz supports `various drivers <https://docs.openstack.org/developer/tooz/drivers.html>`_ including the following back end solutions:
tr_tr: Tooz aşağıdaki arka uç çözümleri de dahil `çeşitli sürücüleri <https://docs.openstack.org/developer/tooz/drivers.html>`_ destekler:

source: Traditionally, Pacemaker has been positioned as an all-encompassing solution. However, as OpenStack services have matured, they are increasingly able to run in an active/active configuration and gracefully tolerate the disappearance of the APIs on which they depend.
tr_tr: Geleneksel olarak, Pacemaker herşeyi kapsayan bir çözüm olarak konulandırıldı. Ancak, OpenStack servisleri olgunlaştıkça, giderek artan şekilde etkin/etkin yapılandırmalarda çalışmaya başladılar ve bağımlılık duydukları API'lerin kaybolması durumunu daha iyi kaldırabiliyorlar.

source: Use HA queues in RabbitMQ (``x-ha-policy: all``):
tr_tr: RabbitMQ'da HA kuyrukları kullan (``x-ha-policy: all``):

source: Use MySQL/Galera in active/passive mode to avoid deadlocks on ``SELECT ... FOR UPDATE`` type queries (used, for example, by nova and neutron). This issue is discussed in the following:
tr_tr: ``SELECT ... FOR UPDATE`` türü sorgularda ölükilitlere yol açmamak için MySQL/Galera'yı etkin/pasif kipte kullanın (örneğin nova ve neutron tarafından kullanılır). Bu sorun aşağıda tartışılmıştır:

source: Use that password to authenticate to the nodes that will make up the cluster:
tr_tr: Kümeyi oluşturan düğümlere kimlik doğrulama için bu parolayı kullan:

source: Use the :command:`corosync-cfgtool` utility with the ``-s`` option to get a summary of the health of the communication rings:
tr_tr: İletişim halkalarının sağlık özetini almak için :command:`corosync-cfgtool` aracını ``-s`` seçeneğiyle kullanın:

source: Use these steps to configurate all services using RabbitMQ:
tr_tr: Tüm servisleri RabbitMQ kullanarak yapılandırmak için bu adımları kullanın:

source: Verify the cluster status:
tr_tr: Küme durumunu doğrula:

source: Virtualized hardware
tr_tr: Sanallaştırılmış donanım

source: We advise that you read this at your own discretion when planning on your OpenStack cloud.
tr_tr: OpenStack bulutunuzu planlarken bunu tedbirli şekilde okumanızı öneririz.

source: We do not recommend setting the quorum to a value less than ``floor(n/2) + 1`` as it would likely cause a split-brain in a face of network partitions.
tr_tr: Yetersayıyı ``taban(n/2) + 1`` değerinden daha küçük bir değer yapmanızı önermiyoruz çünkü ağ bölümlemesi durumunda ayrık-beyine sebep olabilir.

source: We recommend HAProxy as the load balancer, however, there are many alternative load balancing solutions in the marketplace.
tr_tr: Yük dengeleyici olarak HAProxy öneriyoruz, ancak, markette birçok alternatif yük dengeleme çözümü mevcut.

source: We recommend two primary architectures for making OpenStack highly available.
tr_tr: OpenStack'i yüksek kullanılabilir yapmak için iki ana mimari öneriyoruz.

source: We recommended that the maximum latency between any two controller nodes is 2 milliseconds. Although the cluster software can be tuned to operate at higher latencies, some vendors insist on this value before agreeing to support the installation.
tr_tr: İki kontrol düğümü arasındaki azami gecikmenin 2 milisaniye olmasını önerdik. Küme yazılımı daha yüksek gecikmelerle çalışabilecek olsa da, bazı üreticiler kurulumu destekleme konusunda anlaşmaya varmadan öcne bu değer üzerinde durur.

source: What is a cluster manager?
tr_tr: Küme yöneticisi nedir?

source: When Ceph RBD is used for ephemeral volumes as well as block and image storage, it supports `live migration <https://docs.openstack.org/admin-guide/compute-live-migration-usage.html>`_ of VMs with ephemeral drives. LVM only supports live migration of volume-backed VMs.
tr_tr: Ceph RBD geçici birimler için kullanıldığı gibi blok ve imaj depolama için de kullanıldığında, sanal makinelerin `canlı göçünü <https://docs.openstack.org/admin-guide/compute-live-migration-usage.html>`_ geçici sürücülerle sağlar. LVM yalnızca birim destekli sanal makinelerin canlı göçünü destekler.

source: When configuring an OpenStack environment for study or demonstration purposes, it is possible to turn off the quorum checking. Production systems should always run with quorum enabled.
tr_tr: OpenStack ortamını çalışma ya da gösterim amacıyla yapılandırırken, yetersayı kontrolünü kapatmak mümkündür. Üretim sistemleri her zaman yetersayı etkin olarak çalışmalıdır.

source: When each cluster node starts, it checks the IP addresses given to the ``wsrep_cluster_address`` parameter. It then attempts to establish network connectivity with a database server running there. Once it establishes a connection, it attempts to join the Primary Component, requesting a state transfer as needed to bring itself into sync with the cluster.
tr_tr: Her bir küme düğümü başladığında ``wsrep_cluster_address`` parametresine verilen IP adreslerini kontrol eder. Ardından orada çalışan bir veritabanı sunucusu ile ağ bağlantısı kurmaya çalışır. Bağlantı elde ettiğinde, Birincil Bileşene katılmaya çalışır, kendisini küme ile eşzamanlamak için bir durum aktarımı ister.

source: When four nodes fail simultaneously, the cluster would continue to function as well. But if split to partitions of three and four nodes respectively, the quorum of three would have made both sides to attempt to fence the other and host resources. Without fencing enabled, it would go straight to running two copies of each resource.
tr_tr: Dört düğüm aynı anda arızalanırsa da küme işlemeye devam edecektir. Ama üç ve dört düğüm olmak üzere bölümlere ayrıldıysa, üç olan yetersayı iki tarafın da karşı tarafı yalıtıp kaynakları sunmaya çalışmasına yol açacaktır. Parmaklıklama etkin değilse doğrudan her bir kaynağın iki kopyasının sunulduğu duruma düşülür.

source: When installing highly available OpenStack on VMs, be sure that your hypervisor permits promiscuous mode and disables MAC address filtering on the external network.
tr_tr: Sanal makineler üzerinde yüksek kullanılabilir OpenStack kurarken, hipervizörünüzün harici ağ üzerinde MAC adres süzmeyi kapatmaya ve seçici olmayan kipe izin vermesine dikkat edin.

source: When you finish installing and configuring the OpenStack database, you can initialize the Galera Cluster.
tr_tr: OpenStack veritabanını kurup yapılandırmayı bitirdiğinizde, Galera Kümesini ilklendirebilirsiniz.

source: When you have all cluster nodes started, log into the database client of any cluster node and check the ``wsrep_cluster_size`` status variable again:
tr_tr: Tüm küme düğümleri başladıktan sonra, herhangi bir küme düğümünden veritabanı istemcisine giriş yapın ve ``wsrep_cluster_size`` durum değişkenini tekrar kontrol edin:

source: When you start up a cluster (all nodes down) and set ``wait_for_all`` to 1, the cluster quorum is held until all nodes are online and have joined the cluster for the first time. This parameter is new in Corosync 2.0.
tr_tr: Bir küme başlattığınızda (tüm düğümler kapalı) ve ``wait_for_all`` değerini 1 yaptığınızda, tüm düğümler çevrimiçi olup kümeye ilk defa katılana kadar küme yetersayısı bekletilir. Bu parametre Corosync 2.0 sürümüyle yeni gelmiştir.

source: When you use high availability, consider the hardware requirements needed for your application.
tr_tr: Yüksek kullanılırlık kullandığınızda, uygulamanız için gerekli donanım gereksinimlerini göz önüne almalısınız.

source: While SYS-V init replacements like systemd can provide deterministic recovery of a complex stack of services, the recovery is limited to one machine and lacks the context of what is happening on other machines. This context is crucial to determine the difference between a local failure, and clean startup and recovery after a total site failure.
tr_tr: Systemd gibi SYS-V başlangıcının yerine geçen uygulamalar karmaşık servis yığınlarının belirleyici şekilde kurtarılmasını sağlarken, kurtarma bir makineyle sınırlıdır ve diğer makinelerde ne olduğuyla ilgili içeriğe sahip değildir. İçerik, yerel bir arıza, temiz başlangıç ve toplu site arızasının kurtarılması arasındaki farkı belirlemek için çok önemlidir.
