Repository: openstack/openstack-manuals
Catalog: doc/ha-guide/source/locale/*/LC_MESSAGES/ha-guide.po
Languages: ja, tr_tr

source: The neutron L3 agent is scalable, due to the scheduler that supports Virtual Router Redundancy Protocol (VRRP) to distribute virtual routers across multiple nodes. To enable high availability for configured routers, edit the :file:`/etc/neutron/neutron.conf` file to set the following values:
ja: neutron L3 エージェントは、スケーラブルです。複数のノードにわたり仮想ルーターを分散するために、スケジューラーが Virtual Router Redundancy Protocol (VRRP) をサポートするためです。設定済みのルーターを高可用化するために、 :file:`/etc/neutron/neutron.conf` ファイルを編集して、以下の値を設定します。

source: The other is optimized for Active/Active services that do not require any inter-machine coordination. In this setup, services are started by your init system (systemd in most modern distributions) and a tool is used to move IP addresses between the hosts. The most common package for doing this is keepalived.
ja: 他には、マシン間の調整を必要としないアクティブ/アクティブなサービスに最適化されています。このセットアップでは、サービスが init システム (最近のディストリビューションは systemd) により起動され、ツールがホスト間で IP アドレスを移動するために使用されます。これを実行するための最も一般的なパッケージは keepalived です。

source: The service declaration for the pacemaker service may be placed in the :file:`corosync.conf` file directly or in its own separate file, :file:`/etc/corosync/service.d/pacemaker`.
ja: Pacemaker サービスに関するサービス定義は、直接 :file:`corosync.conf` ファイルにあるか、単独ファイル :file:`/etc/corosync/service.d/pacemaker` にある可能性があります。

source: The source address for the connection from HAProxy back to the client is the VIP address. However the VIP address is no longer present on the host. This means that the network (IP) layer deems the packet unroutable, and informs the transport (TCP) layer. TCP, however, is a reliable transport. It knows how to handle transient errors and will retry. And so it does.
ja: HAProxy プロキシーからクライアントに戻る接続の送信元アドレスは、仮想 IP アドレスになります。しかしながら、仮想 IP アドレスはすでにホストに存在しません。つまり、ネットワーク (IP) 層はパケットをルーティングできないと判断して、トランスポート (TCP) 層に通知します。しかしながら、TCP は信頼できる転送になります。一時的なエラーを処理して、再試行する方法がわかっているからです。また、実際にそうします。

source: The standard hardware requirements:
ja: 標準的なハードウェア要件:

source: The steps to implement the Pacemaker cluster stack are:
ja: Pacemaker クラスタースタックを実行する手順は、次のとおりです。
tr_tr: Pacemaker küme yığınını uygulamak için gerekli adımlar:

source: The votequorum library has been created to replace and eliminate qdisk, the disk-based quorum daemon for CMAN, from advanced cluster configurations.
ja: votequorum ライブラリーは、高度なクラスター設定により、qdisk、CMAN 向けディスクベースのクォーラムデーモンを置き換えて除去するために作成されます。

source: The votequorum library is part of the corosync project. It provides an interface to the vote-based quorum service and it must be explicitly enabled in the Corosync configuration file. The main role of votequorum library is to avoid split-brain situations, but it also provides a mechanism to:
ja: votequorum ライブラリーは corosync プロジェクトの一部です。投票ベースのクォーラムサービスへのインターフェースを提供し、Corosync 設定ファイルにおいて明示的に有効化する必要があります。votequorum ライブラリーのおもな役割は、スプリットブレイン状態を避けるためですが、以下の機能も提供します。

source: There are known issues with cinder-volume that recommend setting it as active-passive for now, see: https://blueprints.launchpad.net/cinder/+spec/cinder-volume-active-active-support
ja: 今のところ、cinder-volume に既知の問題があり、アクティブ/パッシブとして設定することを推奨します。https://blueprints.launchpad.net/cinder/+spec/cinder-volume-active-active-support を参照してください。

source: There are primarily two HA architectures in use today.
ja: 今日使用される主要な HA アーキテクチャーは 2 つあります。

source: There are three implementations of Galera Cluster: MySQL, MariaDB and Percona XtraDB. For each implementation, there is a software repository that provides binary packages for Debian, Red Hat, and SUSE-based Linux distributions.
ja: Galera Cluster の実装が 3 種類あります。MySQL、MariaDB、Percona XtraDB です。それぞれ、Debian 系、Red Hat 系、SUSE 系の Linux ディストリビューション向けのバイナリーパッケージを提供するソフトウェアリポジトリーがあります。

source: These agents must conform to one of the `OCF <https://github.com/ClusterLabs/ OCF-spec/blob/master/ra/resource-agent-api.md>`_, `SysV Init <http://refspecs.linux-foundation.org/LSB_3.0.0/LSB-Core-generic/ LSB-Core-generic/iniscrptact.html>`_, Upstart, or Systemd standards.
ja: これらのエージェントは、 `OCF <https://github.com/ClusterLabs/ OCF-spec/blob/master/ra/resource-agent-api.md>`_, `SysV Init <http://refspecs.linux-foundation.org/LSB_3.0.0/LSB-Core-generic/ LSB-Core-generic/iniscrptact.html>`_, Upstart, Systemd 標準に従う必要があります。
tr_tr: Bu aracılar `OCF <https://github.com/ClusterLabs/ OCF-spec/blob/master/ra/resource-agent-api.md>`_, `SysV Init <http://refspecs.linux-foundation.org/LSB_3.0.0/LSB-Core-generic/ LSB-Core-generic/iniscrptact.html>`_, Upstart, veya Systemd'den birine uyumludurlar.

source: This architecture has some inherent limitations that should be kept in mind during deployment and daily operations. The following sections describe these limitations.
ja: このアーキテクチャーは、いくつかの本来的な制約を持ちます。導入や日々の運用において心に留めておく必要があります。以下のセクションは、これらの制限について記載します。

source: This configuration creates ``p_cinder-api``, a resource for managing the Block Storage API service.
ja: この設定は Block Storage API サービスを管理するためのリソース ``p_cinder-api`` を作成します。
tr_tr: Bu yapılandırma Blok Depolama API servisini yönetmek için bir kaynak olan ``p_cinder-api`` oluşturur.

source: This configuration creates ``p_glance-api``, a resource for managing the OpenStack Image API service.
ja: この設定は ``p_glance-api`` を作成します。これは OpenStack Image API サービスを管理するリソースです。
tr_tr: Bu yapılandırma OpenStack İmaj API servisini yönetmek için bir kaynak olan ``p_glance-api`` oluşturur.

source: This configuration creates ``p_keystone``, a resource for managing the OpenStack Identity service.
ja: この設定は OpenStack Identity サービスを管理するためのリソース ``p_keystone`` を作成します。
tr_tr: Bu yapılandırma OpenStack Kimlik servisini yönetmek için bir kaynak olan ``p_keystone``yi oluşturur.

source: This configuration creates ``p_manila-api``, a resource for managing the Shared File Systems API service.
ja: この設定は Shared File Systems API サービスを管理するためのリソース ``p_manila-api`` を作成します。
tr_tr: Bu yapılandırma Paylaşımlı Dosya Sistemleri API servisini yönetmek için bir kaynak olan ``p_manila-api`` oluşturur.

source: This configuration creates ``vip``, a virtual IP address for use by the API node (``10.0.0.11``):
ja: この設定は、API ノード (``10.0.0.11``) により使用される仮想 IP アドレス ``vip`` を作成します。

source: This example assumes that you are using NFS for the physical storage, which will almost never be true in a production installation.
ja: この例は、物理ストレージに NFS を使用していることを仮定します。これは、ほとんどの本番環境のインストールにおいて正しくありません。
tr_tr: Bu örnek fiziksel depolama için NFS kullandığınızı varsayar, ki bu üretim kurulumlarında nerdeyse hiçbir zaman doğru olmaz.

source: This guide describes how to install and configure OpenStack for high availability. It supplements the OpenStack Installation Guides and assumes that you are familiar with the material in those guides.
ja: このガイドでは、OpenStack に高可用性を持たせるにはどのようにインストールと設定を行うかを説明します。 OpenStack インストールガイドを補完する位置付けであり、インストールガイドの内容を前提に書かれています。

source: This guide documents OpenStack Liberty, OpenStack Kilo, and OpenStack Juno releases.
ja: このガイドででは、OpenStack Liberty, OpenStack Kilo, OpenStack Juno のリリースを対象としています。

source: This guide is a work-in-progress and changing rapidly while we continue to test and enhance the guidance. Please note where there are open "to do" items and help where you are able.
ja: このガイドは、作成中であり、頻繁に変更されています。テストと内容の改善を継続しています。「To Do」項目が残っていますので、手伝える部分があれば手伝ってください。

source: This guide uses the following example IP addresses:
ja: このガイドは、以下の IP アドレス例を使用します。
tr_tr: Bu kılavuz şu örnek IP adreslerini kullanır:

source: This is the most common option and the one we document here.
ja: これは最も一般的なオプションで、ここにドキュメント化します。
tr_tr: Bu burada belgelediğimiz en yaygın seçenektir.

source: This is why setting the quorum to a value less than floor(n/2) + 1 is dangerous. However it may be required for some specific cases, like a temporary measure at a point it is known with 100% certainty that the other nodes are down.
ja: これがクォーラムの値を floor(n/2) + 1 より小さく設定することが危険な理由です。しかしながら、いくつかの特別な場合に必要となる可能性があります。例えば、他のノードが 100% 確実に停止していることがわかっている場合の一時的な計測などです。

source: This makes the instances of HAProxy act independently and fail over transparently together with the network endpoints (VIP addresses) failover and, therefore, shares the same SLA.
ja: HAProxy のインスタンスが独立して動作して、ネットワークエンドポイント (仮想 IP アドレス) のフェールオーバーと一緒に透過的にフェールオーバーするため、同じ SLA を共有します。

source: This scenario can be visualized as below, where each box below represents a cluster of three or more guests.
ja: このシナリオは、以下のように可視化できます。以下の各ボックスは 3 つ以上のゲストのクラスターを表します。
tr_tr: Bu senaryo aşağıdaki gibi görselleştirilebilir, her bir kutu üç ya da daha fazla misafire sahip bir kümeyi temsil eder.

source: This scenario can be visualized as below.
ja: このシナリオは以下のように可視化できます。
tr_tr: Bu senaryo şu şekilde görselleştirilebilir.

source: This scenario has the advantage of requiring far fewer, if more powerful, machines. Additionally, being part of a single cluster allows us to accurately model the ordering dependencies between components.
ja: このシナリオは、より高性能ならば、より少ないマシンを必要とする利点があります。加えて、シングルクラスターの一部になることにより、コンポーネント間の順序依存関係を正確にモデル化できます。

source: This section assumes that you are familiar with the `documentation <http://docs.openstack.org/liberty/install-guide-ubuntu/glance.html>`_ for installing the OpenStack Image API service.
ja: このセクションは、OpenStack Image API サービスのインストールに関する `ドキュメント <http://docs.openstack.org/liberty/install-guide-ubuntu/glance.html>`_ に慣れていることを仮定しています。

source: This section discusses ways to protect against data loss in your OpenStack environment.
ja: このセクションは、お使いの OpenStack 環境におけるデータ損失から保護する方法を議論します。
tr_tr: Bu kısım OpenStack ortamınızda veri kaybına karşı alınabilecek yolları tartışır.

source: This value increments with each transaction, so the most advanced node has the highest sequence number, and therefore is the most up to date.
ja: この値は各トランザクションによりインクリメントされます。ほとんどの高度なノードは、最大のシーケンス番号を持つため、ほとんど最新です。

source: To be sure that all data is highly available, ensure that everything is stored in the MySQL database (which is also highly available):
ja: すべてのものを (高可用性) MySQL データベースに保存して、すべてのデータが高可用性になっていることを確認します。
tr_tr: Tüm verinin yüksek kullanılırlıklı olduğundan emin olmak için, herşeyin MYSQL veritabanında depolandığından emin olun (kendisi de yüksek kullanılırlıklı olmak üzere):

source: To configure AppArmor to work with Galera Cluster, complete the following steps on each cluster node:
ja: 各クラスターノードにおいて以下の手順を実行して、Galera Cluster を正常に動作させるために AppArmor を設定します。
tr_tr: AppArmor'u Galera Kümesi ile çalışacak şekilde yapılandırmak için, her bir küme düğümünde aşağıdaki adımları tamamlayın:

source: To configure SELinux to permit Galera Cluster to operate, complete the following steps on each cluster node:
ja: 各クラスターノードにおいて以下の手順を実行して、Galera Cluster の動作を許可するために SELinux を設定します。

source: To do so, stop RabbitMQ everywhere and copy the cookie from the first node to each of the other node(s):
ja: そうするために、すべての場所で RabbitMQ を停止して、1 番目のノードのクッキーを他のノードにコピーします。

source: To ensure that all queues except those with auto-generated names are mirrored across all running nodes, set the ``ha-mode`` policy key to all by running the following command on one of the nodes:
ja: 自動生成された名前を持つキューを除いて、すべてのキューがすべての動作中のノードで確実にミラーするために、以下のコマンドをどこかのノードで実行して、 ``ha-mode`` ポリシーキーを all に設定します。
tr_tr: Otomatik üretilen isimlere sahip olanlar hariç tüm kuyrukların tüm çalışan düğümlerde yansılandığından emin olmak için, düğümlerden biri üzerinde aşağıdaki komutu çalıştırarak ``ha-mode`` ilke anahtarını hepsi olarak ayarlayın:

source: To find the most advanced cluster node, you need to check the sequence numbers, or seqnos, on the last committed transaction for each. You can find this by viewing ``grastate.dat`` file in database directory,
ja: 最も高度なクラスターノードを見つけるために、各ノードの最新コミットのトランザクションにあるシーケンス番号を確認する必要があります。データベースディレクトリーにある ``grastate.dat`` ファイルを表示すると、これを見つけられます。

source: To implement any changes made to this you must restart the HAProxy service
ja: これの変更を反映するために、HAProxy サービスを再起動する必要があります。

source: To install and configure memcached, read the `official documentation <https://code.google.com/p/memcached/wiki/NewStart>`_.
ja: memcached をインストールして設定する方法は、 `公式ドキュメント <https://code.google.com/p/memcached/wiki/NewStart>`_ を参照してください。

source: To make this configuration persistent, repeat the above commands with the :option:`--permanent` option.
ja: :option:`--permanent` オプションを付けて上のコマンドを繰り返して、この設定を永続化します。

source: To start the cluster, complete the following steps:
ja: 以下の手順を実行して、クラスターを起動します。
tr_tr: Kümeyi başlatmak için, aşağıdaki adımları tamamlayın:

source: To verify the cluster status:
ja: クラスターの状態を確認する方法:

source: Tooz supports `various drivers <http://docs.openstack.org/developer/tooz/drivers.html>`__ including the following back end solutions:
ja: Tooz は、以下のバックエンドソリューションを含む、 `さまざまなドライバー <http://docs.openstack.org/developer/tooz/drivers.html>`__ をサポートします。

source: True
ja: True (真)
tr_tr: Doğru

source: Typically, an active/active installation for a stateless service maintains a redundant instance, and requests are load balanced using a virtual IP address and a load balancer such as HAProxy.
ja: 一般的にステートレスサービスをアクティブ / アクティブにインストールすると、冗長なインスタンスを維持することになります。リクエストは HAProxy のような仮想 IP アドレスとロードバランサーを使用して負荷分散されます。
tr_tr: Genellikle, durumsuz bir servis için etkin/etkin bir kurulum yedek bir sunucuya da bakar, ve istekler bir sanal IP adresi ve HAProxy gibi bir yük dengeleyici ile dengelenir.

source: Update the local cache.
ja: ローカルキャッシュを更新します。

source: Use HA queues in RabbitMQ (x-ha-policy: all):
ja: RabbitMQ における HA キューの使用 (x-ha-policy: all):

source: Use MySQL/Galera in active/passive mode to avoid deadlocks on ``SELECT ... FOR UPDATE`` type queries (used, for example, by nova and neutron). This issue is discussed more in the following:
ja: MySQL/Galera をアクティブ/パッシブモードで使用して、 ``SELECT ... FOR UPDATE`` のような形式のクエリーにおけるデッドロックを避けます (例えば、nova や neutron により使用されます)。この問題は、以下において詳細に議論されています。

source: Use durable queues in RabbitMQ:
ja: RabbitMQ での永続キューの使用:
tr_tr: RabbitMQ'da dayanıklı kuyruklar kullan:

source: Use that password to authenticate to the nodes which will make up the cluster. The :option:`-p` option is used to give the password on command line and makes it easier to script.
ja: このパスワードを使用して、クラスターを構成するノードに認証します。 :option:`-p` オプションは、コマンドラインにおいてパスワードを指定して、スクリプト化しやすくするために使用されます。

source: Use the :command:`corosync-cfgtool` utility with the :option:`-s` option to get a summary of the health of the communication rings:
ja: :command:`corosync-cfgtool` ユーティリティーに :option:`-s` オプションを付けて実行して、コミュニケーションリングの稼働状態の概要を取得します。

source: Use the :command:`corosync-objctl` utility to dump the Corosync cluster member list:
ja: :command:`corosync-objctl` ユーティリティーを使用して、Corosync クラスターのメンバー一覧を出力します。
tr_tr: Corosync kümesi üye listesini dökmek için :command:`corosync-objctl` aracını kullanın:

source: Using Galera Cluster requires that you install two packages. The first is the database server, which must include the wsrep API patch. The second package is the Galera Replication Plugin, which enables the write-set replication service functionality with the database server.
ja: Galera Cluster を使用するために 2 つのパッケージをインストールする必要があります。1 つ目はデータベースサーバーです。wsrep API パッチを含める必要があります。2 つ目のパッケージは Galera Replication Plugin です。データベースサーバーの書き込みセットレプリケーションサービス機能を有効にします。

source: Using the ``semanage`` utility, open the relevant ports:
ja: ``semanage`` ユーティリティーを使用して、関連するポートを開きます。

source: Value
ja: 値
tr_tr: Değer

source: Verify that the nodes are running:
ja: そのノードが動作していることを検証します。
tr_tr: Düğümlerin çalıştığını doğrulayın:

source: We are building a cluster of RabbitMQ nodes to construct a RabbitMQ broker, which is a logical grouping of several Erlang nodes.
ja: RabbitMQ ブローカーを構成する RabbitMQ ノードのクラスターを構築しています。これは、いくつかの Erlang ノードの論理グループです。

source: We have to configure the OpenStack components to use at least two RabbitMQ nodes.
ja: 2 つ以上の RabbitMQ ノードを使用するよう、OpenStack のコンポーネントを設定する必要があります。

source: We recommend HAProxy as the load balancer, however, there are many alternatives in the marketplace.
ja: ロードバランサーとして HAProxy を推奨しますが、マーケットプレースにさまざまな同等品があります。

source: We use a check interval of 1 second, however, the timeouts vary by service.
ja: 1 秒間隔でチェックしますが、タイムアウト値はサービスにより異なります。

source: What is a cluster manager
ja: クラスターマネージャーとは

source: When Ceph RBD is used for ephemeral volumes as well as block and image storage, it supports `live migration <http://docs.openstack.org/admin-guide-cloud/compute-live-migration-usage.html>`_ of VMs with ephemeral drives; LVM only supports live migration of volume-backed VMs.
ja: Ceph RBD をブロックストレージやイメージストレージと同じように一時ストレージ用に使用する場合、一時ボリュームを持つ仮想マシンの `ライブマイグレーション <http://docs.openstack.org/admin-guide-cloud/compute-live-migration-usage.html>` がサポートされます。LVM のみがボリュームをバックエンドとした仮想マシンのライブマイグレーションをサポートします。

source: When configuring an OpenStack environment for study or demonstration purposes, it is possible to turn off the quorum checking; this is discussed later in this guide. Production systems should always run with quorum enabled.
ja: 学習やデモの目的に OpenStack 環境を設定している場合、クォーラムのチェックを無効化できます。このガイドで後から議論します。本番システムは必ずクォーラムを有効化して実行すべきです。

source: When each cluster node starts, it checks the IP addresses given to the ``wsrep_cluster_address`` parameter and attempts to establish network connectivity with a database server running there. Once it establishes a connection, it attempts to join the Primary Component, requesting a state transfer as needed to bring itself into sync with the cluster.
ja: 各クラスターノードが起動したとき、``wsrep_cluster_address`` パラメーターに指定された IP アドレスを確認して、それで動作しているデータベースサーバーへのネットワーク接続性を確立しようとします。接続が確立されると、クラスターを同期するために必要となる状態転送を要求する、Primary Component に参加しようとします。

source: When installing highly-available OpenStack on VMs, be sure that your hypervisor permits promiscuous mode and disables MAC address filtering on the external network.
ja: 仮想マシン上に高可用性 OpenStack をインストールする場合、ハイパーバイザーが外部ネットワークにおいてプロミスキャスモードを許可して、MAC アドレスフィルタリングを無効化していることを確認してください。

source: When you find the correct path, run the :command:`iptables-save` command:
ja: 適切なパスを見つけたとき、 :command:`iptables-save` コマンドを実行します。

source: When you finish enabling the software repository for Galera Cluster, you can install it using your package manager. The particular command and packages you need to install varies depending on which database server you want to install and which Linux distribution you use:
ja: Galera Cluster のソフトウェアリポジトリーを有効化すると、パッケージマネージャーを使用してインストールできます。インストールに必要となる具体的なコマンドやパッケージは、インストールしたいデータベースサーバーと使用する Linux ディストリビューションにより異なります。

source: When you finish the installation and configuration process on each cluster node in your OpenStack database, you can initialize Galera Cluster.
ja: 各ノードにおいて、お使いの OpenStack データベースのインストールと設定を完了すると、Galera Cluster を初期化できます。

source: When you have all cluster nodes started, log into the database client on one of them and check the ``wsrep_cluster_size`` status variable again.
ja: すべてのクラスターノードを起動したとき、どれか 1 つにデータベースクライアントからログインして、``wsrep_cluster_size`` 状態変数を再び確認します。

source: While all of the configuration parameters available to the standard MySQL, MariaDB or Percona XtraDB database server are available in Galera Cluster, there are some that you must define an outset to avoid conflict or unexpected behavior.
ja: 標準的な MySQL、MariaDB、Percona XtraDB データベースに利用できる設定パラメーターは Galera Cluster で利用できますが、競合や予期しない動作を避けるために始めに定義する必要があるものがあります。

source: While the application can still run after the failure of several instances, it may not have sufficient capacity to serve the required volume of requests. A cluster can automatically recover failed instances to prevent additional load induced failures.
ja: アプリケーションは、いくつかのインスタンスが故障した後も動作できますが、要求されたリクエスト量を処理するための十分な容量がないかもしれません。クラスターは自動的に故障したインスタンスを復旧して、さらなる負荷が障害を引き起こさないようにできます。
tr_tr: Uygulama birçok sunucunun arızası durumunda da çalışabilse de, istek yoğunluğuna yanıt verecek yeterli kapasiteye sahip olmayabilir. Küme arızalı sunucuları otomatik olarak kurtarıp ek yüke dayalı arızaları önleyebilir.

source: While there will be multiple neutron LBaaS agents running, each agent will manage a set of load balancers, that cannot be failed over to another node.
ja: 複数の neutron LBaaS エージェントが動作していますが、各エージェントは 1 組のロードバランサーを管理し、他のノードにフェールオーバーできません。

source: With ``secauth`` enabled, Corosync nodes mutually authenticate using a 128-byte shared secret stored in the :file:`/etc/corosync/authkey` file, which may be generated with the :command:`corosync-keygen` utility. When using ``secauth``, cluster communications are also encrypted.
ja: ``secauth`` を有効化すると、Corosync ノードが :file:`/etc/corosync/authkey` に保存された 128 バイトの共有シークレットを使用して相互に認証されます。これは、 :command:`corosync-keygen` ユーティリティーを使用して生成できます。 ``secauth`` を使用している場合、クラスター通信も暗号化されます。

source: With the firewall configuration saved, whenever your OpenStack database starts.
ja: ファイアウォール設定を保存すると、OpenStack データベースを起動するときいつでも。

source: With these options set, SELinux now permits Galera Cluster to operate.
ja: これらのオプションを設定すると、SELinux により Galera Cluster の動作を許可されます。

source: Within the ``nodelist`` directive, it is possible to specify specific information about the nodes in the cluster. The directive can contain only the node sub-directive, which specifies every node that should be a member of the membership, and where non-default options are needed. Every node must have at least the ``ring0_addr`` field filled.
ja: ``nodelist`` ディレクティブに、クラスター内のノードに関する具体的な情報を指定できます。このディレクティブは、node サブディレクティブのみを含められます。これは、メンバーシップのすべてのメンバーを指定し、デフォルト以外に必要となるオプションを指定します。すべてのノードは、少なくとも ``ring0_addr`` の項目を入力する必要があります。
tr_tr: ``nodelist`` yönergesi içinde, küme içindeki düğümlerle ilgili belirli bilgileri belirtmek mümkündür. Yönerge yalnızca düğüm alt-yönergesini içerebilir, bu da aboneliğin üyesi olması gereken ve varsayılan dışında seçeneklerin gerektiği her düğümü belirtir. Her düğümün en azından ``ring0_addr`` alanı dolu olmalıdır.

source: Without the ``backend_url`` option being set only one instance of both the central and compute agent service is able to run and function correctly.
ja: ``backend_url`` オプションを設定しないと、中央エージェントとコンピュートエージェントのインスタンスのどちらかのみが正しく動作して機能できます。

source: You also need to create the OpenStack Identity Endpoint with this IP address.
ja: この IP アドレスを用いて OpenStack Identity エンドポイントを作成する必要があります。

source: You can achieve high availability for the OpenStack database in many different ways, depending on the type of database that you want to use. There are three implementations of Galera Cluster available to you:
ja: 使用したいデータベースの種類に応じて、さまざまな情報で OpenStack のデータベースの高可用性を実現できます。Galera Cluster は 3 種類の実装があります。
tr_tr: OpenStack veritabanı için yüksek kullanılırlığı kullanmak istediğiniz veritabanı türüne göre farklı yollarla elde edebilirsiniz. Kullanabileceğiniz üç Galera Kümesi uygulaması bulunmaktadır:

source: You can alternatively use a commercial load balancer, which is a hardware or software. A hardware load balancer generally has good performance.
ja: 代わりに、ハードウェアやソフトウェアの商用ロードバランサーを使用することもできます。ハードウェアロードバランサーは、一般的に高性能です。

source: You can have up to 16 cluster members (this is currently limited by the ability of corosync to scale higher). In extreme cases, 32 and even up to 64 nodes could be possible, however, this is not well tested.
ja: クラスターのメンバーを 16 まで持てます (これは、corosync をよりスケールさせる機能による、現在の制限です)。極端な場合、32 や 64 までのノードさえ利用できますが、十分にテストされていません。

source: You can now add the Pacemaker configuration for Block Storage API resource. Connect to the Pacemaker cluster with the :command:`crm configure` command and add the following cluster resources:
ja: Block Storage API リソース用の Pacemaker 設定を追加できます。 :command:`crm configure` を用いて Pacemaker クラスターに接続し、以下のクラスターリソースを追加します。
tr_tr: Artık Blok Depolama API kaynağı için Pacemaker yapılandırması ekleyebilirsiniz. :command:`crm configure` komutu ile Pacemaker kümesine bağlanın ve aşağıdaki küme kaynaklarını ekleyin:
