Repository: openstack/openstack-manuals
Catalog: doc/ha-guide/source/locale/*/LC_MESSAGES/ha-guide.po
Languages: ja, tr_tr

source: As of September 2016, the OpenStack High Availability community is designing and developing an official and unified way to provide high availability for instances. We are developing automatic recovery from failures of hardware or hypervisor-related software on the compute node, or other failures that could prevent instances from functioning correctly, such as, issues with a cinder volume I/O path.
tr_tr: Eylül 2016 itibariyle, OpenStack Yüksek Kullanılırlık topluluğu sunucular için yüksek kullanılırlık sağlamak için resmi ve birleştirilmiş bir yol tasarlıyor ve geliştiriyorlar. Hesaplama düğümünde donanımsal veya hipervizörle ligili yazılımsal arızalardan, veya cinder birim I/O yoluyla ilgili sunucuların düzgün işlemesine engel olan sorunlarda otomatik kurtarma geliştiriyoruz.

source: Before beginning, ensure that you are familiar with the documentation for installing the OpenStack Image API service. See the *Image service* section in the `Installation Tutorials and Guides <https://docs.openstack.org/ocata/install/>`_, depending on your distribution.
tr_tr: Başlamadan önce, OpenStack İmaj API servisi kurulumu için belgelendirmeye aşina olduğunuzdan emin olun. Dağıtımınıza uygun `Kurulum Öğreticileri ve Kılavuzlarındaki <https://docs.openstack.org/ocata/install/>`_ *İmaj servisi* kısmına göz atın.

source: Before beginning, ensure you have read the `OpenStack Identity service getting started documentation <https://docs.openstack.org/admin-guide/common/get-started-identity.html>`_.
tr_tr: Başlamadan önce, `OpenStack Kimlik servisi başlama belgelendirmesini <https://docs.openstack.org/admin-guide/common/get-started-identity.html>`_ okuduğunuzdan emin olun.

source: Before following this guide to configure the highly available OpenStack cluster, ensure the IP ``10.0.0.11`` and hostname ``controller`` are not in use.
tr_tr: Bu kılavuzu takip ederek yüksek kullanılır OpenStack kümesi yapılandırmadan önce, ``10.0.0.11`` IP adresinin ve ``controller`` makine adının kullanımda olmadığından emin olun.

source: Both the central and the compute agent can run in an HA deployment. This means that multiple instances of these services can run in parallel with workload partitioning among these running instances.
tr_tr: Hem merkezi hem hesaplama aracısı HA bir kurulumda çalışabilirler. Bunun anlamı bu servislerin çoklu şekilde paralel olarak iş yükünü çalışan sunucular arasında dağıtarak çalışabileceğidir.

source: Both use a cluster manager, such as Pacemaker or Veritas, to orchestrate the actions of the various services across a set of machines. Because we are focused on FOSS, we refer to these as Pacemaker architectures.
tr_tr: Her biri makine kümeleri arasındaçi çeşitli eylemleri yönetmek için Pacemaker veya Veritas gibi bir küme yönetici kullanır. FOSS üzerine eğildiğimizden, bunlara Pacemaker mimarileri olarak başvuracağız.

source: By default, STONITH is enabled in Pacemaker, but STONITH mechanisms (to shutdown a node via IPMI or ssh) are not configured. In this case Pacemaker will refuse to start any resources. For production cluster it is recommended to configure appropriate STONITH mechanisms. But for demo or testing purposes STONITH can be disabled completely as follows:
tr_tr: Öntanımlı olarak, STONITH Pacemaker'de etkindir, ama STONITH yöntemleri (bir düğümü IPMI veya ssh ile kapatmak için) yapılandırılmamıştır. Bu durumda Pacemaker herhangi bir kaynağı başlatmayı reddedecektir. Üretim kümesi için uygun STONITH yöntemlerini yapılandırmanız önerilir. Tanıtım veya deneme amaçlı olarak STONITH aşağıdaki gibi tamamen kapatılabilir:

source: By default, ``controller1`` handles the caching service. If the host goes down, ``controller2`` or ``controller3`` will complete the service.
tr_tr: Öntanımlı olarak, ``controller1`` önbellek servisini ele alır. Sunucu kapanırsa, ``controller2`` veya ``controller3`` servisi tamamlayacaktır.

source: By default, cluster nodes do not start as part of a Primary Component. In the Primary Component, replication and state transfers bring all databases to the same state.
tr_tr: Öntanımlı olarak, küme düğümleri bir Birincil Bileşenin parçası olarak başlamazlar. Birincil Bileşende, yedekleme ve durum aktarımları tüm veritabanlarını aynı duruma getirir.

source: By sending all API access through the proxy, you can clearly identify service interdependencies. You can also move them to locations other than ``localhost`` to increase capacity if the need arises.
tr_tr: Tüm API erişimini vekil aracılığıyla göndererek, servis dahili bağımlılıklarını açıkça tanımlayabilirsiniz. Ayrıca ihtiyaç halinde kapasiteyi artırmak için ``localhost`` dışında konumlara da taşıyabilirsiniz.

source: Ceph RBD provides object replication capabilities by storing Block Storage volumes as Ceph RBD objects. Ceph RBD ensures that each replica of an object is stored on a different node. This means that your volumes are protected against hard drive and node failures, or even the failure of the data center itself.
tr_tr: Ceph RBD Blok Depolama birimlerini Ceph RBD nesneleri olarak saklayarak nesne yedekleme yeteneği sağlar. Ceph RBD bir nesnenin her bir yedeğinin farklı bir düğümde saklandığından emin olur. Yani birimleriniz sabit disk ve düğüm arızalarından korunur, hatta veri merkezinin arızalanmasından bile.

source: Cinder provides Block-Storage-as-a-Service suitable for performance sensitive scenarios such as databases, expandable file systems, or providing a server with access to raw block level storage.
tr_tr: Cinder veritabanları, genişleyebilir dosya sistemleri veya bir sunucuya ham blok seviyesinde depolama erişimi sağlamak gibi hassas başarım senaryoları için Servis olarak blok depolama sağlar.

source: Clusters with an even number of hosts suffer from similar issues. A single network failure could easily cause a N:N split where neither side retains a majority. For this reason, we recommend an odd number of cluster members when scaling up.
tr_tr: Eşit sayıda sunucuya sahip kümeler benzer sorunlarla karşılaşır. Tek bir ağ arızası kolaylıkla iki tarafın da çoğunluğu tutmadığı N:N ayrımına yol açabilir. Bu sebeple ölçeklemede tek sayıda küme ögesi seçmenizi tavsiye ediyoruz.

source: Collapsed
tr_tr: Kapalı

source: Commit your configuration changes by entering the following command from the :command:`crm configure` menu:
tr_tr: :command:`crm configure` menüsünden aşağıdaki komutu girerek yapılandırma değişikliklerinizi gönderin:

source: Commit your configuration changes from the :command:`crm configure` menu with the following command:
tr_tr: Aşağıdaki komutla yapılandırma değişikliklerinizi :command:`crm configure` menüsünden gönderin:

source: Common deployment architectures
tr_tr: Genel kurulum mimarileri

source: Configure OpenStack services to use the highly available Block Storage API
tr_tr: OpenStack servislerini yüksek kullanılır Blok Depolama API'sini kullanacak şekilde yapılandırın

source: Configure OpenStack services to use the highly available OpenStack Image API
tr_tr: OpenStack servislerini yüksek kullanılır OpenStack İmaj API'sini kullanacak şekilde yapılandırma

source: Configure networking on each node. See the basic information about configuring networking in the *Networking service* section of the `Install Tutorials and Guides <https://docs.openstack.org/ocata/install/>`_, depending on your distribution.
tr_tr: Her bir düğümde ağı yapılandırın. Dağıtımınıza uygun `Kurulum Öğreticileri ve Kılavuzlarındaki <https://docs.openstack.org/ocata/install/>`_ *Ağ servisi* kısmında ağ yapılandırmasıyla ilgili temel bilgileri bulabilirsiniz.

source: Configure the OpenStack components to use at least two RabbitMQ nodes.
tr_tr: OpenStack bileşenlerini en az iki RabbitMQ düğümü kullanacak şekilde yapılandırın.

source: Configure the kernel parameter to allow non-local IP binding. This allows running HAProxy instances to bind to a VIP for failover. Add following line to ``/etc/sysctl.conf``:
tr_tr: Yerel-olmayan IP bağlamaya izin vermek için çekirdek parametresini yapılandırın. Bu HAProxy sunucuların bir VIP'e bağlanmasını ya da yedeğe geçmesine izin verir. ``/etc/sysctl.conf`` dosyasına şu satırı ekleyin:

source: Configuring RAID on the hard drives that implement storage protects your data against a hard drive failure. If the node itself fails, data may be lost. In particular, all volumes stored on an LVM node can be lost.
tr_tr: Depolamayı sağlayan sabit diskler üzerinde RAID yapılandırmak verinizi sabit disk arızalarından korur. Düğüm kendisi arızalanırsa veri kaybolabilir. Özellikle LVM düğümünde depolanan tüm birimler kaybolabilir.

source: Configuring high availability for instances
tr_tr: Sunucular için yüksek kullanılırlık yapılandırması

source: Configuring mysqld
tr_tr: Mysqld'yi yapılandırma

source: Configuring storage
tr_tr: Depolamanın yapılandırılması

source: Configuring the basic environment
tr_tr: Temel ortamın yapılandırılması

source: Configuring the compute node
tr_tr: Hesaplama düğümünü yapılandırın

source: Configuring the controller
tr_tr: Denetleyicini yapılandırılması

source: Configuring the networking services
tr_tr: Ağ servislerinin yapılandırılması

source: Configuring the shared services
tr_tr: Paylaşımlı servisleri yapılandırın

source: Consider that, while exchanges and bindings survive the loss of individual nodes, queues and their messages do not because a queue and its contents are located on one node. If we lose this node, we also lose the queue.
tr_tr: Değişimler ve bağlar tek düğümlerin kaybını kaldırabilse de, kuyruklar ve iletileri kaldıramaz çünkü bir kuyruk ve içerikleri bir düğüm üzerinde bulunur. Bu düğümü kaybedersek, kuyruğu da kaybederiz.

source: Corosync is started as a regular system service. Depending on your distribution, it may ship with an LSB init script, an upstart job, or a Systemd unit file.
tr_tr: Corosync düzenli bir sistem servisi olarak başlatılır. Dağıtımınıza göre, bir LSB başlangıç betiği, upstart işi veya Systemd birim dosyası olabilir.

source: Create and name the cluster. Then, start it and enable all components to auto-start at boot time:
tr_tr: Kümeyi oluşturun ve isimlendirin. Ardından başlatın ve tüm bileşenleri önyükleme zamanında otomatik başlayacak şekilde etkinleştirin:

source: Create the Block Storage API endpoint with this IP.
tr_tr: Bu IP ile Blok Depolama API uç noktasını oluşturun.

source: Create the OpenStack Identity Endpoint with this IP address.
tr_tr: Bu IP adresiyle OpenStack Kimlik Uç Noktasını oluşturun.

source: Current upstream work
tr_tr: Mevcut yapılan iş

source: Data loss: Accidental deletion or destruction of data.
tr_tr: Veri kaybı: Verinin kazayla silinmesi veya bozulması.

source: Database (Galera Cluster) for high availability
tr_tr: Yüksek kullanılırlık için veritabanı (Galera Kümesi)

source: Database hosts with Galera Cluster installed
tr_tr: Galera Kümesi yüklü veritabanı sunucuları

source: Download the resource agent to your system:
tr_tr: Kaynak aracısını sisteminize indirin:

source: Each instance has its own IP address:
tr_tr: Her bir sunucu kendi IP adresine sahiptir:

source: Each instance of HAProxy configures its front end to accept connections only to the virtual IP (VIP) address. The HAProxy back end (termination point) is a list of all the IP addresses of instances for load balancing.
tr_tr: Her bir HAProxy ön yüzünü yalnızca sanal IP (VIP) adresinden bağlantı kabul edecek şekilde yapılandırır. HAProxy arka ucu (sonlanma noktası) yük dengeleme için olan sunucuların IP adresi listesidir.

source: Edit the :file:`/etc/glance/glance-api.conf` file to configure the OpenStack Image service:
tr_tr: :file:`/etc/glance/glance-api.conf` dosyasını düzenleyerek OpenStack İmaj servisini yapılandırın:

source: Edit the ``/etc/cinder/cinder.conf`` file. For example, on a RHEL-based system:
tr_tr: ``/etc/cinder/cinder.conf`` dosyasını düzenleyin. Örneğin RHEL tabanlı sistemlerde:

source: Ensure that the InnoDB locking mode for generating auto-increment values is set to ``2``, which is the interleaved locking mode:
tr_tr: Otomatik artırma değerleri üretmek için InnoDB kilitleme kipinin sıralı birleştirme kilit kipi olan ``2`` olarak ayarlandığından emn olun:

source: Ensure that the database server is not bound only to the localhost: ``127.0.0.1``. Also, do not bind it to ``0.0.0.0``. Binding to the localhost or ``0.0.0.0`` makes ``mySQL`` bind to all IP addresses on the machine, including the virtual IP address causing ``HAProxy`` not to start. Instead, bind to the management IP address of the controller node to enable access by other nodes through the management network:
tr_tr: Veritabanı sunucusunun yalnızca localhost: ``127.0.0.1`` adresine bağlı olmadığından emin olun. Ayrıca ``0.0.0.0`` adresine de bağlamayın. localhost veya ``0.0.0.0`` adresine bağlamak ``mySQL``in makinedeki tüm IP adreslerine bağlanması demektir, buna sanal IP adresi de dahildir bu da ``HAProxy``nin başlamamasına sebep olur. Bunun yerine kontrol düğümünün yönetim IP adresine bağlayarak diğer düğümlerden erişimi yönetim ağı üzerinden etkinleştirin:

source: Ensure your HAProxy installation is not a single point of failure, it is advisable to have multiple HAProxy instances running.
tr_tr: HAProxy kurulumunuzun tek bir kırılma noktası olmadığından emin olun, birden çok HAProxy sunucusu çalıştırılması önerilir.

source: Ephemeral storage is allocated for an instance and is deleted when the instance is deleted. The Compute service manages ephemeral storage and by default, Compute stores ephemeral drives as files on local disks on the compute node. As an alternative, you can use Ceph RBD as the storage back end for ephemeral storage.
tr_tr: Geçici depolama sunucu için ayrılır ve sunucu silindiğinde silinir. Geçici depolamayı Hesaplama servisi yönetir, ve öntanımlı olarak Hesaplama geçici sürücüleri hesaplama düğümündeki yerel disklerde dosya olarak tutar. Alternatif olarak, geçici depolama için arka uç olarak Ceph RBD kullanabilirsiniz.

source: Even a distributed or replicated application that is able to survive failures on one or more machines can benefit from a cluster manager because a cluster manager has the following capabilities:
tr_tr: Bir ya da daha fazla makinede arızaları kaldırabilen dağıtık ya da yedekli bir uygulama bile bir küme yöneticiden faydalanabilir çünkü küme yönetici şu yeteneklere sahiptir:

source: Existing solutions
tr_tr: Mevcut çözümler

source: For Liberty, you can not have the standalone network nodes. The Networking services are run on the controller nodes. In this guide, the term `network nodes` is used for convenience.
tr_tr: Liberty için, bağımsız ağ düğümlerine sahip olamazsınız. Ağ servisleri kontrol düğümlerinde çalışır. Bu kılavuzda, kolaylık olması için `ağ düğümleri` terimi kullanılmıştır.

source: For OpenStack Compute, (if your OpenStack Identity service IP address is 10.0.0.11) use the following configuration in the :file:`api-paste.ini` file:
tr_tr: OpenStack Hesaplama için, (OpenStack Kimlik servisi IP adresiniz 10.0.0.11 ise) :file:`api-paste.ini` dosyasında şu yapılandırmayı kullanın:

source: For RHEL, Fedora, or CentOS:
tr_tr: RHEL, Fedora veya CentOS için:

source: For Red Hat Enterprise Linux and Red Hat-based Linux distributions, the following process uses Systemd unit files.
tr_tr: Red Hat Kurumsal Linux ve Red Hat tabanlı Linux dağıtımları için, aşağıdaki süreç Systemd birim dosyaları kullanır.

source: For SLES 12:
tr_tr: SLES 12 için:

source: For Ubuntu 16.04.1: Create a configuration file for ``clustercheck`` at ``/etc/default/clustercheck``.
tr_tr: Ubuntu 16.04.1 için: ``/etc/default/clustercheck`` konumunda ``clustercheck`` için bir yapılandırma dosyası oluşturun.

source: For Ubuntu or Debian:
tr_tr: Ubuntu veya Debian için:

source: For `Fedora <https://fedoraproject.org/wiki/How_to_edit_iptables_rules>`_
tr_tr: `Fedora <https://fedoraproject.org/wiki/How_to_edit_iptables_rules>`_ için

source: For `Ubuntu <https://askubuntu.com/questions/66890/how-can-i-make-a-specific-set-of-iptables-rules-permanent#66905>`_
tr_tr: `Ubuntu <https://askubuntu.com/questions/66890/how-can-i-make-a-specific-set-of-iptables-rules-permanent#66905>`_ için

source: For backward compatibility and supporting existing deployments, the central agent configuration supports using different configuration files. This is for groups of service instances that are running in parallel. For enabling this configuration, set a value for the ``partitioning_group_prefix`` option in the `polling section <https://docs.openstack.org/ocata/config-reference/telemetry/telemetry-config-options.html>`_ in the OpenStack Configuration Reference.
tr_tr: Geriye uyumluluk ve mevcut kurulumlara destek için, merkezi aracı yapılandırması farklı yapılandırma dosyalarının kullanımını destekler. Bu paralel olarak çalışan servis sunucu grupları içindir. Bu yapılandırmayı etkinleştirmek için, OpenStack Yapılandırma Kılavuzunda `yoklama kısmındaki <https://docs.openstack.org/ocata/config-reference/telemetry/telemetry-config-options.html>`_ ``partitioning_group_prefix`` seçeneği için bir değer ayarlayın.

source: For detailed instructions about installing HAProxy on your nodes, see the HAProxy `official documentation <http://www.haproxy.org/#docs>`_.
tr_tr: Düğümlerinize HAProxy kurmak hakkında ayrıntılı bilgi için, HAProxy `resmi belgelendirmesine <http://www.haproxy.org/#docs>`_ göz atın.

source: For documentation about these parameters, ``wsrep`` provider option, and status variables available in Galera Cluster, see the Galera cluster `Reference <http://galeracluster.com/documentation-webpages/reference.html>`_.
tr_tr: Bu parametrelerle ilgili belgelendirme, ``wsrep`` sağlayıcı seçeneği, ve Galera Kümesindeki kullanılabilir durum değişkenleri için, Galera küme `Başvurusuna<http://galeracluster.com/documentation-webpages/reference.html>`_ göz atın.

source: For each sub-group of the central agent pool with the same ``partitioning_group_prefix``, a disjoint subset of meters must be polled to avoid samples being missing or duplicated. The list of meters to poll can be set in the :file:`/etc/ceilometer/pipeline.yaml` configuration file. For more information about pipelines see the `Data processing and pipelines <https://docs.openstack.org/admin-guide/telemetry-data-pipelines.html>`_ section.
tr_tr: Aynı ``partitioning_group_prefix`` değerine sahip merkezi aracı havuzu alt grubu için, örneklerin kayıp ya da kopya olmasını engellemek için ölçümlerin ayrık alt kümeler yoklanmalıdır. Yoklanacak ölçümlerin listesi :file:`/etc/ceilometer/pipeline.yaml` yapılandırma dosyasında ayarlanabilir. Yönlendirmelerle ilgili daha fazla bilgi için `Veri işleme ve yönlendirme <https://docs.openstack.org/admin-guide/telemetry-data-pipelines.html>`_ kısmına göz atın.

source: For environments that do not support multicast, Corosync should be configured for unicast. An example fragment of the :file:`corosync.conf` file for unicastis is shown below:
tr_tr: Çoklu yayın desteklemeyen ortamlar için, Corosync tekli yayın için yapılandırılmalıdır. Tekli yayınlar için ayarlanmış :file:`corosync.conf` dosyasının örnek bir parçası aşağıdadır:

source: For example, if your OpenStack Image API service IP address is 10.0.0.11 (as in the configuration explained here), you would use the following configuration in your :file:`nova.conf` file:
tr_tr: Örneğin, OpenStack İmaj API servisi IP adresiniz 10.0.0.11 ise (burada açıklanan yapılandırmadaki gibi) :file:`nova.conf` dosyanızda aşağıdaki yapılandırmayı kullanırdınız:

source: For example, in a seven-node cluster, the quorum should be set to ``floor(7/2) + 1 == 4``. If quorum is four and four nodes fail simultaneously, the cluster itself would fail, whereas it would continue to function, if no more than three nodes fail. If split to partitions of three and four nodes respectively, the quorum of four nodes would continue to operate the majority partition and stop or fence the minority one (depending on the no-quorum-policy cluster configuration).
tr_tr: Örneğin yedi düğümlük bir kümede, yetersayı ``taban(7/2) + 1 == 4`` olarak ayarlanmalıdır. Yetersayı dört ise ve dört düğüm aynı anda arızalanırsa, küme de başarısız olur, üç düğümden fazlası arızalanmazsa çalışmaya devam eder. Eğer üç ve dört düğüm olarak parçalandıysa, dört düğümlük yetersayı ile çoğunluğun olduğu kısımda işlemeye devam edecektir ve azınlıkta kalanları durduracak ya da yalıtacaktır (no-quorum-policy küme yapılandırmasına dayanarak).

source: For example, you may enter ``edit p_ip_glance-api`` from the :command:`crm configure` menu and edit the resource to match your preferred virtual IP address.
tr_tr: Örneğin :command:`crm configure` menüsünden ``edit p_ip_glance-api`` girip kaynağı düzenleyerek tercih ettiğiniz sanal IP adresi ile eşleştirebilirsiniz.

source: For example, you may enter ``edit p_ip_keystone`` from the :command:`crm configure` menu and edit the resource to match your preferred virtual IP address.
tr_tr: Örneğin, :command:`crm configure` menüsünden ``edit p_ip_keystone`` girmeniz ve kaynağı tercih edilen sanal IP adresiyle eşleşecek şekilde düzenlemeniz gerekebilir.

source: For example, you may enter ``edit p_ip_manila-api`` from the :command:`crm configure` menu and edit the resource to match your preferred virtual IP address.
tr_tr: Örneğin :command:`crm configure` menüsünden ``edit p_ip_manila-api`` girebilir ve kaynağı tercih ettiğiniz sanal IP adresi ile eşleşecek şekilde düzenleyebilirsiniz.

source: For firewall configurations, Corosync communicates over UDP only, and uses ``mcastport`` (for receives) and ``mcastport - 1`` (for sends).
tr_tr: Güvenlik duvarı yapılandırmaları için, Corosync yalnızca UDP üzerinden iletişim kurar, ve ``mcastport`` (alıcılar için) ve ``mcastport - 1`` (göndericiler için) kullanır.

source: For information about the required configuration options to set in the :file:`ceilometer.conf`, see the `coordination section <https://docs.openstack.org/ocata/config-reference/telemetry.html>`_ in the OpenStack Configuration Reference.
tr_tr: :file:`ceilometer.conf` dosyasında ayarlanacak gerekli yapılandırma seçenekleri hakkında bilgi için, OpenStack Yapılandırma Başvurusundaki `eşgüdüm kısmına <https://docs.openstack.org/ocata/config-reference/telemetry.html>`_ göz atın.

source: For more information about Memcached installation, see the *Environment -> Memcached* section in the `Installation Tutorials and Guides <https://docs.openstack.org/ocata/install/>`_ depending on your distribution.
tr_tr: Memcached kurulumuyla ilgili daha fazla bilgi için dağıtımınıza göre `Kurulum Öğreticileri ve Kılavuzlarındaki <https://docs.openstack.org/ocata/install>`_ *Ortam -> Memcached* kısmına göz atın.

source: For more information about configuring storage back ends for the different storage options, see `Manage volumes <https://docs.openstack.org/admin-guide/blockstorage-manage-volumes.html>`_ in the OpenStack Administrator Guide.
tr_tr: Farklı depolama seçenekleri için depolama arka uçları yapılandırmayla ilgili daha fazla bilgi için, OpenStack Yönetici Kılavuzundaki `Birimlerin yönetimine <https://docs.openstack.org/admin-guide/blockstorage-manage-volumes.html>`_ göz atın.

source: For more information on configuring SELinux to work with Galera Cluster, see the `SELinux Documentation <http://galeracluster.com/documentation-webpages/selinux.html>`_
tr_tr: SELinux'u Galera Kümesi ile çalışacak şekilde yapılandırmayla ilgili daha fazla bilgi için `SELinux Belgelendirmesine <http://galeracluster.com/documentation-webpages/selinux.html>`_ göz atın
