Repository: openstack/openstack-manuals
Catalog: doc/ha-guide/source/locale/*/LC_MESSAGES/ha-guide.po
Languages: ja, tr_tr

source: For more information on firewalls, see `firewalls and default ports <https://docs.openstack.org/admin-guide/firewalls-default-ports.html>`_ in OpenStack Administrator Guide.
tr_tr: Güvenlik duvarlarıyla ilgili daha fazla bilgi için, OpenStack Yönetici Kılavuzunda `güvenlik duvarları ve öntanımlı bağlantı noktalarına <https://docs.openstack.org/admin-guide/firewalls-default-ports.html>`_ göz atın.

source: For openSUSE:
tr_tr: openSUSE için:

source: For servers that use ``systemd``, run the following command:
tr_tr: ``systemd`` kullanan sunucularda şu komutu çalıştırın:

source: For servers that use ``systemd``, run the following commands:
tr_tr: ``systemd`` kullanan sunucular için, aşağıdaki komutları çalıştırın:

source: For these reasons, we highly recommend the use of a cluster manager like `Pacemaker <http://clusterlabs.org>`_.
tr_tr: Bu sebeplerle, `Pacemaker <http://clusterlabs.org>`_ gibi bir küme yöneticiyi kesinlikle öneriyoruz.

source: For this reason, each cluster in a high availability environment should have an odd number of nodes and the quorum is defined as more than a half of the nodes. If multiple nodes fail so that the cluster size falls below the quorum value, the cluster itself fails.
tr_tr: Bu sebeple, yüksek kullanılır bir ortamdaki her bir küme tek sayıda düğüme sahip olmalı ve yetersayı düğümlerin yarısından fazlası olarak tanımlanmalıdır. Birden çok düğüm arızalanır ve küme boyutu yetersayı boyutunun altına düşerse, küme kendisi başarısız olur.

source: Galera Cluster configuration parameters all have the ``wsrep_`` prefix. You must define the following parameters for each cluster node in your OpenStack database.
tr_tr: Galera Kümesi yapılandırma parametrelerinin ``wsrep_`` öneki bulunur. OpenStak veritabanınızdaki her küme düğümü için aşağıdaki parametreleri tanımlamalısınız.

source: Galera Cluster requires that you open the following ports to network traffic:
tr_tr: Galera Kümesi aşağıdaki bağlantı noktalarını ağ trafiğine açmanızı gerektirir:

source: Galera runs behind HAProxy:
tr_tr: Galera HAProxy arkasında çalışır:

source: Galera synchronous replication guarantees a zero slave lag. The failover procedure completes once HAProxy detects that the active back end has gone down and switches to the backup one, which is then marked as ``UP``. If no back ends are ``UP``, the failover procedure finishes only when the Galera Cluster has been successfully reassembled. The SLA is normally no more than 5 minutes.
tr_tr: Galera eşzamanlı çoğaltma sıfır gecikmeli köleler garantiler. Arıza geçiş yöntemi HAProxy etkin arka ucun gittiğini algılayıp yedek olana geçtiğinde tamamlanır, ardından yeni etkin ``AÇIK`` olarak işaretlenir. Hiçbir arka uç ``AÇIK`` değilse arıza geçiş yöntemi yalnızca Galera Kümesi yeniden bir araya geldiğinde biter. SLA normalde 5 dakikadan fazla değildir.

source: Generally, we use round-robin to distribute load amongst instances of active/active services. Alternatively, Galera uses ``stack-table`` options to ensure that incoming connection to virtual IP (VIP) are directed to only one of the available back ends. This helps avoid lock contention and prevent deadlocks, although Galera can run active/active. Used in combination with the ``httpchk`` option, this ensure only nodes that are in sync with their peers are allowed to handle requests.
tr_tr: Genellikle, etkin/etkin servislerin sunucuları arasında sıralı yük dağıtımı kullanırız. Alternatif olarak, Galera sanal IP'ye (VIP) gelen bağlantının kullanılabilir arka uçlardan yalnızca tekine yönlendirildiğinden emin olmak için ``yığın-tablosu`` seçeneklerini kullanır. Galera etkin/etkin çalışabilse de, bu kilit çekişmelerinden uzak durmayı ve ölü kilitleri önlemeyi sağlar. ``httpchk`` seçeneğiyle birlikte kullanıldığında, yalnızca eşleriyle eşzamanlı olan düğümlerin istekleri ele alma izni olduğundan emin olunur.

source: High availability is implemented with redundant hardware running redundant instances of each service. If one piece of hardware running one instance of a service fails, the system can then failover to use another instance of a service that is running on hardware that did not fail.
tr_tr: Yüksek kullanılırlık her servisin yedeğini çalıştıran yedekli donanım ile uygulanır. Bir servisi çalıştıran bir donanım parçası arızalanırsa, sistem arızalanmayan donanımda çalışan servisi kullanacak şekilde geçiş yapabilir.

source: High availability systems seek to minimize the following issues:
tr_tr: Yüksek kullanılabilir sistemler şu sorunları asgariye indirmeye çalışır:

source: Highly available Identity API
tr_tr: Yüksek kullanılırlıklı Kimlik API'si

source: Highly available Image API
tr_tr: Yüksek kullanılır İmaj API'si

source: Highly available Telemetry
tr_tr: Yüksek kullanılır Telemetri

source: How long to back-off for between retries when connecting to RabbitMQ:
tr_tr: RabbitMQ'ya bağlanırken yeniden denemeler arasında ne kadar bekleneceği:

source: However, running an OpenStack environment on VMs degrades the performance of your instances, particularly if your hypervisor or processor lacks support for hardware acceleration of nested VMs.
tr_tr: Ancak, bir OpenStack ortamını sanal makineler üzerinde çalıştırmak sunucularınızın başarımını azaltır, özellikle hipervizörünüz veya işlemciniz içiçe sanal makinler için donanım hızlandırması desteğine sahip değilse.

source: If the Identity service will be sending ceilometer notifications and your message bus is configured for high availability, you will need to ensure that the Identity service is correctly configured to use it. For details on how to configure the Identity service for this kind of deployment, see :doc:`shared-messaging`.
tr_tr: Kimlik servisi ceilometer bildirilerini gönderecekse ve ileti yolunuz yüksek kullanılırlık için yapılandırılmışsa, Kimlik servisinin bunu kullanacak şekilde düzgün yapılandırıldığından emin olmalısınız. Kimlik servisinin bu tür bir kurulum için nasıl yapılandırılacağıyla ilgili ayrıntılar için bknz :doc:`shared-messaging`.

source: If the ``broadcast`` parameter is set to ``yes``, the broadcast address is used for communication. If this option is set, the ``mcastaddr`` parameter should not be set.
tr_tr: ``broadcast`` parametresi ``yes`` olarak ayarlanırsa, yayın adresi iletişim için kullanılır. Bu seçenek ayarlıysa, ``mcastaddr`` parametresi ayarlanmamalıdır.

source: If you are using Corosync version 2 on Ubuntu 14.04, remove or comment out lines under the service stanza. These stanzas enable Pacemaker to start up. Another potential problem is the boot and shutdown order of Corosync and Pacemaker. To force Pacemaker to start after Corosync and stop before Corosync, fix the start and kill symlinks manually:
tr_tr: Ubuntu 14.04 üzerinde Corosync sürüm 2 kullanıyorsanız, servis kıtasındaki satırları silin veya yorum satırına alın. Bu kıtalar Pacemaker'in başlayışını etkinleştirir. Potansiyel başka bir problem Corosync ve Pacemaker'in önyükleniş ve kapanış sıralarıyla ilgilidir. Pacemaker'in Corosync'den sonra başlamasını ve Corosync'den önce durmasını sağlamak için, başlama ve öldürme sembolik bağlarını elle düzeltin:

source: If you are using both private and public IP addresses, create two virtual IP addresses and define the endpoint. For example:
tr_tr: Hem özel hem açık IP adresleri kullanıyorsanız, iki sanal IP adresi oluşturun ve uç noktayı tanımlayın. Örneğin:

source: If you are using both private and public IP addresses, create two virtual IPs and define your endpoint. For example:
tr_tr: Hep gizli hem açık IP adresleri kullanıyorsanız, iki sanal IP oluşturun ve uç noktanızı tanımlayın. Örneğin:

source: If you are using the horizon Dashboard, edit the :file:`local_settings.py` file to include the following:
tr_tr: Horizon Kontrol Panelini kullanıyorsanız, :file:`local_settings.py` dosyasını aşağıdakileri içerecek şekilde düzenleyin:

source: If you change the configuration from an old set-up that did not use HA queues, restart the service:
tr_tr: Yapılandırmayı HA kuyrukları kullanmayan eski bir kurulumdan değiştirirseniz, servisi yeniden başlatın:

source: If you use HAProxy as a load-balancing client to provide access to the Galera Cluster, as described in the :doc:`controller-ha-haproxy`, you can use the ``clustercheck`` utility to improve health checks.
tr_tr: :doc:`controller-ha-haproxy` belgesinde tanımlandığı gibi Galera Kümesine erişim sağlamak için yük dengeleyen istemci olarak HAProxy kullanıyorsanız, sağlık kontrollerini iyileştirmek için ``clustercheck`` aracını kullanabilirsiniz.

source: In Corosync, configurations use redundant networking (with more than one interface). This means you must select a Redundant Ring Protocol (RRP) mode other than none. We recommend ``active`` as the RRP mode.
tr_tr: Corosync'de, yapılandırmalar yedekli ağ kullanır (birden fazla arayüzle). Bunun anlamı hiçbir şeyden ziyade Yedekli Halka İletişim Kuralı (RRP) kipini seçmeniz gerekeceğidir. RRP kipi olarak ``etkin`` öneriyoruz.

source: In a collapsed configuration, there is a single cluster of 3 or more nodes on which every component is running.
tr_tr: Kapalı yapılandırmada, her birinde tüm bileşenlerin çalıştığı 3 ya da daha fazla düğümden oluşan tek bir küme bulunur.

source: In general, we can divide all the OpenStack components into three categories:
tr_tr: Genelde, tüm OpenStack bileşenlerini üç kategoriye bölebiliriz:

source: In the Galera Cluster, the Primary Component is the cluster of database servers that replicate into each other. In the event that a cluster node loses connectivity with the Primary Component, it defaults into a non-operational state, to avoid creating or serving inconsistent data.
tr_tr: Galera Kümesinde, Birincil Bileşen birbiriyle yedekleme yapan veritabanı sunucuları kümesidir. Bir küme düğümünün Birincil Bileşenle bağlantıyı kaybettiği olaylarda, tutarsız veri oluşturmamak ya da sunmamak için öntanımlı olarak işlevsiz bir duruma düşer.

source: In the event that a component fails and a back-up system must take on its load, most high availability systems will replace the failed component as quickly as possible to maintain necessary redundancy. This way time spent in a degraded protection state is minimized.
tr_tr: Bir bileşenin arızalandığı ve yükünü yedek bir sistemin alması gerektiği durumlarda, çoğu yüksek kullanılır sistem arızalı bileşeni olabildiğince hızlı değiştirerek gerekli yedekliliği sağlar. Bu yolla kullanılamayan koruma durumunda geçirilen zaman asgari düzeyde tutulur.

source: In theory, you can run the Block Storage service as active/active. However, because of sufficient concerns, we recommend running the volume component as active/passive only.
tr_tr: Teoride Blok Depolama servisini etkin/etkin olarak çalıştırabilirsiniz. Ancak birim bileşenini yalnızca etkin/pasif çalıştırmanızı önermek için yeterli endişelerimiz var.

source: Individual cluster nodes can stop and be restarted without issue. When a database loses its connection or restarts, the Galera Cluster brings it back into sync once it reestablishes connection with the Primary Component. In the event that you need to restart the entire cluster, identify the most advanced cluster node and initialize the Primary Component on that node.
tr_tr: Bağımsız küme düğümleri durdurulabilir ve sorunsuzca yeniden başlatılabilir. Bir veritabanı bağlantısını kaybettiğinde veya yeniden başladığında, Galera Kümesi Birincil Bileşenle bağlantısını yeniden sağladığında tekrar onu eşzamanlar. Tüm kümeyi yeniden başlatmanız gerekirse, en gelişmiş küme düğümünü bulun ve Birincil Bİleşeni onun üzerinde başlatın.

source: Installing Memcached
tr_tr: Memcached Kurulumu

source: Installing the operating system
tr_tr: İşletim sisteminin kurulumu

source: It is possible to deploy three different flavors of the Pacemaker architecture. The two extremes are ``Collapsed`` (where every component runs on every node) and ``Segregated`` (where every component runs in its own 3+ node cluster).
tr_tr: Pacemaker mimarisinin üç farklı niteliğini kurmak mümkündür. En uç ikisi ``Kapalı`` (her bileşen her düğümde çalışır) ve ``Ayrılmış``tır (her bileşen kendi 3+ düğümlük kümesinde çalışır).

source: It is storage and application-agnostic, and in no way specific to OpenStack.
tr_tr: Depolama ve uygulama bilgisi yoktur, herhangi bir yönden OpenStack'e özel değildir.

source: It is very important that all members of the system share the same view of who their peers are and whether or not they are in the majority. Failure to do this leads very quickly to an internal `split-brain <https://en.wikipedia.org/wiki/Split-brain_(computing)>`_ state. This is where different parts of the system are pulling in different and incompatible directions.
tr_tr: Sistemin tüm ögelerinin eşlerinin kim olduğuyla ve çoğunlukta olup olmadıklarıyla ilgili aynı görüşe sahip olması çok önemlidir. Bunun yapılmaması çabucak dahili bir `ayrık-beyin <https://en.wikipedia.org/wiki/Split-brain_(computing)>`_ durumuna yol açar. Bu sistemin farklı parçalarının farklı ve uyumsuz yönlere çekmeye başladığı noktadır.

source: List the nodes known to the quorum service
tr_tr: Yetersayı servisi tarafından bilinen düğümleri listele

source: Locate your HAProxy instance on each OpenStack controller node in your environment. The following is an example ``/etc/haproxy/haproxy.cfg`` configuration file. Configure your instance using the following configuration file, you will need a copy of it on each controller node.
tr_tr: Ortamınızdaki her bir OpenStack kontrol düğümündeki HAProxy sunucunuzu bulun. Aşağıdaki bir ``/etc/haproxy/haproxy.cfg`` yapılandırma dosyası örneğidir. Aşağıdaki yapılandırma dosyasıyla sunucunuzu yapılandırın, her bir kontrol düğümünde bir kopyasına ihtiyacınız olacaktır.

source: Log in to the database client and grant the ``clustercheck`` user ``PROCESS`` privileges:
tr_tr: Veritabanı istemcisine giriş yapın ve ``clustercheck`` kullanıcısına ``PROCESS`` yetkisi verin:

source: Maintains a redundant instance that can be brought online when the active service fails. For example, OpenStack writes to the main database while maintaining a disaster recovery database that can be brought online if the main database fails.
tr_tr: Etkin servis arızalandığında yedek bir sunucuyu ayağa kaldıracak şekilde yönetir. Örneğin, OpenStack ana veritabanına yazarken ana veritabanı arızalanırsa çevrimiçi yapılacak bir felaket durumu kurtarma veritabanı yönetir.

source: Make sure `pcs` is running and configured to start at boot time:
tr_tr: `pcs`nin çalıştığına ve önyükleme aşamasında başlayacak şekilde yapılandırıldığına emin olun:

source: Make sure to save the changes once you are done. This will vary depending on your distribution:
tr_tr: İşiniz bittiğinde değişiklikleri kaydettiğinizden emin olun. Bu dağıtımınıza göre değişiklik gösterecektir:

source: Making the Block Storage (cinder) API service highly available in active/active mode involves:
tr_tr: Blok Depolama (cinder) API servisini etkin/etkin kipte yüksek kullanılır yapmak şunları içerir:

source: Making the Block Storage API service highly available in active/passive mode involves:
tr_tr: Blok Depolama API servisini etkin/pasif kipte yüksek kullanılabilir yapmak şunları içerir:

source: Making the OpenStack Identity service highly available in active and passive mode involves:
tr_tr: OpenStack Kimlik servisini etkin ve pasif kiplerde yüksek kullanılırlıklı yapmak şunları içerir:

source: Memory caching is managed by `oslo.cache <http://specs.openstack.org/openstack/oslo-specs/specs/kilo/oslo-cache-using-dogpile.html>`_. This ensures consistency across all projects when using multiple Memcached servers. The following is an example configuration with three hosts:
tr_tr: Hafıza önbellekleme `oslo.cache <http://specs.openstack.org/openstack/oslo-specs/specs/kilo/oslo-cache-using-dogpile.html>`_ tarafından yönetilir. Bu birden çok Memcached sunucusu kullanırken tüm projeler arasında tutarlılık sağlar. Aşağıda üç sunuculu bir yapılandırma örneği görebilirsiniz:

source: Messaging service for high availability
tr_tr: Yüksek kullanılırlık için ileti servisi

source: Mixed
tr_tr: Karışık

source: More details are available in the `user story <https://specs.openstack.org/openstack/openstack-user-stories/user-stories/proposed/ha_vm.html>`_ co-authored by OpenStack's HA community and `Product Working Group <https://wiki.openstack.org/wiki/ProductTeam>`_ (PWG), where this feature is identified as missing functionality in OpenStack, which should be addressed with high priority.
tr_tr: Daha fazla ayrıntıyı OpenStack HA topluluğu ve `Ürün Çalışma Grubu <https://wiki.openstack.org/wiki/ProductTeam>`_ (PWG) tarafından ortak yazılan ve bu özelliğin OpenStack'de eksik bir işlevsellik olduğunu, yüksek öncelikle ele alınması gerektiğini bildiren `kullanıcı hikayesinde <https://specs.openstack.org/openstack/openstack-user-stories/user-stories/proposed/ha_vm.html>`_ bulabilirsiniz.

source: Most OpenStack services can use Memcached to store ephemeral data such as tokens. Although Memcached does not support typical forms of redundancy such as clustering, OpenStack services can use almost any number of instances by configuring multiple hostnames or IP addresses.
tr_tr: Çoğu OpenStack servisi jetonlar gibi geçici verileri saklamak için Memcached kullanabilir. Memcached kümeleme gibi tipik yedekleme biçimlerini desteklemese de, OpenStack servisleri çoklu makine adları veya IP adresleri yapılandırarak istenen sayıda sunucuyu kullanabilir.

source: Most high availability systems guarantee protection against system downtime and data loss only in the event of a single failure. However, they are also expected to protect against cascading failures, where a single failure deteriorates into a series of consequential failures. Many service providers guarantee a :term:`Service Level Agreement (SLA)` including uptime percentage of computing service, which is calculated based on the available time and system downtime excluding planned outage time.
tr_tr: Çoğu yüksek kullanılabilir sistem sistem kapalı süresine ve veri kaybına karşı yalnızca tek bir arıza olayında koruma garantiler. Ancak aynı zamanda bir arızanın bir çok arızayı tetiklediği takip eden arızalara karşı korumaları beklenir. Çoğu servis sağlayıcı planlı kesintiler ve sistem kapalı süresi çıkarıldıktan sonra kalan kullanılabilir süreyi taban alarak hesaplanan bir :term:`Servis Seviyesi Anlaşması (SLA)` ile hesaplama servisinin açık kalma süresini garantiler.

source: Multicast groups (``mcastaddr``) must not be reused across cluster boundaries. No two distinct clusters should ever use the same multicast group. Be sure to select multicast addresses compliant with `RFC 2365, "Administratively Scoped IP Multicast" <http://www.ietf.org/rfc/rfc2365.txt>`_.
tr_tr: Çoklu yayın grupları (``mcastaddr``) küme sınırları arasında tekrar kullanılmamalıdır. Ayrı iki küme aynı çoklu yayın grubunu kullanmamalıdır. `RFC 2365, "Yönetimsel Kapsamlı IP Çoklu Yayını" <http://www.ietf.org/rfc/rfc2365.txt>`_ ile uyumlu çoklu yayın adresleri seçtiğinizden emin olun.

source: Networking L2 agent
tr_tr: Ağ L2 aracısı

source: No firewalls between the hosts
tr_tr: Sunucular arasında güvenlik duvarı yok

source: Older versions of some distributions, which do not have an up-to-date policy for securing Galera, may also require SELinux to be more relaxed about database access and actions:
tr_tr: Galera'yı güvenli hale getirmek için güncel ilkeleri olmayan bazı dağıtımların eski sürümleri de SELinux'un veritabanı erişimi ve eylemleri konusunda daha esnek olmasını bekleyebilir:

source: On RHEL-based systems, create resources for cinder's systemd agents and create constraints to enforce startup/shutdown ordering:
tr_tr: RHEL tabanlı sistemlerde, cinder'in systemd aracıları için kaynaklar oluşturun ve başlangıç/kapatma sıralamasını zırlayacak kısıtlar oluşturun:

source: On ``4444``, Galera Cluster uses TCP for all other State Snapshot Transfer methods.
tr_tr: ``4444`` üzerinde, Galera Kümesi diğer tüm Durum Anlık Görüntü Aktarım yöntemleri için TCP kullanır.

source: On ``4567``, Galera Cluster uses TCP for replication traffic. Multicast replication uses both TCP and UDP on this port.
tr_tr: ``4567`` üzerinde, Galera Kümesi çoğaltma trafiği için TCP kullanır. Çoklu yayın çoğaltma bu bağlantı noktası üzerinde hem TCP hem UDP kullanır.

source: On ``4568``, Galera Cluster uses TCP for Incremental State Transfers.
tr_tr: ``4568`` üzerinde, Galera Kümesi Artan Durum Aktarımları için TCP kullanır.

source: On any host that is meant to be part of a Pacemaker cluster, establish cluster communications through the Corosync messaging layer. This involves installing the following packages (and their dependencies, which your package manager usually installs automatically):
tr_tr: Bir Pacemaker kümesinin parçası olacak herhangi bir sunucu üzerinde, küme iletişimini Corosync iletileme katmanı ile sağlayın. Bu aşağıdaki paketlerin kurulumunu içerir (ve bağımlılıklarını, paket yöneticiniz genellikle otomatik olarak kurar):

source: On each target node, verify the correct owner, group, and permissions of the file :file:`erlang.cookie`:
tr_tr: Her bir hedef düğümde, :file:`erlang.cookie` dosyasının doğru sahip, grup ve izinleri olduğunu doğrulayın:

source: On the infrastructure layer, the SLA is the time for which RabbitMQ cluster reassembles. Several cases are possible. The Mnesia keeper node is the master of the corresponding Pacemaker resource for RabbitMQ. When it fails, the result is a full AMQP cluster downtime interval. Normally, its SLA is no more than several minutes. Failure of another node that is a slave of the corresponding Pacemaker resource for RabbitMQ results in no AMQP cluster downtime at all.
tr_tr: Altyapı katmanında, SLA RabbitMQ kümesinin yeniden bir araya gelme süresidir. Bir çok durum mümkündür. Mnesia tutucu düğümü RabbitMQ için ilişkili Pacemaker kaynağının anasıdır. Başarısız olduğunda, sonuç tüm AMQP kümesinin kapalı süre aralığıdır. Normalde SLA'sı bir kaç dakikadan fazla değildir. RabbitMQ için ilişkili Pacemaker kaynağının kölesi olan başka bir düğümün arızalanması herhangi bir AMQP kümesinin kapalı kalmasına sebep olmaz.

source: Once created, synchronize the :file:`corosync.conf` file (and the :file:`authkey` file if the secauth option is enabled) across all cluster nodes.
tr_tr: Oluşturulduktan sonra, :file:`corosync.conf` dosyasını tüm küme düğümlerinde eşitleyin (secauth seçeneği etkinse :file:`authkey` dosyasını da).

source: Only one instance for the central and compute agent service(s) is able to run and function correctly if the ``backend_url`` option is not set.
tr_tr: ``backend_url`` seçeneği ayarlı değilse merkezi ve hesaplama aracı servis(ler)i için yalnızca tek bir sunucu çalışıp düzgün işleyebilir.

source: OpenStack APIs: APIs that are HTTP(s) stateless services written in python, easy to duplicate and mostly easy to load balance.
tr_tr: OpenStack API'leri: Python ile yazılmış HTTP(s) durumsuz servisler olan API'ler, çoğaltması ve yük dengelemesi kolaydır.

source: OpenStack Block Storage
tr_tr: OpenStack Blok Depolama

source: OpenStack Compute
tr_tr: OpenStack Hesaplama

source: OpenStack Networking
tr_tr: OpenStack Ağı

source: OpenStack does not require a significant amount of resources and the following minimum requirements should support a proof-of-concept high availability environment with core services and several instances:
tr_tr: OpenStack kayda değer miktarda kaynak gerektirmez ve aşağıdaki asgari gereklilikler kavram ispatı niteliğinde çekirdek servisler ve bir çok sunucuya sahip yüksek kullanılabilir bir ortamı destekler:
