Repository: openstack/openstack-manuals
Catalog: doc/ha-guide/source/locale/*/LC_MESSAGES/ha-guide.po
Languages: ja, tr_tr

source: Replace ``CINDER_DBPASS`` with the password you chose for the Block Storage database.
ja: ``CINDER_DBPASS`` を Block Storage データベース用に選択したパスワードで置き換えます。
tr_tr: ``CINDER_DBPASS`` anahtarını Blok Depolama veritabanı için seçtiğiniz parolayla değiştirin.

source: Replace ``CINDER_DBPASS`` with the password you chose for the Block Storage database. Replace ``CINDER_PASS`` with the password you chose for the ``cinder`` user in the Identity service.
ja: ``CINDER_DBPASS`` を Block Storage サービス用に選択したパスワードで置き換えます。``CINDER_PASS`` を Identity サービスで ``cinder`` ユーザー用に選択したパスワードで置き換えます。
tr_tr: ``CINDER_DBPASS`` anahtarını Blok Depolama veritabanı için seçtiğiniz parolayla değiştirin. ``CINDER_PASS`` anahtarını Kimlik servisinde ``cinder`` kullanıcısı için seçtiğiniz parola ile değiştirin.

source: Replace ``DISTRO`` with the name of the distribution you use, such as ``centos`` or ``fedora``. Replace ``RELEASE`` with the release number, such as ``7`` for CentOS 7. Replace ``ARCH`` with your system architecture, such as ``x86_64``
ja: ``DISTRO`` を ``centos`` や ``fedora`` などの使用するディストリビューションの名前で置き換えます。 ``RELEASE`` を CentOS 7 向けの ``7`` などのリリース番号で置き換えます。 ``ARCH`` を ``x86_64`` などのシステムアーキテクチャーで置き換えます。

source: Replace ``VERSION`` with the version of MariaDB you want to install, such as ``5.6`` or ``10.0``. Replace ``PACKAGE`` with the package type and architecture, such as ``rhel6-amd64`` for Red Hat 6 on 64-bit architecture.
ja: インストールしたい MariaDB のバージョン、``5.6`` や ``10.0`` などで ``VERSION`` を置き換えます。パッケージ種別とアーキテクチャー、Red Hat 6 64 -bit アーキテクチャー向けの ``rhel6-amd64`` などで ``PACKAGE`` を置き換えます。

source: Replace the IP addresses given here with comma-separated list of each OpenStack database in your cluster.
ja: ここで指定された IP アドレスを、お使いのクラスターにある OpenStack の各データベースのコンマ区切りリストに置き換えます。
tr_tr: Burada verilen IP adreslerini kümenizdeki her bir OpenStack veritabanının virgülle ayrılmış listesiyle değiştirin.

source: Restart AppArmor. For servers that use ``init``, run the following command:
ja: AppArmor を再起動します。``init`` を使用するサーバーの場合、以下のコマンドを実行します。
tr_tr: AppArmor'u yeniden başlatın. ``init`` kullanan sunucularda şu komutu çalıştırın:

source: Restarting the cluster
ja: クラスターの再起動
tr_tr: Kümenin yenidene başlatılması

source: Run neutron DHCP agent
ja: Neutron DHCP エージェントの実行

source: Run neutron L3 agent
ja: Neutron L3 エージェントの実行

source: Run neutron LBaaS agent
ja: neutron LBaaS エージェントの実行

source: Run neutron metadata agent
ja: Neutron メタデータエージェントの実行

source: Run the following commands on each node except the first one:
ja: 1 番目のノード以外の各ノードで以下のコマンドを実行します。
tr_tr: İlk düğüm hariç geri kalan düğümlerde aşağıdaki komutları çalıştırın:

source: SELinux and AppArmor set to permit access to ``mysqld``;
ja: SELinux や AppArmor が ``mysqld`` にアクセスを許可していること。

source: SQL relational database server provides stateful type consumed by other components. Supported databases are MySQL, MariaDB, and PostgreSQL. Making SQL database redundant is complex.
ja: SQL リレーショナルデータベースサーバーは、他のコンポーネントにより利用されるステートフルな状態を提供します。サポートされるデータベースは、MySQL、MariaDB、PostgreSQL です。SQL データベースを冗長化することは複雑です。

source: Search in this guide
ja: ガイド内検索

source: Security-Enhanced Linux is a kernel module for improving security on Linux operating systems. It is commonly enabled and configured by default on Red Hat-based distributions. In the context of Galera Cluster, systems with SELinux may block the database service, keep it from starting or prevent it from establishing network connections with the cluster.
ja: Security-Enhanced Linux は、Linux オペレーティングシステムにおいてセキュリティーを向上させるためのカーネルモジュールです。Red Hat 系のディストリビューションでは、一般的にデフォルトで有効化され、設定されています。Galera Cluster の観点では、SELinux を有効化したシステムは、データベースサービスをブロックするかもしれません。また、クラスターを起動しても、ネットワーク接続を確立できないかもしれません。

source: Service monitoring and recovery required
ja: サービスモニタリングおよび必要なリカバリー

source: Services like RabbitMQ and Galera have complicated boot-up sequences that require co-ordination, and often serialization, of startup operations across all machines in the cluster. This is especially true after site-wide failure or shutdown where we must first determine the last machine to be active.
ja: RabbitMQ や Galera などのサービスは、複雑な起動順番を持ちます。クラスター内の全マシンに渡り、起動処理の協調動作を必要とし、しばしば順番に実行する必要があります。とくに、サイト全体の障害後、最後にアクティブにするマシンを判断する必要のあるシャットダウンのときに当てはまります。

source: Set SELinux to allow the database server to run:
ja: SELinux を設定して、データベースサーバーの実行を許可します。

source: Set a password for hacluster user **on each host**.
ja: **各ホストにおいて** hacluster ユーザーのパスワードを設定します。

source: Set automatic L3 agent failover for routers
ja: ルーター向け L3 エージェントの自動フェイルオーバーの設定
tr_tr: Yönlendiriciler için otomatik L3 aracısı kurtarmayı ayarla

source: Set basic cluster properties
ja: 基本的なクラスターのプロパティの設定
tr_tr: Temel küme özelliklerini ayarlayın

source: Set up Corosync with multicast
ja: マルチキャストを使う場合の Corosync の設定
tr_tr: Corosync'i çoklu yayın ile ayarla

source: Set up Corosync with unicast
ja: ユニキャストを使う場合の Corosync の設定
tr_tr: Corosync'i tekli yayın ile ayarla

source: Set up Corosync with votequorum library
ja: votequorum ライブラリーを使う場合の Corosync の設定
tr_tr: Corosync'i votequorum kitaplığıyla ayarla

source: Set up the cluster with `crmsh`
ja: `crmsh` を用いたクラスターのセットアップ
tr_tr: Kümeyi `crmsh` ile ayarla

source: Set up the cluster with `pcs`
ja: `pcs` を用いたセットアップ

source: Setting ``last_man_standing`` to 1 enables the Last Man Standing (LMS) feature; by default, it is disabled (set to 0). If a cluster is on the quorum edge (``expected_votes:`` set to 7; ``online nodes:`` set to 4) for longer than the time specified for the ``last_man_standing_window`` parameter, the cluster can recalculate quorum and continue operating even if the next node will be lost. This logic is repeated until the number of online nodes in the cluster reaches 2. In order to allow the cluster to step down from 2 members to only 1, the ``auto_tie_breaker`` parameter needs to be set; this is not recommended for production environments.
ja: ``last_man_standing`` を 1 に設定することにより、Last Man Standing (LMS) 機能を有効化できます。デフォルトで、無効化されています (0 に設定)。クラスターが、``last_man_standing_window`` パラメーターに指定した時間より長く、クォーラムエッジ (``expected_votes:`` が 7 に設定、 ``online nodes:`` が 4 に設定) にある場合、クラスターはクォーラムを再計算して、次のノードが失われても動作を継続します。この論理は、クラスターのオンラインノードが 2 になるまで繰り返されます。クラスターが 2 つのメンバーから 1 つだけに減ることを許可するために、 ``auto_tie_breaker`` パラメーターを設定する必要があります。これは本番環境では推奨されません。

source: Setting ``wait_for_all`` to 1 means that, When starting up a cluster (all nodes down), the cluster quorum is held until all nodes are online and have joined the cluster for the first time. This parameter is new in Corosync 2.0.
ja: ``wait_for_all`` を 1 に設定することは、クラスター起動 (全ノードダウン) 時、クラスターのクォーラムは、すべてのノードがオンラインになり、まずクラスターに参加するまで保持されることを意味しますこのパラメーターは Corosync 2.0 の新機能です。

source: Setting the ``pe-warn-series-max``, ``pe-input-series-max`` and ``pe-error-series-max`` parameters to 1000 instructs Pacemaker to keep a longer history of the inputs processed and errors and warnings generated by its Policy Engine. This history is useful if you need to troubleshoot the cluster.
ja: パラメーター ``pe-warn-series-max``, ``pe-input-series-max``, ``pe-error-series-max`` を 1000 に設定することにより、Pacemaker が処理した入力履歴、ポリシーエンジンにより生成されたログと警告を保持するよう指定できます。この履歴は、クラスターのトラブルシューティングを必要とする場合に役立ちます。

source: Simplified process for adding/removing of nodes
ja: ノードの追加と削除を簡単化したプロセス
tr_tr: Düğümlerin eklenip/çıkarılması için basitleştirilmiş süreç

source: Since the cluster is a single administrative domain, it is generally accepted to use the same password on all nodes.
ja: クラスターは単一の管理ドメインなので、一般的にすべてのノードで同じパスワードを使用できます。

source: Single-controller high availability mode
ja: シングルコントローラーの高可用性モード
tr_tr: Tek-denetleyicili yüksek kullanılabilirlik kipi

source: Specifying ``corosync_votequorum`` enables the votequorum library; this is the only required option.
ja: ``corosync_votequorum`` を指定することにより、votequorum ライブラリーを有効化します。これは唯一の必須オプションです。

source: Start Corosync
ja: Corosync の開始
tr_tr: Corosync'i Başlat

source: Start Pacemaker
ja: Pacemaker の開始
tr_tr: Pacemaker'i Başlat

source: Start the ``xinetd`` daemon for ``clustercheck``. For servers that use ``init``, run the following commands:
ja: ``clustercheck`` の ``xinetd`` デーモンを起動します。 ``init`` を使用するサーバーの場合、以下のコマンドを実行します。
tr_tr: ``clustercheck`` için ``xinetd`` artalan işini başlatın. ``init`` kullanan sunucular için aşağıdaki komutları çalıştırın:

source: Start the database server on all other cluster nodes. For servers that use ``init``, run the following command:
ja: すべての他のクラスターノードにおいてデータベースサーバーを起動します。``init`` を使用するサーバーに対して、以下のコマンドを実行します。
tr_tr: Dİğer tüm küme düğümlerinde veritabanı sunucusunu başlatın. ``init`` kullanan sunucularda şu komutu çalıştırın:

source: Start the message queue service on all nodes and configure it to start when the system boots.
ja: すべてのノードにおいてメッセージキューサービスを起動し、システム起動時に起動するよう設定します。

source: Starting up one instance of the service on several controller nodes, when they can coexist and coordinate by other means. RPC in ``nova-conductor`` is one example of this.
ja: いくつかのコントローラノードで、一つのサービスインスタンスが開始します。それらは、ほかの意味で、共存、調和できるということであり、``nova-conductor``のRPCはその例の一つです。

source: Stateful service
ja: ステートフルサービス
tr_tr: Durumsal servis

source: Stateful services may be configured as active/passive or active/active:
ja: ステートフルサービスは、アクティブ/パッシブまたはアクティブ/アクティブとして設定できます。

source: Stateless service
ja: ステートレスサービス
tr_tr: Durumsuz servis

source: Stateless vs. stateful services
ja: ステートレスサービスとステートフルサービス

source: Storage
ja: ストレージ
tr_tr: Depolama

source: Storage back end
ja: ストレージバックエンド
tr_tr: Depolama arka ucu

source: Storage components
ja: ストレージ構成要素
tr_tr: Depolama bileşenleri

source: TCP generally holds on to hope for a long time. A ballpark estimate is somewhere on the order of tens of minutes (30 minutes is commonly referenced). During this time it will keep probing and trying to deliver the data.
ja: TCP は一般的に長く接続されています。概算として数十分 (一般的に 30 分として参照されます) のレベルです。この間、プルーブして、データを配送しようとします。

source: Telemetry central agent
ja: Telemetry 中央エージェント

source: The :command:`crm configure` command supports batch input, so you may copy and paste the above into your live Pacemaker configuration and then make changes as required. For example, you may enter edit ``p_ip_glance-api`` from the :command:`crm configure` menu and edit the resource to match your preferred virtual IP address.
ja: :command:`crm configure` はバッチ入力をサポートします。そのため、現在の pacemaker 設定の中に上をコピー・ペーストし、適宜変更を反映できます。例えば、お好みの仮想 IP アドレスに一致させるために、:command:`crm configure` メニューから ``edit p_ip_glance-api`` と入力し、リソースを編集できます。

source: The :command:`crm configure` supports batch input, so you may copy and paste the lines above into your live Pacemaker configuration and then make changes as required. For example, you may enter ``edit p_ip_manila-api`` from the :command:`crm configure` menu and edit the resource to match your preferred virtual IP address.
ja: :command:`crm configure` はバッチ入力をサポートします。そのため、現在の pacemaker 設定の中に上の行をコピー・ペーストし、適宜変更を反映できます。例えば、お好みの仮想 IP アドレスに一致させるために、:command:`crm configure` メニューから ``edit p_ip_manila-api`` と入力し、リソースを編集できます。

source: The Galera cluster configuration directive ``backup`` indicates that two of the three controllers are standby nodes. This ensures that only one node services write requests because OpenStack support for multi-node writes is not yet production-ready.
ja: この Galera cluster の設定ディレクティブ ``backup`` は、3 つのコントローラーの内 2 つがスタンバイノードであることを意味します。
tr_tr: Galera kümesi yapılandırma yönergesi ``backup`` üç kontrol düğümünden ikisinin bekleme düğümü olduğunu gösterir. Böylece OpenStack çoklu-düğüm yazma henüz üretim için hazır olmadığından tek bir düğümün yazma isteklerini karşılması sağlanır.

source: The Memcached client implements hashing to balance objects among the instances. Failure of an instance only impacts a percentage of the objects and the client automatically removes it from the list of instances. The SLA is several minutes.
ja: Memcached クライアントは、インスタンス間でオブジェクトを分散するハッシュ機能を持ちます。インスタンスの障害は、オブジェクトの使用率のみに影響します。クライアントは、インスタンスの一覧から自動的に削除されます。SLA は数分です。

source: The OpenStack Image service offers a service for discovering, registering, and retrieving virtual machine images. To make the OpenStack Image API service highly available in active / passive mode, you must:
ja: OpenStack Image サービスは、仮想マシンイメージを検索、登録、取得するためのサービスを提供します。OpenStack Image API サービスをアクティブ/パッシブモードで高可用性にするために、以下が必要になります。

source: The OpenStack Installation Guides also include a list of the services that use passwords with important notes about using them.
ja: OpenStack インストールガイドは、パスワードを使用するサービスの一覧、それらを使用する上の重要な注意点もまとめてあります。

source: The OpenStack Networking service has a scheduler that lets you run multiple agents across nodes; the DHCP agent can be natively highly available. To configure the number of DHCP agents per network, modify the ``dhcp_agents_per_network`` parameter in the :file:`/etc/neutron/neutron.conf` file. By default this is set to 1. To achieve high availability, assign more than one DHCP agent per network.
ja: OpenStack Networking サービスには、ノードにまたがって複数のエージェントを実行できるスケジューラーがあります。 DHCP エージェントは本質的に高可用性があります。ネットワークあたりの DHCP エージェント数を設定するには、 file:`/etc/neutron/neutron.conf` ファイルの``dhcp_agents_per_network`` パラメーターを変更します。このパラメーターのデフォルト値は １ です。高可用性を持たせるには、ネットワークあたりの DHCP エージェント数を １ 以上にする必要があります。

source: The Pacemaker architecture
ja: Pacemaker アーキテクチャー
tr_tr: Pacemaker mimarisi

source: The Pacemaker service also requires an additional configuration file ``/etc/corosync/uidgid.d/pacemaker`` to be created with the following content:
ja: Pacemaker サービスは、以下の内容で作成された、追加の設定ファイル ``/etc/corosync/uidgid.d/pacemaker`` も必要とします。
tr_tr: Pacemaker servisi ayrıca aşağıdaki içeriğe sahip ek bir ``/etc/corosync/uidgid.d/pacemaker`` yapılandırma dosyasına ihtiyaç duyar:

source: The Telemetry central agent can be configured to partition its polling workload between multiple agents, enabling high availability.
ja: Telemetry 中央エージェントは、高可用性を有効化した、複数のエージェント間でポーリングする負荷を分割するよう設定できます。

source: The `Installation Guide <http://docs.openstack.org/liberty/#install-guides>`_ gives instructions for installing multiple compute nodes. To make them highly available, you must configure the environment to include multiple instances of the API and other services.
ja: `インストールガイド <http://docs.openstack.org/liberty/#install-guides>`_ に複数のコンピュートノードのインストール方法について記載されています。それらを高可用性にするために、API と他のサービスの複数インスタンスなど、環境を設定する必要があります。

source: The `Tooz <https://pypi.python.org/pypi/tooz>`__ library provides the coordination within the groups of service instances. It provides an API above several back ends that can be used for building distributed applications.
ja: `Tooz <https://pypi.python.org/pypi/tooz>`__ ライブラリーは、サービスインスタンスのグループ内に条件を提供します。分散アプリケーションを構築するために使用できる、いくつかのバックエンドに上の API を提供します。

source: The ``admin_bind_host`` parameter lets you use a private network for admin access.
ja: ``admin_bind_host`` パラメーターにより、管理アクセスのためのプライベートネットワークを使用できます。
tr_tr: ``admin_bind_host`` parametresi yönetici erişimi için özel bir ağ kullanmanızı sağlar.

source: The ``bindnetaddr`` is the network address of the interfaces to bind to. The example uses two network addresses of /24 IPv4 subnets.
ja: ``bindnetaddr`` は、バインドするインターフェースのネットワークアドレスです。この例は、2 つの /24 IPv4 サブネットを使用します。
tr_tr: ``bindnetaddr`` bağlanılacak arayüzün ağ adresidir. Örnek /24 IPv4 alt ağlarının iki ağ adresini kullanır.

source: The ``token`` value specifies the time, in milliseconds, during which the Corosync token is expected to be transmitted around the ring. When this timeout expires, the token is declared lost, and after ``token_retransmits_before_loss_const lost`` tokens, the non-responding processor (cluster node) is declared dead. In other words, ``token × token_retransmits_before_loss_const`` is the maximum time a node is allowed to not respond to cluster messages before being considered dead. The default for token is 1000 milliseconds (1 second), with 4 allowed retransmits. These defaults are intended to minimize failover times, but can cause frequent "false alarms" and unintended failovers in case of short network interruptions. The values used here are safer, albeit with slightly extended failover times.
ja: ``token`` の値は、Corosync トークンがリング内を転送されることが予想される時間をミリ秒単位で指定します。このタイムアウトを過ぎると、トークンが失われます。 ``token_retransmits_before_loss_const lost`` トークンの後、応答しないプロセッサー (クラスターノード) が停止していると宣言されます。言い換えると、 ``token × token_retransmits_before_loss_const`` は、ノードが停止とみなされるまでに、クラスターメッセージに応答しないことが許される最大時間です。トークン向けのデフォルトは、1000 ミリ秒 (1 秒)、4 回の再送許可です。これらのデフォルト値は、フェイルオーバー時間を最小化することを意図していますが、頻繁な「誤検知」と短いネットワーク中断による意図しないフェイルオーバーを引き起こす可能性があります。ここで使用される値は、フェイルオーバー時間がわずかに長くなりますが、より安全です。

source: The ``transport`` directive controls the transport mechanism used. To avoid the use of multicast entirely, specify the ``udpu`` unicast transport parameter. This requires specifying the list of members in the ``nodelist`` directive; this could potentially make up the membership before deployment. The default is ``udp``. The transport type can also be set to ``udpu`` or ``iba``.
ja: ``transport`` ディレクティブは使用するトランスポートメカニズムを制御します。 マルチキャストを完全に無効にするためには、``udpu`` ユニキャストトランスポートパラメーターを指定します。``nodelist`` ディレクティブにメンバー一覧を指定する必要があります。展開する前にメンバーシップを構成することができます。デフォルトは ``udp`` です。トランスポート形式は ``udpu`` や ``iba`` に設定することもできます。

source: The application layer is controlled by the ``oslo.messaging`` configuration options for multiple AMQP hosts. If the AMQP node fails, the application reconnects to the next one configured within the specified reconnect interval. The specified reconnect interval constitutes its SLA.
ja: アプリケーション層は、複数 AMQP ホスト向けの ``oslo.messaging`` 設定オプションにより制御されます。AMQP ノードが故障したとき、アプリケーションが、指定された再接続間隔で、設定された次のノードに再接続します。
tr_tr: Uygulama katmanı birçok AMQP sunucusu için ``oslo.messaging`` yapılandırma seçeneği tarafından kontrol edilir. AMQP düğümü başarısız olursa, uygulama belirtilen yeniden bağlanma aralığı dahilinde yapılandırılan bir sonrakine bağlanır. Belirtilen yeniden bağlanma aralığı SLA'sını teşkil eder.

source: The availability check of the instances is provided by heartbeat messages. When the connection with an instance is lost, the workload will be reassigned within the remained instances in the next polling cycle.
ja: インスタンスの死活監視は、ハートビートメッセージによって提供されます。インスタンスとの接続が失われた時、次のポーリングサイクルにて、ワークロードは、残ったインスタンスの中で再割り当てが行われます。

source: The benefits of this approach are the physical isolation between components and the ability to add capacity to specific components.
ja: この方法の利点は、コンポーネント間の物理的な隔離、特定のコンポーネントへのキャパシティーの追加です。
tr_tr: Bu yaklaşımın faydaları bileşenler arasındaki fiziksel yalıtım ve belirli bileşenlere kapasite ekleyebilme becerisidir.

source: The cloud controller runs on the management network and must talk to all other services.
ja: クラウドコントローラーは、管理ネットワークで動作し、他のすべてのサービスと通信できる必要があります。
tr_tr: Bulut denetleyici yönetim ağı üzerinde çalışır ve tüm diğer servislerle konuşmalıdır.

source: The cluster is fully operational with ``expected_votes`` set to 7 nodes (each node has 1 vote), quorum: 4. If a list of nodes is specified as ``nodelist``, the ``expected_votes`` value is ignored.
ja: このクラスターは、7 ノード (各ノードが 1 つの投票権を持つ)、クォーラム 4 つに設定した ``expected_votes`` で完全に動作します。ノードの一覧は ``nodelist`` に指定された場合、 ``expected_votes`` の値は無視されます。
tr_tr: Küme ``expected_votes`` 7 düğüm (her düğümün 1 oyu var) olarak ayarlanmış ve tamamen işlevsel, yetersayı: 4. Eğer düğüm listesi ``nodelist`` olarak belirtilmişse, ``expected_votes`` değeri göz ardı edilir.

source: The command :command:`crm configure` supports batch input, so you may copy and paste the lines above into your live pacemaker configuration and then make changes as required. For example, you may enter ``edit p_ip_cinder-api`` from the :command:`crm configure` menu and edit the resource to match your preferred virtual IP address.
ja: :command:`crm configure` コマンドはバッチ入力をサポートします。そのため、現在の Pacemaker 設定の中に上の行をコピー・ペーストし、適宜変更を反映できます。例えば、お好みの仮想 IP アドレスに一致させるために、:command:`crm configure` メニューから ``edit p_ip_cinder-api`` と入力し、リソースを編集できます。

source: The commands for installing RabbitMQ are specific to the Linux distribution you are using:
ja: RabbitMQ のインストールコマンドは、使用している Linux ディストリビューションにより異なります。

source: The common practice is to locate an HAProxy instance on each OpenStack controller in the environment.
ja: 一般的なプラクティスは、環境内の各 OpenStack コントローラーに HAProxy インスタンスを置くことです。

source: The configuration uses static routing without Virtual Router Redundancy Protocol (VRRP) or similar techniques implemented.
ja: この設定は、Virtual Router Redundancy Protocol (VRRP) や類似技術を実装することなく、静的ルーティングを使用します。

source: The correct path to ``libgalera_smm.so`` given to the ``wsrep_provider`` parameter.
ja: ``wsrep_provider`` パラメーターに指定された ``libgalera_smm.so`` への適切なパス。

source: The current design of the neutron LBaaS agent using the HAProxy driver does not allow high availability for the tenant load balancers. The neutron-lbaas-agent service will be enabled and running on all controllers, allowing for load balancers to be distributed across all nodes. However, a controller node failure will stop all load balancers running on that node until the service is recovered or the load balancer is manually removed and created again.
ja: 現在の HAProxy ドライバーを使用する neutron LBaaS エージェントは、テナントのロードバランサーの高可用性を実現できません。neutron-lbaas-agent サービスが有効化され、すべてのコントローラーにおいて実行され、ロードバランサーがすべてのノードにわたり分散されることを許可します。しかしながら、コントローラーノードの障害は、サービスが復旧されるまで、またはロードバランサーが手動で削除され、再び追加されるまで、そのノードで動作しているロードバランサーをすべて停止します。

source: The default node type is a disc node. In this guide, nodes join the cluster as RAM nodes.
ja: デフォルトのノード種別は disc ノードです。このガイドでは、ノードは RAM ノードとしてクラスターに参加します。
tr_tr: Öntanımlı düğüm türü disk düğümüdür. Bu kılavuzda düğümler kümeye RAM düğümleri olarak katılır.

source: The first step in setting up your highly-available OpenStack cluster is to install the operating system on each node. Follow the instructions in the OpenStack Installation Guides:
ja: 高可用性 OpenStack クラスターをセットアップする第一歩は、各ノードにオペレーティングシステムをインストールすることです。OpenStack インストールガイドにある手順に従ってください。

source: The first step is to install the database that sits at the heart of the cluster. To implement high availability, run an instance of the database on each controller node and use Galera Cluster to provide replication between them. Galera Cluster is a synchronous multi-master database cluster, based on MySQL and the InnoDB storage engine. It is a high-availability service that provides high system uptime, no data loss, and scalability for growth.
ja: 最初の手順は、クラスターの中心になるデータベースをインストールすることです。高可用性を実現するために、各コントローラーノードにおいてデータベースを実行し、ノード間でレプリケーションできる Galera Cluster を使用します。Galera Cluster は、MySQL と InnoDB ストレージエンジンをベースにした、同期型のマルチマスターデータベースクラスターです。高いシステム稼働時間、データ損失なし、スケーラビリティーを提供する、高可用性サービスです。
tr_tr: İlk adım kümenin kalbinde olan veritabanının kurulumudur. Yüksek kullanılırlık uygulamak için her bir kontrol düğümünde veritabanı sunucusu çalıştırın ve aralarında yedekliliği sağlamak için Galera Kümesini kullanın. Galera Kümesi MySQL ve InnoDB depolama motoru tabanlı, eşzamanlı, çoklu-ana sunuculu veritabanı kümesidir. Yüksek sistem çalışma süresi, kayıpsız veri ve büyüme için ölçeklenebilirlik sağlayan yüksek kullanılır bir servistir.

source: The following components are currently unable to benefit from the use of a proxy server:
ja: 以下のコンポーネントは、現在、プロキシサーバーの利用による利点はありません。
tr_tr: Aşağıdaki bileşenler şu anda bir vekil sunucudan faydalanamıyorlar:

source: The following components/services can work with HA queues:
ja: 以下のコンポーネントやサービスは、HA キューを用いて動作できます。
tr_tr: Aşağıdaki bileşenler/servisler HA kuyruklarıyla çalışabilir:

source: The following diagram shows a very simplified view of the different strategies used to achieve high availability for the OpenStack services:
ja: 以下の図は、OpenStack サービスの高可用性を達成するために使用される、さまざまな方法を非常に簡略化した図を表します。

source: The keepalived architecture
ja: keepalived アーキテクチャー

source: The most popular AMQP implementation used in OpenStack installations is RabbitMQ.
ja: OpenStack 環境に使用される最も一般的な AMQP ソフトウェアは RabbitMQ です。
tr_tr: OpenStack kurulumlarında en yaygın kullanılan AMQP uygulaması RabbitMQ'dur.
