Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: The project that facilitates API client authentication, service discovery, distributed multi-tenant authorization, and auditing. It provides a central directory of users mapped to the OpenStack services they can access. It also registers endpoints for OpenStack services and acts as a common authentication system.
ru: Проект, который предназначен для упрощения аутентификации клиентов посредством API-интерфейса, обнаружения служб, авторизации распределенных тенантов и аудита. Она предоставляет централизованный каталог пользователей и служб OpenStack, к которым они могут получить доступ. Она также регистрирует точки входа служб OpenStack и работает как общая система аутентификации.

source: The project that produces a secret storage and generation system capable of providing key management for services wishing to enable encryption features.
de: Das Projekt, das ein geheimes Speicher- und Erzeugungssystem erzeugt, das in der Lage ist, eine Schlüsselverwaltung für Dienste bereitzustellen, die Verschlüsselungsfunktionen ermöglichen möchten.
ru: Проект, выпускающий a secret storage and generation system capable of providing key management for services wishing to enable encryption features.

source: The project that produces a set of python libraries containing code shared by OpenStack projects. The APIs provided by these libraries should be high quality, stable, consistent, documented and generally applicable.
de: Das Projekt erstellt einen Satz Python Bibliotheken mit Code, der zwischen den OpenStack Projekten geteilt wird. Die von diesen Bibliotheken bereitgestellten APIs sollen hochqualitativ, konsistent, dokumentiert und allgemein anwendbar sein.
ru: Проект по созданию набора Python-библиотек, в которых содержится программный код, совместно используемый в проектах OpenStack. Предоставленные этими библиотеками API должны быть высококачественными, стабильными, согласованными, документированными и общеприменимыми.

source: The project that provides a messaging service that affords a variety of distributed application patterns in an efficient, scalable and highly available manner, and to create and maintain associated Python libraries and documentation.
de: Das Projekt, das einen Messaging-Dienst bietet, der eine Vielzahl von verteilten Anwendungsmustern in einer effizienten, skalierbaren und hochverfügbaren Weise bietet und die damit verbundenen Python-Bibliotheken und Dokumentation erstellt und verwaltet.
ru: Проект, который предоставляет службу сообщений, обеспечивающую создание эффективных и масштабируемых шаблонов распределенных приложений с высокой доступностью. Позволяет создавать и поддерживать связанные библиотеки и документацию на языке Python.

source: The project that provides an application catalog service so that users can compose and deploy composite environments on an application abstraction level while managing the application lifecycle.
de: Das Projekt, das einen Anwendungskatalogdienst bereitstellt, damit Benutzer zusammengesetzte Umgebungen auf einer Anwendungsabstraktionsebene erstellen und bereitstellen können, während der Anwendungslebenszyklus verwaltet wird.
ru: Проект OpenStack, предоставляющий службу каталога приложений, чтобы пользователи могли формировать и развертывать составные окружения на уровне абстрактных приложений при управлении жизненным циклом ПО.

source: The project which provides a set of services for provisioning, scaling, and managing container orchestration engines.
de: Das Projekt, das eine Reihe von Dienstleistungen für die Bereitstellung, Skalierung und Verwaltung von Container-Orchestrierung Maschinen bietet.
ru: Проект по предоставлению набора служб для развертывания, масштабирования и управления модулями оркестрации контейнеров.

source: The project who owns an Image service virtual machine image.
de: Das Projekt, dem das Virtuelle Maschinen Abbild im Abbilddienst gehört.
ru: Проект, который владеет образом виртуальной машины службы образов.

source: The protocol by which layer-3 IP addresses are resolved into layer-2 link local addresses.
de: Das Protokoll, welches Layer-3-IP-Adressen zu Layer-2 link-local Adressen auflöst.
ru: Протокол, с помощью которого IP-адреса сетевого уровня (L3) транслируются в локальные адреса канального уровня (L2).
vi_vn: Giao thức mà ở đó các địa chỉ IP layer-3 dược phân giải thành các địa chỉ liên kết nội vùng layer-2.

source: The queue
de: Die Warteschlange
ru: Очередь

source: The recommended way to install setuptools on Microsoft Windows is to follow the documentation provided on the setuptools website (https://pypi.python.org/pypi/setuptools).
ru: Чтобы установить setuptools в системе Microsoft Windows, рекомендуем следовать инструкциям, представленным на веб-сайте setuptools (https://pypi.python.org/pypi/setuptools).

source: The registry is a private internal service meant for use by OpenStack Image service. Do not expose this service to users.
de: Die Registry ist ein privater interner Dienst für den OpenStack Abbilddienst. Stellen Sie diesen Dienst nicht Benutzern zur Verfügung.
ru: Регистр — это собственная служба для внутреннего использования службой образов OpenStack. Не предоставляйте эту службу пользователям.

source: The router advertisement daemon, used by the Compute VLAN manager and FlatDHCP manager to provide routing services for VM instances.
ru: демон маршрутизатора с поддержкой анонсирования, используемый диспетчером VLAN службы вычислительных ресурсов и диспетчером FlatDHCP с целью обеспечения маршрутизации для инстансов ВМ.
vi_vn: Daemon quảng bá router, được sử dụng bởi quản lý VLAN và quản lý FlatDHCP của Compute để cung cấp các dịch vụ định tuyến tới các máy ảo.

source: The row that has the value ``used_max`` in the ``PROJECT`` column shows the sum of the resources allocated to the instances that run on the host.
ru: В строке со значением ``used_max`` в столбце ``PROJECT`` отображается суммарное значение ресурсов, выделенных инстансам, которые выполняются на хосте.

source: The row that has the value ``used_now`` in the ``PROJECT`` column shows the sum of the resources allocated to the instances that run on the host, plus the resources allocated to the virtual machine of the host itself.
ru: В строке со значением ``used_now`` в столбце ``PROJECT`` отображается суммарное значение ресурсов, выделенных инстансам, которые выполняются на хосте, плюс ресурсы, выделенные виртуальной машине самого хоста.

source: The service enables deployers to integrate with the Orchestration service directly or through custom plug-ins.
de: Der Dienst ermöglicht es den Arbeitgebern, sich direkt oder über benutzerdefinierte Plug-Ins mit dem Orchestrierungsdienst zu integrieren.
ru: Служба позволяет интегрировать средства развертывания в службу оркестрации непосредственно или с помощью настраиваемых плагинов.

source: The service that provides a set of services for management of shared file systems in a multi-tenant cloud environment, similar to how OpenStack provides block-based storage management through the OpenStack :term:`Block Storage service<Block Storage service (cinder)>` project. With the Shared File Systems service, you can create a remote file system and mount the file system on your instances. You can also read and write data from your instances to and from your file system.
ru: Служба, которая предоставляет набор служб для управления общими файловыми системами в мультитенантной облачной среде, пдобно тому, как OpenStack обеспечивает управление блочными хранилищами с помощью :term:`службы блочных хранилищ<Block Storage service (cinder)>`. Служба общих файловых систем позволяет создавать удаленную файловую систему и монтировать ее на инстансах. Также можно читать и записывать данные из инстансов в файловую систему и из нее.

source: The software package used to provide AMQP messaging capabilities within Compute. Default package is RabbitMQ.
de: Das Softwarepaket zur Bereitstellung von AMQP Messaging-Funktionen in Compute. Standardpaket ist RabbitMQ.
ru: Пакет программного обеспечения, используемый для обмена сообщениями AMQP в рамках службы вычислительных ресурсов. Пакет по умолчанию: RabbitMQ.
vi_vn: Gói phần mềm được sử dụng để cung cấp khả năng truyền tin AMQP trong Compute. Gói mặc định là RabbitMQ.

source: The solution addresses the following use cases:
de: Die Lösung behandelt folgende Anwendungsfälle:
ru: Решение подходит для следующих сценариев использования.

source: The source used by Identity service to retrieve user information; an OpenLDAP server, for example.
de: Die Quelle, die vom Identitätsdienst verwendet wird, um Benutzerinformationen abzurufen; Ein OpenLDAP-Server, zum Beispiel.
ru: Источник, используемый службой идентификации для получения сведений о пользователе, например сервер OpenLDAP.
vi_vn: Nguồn được sử dụng bởi dịch vụ Identity để nhận về thông tin người dùng; ví dụ như một OpenLDAP server.

source: The step in the Compute scheduling process when hosts that cannot run VMs are eliminated and not chosen.
de: Der Schritt im Compute-Scheduling-Prozess, wenn Hosts, die keine VMs ausführen können, eliminiert und nicht ausgewählt werden.
ru: Шаг планирования в службе вычислительных ресурсов, при котором хосты, не запустившие виртуальные машины, удаляются без выбора.
vi_vn: Một bước trong quá trình lên lịch của Compute khi các máy vật lý không thể chạy máy ảo sẽ bị loại và không được chọn.

source: The storage method used by the Identity service catalog service to store and retrieve information about API endpoints that are available to the client. Examples include an SQL database, LDAP database, or KVS back end.
de: Die vom Identity Service-Katalogdienst verwendete Speichermethode zum Speichern und Abrufen von Informationen über API-Endpunkte, die dem Client zur Verfügung stehen. Beispiele umfassen eine SQL-Datenbank, eine LDAP-Datenbank oder ein KVS-Backend.
ru: Метод хранения данных, используемый каталогом службы идентификации, чтобы хранить и извлекать информацию о конечных точках API, доступных клиенту. Примеры включают базы данных SQL и LDAP и серверную часть KVS.

source: The sum of each cost used when deciding where to start a new VM instance in Compute.
de: Die Summe der Kosten, die bei der Entscheidung verwendet werden, wo eine neue VM-Instanz in Compute gestartet werden soll.
ru: При определении, где в Compute запустить новую ВМ, учитывается сумма всех цен.
vi_vn: Tổng tài nguyên tiêu tốn khi khởi động một máy ảo mới trong Compute.

source: The tenant who should own the image. The size of image data, in bytes.
ru: Тенант, который является владельцем образа. Размер образа в байтах.

source: The transfer of data, usually in the form of files, from one computer to another.
de: Der Transfer von Daten, üblicherweise in der Form von Dateien, von einem Computer zum anderen.
ru: Передача файлов с одного компьютера на другой, как правило, в форме файлов.
vi_vn: Quá trình truyền dữ liệu, thường dưới dạng các tập tin, từ máy tính này sang máy tính khác.

source: The underlying format that a disk image for a VM is stored as within the Image service back-end store. For example, AMI, ISO, QCOW2, VMDK, and so on.
de: Das zugrunde liegende Format, in dem ein Datenträgerabbild für eine VM gespeichert ist, befindet sich im Abbilddienst-Backend-Speicher. Zum Beispiel, AMI, ISO, QCOW2, VMDK, und so weiter.
ru: Базовый формат, в котором образ диска для ВМ хранится во внутреннем хранилище службы Image. Например, AMI, ISO, QCOW2, VMDK и др.
vi_vn: Định dạng cơ sở mà một image đĩa cho một máy ảo được lưu trữ dưới dạng đó trong kho lưu trữ back-end của Image service. Ví dụ nhu AMI, ISO, QCOW2, VMDK,...

source: The universal measurement of how quickly data is transferred from place to place.
de: Die universelle Messgröße, wie schnell Daten von einem Ort zum anderen transportiert werden.
ru: Универсальная единица измерения для скорости передачи данных.
vi_vn: Đơn vị đo lường phổ thông về tốc độ truyền dữ liệu từ nơi này đến nơi khác.

source: The valid model values depend on the ``libvirt_type`` setting, as shown in the following tables.
de: Die gültigen Modellwerte hängen von der Einstellung "libvirt_type" ab, wie in den folgenden Tabellen gezeigt.
ru: Допустимые значения модели зависят от заданного значения параметра ``libvirt_type``, как показано в следующих таблицах.

source: The volume must be in an ``available`` state or the request will be denied. If the transfer request is valid in the database (that is, it has not expired or been deleted), the volume is placed in an ``awaiting-transfer`` state. For example:
de: Der Datenträger muss in einem ``verfügbar`` Zustand sein, oder die Anforderung wird verweigert. Wenn die Übertragungsanforderung in der Datenbank gültig ist (das heißt, sie ist nicht abgelaufen oder gelöscht worden), wird der Datenträger in den Zustand "erwarte-transfer" gesetzt. Beispielsweise:
ru: Переносимый том должен находиться в состоянии ``available``. В противном случае запрос будет отклонен. Если запрос на перенос допустим в базе данных (то есть не устарел и не удален), для тома задается состояние ``awaiting-transfer``. Например:

source: Then install pip and use it to manage client installation:
de: Installieren Sie dann pip und verwenden Sie es zur Verwaltung der Client-Installation:
ru: После этого установите pip и используйте его для управления установкой клиента:

source: Then you can install the packages:
ru: Затем можно установить пакеты:

source: Theoretically, OpenStack Compute can support any database that SQL-Alchemy supports. Common databases are SQLite3 for test and development work, MySQL, MariaDB, and PostgreSQL.
ru: Теоретически служба вычислительных ресурсов OpenStack поддерживает любую базу данных с поддержкой SQL-Alchemy. Общие базы данных: SQLite3 для тестирования и разработки, MySQL, MariaDB и PostgreSQL.

source: There are also packaged versions of the clients available in `RDO <https://www.rdoproject.org/>`__ that enable yum to install the clients as described in Installing_from_packages_.
ru: Кроме того, существуют упакованные версии клиентов, доступные в `RDO <https://www.rdoproject.org/>`__, которые позволяют использовать команду yum для установки клиентов, как описано в разделе Установка_из_пакетов_.

source: There are also packaged versions of the clients available that enable zypper to install the clients as described in Installing_from_packages_.
de: Es sind paketierte Versionen des Clients verfügbar die erlauben, zypper zur Installation der Clients zu verwenden, wie in Installation _aus_Paketen beschrieben.
ru: Кроме того, существуют другие упакованные версии клиентов, которые можно автоматически устанавливать с помощью zypper, как описано в Установка_из_пакетов_.

source: These services communicate by using the OpenStack messaging bus. Only the collector and API server have access to the data store.
de: Diese Dienste kommunizieren über den OpenStack Messaging Bus. Nur der Kollektor und der API-Server haben Zugriff auf den Datenspeicher.
ru: Для связи эти службы используют шину сообщений OpenStack. К хранилищу данных имеет доступ только сборщик и сервер API.

source: These values are computed by using information about the flavors of the instances that run on the hosts. This command does not query the CPU usage, memory usage, or hard disk usage of the physical host.
ru: Эти значения вычисляются с помощью сведений о типах инстансов, которые выполняются на хостах. Эта команда не запрашивает использование ЦП, памяти или жесткого диска на физическом хосте.

source: This command does not provide any output.
de: Dieser Befehl liefert keine Ausgabe.
ru: Эта команда ничего не выводит.

source: This example creates a ``my-new-volume`` volume based on an image.
de: Dieses Beispiel erstellt ein `` my-new-volume`` Datenträger basierend auf einem Abbild.
ru: В этом примере из образа создается том ``my-new-volume``.

source: This example is a high-level process flow for using Database services:
de: Dieses Beispiel ist ein hochrangiger Prozessablauf für die Verwendung von Datenbankdiensten:
ru: Это пример высокоуровневой технологической схемы для использования службы баз данных.

source: This glossary offers a list of terms and definitions to define a vocabulary for OpenStack-related concepts.
de: Dieses Glossar bietet eine Liste von Begriffen und Definitionen, um ein Vokabular für OpenStack-bezogene Konzepte zu definieren.
ru: Этот глоссарий содержит термины и определения, касающиеся OpenStack.
vi_vn: Danh mục thuật ngữ này dùng để cung cấp một list các thuật ngữ, định nghĩa dùng để định rõ thuật ngữ đó liên quan đến các khái niệm trong Open-Stack.

source: This section describes OpenStack services in detail.
de: Dieser Abschnitt beschreibt die OpenStack-Dienste im Detail.
ru: В этом разделе подробно описываются службы OpenStack.

source: To add to OpenStack glossary, clone the `openstack/openstack-manuals repository <https://git.openstack.org/cgit/openstack/openstack-manuals>`__ and update the source file ``doc/common/glossary.rst`` through the OpenStack contribution process.
de: Um dem OpenStack-Glossar etwas hinzuzufügen, klonen Sie das `openstack/openstack-manuals Repository <https://git.openstack.org/cgit/openstack/openstack-manuals>` und aktualisieren Sie die Quelldatei `` doc/common/glossary.rst `` durch den OpenStack Mitwirkungsprozess.
ru: Чтобы добавить термин в глоссарий OpenStack, клонируйте `openstack/openstack-manuals repository <https://git.openstack.org/cgit/openstack/openstack-manuals>`__ и обновите исходный файл ``doc/common/glossary.rst`` с помощью соответствующего процесса OpenStack.

source: To avoid storing the password in plain text, you can prompt for the OpenStack password interactively.
de: Um zu vermeiden, das Passwort im Klartext zu speichern, können Sie das Passwort interaktiv eingeben.
ru: Чтобы отказаться от хранения паролей в виде обычного текста, можно настроить интерактивный ввод пароля для OpenStack.

source: To create an image, use :command:`openstack image create`:
de: Um ein Abbild zu erstellen, verwenden Sie: command: `openstack image create`:
ru: Чтобы создать образ, используйте команду `openstack image create`:

source: To delete your volume, you must first detach it from the server. To detach the volume from your server and check for the list of existing volumes, see steps 1 and 2 in Resize_a_volume_.
de: Um den Datenträger zu löschen, müssen Sie ihn zuerst vom Server trennen. Um den Datenträger vom Server zu trennen und nach der Liste der vorhandenen Datenträger zu suchen, siehe Schritte 1 und 2 in Resize_a_volume_.
ru: Перед удалением отсоедините том от сервера. Чтобы отсоединить том от сервера и проверить список доступных томов, см. шаги 1 и 2 в разделе Resize_a_volume_.

source: To design, deploy, and configure OpenStack, administrators must understand the logical architecture.
de: OpenStack Administratoren müssen zum designen, installieren und konfigurieren die logische Architektur verstehen.
ru: Чтобы создать, развернуть и настроить OpenStack, администраторы должны понимать логическую архитектуру.

source: To get a list of images and to get further details about a single image, use :command:`openstack image list` and :command:`openstack image show` commands.
de: Um eine Liste von Abbildern zu erhalten und weitere Details über ein einzelnes Abbild zu erhalten, verwenden Sie die Befehle: `openstack image list` und :command:`openstack image show`.
ru: Чтобы отобразить список образов или получить дополнительные сведения об определенном образе, используйте команды `openstack image list` и `openstack image show`.

source: To install the clients on a Linux, Mac OS X, or Microsoft Windows system, use pip. It is easy to use, ensures that you get the latest version of the clients from the `Python Package Index <https://pypi.python.org/>`__, and lets you update or remove the packages later on.
de: Um die Clients auf einem Linux-, Mac OS X- oder Microsoft Windows-System zu installieren, verwenden Sie pip. Es ist einfach zu bedienen, stellt sicher, dass Sie die neueste Version der Clients aus dem `Python Package Index <https://pypi.python.org/>` __ erhalten und Sie die Pakete später aktualisieren oder entfernen können.
ru: Чтобы установить клиенты в системах Linux, Mac OS X или Microsoft Windows, используйте пакет pip. Он прост в использовании и помогает установить последнюю версию клиента из `Каталога пакетов Python <https://pypi.python.org/>`__, а также позволяет обновлять или удалять пакеты.

source: To provide feedback on documentation, join and use the openstack-docs@lists.openstack.org mailing list at `OpenStack Documentation Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs>`__, or `report a bug <https://bugs.launchpad.net/openstack-manuals/+filebug>`__.
ru: Свои комментарии по документации вы можете отправить в список рассылки по адресу openstack-docs@lists.openstack.org, предварительно вступив в сообщество на странице `OpenStack Documentation Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs>`__. Кроме того, можно сообщить о баге по ссылке `report a bug <https://bugs.launchpad.net/openstack-manuals/+filebug>`__.

source: To remove the client, run the :command:`pip uninstall` command:
ru: Чтобы удалить клиент, выполните команду `pip uninstall`:

source: To resize your volume, you must first detach it from the server. To detach the volume from your server, pass the server ID and volume ID to the following command:
de: Um die Grösse des Datenträgers zu ändern, müssen Sie ihn zuerst vom Server trennen. Um den Datenträger von Ihrem Server zu trennen, übergeben Sie die Server-ID und die Volume-ID an den folgenden Befehl:
ru: Чтобы изменить размер тома, сначала отсоедините его от сервера. Для этого укажите идентификаторы сервера и тома в следующей команде:

source: To set the required environment variables for the OpenStack command-line clients, you must create an environment file called an OpenStack rc file, or ``openrc.sh`` file. If your OpenStack installation provides it, you can download the file from the OpenStack dashboard as an administrative user or any other user. This project-specific environment file contains the credentials that all OpenStack services use.
ru: Чтобы задать необходимые переменные среды для клиентов командной строки OpenStack, необходимо создать файл среды: RC-файл OpenStack или файл ``openrc.sh``. Если в процессе установки вашей версии OpenStack доступна такая возможность, можно загрузить этот файл с панели управления OpenStack (загрузку может выполнить администратор или любой другой пользователь. В этом файле среды для определенного проекта содержатся учетные данные, используемые всеми службами OpenStack.

source: To store location metadata for images, which enables direct file access for a client, update the ``/etc/glance/glance-api.conf`` file with the following statements:
de: Um die Metadaten für Abbilder zu speichern, die einen direkten Dateizugriff für einen Client ermöglichen, aktualisieren Sie die Datei ``/ etc / glance / glance-api.conf` mit den folgenden Anweisungen:
ru: Чтобы сохранять метаданные расположения образов, которые обеспечивают клиенту прямой доступ к файлам, в файле ``/etc/glance/glance-api.conf``обновите следующие строки:

source: To update an image by name or ID, use :command:`openstack image set`:
de: Um ein Abbild nach Name oder ID zu aktualisieren, verwenden Sie: command: `openstack image set`:
ru: Чтобы обновить образ по его имени или ID, используйте команду `openstack image set`:

source: To upgrade a client, add the :option:`--upgrade` option to the :command:`pip install` command:
ru: Чтобы обновить клиент, добавьте параметр `--upgrade` к команде `pip install`:
