Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: A system by which Internet domain name-to-address and address-to-name resolutions are determined. DNS helps navigate the Internet by translating the IP address into an address that is easier to remember. For example, translating 111.111.111.1 into www.yahoo.com. All domains and their components, such as mail servers, utilize DNS to resolve to the appropriate locations. DNS servers are usually set up in a master-slave relationship such that failure of the master invokes the slave. DNS servers might also be clustered or replicated such that changes made to one DNS server are automatically propagated to other active servers. In Compute, the support that enables associating DNS entries with floating IP addresses, nodes, or cells so that hostnames are consistent across reboots.
de: Ein System, mit dem Internet Domain Name-to-Address und Address-to-Name-Auflösungen ermittelt werden. DNS hilft, das Internet zu navigieren, indem man die IP-Adresse in eine Adresse umwandelt, die einfacher zu merken ist. Zum Beispiel, übersetzen 111.111.111.1 in www.yahoo.com. Alle Domänen und deren Komponenten, wie z. B. Mailserver, verwenden DNS, um die entsprechenden Standorte zu lösen. DNS-Server werden in der Regel in einer Master-Slave-Beziehung eingerichtet, so dass der Ausfall des Masters den Slave aufruft. DNS-Server können auch gruppiert oder repliziert werden, so dass Änderungen an einem DNS-Server automatisch an andere aktive Server weitergegeben werden. Compute unterstützt die Zuordnung von DNS-Einträgen mit Floating-IP-Adressen, Knoten oder Zellen ermöglicht, so dass Hostnamen über Reboots konsistent sind.
ru: Система, которая позволяет получить IP-адрес компьютера в Интернете, зная его доменное имя, и наоборот. Система DNS упрощает навигацию в Интернете, благодаря преобразованию IP-адресов в удобные для запоминания доменные имена. Например, IP-адрес 111.111.111.1 может быть преобразован в www.yahoo.com. Все домены и их компоненты, например почтовые серверы, используют службу DNS для поиска нужных IP-адресов компьютеров по их доменным именам. Как правило, информация о домене хранится на двух DNS-серверах - первичном и вторичном. При отказе первичного сервера, его заменяет вторичный. DNS-серверы можно объединять в кластеры или реплицировать таким образом, что изменения, внесенные на одном сервере, автоматически распространяются на все активные серверы. В службе вычислений DNS обеспечивает сопоставление DNS-записей с плавающими IP-адресами, узлами и ячейками, чтобы имена хостов оставались неизменными после перезагрузки.

source: A system that provides services to other system entities. In case of federated identity, OpenStack Identity is the service provider.
ru: Система, которая предоставляет службы другим сущностям системы. Когда речь идет о федеративном удостоверении, поставщиком службы является служба идентификации OpenStack.
vi_vn: Một hệ thống cung cấp các dịch vụ cho các thực thể hệ thống khác. Trong trường liên kết identity, OpenStack Identity chính là trình cung cấp dịch vụ.

source: A tool to automate system configuration and installation on Debian-based Linux distributions.
ru: Инструмент для автоматизации настройки системы и установки дистрибутивов Linux на основе Debian.
vi_vn: Một công cụ tự động cài đặt và cấu hình hệ thống trên các nền Linux chạy Debian.

source: A tool to automate system configuration and installation on Red Hat, Fedora, and CentOS-based Linux distributions.
de: Ein Tool zur Automatisierung der Systemkonfiguration und -installation auf Red Hat-, Fedora- und CentOS-basierten Linux-Distributionen.
ru: Инструмент для автоматизации системных конфигураций и установки на дистрибуциях Linux на базе Red Hat, Fedora и CentOS.
vi_vn: Một công cụ tự động cấu hình hệ thống và cài đặt trên các nền Linux chạy Red Hat, Fedora hoặc CentOS.

source: A type of VM image that exists as a single, bootable file.
de: Ein Typ eines VM-Abbildes, welches als einzige, bootfähige Datei existiert.
ru: Тип образа виртуальной машины в виде единого загрузочного файла.
vi_vn: Một loại của image VM mà tồn tại độc lập, như một thư mục có khả năng khởi động.

source: A type of image file that is commonly used for animated images on web pages.
de: Eine Art von Abbilddatei, die häufig für animierte Bilder auf Webseiten verwendet wird.
ru: Тип файла изображения, как правило, используемый для анимированных изображений на веб-страницах.
vi_vn: Một dạng file ảnh được sử dụng chủ yếu cho ảnh động trên các trang web.

source: A type of reboot where a physical or virtual power button is pressed as opposed to a graceful, proper shutdown of the operating system.
de: Eine Art von Neustart, wo eine physische oder virtuelle Power-Taste gedrückt wird, im Gegensatz zu einem sanften, ordnungsgemäßen Herunterfahren des Betriebssystems.
ru: Тип перезагрузки, при котором нажимается физическая или виртуальная кнопка питания компьютера (в отличие от безопасного выключения операционной системы).
vi_vn: Một dạng reboot khi một nút nguồn ảo hoặc vật lý được bấm, đối lập với việc tắt hệ điều hành một cách có bài bản.

source: A unique ID given to each replica of an Object Storage database.
de: Eine eindeutige ID für jede Replik einer Objekt Storage Datenbank.
ru: Уникальный ID, который присваивается каждой реплике базы данных хранилища объектов.
vi_vn: ID duy nhất được gán cho mỗi bản sao của một cơ sở dữ liệu Object Storage.

source: A unit of storage within Object Storage used to store objects. It exists on top of devices and is replicated for fault tolerance.
ru: Единица хранения в хранилище объектов, используемая для хранения объектов. Создается поверх физических устройств и реплицируется в целях отказоустойчивости.
vi_vn: Đơn vị lưu trữ nằm trong Object Storage được sử dụng để chứa các object. Nó tồn tại ở phía trên các thiết bị và được sao lưu nhằm mục đích chống chịu lỗi.

source: A user specifies their username and password credentials to interact with OpenStack, using any client command. These credentials can be specified using various mechanisms, namely, the environment variable or command-line argument. It is not safe to specify the password using either of these methods.
de: Ein Benutzer gibt ihre Anmeldeinformationen für den Benutzernamen und das Kennwort an, um mit OpenStack unter Verwendung eines beliebigen Client-Befehls zu interagieren. Diese Anmeldeinformationen können mithilfe verschiedener Mechanismen angegeben werden, nämlich der Umgebungsvariablen oder des Befehlszeilenarguments. Es ist nicht sicher, das Kennwort mit einer dieser Methoden festzulegen.
ru: При использовании любой клиентской команды для взаимодействия с OpenStack пользователь указывает свои учетные данные (имя пользователя и пароль). Это можно сделать несколькими методами, в которых используется переменная среды или аргумент командной строки. Все эти методы не надежны с точки зрения безопасности.

source: A user-created Python module that is loaded by horizon to change the look and feel of the dashboard.
de: Ein vom Benutzer erstelltes Python-Modul, das von Horizon geladen das Erscheinungsbild des Dashboards ändert.
ru: Пользовательский модуль Python, который загружает Horizon, чтобы изменить внешний вид и функции панели.
vi_vn: Mô hình người dùng tự khởi tạo bằng Python được tải lên trên horizon để thay đổi giao diện trên dashboard.

source: A virtual network port within Networking; VIFs / vNICs are connected to a port.
ru: Виртуальный сетевой порт в службе управления сетью. К порту подключены VIF / vNIC.
vi_vn: Một port mạng ảo nằm trong Networking, VIFs / VICs đều được kết nối đến port.

source: A virtual network that provides connectivity between entities. For example, a collection of virtual ports that share network connectivity. In Networking terminology, a network is always a layer-2 network.
de: Ein virtuelles Netzwerk, das Konnektivität zwischen Entitäten bietet. Zum Beispiel eine Sammlung von virtuellen Ports, die Netzwerk-Konnektivität zu teilen. In Networking-Terminologie ist ein Netzwerk immer ein Layer-2-Netzwerk.
ru: Виртуальная сеть, которая обеспечивает соединение между сущностями. Например, набор связанных между собой виртуальных портов. Для службы Networking термин сеть всегда относится к сети уровня 2.
vi_vn: Một hệ thống mạng ảo cung cấp kết nối giữa hai thực thể. Ví dụ như một tập hợp các port ảo chia sẻ chung một kết nối mạng. Trong thuật ngữ Networking, một hệ thống mạng luôn luôn là một hệ thống mạng layer-2.

source: A volume is a detachable block storage device, similar to a USB hard drive. You can attach a volume to only one instance. Use the ``openstack`` client commands to create and manage volumes.
de: Ein Datenträger ist ein abtrennbares Blockspeichergerät, ähnlich einer USB-Festplatte. Sie können ein Datenträger an genau eine Instanz anhängen. Verwenden Sie die ``openstack`` Client-Befehle, um Datenträger zu erstellen und zu verwalten.
ru: Том представляет собой отключаемое блочное устройство хранения, подобное USB-устройству. Том можно подключить только к одному инстансу. Для создания томов и управления ими используйте команды клиента ``openstack``.

source: A web framework used extensively in horizon.
de: Ein von Horizon ausgiebig genutztes Web-Framework.
ru: Веб-фреймфорк, широко используемый в Horizon.

source: A worker daemon that creates and terminates virtual machine instances through hypervisor APIs. For example:
de: Ein Worker-Daemon, der virtuelle Maschineninstanzen durch Hypervisor-APIs erstellt und beendet. Beispielsweise:
ru: Рабочий демон, создающий и удаляющий экземпляры виртуальных машин посредством API гипервизоров. Например:

source: A worker process that verifies the integrity of Object Storage objects, containers, and accounts. Auditors is the collective term for the Object Storage account auditor, container auditor, and object auditor.
de: Ein Worker-Prozess, der die Integrität von Objekt Storage Objekten, Containern und Konten verifiziert. Auditor ist der kollektive Ausdruck für Objekt Storage Konten-Auditor, Container-Auditor und Objekt-Auditor.
ru: Рабочий процесс, проверяющий целостность объектов в хранилище, контейнеров и учетных записей. Аудиторы — это собирательный термин для аудитора учетных записей в хранилище объектов, аудитора контейнеров и аудитора объектов.
vi_vn: Một quá trình worker có mục đích xác thực tính toàn vẹn của các object, container và tài khoản thuộc Object Storage. Các trình kiểm tra là thuật ngữ chung cho trình kiểm tra tài khoản, trình kiểm tra container và trình kiểm tra object của Object Storage.

source: A wrapper used by the Image service that contains a VM image and its associated metadata, such as machine state, OS disk size, and so on.
de: Ein Wrapper, der von dem Abbilddienst verwendet wird, der ein VM-Abbild und die zugehörigen Metadaten enthält, z. B. den Maschinenzustand, die Größe des Betriebssystems und so weiter.
ru: Оболочка, используемая службой образов, которая содержит образ ВМ и связанные метаданные, например состояние компьютера, размер диска ОС и др.
vi_vn: người phát triển

source: API endpoint
de: API Endpunkt
ru: Конечная точка API
vi_vn: Điểm cuối API

source: API extension
de: API Erweiterung
ru: Расширение API

source: API extension plug-in
de: API Erweiterung Plug-In
ru: Плагин расширения API

source: API key
de: API Schlüssel
ru: Ключ API

source: API server
ru: Сервер API

source: API token
ru: Токен API
vi_vn: thẻ bài API

source: API used to access OpenStack :term:`Object Storage<Object Storage service (swift)>`.
ru: Интерфейс API, используемый для доступа к :term:`службе объектного хранилища<Object Storage service (swift)> OpenStack.

source: API used to access OpenStack Networking. Provides an extensible architecture to enable custom plug-in creation.
ru: Интерфейс API, используемый для доступа к службе управления сетью OpenStack. Расширяемая архитектура позволяет создавать пользовательские плагины.
vi_vn: API được sử dụng để truy cập OpenStack Networking. Cung cấp một kiến trúc mở rộng để cho phép việc khởi tạo các plug-in riêng.

source: API version
ru: версия API
vi_vn: phiên bản API

source: AWS CloudFormation allows Amazon Web Services (AWS) users to create and manage a collection of related resources. The Orchestration service supports a CloudFormation-compatible format (CFN).
de: AWS CloudFormation erlaubt Amazon Web Services (AWS) Benutzern die Erstellung und Verwaltung einer Sammlung gleichartiger Resourcen. Der Orchestrierungsdienst unterstützt ein CloudFormation-kompatibles Format (CFN).
ru: Благодаря AWS CloudFormation пользователи Amazon Web Services (AWS) создают набор соответствующих ресурсов и управляют им. Служба оркестрации поддерживает формат CFN, совместимый с CloudFormation.

source: AWS CloudFormation template
de: AWS CloudFormation Vorlage
ru: Шаблон AWS CloudFormation
vi_vn: Mãu AWS CloudFormation

source: Absolute limit on the amount of network traffic a Compute VM instance can send and receive.
ru: Абсолютное ограничение сетевого трафика, который может принимать и отправлять инстанс ВМ службы вычислительных ресурсов.
vi_vn: Giới hạn tuyệt đối về số lượng các lưu lượng mạng mà một máy ảo Compute có thể gửi và nhận.

source: Accept a volume transfer request
de: Akzeptieren eines Datentransferauftrags
ru: Прием запроса на на перенос тома

source: Accept the request:
de: Die Anfrage akzeptieren:
ru: Примите запрос:

source: Accepts API requests, and routes them to the ``cinder-volume`` for action.
de: Nimmt API Anfragen entgegen und leitet sie zur Ausführung an ``cinder-volume`` weiter.
ru: Принимает запросы API и перенаправляет их в ``cinder-volume`` для выполнения действий.

source: Accepts Image API calls for image discovery, retrieval, and storage.
de: Nimmt API-Aufrufe zum Auffinden, Abrufen und Speichern von Abbildern entgegen.
ru: Принимает вызовы API образов, чтобы обнаруживать, извлекать и сохранять образы.

source: Accepts OpenStack Object Storage API and raw HTTP requests to upload files, modify metadata, and create containers. It also serves file or container listings to web browsers. To improve performance, the proxy server can use an optional cache that is usually deployed with memcache.
de: Akzeptiert OpenStack Object Storage API und rohe HTTP-Anforderungen zum Hochladen von Dateien, Ändern von Metadaten und Erstellen von Containern. Es bedient auch Datei-oder Container-Listen für Web-Browser. Um die Leistung zu verbessern, kann der Proxyserver einen optionalen Cache verwenden, der normalerweise mit memcache bereitgestellt wird.
ru: Принимают запросы API хранилища объектов OpenStack и необработанные запросы HTTP, чтобы передавать файлы, изменять метаданные и создавать контейнеры. Кроме того, прокси-серверы передают веб-браузерам перечни файлов и контейнеров. Чтобы повысить быстродействие, прокси-сервер может использовать дополнительную кэш-память, обычно развертываемую с помощью memcache.

source: Accepts and responds to end user compute API calls. The service supports the OpenStack Compute API, the Amazon EC2 API, and a special Admin API for privileged users to perform administrative actions. It enforces some policies and initiates most orchestration activities, such as running an instance.
de: Nimmt Endbenutzer API-Aufrufe entgegen und beantwortet sie. Der Dienst unterstützt die OpenStack Compute API, die Amazon EC2 API und eine spezielle Admin API für privilegierte Benutzer zum Ausführen administrativer Aktionen. Dabei werden eine Richtlinien erzwungen und die meisten Orchestrierungsaktionen können gestartet werde, wie zum Beispiel der Start einer Instanz.
ru: Принимает вызовы API вычислительных ресурсов конечных пользователей и отвечает на них. Служба поддерживает API службы вычислительных ресурсов OpenStack, Amazon EC2 API и специальный API администратора для привилегированных пользователей, который позволяет выполнять администрирование. Она применяет определенные политики и запускает большинство действий по оркестрации, например выполнение экземпляра.

source: Accepts and routes API requests to the appropriate OpenStack Networking plug-in for action.
de: Nimmt API Anfragen entgegen und routet diese an das entsprechende OpenStack Netzwerk-Plugin zur Ausführung.
ru: Принимает и перенаправляет API запросы соответствующим плагинам сетевой службы OpenStack для обработки.

source: Accepts metadata requests from instances. The ``nova-api-metadata`` service is generally used when you run in multi-host mode with ``nova-network`` installations. For details, see `Metadata service <http://docs.openstack.org/admin-guide/compute-networking-nova.html#metadata-service>`__ in the OpenStack Administrator Guide.
ru: Принимает запросы метаданных от экземпляров. В общем случае служба ``nova-api-metadata`` используется при работе в режиме нескольких хостов с инсталляциями ``nova-network``. Подробнее см. в разделе `Служба метаданных <http://docs.openstack.org/admin-guide/compute-networking-nova.html#metadata-service>`__ в руководстве администратора OpenStack.

source: Access associated with a VM
de: Zugriff, der einer VM zugeordnet ist
ru: Доступ в пределах виртуальных машин

source: Access can be provided to a VM
de: Zugriff kann für eine VM gewährt werden.
ru: Доступ предоставляется к виртуальным машинам

source: Access the Database service instance using typical database access commands. For example, with MySQL:
de: Greifen Sie auf die Datenbankdienstinstanz zu, indem Sie typische Datenbankzugriffsbefehle verwenden. Zum Beispiel mit MySQL:
ru: Получают доступ к экземпляру службы баз данных, используя обычные команды доступа к базам данных. Например, для MySQL:

source: Account servers (swift-account-server)
de: Account Server (swift-account-server)
ru: Серверы учетных записей (swift-account-server)

source: Acts as the gatekeeper to Object Storage and is responsible for authenticating the user.
ru: Действует в качестве привратника объектного хранилища и отвечает за аутентификацию пользователей.
vi_vn: Hoạt động như là người giữ cổng khi truy cập vào Object Storage và chịu trách nhiệm xác thực người dùng.

source: Address Resolution Protocol (ARP)
ru: протокол ARP
vi_vn: Giao thức phân giải địa chỉ (ARP)

source: Administrator configures size setting, based on flavors
de: Administrator konfiguriert die Bemessung, basierend auf den Varianten
ru: Администратор задает размер на основе типа экземпляра

source: Advanced Message Queuing Protocol (AMQP)
ru: Расширенный протокол очереди сообщений (AMQP)

source: After the volume recipient, or new owner, accepts the transfer, you can see that the transfer is no longer available:
de: Nachdem der Datenträgerempfänger oder neue Besitzer die Übertragung akzeptiert hat, sehen Sie, dass die Übertragung nicht mehr verfügbar ist:
ru: После принятия получателем тома (новым владельцем) этот перенос становится недоступен:

source: After you restart the Image service, you can use the following syntax to view the image's location information:
de: Nachdem Sie den Abbild-Dienst neu gestartet haben, können Sie die folgende Syntax verwenden, um die Standortinformationen des Abbilds anzuzeigen:
ru: Перезапустив службу образов, можно использовать следующую команду для просмотра сведений о расположении образа:

source: After you upload an image, you cannot change it.
de: Nachdem Sie ein Abbild hochgeladen haben, können Sie es nicht mehr ändern.
ru: Образ невозможно изменить после его загрузки.

source: All OpenStack core projects are provided under the terms of the Apache License 2.0 license.
de: Alle OpenStack Kernprojekte werden unter den Bedingungen der Apache License 2.0 Lizenz zur Verfügung gestellt.
ru: Все официальные проекты OpenStack предоставляются согласно положениям лицензии Apache License 2.0.
vi_vn: Tất cả các chính thức chính thức của OpenStack được cung cấp theo các điều khoản trong phiên bản Apache 2.0 cấp phép.

source: Allows a user to set a flag on an :term:`Object Storage<Object Storage service (swift)>` container so that all objects within the container are versioned.
ru: Позволяет пользователю установить флаг для контейнера :term:`объектного хранилища<Object Storage service (swift)>` с целью управления всеми объектами в контейнере.

source: Alphanumeric ID assigned to each Identity service role.
ru: Набор алфавитно-цифровых символов, которые задаются для каждой роли службы идентификации.
vi_vn: ID gồm số và ký tự được gán cho mỗi vai trò của dịch vụ Identity.

source: Alternative name for the :term:`Image API`.
de: Alternativer Name für den Ausdruck :term:`Abbild API`.
ru: Альтернативный термин для :term:`API службы образов`.

source: Alternative name for the Block Storage API.
de: Alternativer Name für die Block Storage API.
ru: Альтернативный термин для API блочного хранилища.
vi_vn: Tên gọi khác của Block Storage API.

source: Alternative term for a Networking plug-in or Networking API extension.
de: Alternative Bezeichnung für ein Netzwerk-Plugin oder Netzwerk-API-Erweiterung.
ru: Вариант термина для плагина управления сетью или расширения сетевого API.
vi_vn: Thuật ngữ thay thế cho một plug-in Networking hoặc API Networking mở rộng.

source: Alternative term for a RabbitMQ message exchange.
de: Alternativer Ausdruck für ein RabbitMQ Nachrichtenaustausch.
ru: Альтернативный термин для обмена сообщениями RabbitMQ.
vi_vn: Thuật ngữ thay thế cho một trao đổi tin nhắn của RabbitMQ.

source: Alternative term for a VM image.
ru: Альтернативный термин для образа ВМ,
vi_vn: Thuật ngữ thay thế cho image máy ảo

source: Alternative term for a VM instance type.
de: Alternativer Ausdruck für VM Instanz-Typ.
ru: Альтернативный термин для типа инстанса виртуальной машины.
vi_vn: Thuật ngữ thay thế cho một dạng máy ảo.

source: Alternative term for a VM or guest.
de: Alternativer Ausdruck für eine VM oder ein Gast.
ru: Альтернативный термин для виртуальной машины или гостевой ОС.
vi_vn: Thuật ngữ thay thế cho một máy ảo hoặc máy khách.

source: Alternative term for a cloud controller node.
de: Alternative Bezeichnung für einen Cloud-Controller-Knoten.
ru: Вариант названия для управляющего узла облака.
vi_vn: Thuật ngữ thay thế cho node điều khiển cloud.

source: Alternative term for a cloudpipe.
ru: Альтернативный термин для cloudpipe.
vi_vn: Thuật ngữ thay thế cho cloudpipe.

source: Alternative term for a fixed IP address.
ru: Альтернативный термин для фиксированного IP-адреса.
vi_vn: Thuật ngữ thay thế cho địa chỉ IP cố định.

source: Alternative term for a flavor ID.
de: Alternativer Ausdruck für Varianten-ID.
ru: Альтернативный термин для flavor ID.
vi_vn: Thuật ngữ thay thế cho flavor ID.

source: Alternative term for a non-durable exchange.
ru: Альтернативный термин для непродолжительного обмена.

source: Alternative term for a non-durable queue.
ru: Альтернативный термин для непродолжительной очереди.
vi_vn: thuật ngữ thay thế cho một trình tự queue không bền

source: Alternative term for a paused VM instance.
ru: Альтернативный термин для приостановленного инстанса ВМ.

source: Alternative term for a virtual network.
de: Alternativer Ausdruck für ein virtuelles Netzwerk.
ru: Альтернативный термин для виртуальной сети.
vi_vn: Thuật ngữ thay thế cho mạng ảo

source: Alternative term for a volume plug-in.
de: Alternative Bezeichnung für ein Datenträger Plug-in.
ru: Альтернативный термин для плагина диска.
vi_vn: Một thuật ngữ thay thế cho ổ cứng ngoài.
