Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: One of the RPC primitives used by the OpenStack message queue software. Sends a message and does not wait for a response.
de: Einer der RPC-Primitive, die von der OpenStack-Nachrichtenwarteschlangensoftware verwendet werden. Sendet eine Nachricht und wartet nicht auf eine Antwort.
ru: Один из примитивов RPC, который используется очередью сообщений OpenStack. Отправляет сообщение и не ждет ответа.
vi_vn: Một trong các RPC nguyên gốc được sử dụng bởi phần mềm tin nhắn theo trình tự OpenStack. Gửi một thông điệp và KHÔNG chờ một phản hồi.

source: One of the RPC primitives used by the OpenStack message queue software. Sends a message and waits for a response.
de: Einer der RPC-Primitive, die von der OpenStack-Nachrichtenwarteschlangensoftware verwendet werden. Sendet eine Nachricht und wartet auf eine Antwort.
ru: Один из примитивов RPC, который используется очередью сообщений OpenStack. Отправляет сообщение и ждет ответа.
vi_vn: Một trong các RPC nguyên gốc được sử dụng bởi phần mềm tin nhắn theo trình tự OpenStack. Gửi một thông điệp và chờ một phản hồi.

source: One of the VM image disk formats supported by Image service.
de: Eine der VM-Abbild-Festplattenformate, die vom Abbilddienst unterstützt wird.
ru: Один из форматов дисков для образов виртуальных машин, поддерживаемый службой образов.
vi_vn: Một trong những định dang đĩa image máy ảo được hỗ trợ bởi dịch vụ Image.

source: One of the VM image disk formats supported by Image service; an unstructured disk image.
ru: Один из форматов дисков для образов виртуальных машин, поддерживаемый службой образов. Неструктурированный образ диска.
vi_vn: Một trong những định dạng image disk của máy ảo VM hỗ trợ bởi dịch vụ hình ảnh; một hình ảnh đĩa có cấu trúc.

source: One of the default roles in the Compute RBAC system and the default role assigned to a new user.
de: Eine der als Standard vorhandenen Rollen im Compute RBAC System und die Standardrolle für neue Benutzer.
ru: Одна из ролей по умолчанию в системе RBAC службы вычислительных ресурсов и роль по умолчанию, назначенная новому пользователю.
vi_vn: Một trong những vai trò mặc định trong hệ thống Compute RBAC và là vai trò mặc định được gán cho người dùng mới.

source: One of the default roles in the Compute RBAC system. Enables a user to add other users to a project, interact with VM images that are associated with the project, and start and stop VM instances.
ru: Одна из ролей по умолчанию в системе RBAC службы вычислительных ресурсов. Системный администратор может добавлять других пользователей в проект, взаимодействовать с образами ВМ (связанными с проектом), а также запускать и останавливать инстансы ВМ.
vi_vn: Một trong những vai trò mặc định trong hệ thống Compute RBAC. Cho phép người dùng có thể thêm các người dùng khác vào một project, tương tác với các image VM có liên kết đến project đó, bật và tắt các máy ảo VM.

source: One of the default roles in the Compute RBAC system. Enables the user to allocate publicly accessible IP addresses to instances and change firewall rules.
de: Eine der Standardrollen im Rechen-RBAC-System. Ermöglicht dem Benutzer, öffentlich zugängliche IP-Adressen zu Instanzen zuzuweisen und Firewall-Regeln zu ändern.
ru: Одна из ролей по умолчанию в системе Compute с управлением доступом на основе ролей (RBAC). Позволяет пользователям выделять общедоступные IP-адреса инстансам и настраивать правила на брандмауэрах.
vi_vn: Một trong những vai trò mặc định trong hệ thống Compute RBAC. Nó cho phép người dùng phân bố công khai địa chỉ IP truy cập đến các máy ảo hoặc thay đổi các quy tắc của tường lửa.

source: One of the default roles in the Compute RBAC system. Grants complete system access.
de: Eine der Standardrollen im Compute RBAC-System. Gewährt den gesamten Systemzugriff.
ru: Одна из ролей по умолчанию в системе с управлением доступом на основе ролей (RBAC) службы вычислительных ресурсов. Предоставляет полный доступ к системе.
vi_vn: Một trong những vai trò mặc định của hệ thống Compute RBAC.

source: One of the hypervisors supported by OpenStack.
de: Eine der Hypervisor unterstützt von OpenStack.
ru: Один из гипервизоров поддерживаемых OpenStack.
vi_vn: Một trong những hypervisor được hỗ trợ bởi OpenStack

source: One of the supported response formats in OpenStack.
de: Eines der unterstützten Antwortformate in OpenStack
ru: Один из поддерживаемых форматов ответа в OpenStack.
vi_vn: Một trong những định dạng hồi đáp được hỗ trợ trong OpenStack.

source: Open source GUI and CLI tools used for remote console access to VMs. Supported by Compute.
de: Open Source GUI und CLI Werkzeuge zum Fernzugriff auf VMs. Von Compute unterstützt.
ru: Инструменты пользовательского интерфейса и командной строки с открытым исходным кодом, которые используются для удаленного доступа с консоли к ВМ. Поддерживаются службой вычислительных ресурсов.
vi_vn: Các công cụ GUI và CLI mã nguồn mở dùng để truy cập giao diện điều khiển từ xa đến các VM. Được hỗ trợ bởi Compute.

source: Open source tool used to access remote hosts through an encrypted communications channel, SSH key injection is supported by Compute.
ru: Средство с открытым исходным кодом, используемое для доступа к удаленным хостам по зашифрованному каналу связи. Использование ключа SSH поддерживается в службе вычислительных ресурсов.
vi_vn: Công cụ mã nguồn mở được sử dụng để truy cập vào các máy chủ từ xa thông qua các kênh truyền thông mã hóa, truyền key SSH được hỗ trợ bởi Compute.

source: Open vSwitch (OVS) agent
ru: агент Open vSwitch (OVS)

source: Open vSwitch is a production quality, multilayer virtual switch licensed under the open source Apache 2.0 license. It is designed to enable massive network automation through programmatic extension, while still supporting standard management interfaces and protocols (for example NetFlow, sFlow, SPAN, RSPAN, CLI, LACP, 802.1ag).
ru: Open vSwitch — высококачественный многоуровневый виртуальный коммутатор с открытым исходным кодом, предоставляемый по лицензии Apache 2.0. Предназначен для автоматизации управления крупных сетей с помощью программных средств, но при этом поддерживает стандартные сетевые протоколы и интерфейсы (например, NetFlow, sFlow, SPAN, RSPAN, CLI, LACP, 802.1ag).
vi_vn: OpenStack là một sản phẩm chất lượng, một switch ảo đa tầng được cấp phép theo giấy pháp mã nguồn mở Apache 2.0. Nó được thiết kế để cho phép tự động hóa các hệ thống mạng khổng lồ thông qua các phần mở rộng theo chương trình, đồng thời vẫn hỗ trợ các giao diện và giao thức quản lý tiêu chuẩn (ví dụ như NetFlow, sFlow, SPAN, RSPAN, CLI, LACP, 802.1ag).

source: Open vSwitch neutron plug-in
ru: Плагин Open vSwitch neutron

source: OpenStack APIs are open-source Python clients, and can run on Linux or Mac OS X systems. On some client commands, you can specify a debug parameter to show the underlying API request for the command. This is a good way to become familiar with the OpenStack API calls.
de: OpenStack-APIs sind Open-Source-Python-Clients und können auf Linux- oder Mac OS X-Systemen ausgeführt werden. Auf einigen Client-Befehlen können Sie einen Debug-Parameter angeben, um die zugrundeliegende API-Anforderung für den Befehl anzuzeigen. Dies ist eine gute Möglichkeit, sich mit den OpenStack API-Anrufen vertraut zu machen.
ru: API OpenStack — это клиенты Python с открытым исходным кодом, которые можно выполнять в системах Linux и Mac OS X. При использовании некоторых команд клиента можно задавать параметры отладки, чтобы отобразить базовый API-запрос для этой команды. Это хороший способ изучить вызовы API OpenStack.

source: OpenStack Compute consists of the following areas and their components:
de: OpenStack Compute besteht aus den folgenden Bereichen und deren Komponenten:
ru: Служба вычислительных ресурсов OpenStack состоит из следующих областей и компонентов.

source: OpenStack Compute interacts with OpenStack Identity for authentication; OpenStack Image service for disk and server images; and OpenStack dashboard for the user and administrative interface. Image access is limited by projects, and by users; quotas are limited per project (the number of instances, for example). OpenStack Compute can scale horizontally on standard hardware, and download images to launch instances.
ru: Служба вычислительных ресурсов OpenStack взаимодействует со службой идентификации OpenStack для аутентификации, со службой образов OpenStack — для работы с образами дисков и серверов, а также с панелью мониторинга OpenStack — для использования интерфейса пользователя и администратора. Доступ к образам ограничен проектами и пользователями, квоты ограничены проектом (например, числом экземпляров). Службу вычислительных ресурсов OpenStack можно масштабировать горизонтально на стандартном оборудовании, а также загружать образы для запуска экземпляров.

source: OpenStack Networking (neutron) allows you to create and attach interface devices managed by other OpenStack services to networks. Plug-ins can be implemented to accommodate different networking equipment and software, providing flexibility to OpenStack architecture and deployment.
de: OpenStack Netzwerk (neutron) erlaubt die Erstellung und das Hinzufügen von Netzwerkgeräten, die von anderen OpenStack Diensten verwaltet werden. Plugins können verwendet werden, um verschiedene Netzwerkausrüstung und Software zu ermöglichen, und dabei die Flexibilität der OpenStack Architektur und der Bereitstellung sicherzustellen.
ru: Сетевая служба OpenStack (Neutron) позволяет создавать и подключать к сетям интерфейсные устройства, которыми управляют другие службы OpenStack. Для подключения различного сетевого программного обеспечения и оборудования можно использовать плагины, которые повышают гибкость архитектуры и развертывания OpenStack.

source: OpenStack Networking agent that provides DHCP services for virtual networks.
de: OpenStack Netzwerk Agent, der DHCP Dienste für virtuelle Netzwerke zur Verfügung stellt.
ru: Агент OpenStack Networking, который предоставляет службы DHCP для виртуальных сетей.
vi_vn: OpenStack Networking agent cung cấp dịch vụ DHCP cho các mạng ảo

source: OpenStack Networking agent that provides layer-2 connectivity for virtual networks.
de: OpenStack Netzwerkagent, der Layer-2-Verbindung für virtuelle Netzwerke bereitstellt.
ru: Агент службы управления сетью OpenStack (Networking), предоставляющий подключение layer-2 для виртуальных сетей.
vi_vn: OpenStack Networking agent cung cấp kết nối lớp-2 cho các mạng ảo

source: OpenStack Networking agent that provides layer-3 (routing) services for virtual networks.
de: OpenStack Netzwerkagent, der layer-3 (routing) Dienste für virtuelle Netzwerke zur Verfügung stellt.
ru: Агент службы управления сетью OpenStack (Networking), предоставляющий службы layer-3 (маршрутизация) для виртуальных сетей.
vi_vn: OpenStack Networking agent cung cấp kết nối lớp-2(định tuyến) cho các mạng ảo

source: OpenStack Networking agent that provides metadata services for instances.
de: OpenStack Networking Agent, der Metadatendienste für Instanzen bereitstellt.
ru: Агент OpenStack службы Networking, который предоставляет службы метаданных для инстансов.
vi_vn: OpenStack Networking agent cung cấp các dịch vụ metadata cho các máy ảo

source: OpenStack Networking mainly interacts with OpenStack Compute to provide networks and connectivity for its instances.
de: OpenStack Networking interagiert hauptsächlich mit OpenStack Compute, um Netzwerke und Konnektivität für seine Instanzen bereitzustellen.
ru: Сетевая служба OpenStack, как правило, взаимодействует со службой вычислительных ресурсов OpenStack, чтобы обеспечить сетевое подключение всех экземпляров.

source: OpenStack Networking plug-ins and agents
de: OpenStack Networking-Plug-ins und Agenten
ru: Плагины и агенты сетевой службы OpenStack

source: OpenStack Services
de: OpenStack-Dienste
ru: Службы OpenStack

source: OpenStack code name
ru: Кодовое имя OpenStack
vi_vn: Tên mã OpenStack

source: OpenStack command-line clients prerequisites
de: OpenStack Kommandozeilenclient Voraussetzungen
ru: Необходимые условия для установки клиентов командной строки OpenStack

source: OpenStack distribution packages
de: OpenStack Distributionspakete
ru: Пакеты дистрибутива OpenStack

source: OpenStack is a cloud operating system that controls large pools of compute, storage, and networking resources throughout a data center, all managed through a dashboard that gives administrators control while empowering their users to provision resources through a web interface. OpenStack is an open source project licensed under the Apache License 2.0.
de: OpenStack ist ein Cloud-Betriebssystem, das große Bestände von Computer-, Speicher- und Netzwerkresourcen im Rechenzentrum kontrolliert, verwaltet durch eine Weboberfläche, die es Administratoren ermöglicht, dass Benutzer ihre Ressoursen selbst provisionieren können. OpenStack ist ein Opensource-Projekt lizensiert unter der Apache Lizenz 2.0.
ru: OpenStack — облачная операционная система, которая через ЦОД управляет большими пулами вычислительных и сетевых ресурсов, а также устройствами хранения. Управление выполняют администраторы с помощью панели управления (dashboard), а пользователи могут развертывать ресурсы с помощью веб-интерфейса. OpenStack — проект с отрытым исходным кодом, который предоставляется согласно положениям лицензии Apache License 2.0.
vi_vn: OpenStack là một hệ điều hành điện toán đám mây có khả năng kiểm soát một lượng lớn các tài nguyên về tính toán, lưu trữ và mạng thông qua một trung tâm dữ liệu, tất cả đều được quản lý qua một bảng điều khiển (dashboard). Bảng điều khiển này trao quyền kiểm soát cho các quản trị viên đồng thời khuyến khích người dùng của họ cung cấp tài nguyên thông qua giao diện web. OpenStack là một dự án mã nguồn mở được cấp phép theo Apache License 2.0.

source: OpenStack mailing lists
de: OpenStack Mailinglisten
ru: Списки рассылки OpenStack

source: OpenStack project that aims to make cloud services easier to consume and integrate with application development process by automating the source-to-image process, and simplifying app-centric deployment. The project name is solum.
ru: Проект OpenStack под названием Solum, который предназначен, чтобы упростить использование облачных служб и интегрировать их в процесс разработки приложений с помощью автоматизации процесса S2I (source-to-image) и упрощения развертывания инфраструктуры, ориентированной на приложения.

source: OpenStack project that provides a Clustering service.
ru: Проект OpenStack, который предоставляет службу кластеризации.

source: OpenStack project that provides a Software Development Lifecycle Automation service.
ru: Проект OpenStack, который предоставляет службу автоматизации жизненного цикла разработки программного обеспечения.

source: OpenStack project that provides a framework for performance analysis and benchmarking of individual OpenStack components as well as full production OpenStack cloud deployments.
de: OpenStack-Projekt, das ein Framework für Performance-Analyse und Benchmarking einzelner OpenStack-Komponenten sowie vollständige OpenStack-Cloud-Implementierungen bereitstellt.
ru: Проект OpenStack, предоставляющий платформу для анализа производительности и эффективности отдельных компонентов OpenStack, а также полномасштабных облачных развертываний OpenStack.

source: OpenStack project that provides a scalable data-processing stack and associated management interfaces.
de: OpenStack Projekt, dass einen skalierbaren Datenverarbeitungs-Stack und passende Management-Interfaces bereitstellt.
ru: Проект OpenStack, который предоставляет масштабируемый стек обработки данных и связанные интерфейсы управления.
vi_vn: Một dự án OpenStack cung cấp một stack xử lý dữ liệu có khả năng mở rộng cùng với các giao diện quản lý đi kèm.

source: OpenStack project that provides backup restore and disaster recovery as a service.
ru: Проект OpenStack, предлагающий резервное копирование и аварийное восстановление в виде услуги.

source: OpenStack project that provides scalable, on demand, self service access to authoritative DNS services, in a technology-agnostic manner. The code name for the project is designate.
ru: Проект OpenStack, по запросу предоставляющий масштабируемый самостоятельный доступ к доверенным службам DNS не зависящим от технологий способом. Кодовое имя проекта — designate.

source: OpenStack project that provides the Governance service.
ru: Проект OpenStack, который предоставляет службу управления.

source: OpenStack project to provide Governance-as-a-Service across any collection of cloud services in order to monitor, enforce, and audit policy over dynamic infrastructure. The code name for the project is congress.
ru: Проект OpenStack, предоставляющий управление как услугу для любого набора сетевых служб с целью мониторинга, применения и аудита политики по отношению к динамической инфраструктуре. Кодовое имя проекта — Congress.

source: OpenStack project which provides an extensible, unified, web-based user interface for all OpenStack services.
de: OpenStack Projekt, das ein erweiterbares, einheitliches Web-basiertes Benutzerinterface für alle OpenStack Dienste bietet.
ru: Проект OpenStack по предоставлению расширяемого, унифицированного пользовательского веб-интерфейса для всех служб OpenStack.

source: OpenStack provides an :term:`Infrastructure-as-a-Service (IaaS)` solution through a set of interrelated services. Each service offers an :term:`application programming interface (API)` that facilitates this integration. Depending on your needs, you can install some or all services.
de: OpenStack bietet ein :term: `Infrastruktur-as-a-Service (IaaS)` Lösung durch eine Reihe von miteinander verbundenen Dienstleistungen. Jeder Dienst bietet eine :term: `API-Programmierung ', die diese Integration erleichtert. Abhängig von Ihren Bedürfnissen können Sie einige oder alle Dienste installieren.
ru: Для реализации модели :term:`Инфраструктура как услуга (IaaS)` в OpenStack используется набор взаимосвязанных служб. Каждая служба предоставляет :term:`программный интерфейс (API)`, с помощью которого реализуется это взаимодействие. Службы можно устанавливать с учетом существующих потребностей.

source: OpenStack services
de: OpenStack Dienste
ru: Службы OpenStack

source: OpenStack services and clients
de: OpenStack-Dienste und Clients
ru: Службы и клиенты OpenStack

source: OpenStack supports accessing the Amazon EC2 API through Compute.
de: OpenStack unterstützt Zugriff auf Amazon EC2 API durch Compute.
ru: OpenStack поддерживает доступ к интерфейсу Amazon EC2 API через службу вычислительных ресурсов (Compute).
vi_vn: OpenStack hỗ trợ truy cập vào Amazon EC2 API thông qua Compute.

source: OpenStack supports encryption technologies such as HTTPS, SSH, SSL, TLS, digital certificates, and data encryption.
de: OpenStack unterstützt Verschlüsselungstechnologien wie HTTPS, SSH, SSL, TLS, digitale Zertifikate und Datenverschlüsselung.
ru: В OpenStack поддерживаются следующие технологии шифрования: HTTPS, SSH, SSL, TLS, цифровые сертификаты и шифрование данных.
vi_vn: OpenStack hỗ trợ các công nghệ mã hóa như HTTPS, SSH, SSL, TLS, các xác thực kĩ thuật số và mã hóa dữ liệu.

source: OpenStack-on-OpenStack program. The code name for the OpenStack Deployment program.
ru: Программа OpenStack-on-OpenStack. Кодовое имя программы развертывания OpenStack.
vi_vn: Chương trình OpenStack trên OpenStack. Tên mã của chương trình Triển Khai OpenStack.

source: OpenStackClient project provides a unified command-line client, which enables you to access the project API through easy-to-use commands. Also, most OpenStack project provides a command-line client for each service. For example, the Compute service provides a ``nova`` command-line client.
de: OpenStackClient-Projekt bietet einen einheitlichen Befehlszeilen-Client, mit dem Sie über einfach zu bedienende Befehle auf die Projekt-API zugreifen können. Darüber hinaus bietet die meisten OpenStack-Projekte einen Befehlszeilen-Client für jeden Dienst. Beispielsweise stellt der Compute-Dienst einen ``nova``-Befehlszeilenclient bereit.
ru: В проекте OpenStackClient предоставляется универсальный клиент командной строки, который позволяет получать доступ к API проекта с помощью простых команд. Кроме того, в большинстве проектов OpenStack предоставляется клиент командной строки для каждой службы. Например, для службы вычислительных ресурсов предоставляется клиент командной строки ``nova``.

source: Opens all objects for an object server and verifies the MD5 hash, size, and metadata for each object.
ru: Открывает все объекты для сервера объектов и проверяет хэш MD5, размер и метаданные каждого объекта.
vi_vn: Mở tất cả các object cho một object server và kiểm tra, MD5 hash, kích cỡ và metadata cho từng object.

source: Optionally, to confirm the upload in Image service, run:
de: Optional können Sie den Upload im Abbild-Dienst bestätigen:
ru: Кроме того, чтобы подтвердить передачу образа в службу образов, можно выполнить команду:

source: Optionally, you can specify a name for the transfer by using the ``--name transferName`` parameter.
de: Optional können Sie einen Namen für die Übertragung mit dem Parameter `` --name transferName`` angeben.
ru: Дополнительно можно задать имя переноса с помощью параметра ``--name transferName``.

source: Orchestrates multiple composite cloud applications by using either the native HOT template format or the AWS CloudFormation template format, through both an OpenStack-native REST API and a CloudFormation-compatible Query API.
de: Orchestriert mehrere zusammengesetzte Cloud-Anwendungen, indem entweder das native HOT-Template-Format oder das AWS-CloudFormation-Vorlagenformat verwendet wird, und zwar sowohl über eine OpenStack-native REST-API als auch eine CloudFormation-kompatible Abfrage-API.
ru: Координирует работу многочисленных составных облачных приложений с помощью собственного формата шаблона HOT или с помощью формата шаблона AWS CloudFormation посредством собственного REST API OpenStack и Query API, совместимого с CloudFormation.

source: Orchestrates the launching of templates and provides events back to the API consumer.
de: Orchestriert das Starten von Vorlagen und stellt Ereignisse an den API-Konsumenten zurück.
ru: Оркестрирует запуск шаблонов и возвращает события потребителю API.

source: Orchestration service
de: Orchestrierungsdienst (heat)
ru: Служба оркестрации

source: Orchestration service (heat)
ru: Служба оркестрации (Heat)

source: Orchestration service overview
de: Übersicht Orchestrierungsdienst
ru: Обзор службы оркестрации

source: Organizes and stores objects in Object Storage. Similar to the concept of a Linux directory but cannot be nested. Alternative term for an Image service container format.
de: Organisiert und speichert Objekte in Object Storage. Ähnlich wie das Konzept eines Linux-Verzeichnisses, kann aber nicht verschachtelt werden. Alternativer Begriff für ein Abbilddienstcontainerformat.
ru: Упорядочивает и хранит объекты в хранилище. Похож на каталог Linux, но не поддерживает вложения. Вариант названия для формата контейнеров службы образов.
vi_vn: Quản lý và lưu trữ các object trong Object Storage. Tương tự như khái niệm của một thư mục Linux nhưng không thể lồng vào với nhau. Thuật ngữ thay thế của định dạng container của Image service.

source: Override environment variable values
de: Überschreiben von Umgebungsvariablenwerten
ru: Изменение значений переменных среды

source: PCI passthrough
ru: сквозной режим PCI

source: Package
de: Paket
ru: Пакет
