Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: A number of periodic processes run on the OpenStack Image service to support caching. Replication services ensure consistency and availability through the cluster. Other periodic processes include auditors, updaters, and reapers.
de: Eine Anzahl von periodischen Prozessen wird auf dem OpenStack Abbilddienst ausgeführt, um das Caching zu unterstützen. Replikationsdienste sorgen für Konsistenz und Verfügbarkeit durch den Cluster. Andere periodische Prozesse umfassen auditors, updaters und reapers.
ru: Целый ряд периодических процессов использует службу образов OpenStack для поддержки кэширования. Служба репликации обеспечивает согласованность и доступность в рамках кластера. Кроме того, периодические процессы включают в себя аудиторы, корректоры и риперы.

source: A number within a database that is incremented each time a change is made. Used by Object Storage when replicating.
ru: Число в базе данных, которое увеличивается при каждом изменении. Используется объектным хранилищем при репликации.
vi_vn: Một con số nằm trong cơ sở dữ liệu được tăng lên mỗi khi có thay đổi. Được sử dụng bởi Object Storage khi thực hiện sao lưu.

source: A package commonly installed in VM images that performs initialization of an instance after boot using information that it retrieves from the metadata service, such as the SSH public key and user data.
de: Ein Paket, das häufig in VM-Images installiert ist und die Initialisierung einer Instanz nach dem Booten unter Verwendung von Informationen ausführt, die es vom Metadatendienst abruft, wie beispielsweise der öffentliche SSH-Schlüssel und die Benutzerdaten.
ru: Популярный пакет инициализации виртуальных машин после их загрузки. Использует информацию, полученную от служб метаданных, например SSH с открытым ключом и пользовательских данных
vi_vn: Một gói thường được cài trên các image máy ảo thực hiện việc khởi tạo một instance sau khi khởi động bằng cách sử dụng thông tin mà nó thu thập được từ dịch vụ metadata, ví dụ như SSH pbulic key và thông tin người dùng.

source: A packaged version available in `the Open Build Service <https://build.opensuse.org/package/show?package=python-pip&project=Cloud:OpenStack:Master>`__ enables you to use YaST or zypper to install the package.
de: Eine paketierte Version aus dem `Open Build Service <https://build.opensuse.org/package/show?package=python-pip&project=Cloud:OpenStack:Master>`__ erlaubt Ihnen YaST oder zypper zur Paketinstallation zu verwenden.
ru: Если упакованная версия клиента доступна на платформе `the Open Build Service <https://build.opensuse.org/package/show?package=python-pip&project=Cloud:OpenStack:Master>`__, для установки пакета можно использовать YaST или zypper.

source: A packaged version enables you to use yum to install the package:
de: Eine paketierte Version ermöglicht es Ihnen, yum verwenden, um das Paket zu installieren:
ru: Чтобы установить упакованную версию клиента, можно использовать команду yum:

source: A persistent storage method supported by XenAPI, such as iSCSI or NFS.
ru: Метод создания постоянного хранилища, поддерживаемый XenAPI. Например, iSCSI или NFS.
vi_vn: Một phương thức lưu trữ liên tục được hỗ trợ bởi XenAPI như iSCSI hoặc NFS.

source: A person who plans, designs, and oversees the creation of clouds.
de: Eine Person, die die Erstellung von Clouds plant, entwirft und überwacht.
ru: Человек, который планирует, проектирует и контролирует создание облачных систем.
vi_vn: Người lên kế hoạch, thiết kế và giám sát quá trình hình thành các cloud.

source: A personality that a user assumes to perform a specific set of operations. A role includes a set of rights and privileges. A user assuming that role inherits those rights and privileges.
ru: Назначая пользователю роль, можно определить набор разрешенных ему действий, а также прав и привилегий.
vi_vn: Một cá tính mà người dùng đảm nhận khi thực hiện một nhóm các hoạt động cụ thể. Một vai trò bao gồm một tập hợp các quyền và đặc quyền. Một người dùng đảm đương một vai trò sẽ được thừa hưởng các quyền và đặc quyền của vai trò đó.

source: A physical computer, not a VM instance (node).
de: Ein physikalischer Computer, keine VM-Instanze (Knoten).
ru: Физический компьютер, а не виртуальная машина (узел).
vi_vn: Một máy tính vật lý, không phải là một máy ảo VM (node).

source: A physical or virtual device that provides connectivity to another device or medium.
de: Ein physisches oder virtuelles Gerät, das Konnektivität zu einem anderen Gerät oder Medium bietet.
ru: Физическое или виртуальное устройство, обеспечивающее соединение с другим устройством или средой.
vi_vn: Một thiết bị ảo hoặc vật lý cung cấp kết nối đến một thiết bị hoặc phương tiện trung gian khác.

source: A physical or virtual network device that passes network traffic between different networks.
ru: Физическое или виртуальное сетевое устройство, которое передает сетевой трафик между различными сетями.
vi_vn: Một thiết bị mạng vật lý hoặc ảo có nhiệm vụ truyền dữ liệu giữa các hệ thống mạng khác nhau.

source: A piece of software that makes available another piece of software over a network.
de: Ein Stück Software, die ein weiteres Stück Software über ein Netzwerk zur Verfügung stellt.
ru: Часть программного обеспечения, открывающая сетевой доступ к другой его части.
vi_vn: Một bộ phận phần mềm tạo ra sự sẵn có cho một bộ phận phần mềm khác thông qua một mạng lưới.

source: A platform that provides a suite of desktop environments that users access to receive a desktop experience from any location. This may provide general use, development, or even homogeneous testing environments.
de: Eine Plattform, die eine Reihe von Desktop-Umgebungen bietet, die den Zugriff auf eine Desktop von jedem Ort aus ermöglichen. Dies kann eine allgemeine Zweck dienen, Entwicklungs- oder sogar homogene Testumgebung sein.
ru: Платформа, которая предоставляет набор сред, с помощью которых пользователи могут использовать рабочие столы из любого места. К ним относятся среды общего использования, разработки и даже однородные среды тестирования.
vi_vn: Nền tảng cung cấp một tập hợp môi trường của các desktops mà trong đó người dùng truy cập để thưởng thức trải nghiệm desktops ở bất cứ đâu . Điều này có thể cung cấp cách thức sử dụng chung, phát triển, hoặc thậm chí môi trường thử nghiệm đồng nhất.

source: A plug-in for the OpenStack dashboard (horizon).
ru: Модуль для панели управления OpenStack (Horizon).

source: A point-in-time copy of an OpenStack storage volume or image. Use storage volume snapshots to back up volumes. Use image snapshots to back up data, or as "gold" images for additional servers.
ru: Копия тома или образа хранилища OpenStack на определенный момент времени. Снимки томов хранилищ используются в целях резервного копирования. Снимки образов используются для резервного копирования данных или в качестве золотых образов для дополнительных серверов.
vi_vn: Bản sao lưu một thời điểm nhất định của một ổ lưu trữ hoặc image của OpenStack. Sử dụng các snapshot ổ lưu trữ để sao lưu các ổ lưu trư. Sử dụng các snapshot image để sao lưu dữ liệu hoặc sao lưu thành các "gold" images cho các server thêm vào sau này.

source: A pre-made VM image that serves as a cloudpipe server. Essentially, OpenVPN running on Linux.
de: Ein vorgefertigtes VM-Abbild, das als Cloudpipe-Server dient. Grundsätzlich ist es OpenVPN unter Linux.
ru: Готовый образ виртуальной машины, который работает как сервер CloudPipe. По сути OpenVPN, работающий на Linux.
vi_vn: Một image máy ảo được tạo sẵn đóng vai trò là một cloudpipe server. Chủ yếu là OpenVPN chạy trên Linux.

source: A process that is created when a RPC call is executed; used to push the message to the topic exchange.
ru: Процесс, создаваемый при выполнении вызова RPC. Используется для отправки сообщения в обмен по теме.
vi_vn: Một tiến trình được tạo ra khi một thủ tục gọi RPC được thực thi, được sử dụng để đưa các thông điệp tới các nhóm trao đổi

source: A process that runs in the background and waits for requests. May or may not listen on a TCP or UDP port. Do not confuse with a worker.
de: Ein im Hintergrund laufender Prozess, der auf Anfragen wartet. Kann auf TCP oder UDP Ports hören. Nicht mit einem Worker zu verwechseln.
ru: Процесс, который выполняется в фоновом режиме и ожидает запросы. Может прослушивать порты TCP или UDP. Не путайте с вычислительным рабочим процессом.
vi_vn: Một quá trình chạy nền và chờ đợi các yêu cầu. Có thể lắng nghe hoặc không trên một port TCP hoặc UDP. Tránh nhầm lẫn với một worker.

source: A program that keeps the Image service VM image cache at or below its configured maximum size.
de: Ein Programm, das die Abbilder im VM-Abbild-Zwischenspeicher an oder unter der konfigurierten maximalen Größe hält.
ru: Программа, позволяющая устанавливать максимальный размер кэша для образа виртуальной машины в службе образов.
vi_vn: Một chương trình có tác dụng giữ bộ nhớ cache image máy ảo của Image service bằng hoặc thấp hơn kích thước tối đa được cấu hình của nó.

source: A programming language that is used to create systems that involve more than one computer by way of a network.
de: Eine Programmiersprache, die verwendet wird, um Systeme zu schaffen, die mehr als einen Computer über ein Netzwerk beinhalten.
ru: Язык программирования, используемый для создания систем из нескольких компьютеров, объединенных посредством сети.
vi_vn: Một loại ngôn ngữ lập trình được sử dụng để tạo ra các hệ thống, các hệ thống này bao gồm nhiều máy tính với hình thức của một mạng lưới

source: A project that is not officially endorsed by the OpenStack Foundation. If the project is successful enough, it might be elevated to an incubated project and then to a core project, or it might be merged with the main code trunk.
de: Ein Projekt, das nicht offiziell von der OpenStack Foundation unterstützt wird. Wenn das Projekt erfolgreich genug ist, kann es zu einem inkubierten Projekt und dann zu einem Kernprojekt erhöht werden, oder es kann mit dem Hauptcode-Trunk zusammengeführt werden.
ru: Проект, который не был официально утвержден OpenStack Foundation. Если проект достаточно успешен, ему могут присвоить статус инкубационного, а потом и официального. Кроме того, его могут объединить с основным стволом проекта.
vi_vn: Một dựa án không được chính thức xác nhận bởi OpenStack Foundation. Nếu dự án đạt được thành công nhất định, nó có thể được nâng cấp lên thành một dự án ủ và sau đó thành dự án chính, hoặc nó có thể sẽ được hợp nhất với phần code chính.

source: A project that ports the shell script-based project named DevStack to Python.
de: Ein Projekt, welches das Shell-Skript-basierende Projekt DevStack nach Python portiert.
ru: Проект, с помощью которого скрипты проекта DevStack транслируются на язык Python.
vi_vn: Một dự án có vai trò chuyển dự án nền tảng shell script có tên là DevStack sang Python.

source: A recommended architecture for an OpenStack cloud.
ru: Рекомендуемая архитектура для облака OpenStack.
vi_vn: Mô hình được khuyên dùng cho một OpenStack cloud.

source: A record that specifies information about a particular domain and belongs to the domain.
de: Ein Datensatz der Informationen zu einer bestimmten Domäne sowie Zugehörigkeiten zu der Domäne beinhaltet.
ru: Запись, принадлежащая определенному домену и содержащая сведения о нем.
vi_vn: Một bản ghi chỉ rõ thông tin về một miền đặc biệt và phụ thuộc vào miền đó.

source: A remote, mountable file system in the context of the :term:`Shared File Systems service<Shared File Systems service (manila)>`. You can mount a share to, and access a share from, several hosts by several users at a time.
ru: Удаленная монтируемая файловая система в контексте e :term:`службы общих файловых систем<Shared File Systems service (manila)>`. Общий ресурс можно монтировать на несколько хостов. Доступ к общему ресурсу могут получать одновременно несколько пользователей.

source: A routing algorithm in the Compute RabbitMQ.
de: Ein Routing-Algorithmus im Compute RabbitMQ.
ru: Алгоритм маршрутизации для вычислительных ресурсов Compute RabbitMQ.
vi_vn: Một thuật toán định tuyến trong Compute RabbitMQ.

source: A routing table that is created within the Compute RabbitMQ during RPC calls; one is created for each RPC call that is invoked.
de: Eine Routingtabelle, die in Compute RabbitMQ während RPC Aufrufen erstellt wird, eine für jeden RPC Aufruf.
ru: Таблица маршрутизации, которую создает RabbitMQ службы вычислительных ресурсов во время вызовов RPC, по одной на каждый вызов.
vi_vn: Bảng định tuyến được khởi tạo trong Compute RabbitMQ trong các cuộc gọi RPC; một bảng sẽ được tạo ra mỗi khi một cuộc gọi RPC được gọi đến.

source: A running VM, or a VM in a known state such as suspended, that can be used like a hardware server.
de: Eine laufende VM oder eine VM in einem bekannten Zustand wie suspendiert, die wie ein Hardware-Server verwendet werden kann.
ru: Запущенная или приостановленная виртуальная машина, которая может использоваться как сервер аппаратного обеспечения.
vi_vn: Một máy ảo (VM) đang chạy, hoặc một máy ảo đang trong một trạng thái như suspended, có thể được sử dụng như một server phần cứng.

source: A scheduling method used by Compute that randomly chooses an available host from the pool.
de: Eine Planungsmethode benutzt von Compute, die nach dem Zufallsprinzip einen verfügbaren Computer vom Bestand auswählt.
ru: Метод случайного выбора доступного хоста из пула, который использует служба вычислительных ресурсов.
vi_vn: Một phương pháp lập kế hoạch được sử dụng bởi Compute mà chọn ngẫu nhiên một host có sẵn từ các pool.

source: A scripting language that is used to build web pages.
de: Eine Skriptsprache zur Erstellung von Webseiten.
ru: Язык сценариев, используемый для создания веб-страниц.
vi_vn: Một ngôn ngữ kịch bản được dùng để xây dựng các trang web.

source: A security model that focuses on data confidentiality and controlled access to classified information. This model divides the entities into subjects and objects. The clearance of a subject is compared to the classification of the object to determine if the subject is authorized for the specific access mode. The clearance or classification scheme is expressed in terms of a lattice.
de: Ein Sicherheitsmodell, welches sich auf Datenvertraulichkeit und kontrollierten Zugriff für klassifizierte Informationen konzentriert. Dieses Modell unterscheidet die Entitäten in Subjekte und Objekte. Die Genehmigung eines Subjekts wird mit der Klassifizierung des Objekts verglichen um festzustellen, ob das Subjekt für das spezifische Zugriffsmodell berechtigt ist. Die Berechtigung oder das Klassifizierungsschema wird durch Bedingungen in Form eines Gitters dargestellt.
ru: Модель безопасности с акцентом на конфиденциальности данных и управлении доступом к закрытой информации. Эта модель подразделяет сущности на субъекты и объекты. Допуск к объекту сравнивается с его классификацией, чтобы определить, авторизован ли субъект для определенного режима доступа. Допуск или схема классификации выражается с помощью решетки.

source: A server daemon that serves the Nova Cert service for X509 certificates. Used to generate certificates for ``euca-bundle-image``. Only needed for the EC2 API.
de: Ein Server-Daemon, der dem Nova Cert-Dienst für X509-Zertifikate dient. Dient zum Generieren von Zertifikaten für ``euca-bundle-image``. Nur für die EC2-API erforderlich.
ru: Серверный демон, предоставляющий сертификаты X509 службе Nova Cert. Используется, чтобы создавать сертификаты для ``euca-bundle-image``. Необходим только для EC2 API.

source: A set of OpenStack resources created and managed by the Orchestration service according to a given template (either an AWS CloudFormation template or a Heat Orchestration Template (HOT)).
ru: Набор ресурсов OpenStack, создаваемых и управляемых службой оркестрации согласно заданного шаблона (шаблона AWS CloudFormation или шаблона оркестрации Heat).
vi_vn: Một bộ các tài nguyên OpenStack được khởi tạo và quản lý bởi dịch vụ Orchestration dựa theo một mẫu cho sẵn (hoặc là theo mẫu AWS CloudFormation hoặc Heat Orchestration Template (HOT)).

source: A set of network traffic filtering rules that are applied to a Compute instance.
ru: Набор правил фильтрации сетевого трафика, который применяется к инстансу службы Compute.
vi_vn: Một bộ các quy tắc lọc lưu lượng mạng được ứng dụng cho một máy ảo Compute.

source: A set of segment objects that Object Storage combines and sends to the client.
de: Ein Satz Segmentobjekte, die Objekt Storage kombiniert und zum Client sendet.
ru: Набор объектов сегментов, которые хранилище объектов объединяет и отправляет клиенту.
vi_vn: Tập các mảnh vật thể trong Object Storage được nhóm lại và gửi tới người dùng.

source: A snapshot is a point in time version of a volume. As an administrator, you can manage and unmanage snapshots.
de: Eine Schattenkopie ist eine zeitliche Version eines Datenträgers. Als Administrator können Sie Schattenkopie verwalten und nicht verwalten.
ru: Снимок — это версия тома на текущий момент времени. Администратор может управлять и прекращать управление снимками.

source: A special Object Storage object that contains the manifest for a large object.
de: Ein spezielles Objektspeicherobjekt, das das Manifest für ein großes Objekt enthält.
ru: Специальный объект объектного хранилища, который содержит манифест для большого объекта.
vi_vn: Một Object Storage object đặc biệt chứa bản kê của một object lớn.

source: A special type of VM image that is booted when an instance is placed into rescue mode. Allows an administrator to mount the file systems for an instance to correct the problem.
ru: Особый тип виртуальной машины, которая загружается, когда инстанс переходит в режим восстановления. Позволяет администратору монтировать файловые системы для инстанса с целью исправления проблемы.
vi_vn: Một dạng image máy ảo đặc biệt được khởi động lên khi một máy ảo được đặt vào trạng thái cần giải cứu. Cho phép quản trị viên mount các hệ thống file của một máy ảo để sửa chữa vấn đề.

source: A specification that, when implemented by a physical PCIe device, enables it to appear as multiple separate PCIe devices. This enables multiple virtualized guests to share direct access to the physical device, offering improved performance over an equivalent virtual device. Currently supported in OpenStack Havana and later releases.
ru: Спецификация, которая позволяет предоставить физическое устройство PCIe как несколько отдельных устройств PCIe. В результате гостевые виртуальные машины могут получить непосредственный совместный доступ к физическому устройству, что повышает производительность работы по сравнению с использованием виртуальных устройств. Поддерживается в OpenStack Havana и более поздних релизах.

source: A standalone service whose purpose is to receive requests, process data operations such as copying, share migration or backup, and send back a response after an operation has been completed.
de: Ein eigenständiger Dienst, dessen Zweck die Annahme von Anfragen, die Verarbeitung von Daten wie z.B. Kopieren, Sharemigration oder Datensicherung, sowie schließlich das Zurückschicken einer Antwort ist, wenn die Aktion abgeschlossen wurde.
ru: Автономная служба, которая получает запросы, обрабатывает операции с данными (например, копирование, общий доступ к миграции или резервное копирование) и отправляет ответ после завершения операции.

source: A standardized interface for managing compute, data, and network resources, currently unsupported in OpenStack.
ru: Стандартизированный интерфейс для управления данными, а также вычислительными и сетевыми ресурсами. В настоящий момент не поддерживается в OpenStack.
vi_vn: Một giao diện chuẩn hóa dùng để quản lý các tài nguyên tính toán, dữ liệu và mạng, hiện không được hỗ trợ trong OpenStack.

source: A string of text provided to the client after authentication. Must be provided by the user or process in subsequent requests to the API endpoint.
de: Eine Zeichenfolge, die dem Client nach der Authentifizierung zur Verfügung gestellt wird. Muss vom Benutzer oder Prozess in nachfolgenden Anfragen an den API-Endpunkt bereitgestellt werden.
ru: Текстовая строка, отображаемая для клиента после аутентификации. Должна предоставляться пользователю или процессу в последующих запросах точки входа API.
vi_vn: Một chuỗi văn bản được cung cấp đến client sau quá trình chứng thực. Người dùng hoặc quá trình phải cung cấp thẻ này trong các yêu cầu sau này đến API endpoint.

source: A subset of API calls that are accessible to authorized administrators and are generally not accessible to end users or the public Internet. They can exist as a separate service (keystone) or can be a subset of another API (nova).
de: Eine Teilmenge von API Aufrufen, die erreichbar sind für authorisierte Administratoren und nicht für Endbenutzer oder im öffentlichen Internet. Sie können als ein separater Dienst (Keystone) vorhanden sein oder sie sind eine Teilmenge einer anderen API (nova).
ru: Подмножество вызовов API, доступных для авторизованных администраторов и в общем случае недоступных для конечных пользователей или общего доступа через Интернет. Могут существовать как отдельная служба (Keystone) или в виде подмножества другого API (Nova).
vi_vn: Một tập hợp con của các cuộc gọi API có thể truy cập được bởi các quản trị viên được ủy quyền và thường không thể truy cập tới bởi các người dùng cuối hoặc hệ thống Internet công cộng. Chúng có thể tồn tại như là một dịch vụ riêng rẽ (keystone) hoặc có thể là tập con của một API khác (nova).
