Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: For SUSE Linux Enterprise Server, use ``zypper`` to install the clients from the distribution packages in the Open Build Service. First, add the Open Build Service repository:
ru: В SUSE Linux Enterprise Server используйте``zypper`` для установки клиентов из пакетов распространения в службе Open Build. Сначала добавьте репозиторий службы Open Build Service:

source: For Ubuntu or Debian, use ``apt-get`` to install the clients from the packaged versions:
de: Für Ubuntu oder Debian verwenden Sie ``apt-get``, um die Clients aus den gepackten Versionen zu installieren:
ru: В системах Ubuntu и Debian используйте команду ``apt-get``, чтобы установить клиенты из упакованных версий:

source: For bulk import of data to the cloud, the data ingress system creates a new Block Storage volume, copies data from the physical device, and transfers device ownership to the end user.
de: Für den Bulk-Import von Daten in die Cloud erstellt das Dateneingangssystem einen neuen Blockspeicherdatenträger, kopiert Daten vom physischen Gerät und überträgt die Geräteeigentümer an den Endbenutzer.
ru: Для массового импорта данных в облако система обработки входящих данных создает том хранилища блоков, копирует данные с физического устройства и переносит права на владение устройством конечному пользователю.

source: For communication between the processes of one service, an AMQP message broker is used. The service's state is stored in a database. When deploying and configuring your OpenStack cloud, you can choose among several message broker and database solutions, such as RabbitMQ, MySQL, MariaDB, and SQLite.
de: Für die Kommunikation zwischen den Prozessen eines Dienstes wird ein AMQP Message Broker verwendet. Der Zustand des Dienstes wird in einer Datenbank gespeichert. Bei der Bereitstellung und Konfiguration Ihrer OpenStack Cloud können Sie zwischen mehreren Message Brokern und Datenbanklösungen wie RabbitMQ, MySQL, MariaDB und SQLite wählen.
ru: Для взаимодействия между процессами одной службы используется брокер сообщений AMQP. Состояние службы хранится в базе данных. При развертывании и настройке облака OpenStack можно выбрать одну из нескольких комбинаций брокера сообщений и базы данных (RabbitMQ, MySQL, MariaDB и SQLite).

source: For details about image creation, see the `Virtual Machine Image Guide <http://docs.openstack.org/image-guide/>`__.
ru: Подробнее о создании образов см. `Руководство по образам виртуальных машин <http://docs.openstack.org/image-guide/>`__.

source: For example, copy the file to the computer from which you want to upload an image with a ``glance`` client command.
de: Kopieren Sie beispielsweise die Datei auf den Computer, von dem Sie ein Abbild mit einem ``glance`` Client-Befehl hochladen möchten.
ru: Например, скопируйте файл на компьютер, с которого необходимо передать образ с помощью команды клиента ``glance``.

source: For example, to see the version number for the ``openstack`` client, run the following command:
de: Als Beispiel, für die Versionsnummer des ``openstack``Clients verwenden Sie das folgende Kommando:
ru: К примеру, чтобы узнать версию клиента ``openstack``, выполните следующую команду:

source: For example, using the image ID shown above, you would issue the command as follows:
de: Wenn Sie beispielsweise die oben gezeigte Abbild-ID verwenden, geben Sie den Befehl wie folgt aus:
ru: Например, для указанного выше ID образа, команда будет выглядеть следующим образом:

source: For example, when you specify your password using the command-line client with the :option:`--os-password` argument, anyone with access to your computer can view it in plain text with the ``ps`` field.
ru: Например, если указать пароль с помощью клиента командной строки, в котором указан аргумент :option:`--os-password`, любой пользователь, который имеет доступ к компьютеру, может увидеть этот пароль в виде обычного текста в поле ``ps``.

source: For example:
de: Zum Beispiel:
ru: Например:

source: For more information, see `OpenStack Configuration Reference <http://docs.openstack.org/newton/config-reference/shared-file-systems/overview.html>`__.
ru: Подробнее см. `Руководство по настройке OpenStack <http://docs.openstack.org/newton/config-reference/shared-file-systems/overview.html>`__.

source: For more sophisticated monitoring, see the `ceilometer <https://launchpad.net/ceilometer>`__ project. You can also use tools, such as `Ganglia <http://ganglia.info/>`__ or `Graphite <http://graphite.wikidot.com/>`__, to gather more detailed data.
ru: Для более интеллектуального мониторинга см. проект `Ceilometer <https://launchpad.net/ceilometer>`. Чтобы получить развернутые данные, также можно использовать специальные инструменты наподобие `Ganglia <http://ganglia.info/>`или `Graphite <http://graphite.wikidot.com/>`.

source: For openSUSE, use ``zypper`` to install the clients from the distribution packages service:
de: Für openSUSE verwenden Sie ``zypper``, um die Clients aus dem Distributionspaketdienst zu installieren:
ru: В системах openSUSE используйте диспетчер пакетов ``zypper``, чтобы установить клиенты из службы пакетов распространения:

source: For the available OpenStack documentation, see `docs.openstack.org <http://docs.openstack.org>`__.
ru: Документация OpenStack доступна по ссылке `docs.openstack.org <http://docs.openstack.org>`__.

source: Free up space in a thinly-provisioned back end.
de: Freier Speicher in einem spärlich ausgestattetem Backend.
ru: Освобождение пространства на серверах тонких клиентов.

source: From a network architecture point of view, this service must be accessible to customers and the public API for each OpenStack service. To use the administrator functionality for other services, it must also connect to Admin API endpoints, which should not be accessible by customers.
de: Aus Sicht der Netzwerkarchitektur muss dieser Dienst für Kunden und die öffentliche API für jeden OpenStack-Dienst zugänglich sein. Um die Administratorfunktionalität für andere Dienste zu verwenden, muss sie auch eine Verbindung zu Admin-API-Endpunkten herstellen, auf die Kunden nicht zugreifen dürfen.
ru: С точки зрения сетевой архитектуры, для клиентов должны быть доступны эта служба и публичный API для каждой службы OpenStack. Использование функций администратора для других служб также требует соединения с административными точками доступа API, которые должны быть доступны для клиентов.

source: Gathers statistics, lists items, updates metadata, and uploads, downloads, and deletes files stored by the Object Storage service. Gains access to an Object Storage installation for ad hoc processing.
de: Sammelt Statistiken, Listenelemente, Aktualisierungsmetadaten und Uploads, Downloads und Löschung von Dateien, die vom Objektspeicherdienst gespeichert werden. Zugriff auf eine Objektspeicherinstallation für die Ad-hoc-Verarbeitung.
ru: Собирает статистику, отображает списки элементов, обновляет метаданные, а также загружает, передает и удаляет файлы, сохраненные службой хранилища объектов для их динамической обработки.

source: Generally, extra properties on an Image service image to which only cloud administrators have access. Limits which user roles can perform CRUD operations on that property. The cloud administrator can configure any image property as protected.
ru: В общем случае это дополнительные свойства образа службы Image, доступ к которым имеет только администратор облака. Ограничивает набор ролей пользователей, которым разрешается выполнять операции CRUD с этим свойством. Администратор облака может настроить любое свойство образа как защищенное.
vi_vn: Nói chung, tính thêm vào một ảnh dịch vụ Image mà chỉ có quản trị viên cloud mới có thể truy cập. Giới hạn đó vai trò người dùng có thể thực hiện các thao tác CRUD trên đó. Các quản trị viên cloud có thể cấu hình bất kỳ image nào như để bảo vệ.

source: Get CPU, memory, I/O, and network statistics for an instance.
de: CPU, Speicher, I/O und Netzwerk-Statistiken für eine Instanz abrufen.
ru: Получить для инстанса статистику использования ЦП, памяти, ввода-вывода и обмена данными по сети.

source: Get a summary of resource usage of all of the instances running on the host:
ru: Позволяет получить сводку по использованию ресурсов всеми инстансами, выполняющимися на хосте:

source: Get diagnostic statistics:
de: Diagnosestatistiken abrufen:
ru: Получить статистику диагностики:

source: Get started with OpenStack
de: Erste Schritte mit OpenStack
ru: Знакомство с OpenStack

source: Get summary statistics for each tenant:
ru: Получить сводную статистику для каждого тенанта:

source: Give a clear, concise summary.
de: Liefern Sie eine klare und prägnante Zusammenfassung.
ru: Предоставьте ясную и краткую сводку.

source: Gives guest VMs exclusive access to a PCI device. Currently supported in OpenStack Havana and later releases.
ru: Предоставляет гостевым ВМ эксклюзивный доступ к устройству PCI. В настоящий момент поддерживается в OpenStack Havana и более поздних релизах.
vi_vn: Trao quyền truy cập độc quyền cho các máy ảo khách đến một thiết bị PCI. Hiện được hỗ trợ từ bản OpenStack Havana trở đi.

source: Glossary
de: Glossar
ru: Глоссарий
vi_vn: Danh mục thuật ngữ

source: Governance service
ru: служба управления (Governance)

source: Governs the ability of subjects to access objects, while enabling users to make policy decisions and assign security attributes. The traditional UNIX system of users, groups, and read-write-execute permissions is an example of DAC.
de: Gibt die Fähigkeit von Subjekten, auf Objekte zuzugreifen, während es Benutzern ermöglicht, Entscheidungsrichtlinien zu treffen und Sicherheitsattribute zuzuweisen. Das traditionelle UNIX-System von Benutzern, Gruppen und Read-Write-Execute-Berechtigungen ist ein Beispiel für DAC.
ru: Управляет доступом субъектов к объектам, разрешает пользователям принимать решения по политикам и назначать атрибуты безопасности. Примеры DAC: традиционные UNIX-системы пользователей, групп, а также разрешения на чтение, запись и выполнение.

source: Graphic Interchange Format (GIF)
ru: Формат обмена графическими данными (GIF)

source: Graphics Processing Unit (GPU)
ru: Графический процессор (GPU)
vi_vn: Đơn vị Xử lý Đồ họa (GPU)

source: Green Threads
ru: Зеленые потоки

source: Group
de: Gruppe
ru: Группа

source: Hadoop Distributed File System (HDFS)
ru: Распределенная файловая система Hadoop (HDFS)

source: Handles authentication and is usually OpenStack Identity.
de: Behandelt Authentifizierung und ist in der Regel OpenStack Identity.
ru: Выполняет аутентификацию (как правило, служба идентификации OpenStack).

source: Hash of image data to use for verification.
ru: Хэш образа, используемый для верификации.

source: Heat Orchestration Template (HOT)
ru: Шаблон оркестрации Heat (HOT)

source: Heat input in the format native to OpenStack.
de: Heat-Eingabe im Format nativ zu OpenStack.
ru: Входные данные Heat в собственном формате OpenStack.
vi_vn: Đầu vào nhiệt trong định dạng gốc đối với OpenStack.

source: Helpful information that prevents the user from making mistakes.
de: Hilfreiche Informationen, die den Benutzer davor bewahren, Fehler zu machen.
ru: Полезная информация, которая помогает избегать ошибок.

source: High-availability mode for legacy (nova) networking. Each compute node handles NAT and DHCP and acts as a gateway for all of the VMs on it. A networking failure on one compute node doesn't affect VMs on other compute nodes.
de: Hochverfügbarkeitsmodus für Legacy (nova) Vernetzung. Jeder Compute-Knoten behandelt NAT und DHCP und fungiert als Gateway für alle VMs darauf. Ein Netzwerkfehler auf einem Rechenknoten wirkt sich nicht auf VMs auf anderen Compute-Knoten aus.
ru: Режим высокой доступности для устаревшей службы управления сетью (Nova). Каждый вычислительный узел управляет NAT и DHCP и работает как шлюз для всех выполняющихся на нем ВМ. Сбой в работе сети на одном из вычислительных узлов не влияет на виртуальные машины на других вычислительных узлах.
vi_vn: Chế độ sẵn sàng cao cho hệ thống mạng legacy (nova). Mỗi node compute xử lý dịch vụ NAT và DHCP và hoạt động như một gateway cho tất cả các máy ảo trên nó. Một hư hỏng về man trên một node compute sẽ không ảnh hưởng đến các máy ảo trên các node compute khác.

source: High-performance 64-bit file system created by Silicon Graphics. Excels in parallel I/O operations and data consistency.
de: Hochperformantes 64-Bit Dateisystem von Silicon Graphics. Zeichnet sich bei parallelen I/O Operationen und Datenkonsistenz aus.
ru: Высокопроизводительная 64-разрядная файловая система, созданная Silicon Graphics. Предназначена для выполнения параллельных операций ввода-вывода и обеспечения согласованности данных.
vi_vn: Các hệ thống dữ liệu hiệu suất cao 64-bit được tạo bởi Silicon Graphics. Vượt trội hơn về sự vận hành song song dữ liệu vào/ra và tính nhất quán của dữ liệu.

source: Host Bus Adapter (HBA)
ru: хост-адаптер шины (HBA)

source: Hypertext Transfer Protocol (HTTP)
ru: Протокол передачи гипертекста (HTTP)
vi_vn: Giao tiếp truyền tải siêu văn bản (HTTP)

source: Hypertext Transfer Protocol Secure (HTTPS)
ru: Протокол защищенной передачи гипертекста (HTTPS)
vi_vn: Giao thức truyền tải siêu văn bản bảo mật (HTTPS)

source: ID number
de: ID Nummer
ru: числовой ID
vi_vn: số ID

source: INI format
ru: формат INI

source: IOPS are a common performance measurement used to benchmark computer storage devices like hard disk drives, solid state drives, and storage area networks.
de: IOPS sind eine gemeinsame Leistungsmessung, die zum Benchmark von Computer-Speichergeräten wie Festplattenlaufwerken, Festplattenlaufwerken und Speicherbereichsnetzwerken verwendet wird.
ru: IOPS — это общее измерение производительности, используемое для запоминающих устройств компьютера, таких как жесткие диски, твердотельные накопители и сети хранения данных.

source: IP Address Management (IPAM)
de: IP-Adressenverwaltung (IPAM)
ru: Управление IP-адресами (IPAM)
vi_vn: Quản lý địa chỉ IP (IPAM)

source: IP address
de: IP-Adresse
ru: IP-адрес
vi_vn: địa chỉ IP

source: IPMI is a standardized computer system interface used by system administrators for out-of-band management of computer systems and monitoring of their operation. In layman's terms, it is a way to manage a computer using a direct network connection, whether it is turned on or not; connecting to the hardware rather than an operating system or login shell.
de: IPMI ist eine standardisierte Rechnersystemschnittstelle, die von Systemadministratoren für die Out-of-Band-Verwaltung von Computersystemen und deren Überwachung verwendet wird. In einfachen Worten, ist es ein Weg, um einen Computer mit einer direkten Netzwerkverbindung zu verwalten, ob er eingeschaltet ist oder nicht; Herstellen einer Verbindung zur Hardware anstelle eines Betriebssystems oder Login-Shell.
ru: IPMI — это стандартизованный интерфейс компьютерных систем, используемый системным администратором, чтобы удаленно управлять компьютерными системами и отслеживать их работу. Проще говоря, это способ управления компьютером при помощи непосредственного сетевого соединения (активного или неактивного), с оборудованием, а не с операционной системой или исходным командным процессором.

source: IQN is the format most commonly used for iSCSI names, which uniquely identify nodes in an iSCSI network. All IQNs follow the pattern iqn.yyyy-mm.domain:identifier, where 'yyyy-mm' is the year and month in which the domain was registered, 'domain' is the reversed domain name of the issuing organization, and 'identifier' is an optional string which makes each IQN under the same domain unique. For example, 'iqn.2015-10.org.openstack.408ae959bce1'.
de: IQN ist das Format, das am häufigsten für iSCSI-Namen verwendet wird, die die Knoten in einem iSCSI-Netzwerk eindeutig identifizieren. Alle IQNs folgen dem Muster iqn.yyyy-mm.domain: identifier, wobei 'yyyy-mm' das Jahr und den Monat ist, in dem die Domain registriert wurde, 'domain' ist der umgekehrte Domainname der ausstellenden Organisation und 'identifier' Ist eine optionale Zeichenfolge, die jeden IQN unter derselben Domain eindeutig macht. Zum Beispiel, 'iqn.2015-10.org.openstack.408ae959bce1'.
ru: IQN — это формат, наиболее часто используемый для имен iSCSI, однозначно определяющий имена в сети iSCSI. Все IQN построены по шаблону iqn.гггг-мм.домен:идентификатор, где 'гггг-мм' — это год и месяц регистрации домена, 'домен' — имя домена оформляющей организации в обратном порядке, а 'идентификатор' является необязательной строкой, делающей каждое имя IQN уникальным в рамках того же домена. Например, 'iqn.2015-10.org.openstack.408ae959bce1'.

source: IaaS is a provisioning model in which an organization outsources physical components of a data center, such as storage, hardware, servers, and networking components. A service provider owns the equipment and is responsible for housing, operating and maintaining it. The client typically pays on a per-use basis. IaaS is a model for providing cloud services.
de: IaaS ist ein Bereitstellungsmodell, in dem eine Organisation physikalische Komponenten eines Rechenzentrums wie Speicher, Hardware, Server und Netzwerkkomponenten auslagert. Ein Dienstleister besitzt die Ausrüstung und ist verantwortlich für Wohnraum, Betrieb und Wartung. Der Kunde zahlt in der Regel eine Nutzungsdauer. IaaS ist ein Modell für die Bereitstellung von Cloud-Services.
ru: IaaS — модель предоставления ресурсов, когда организация использует аутсорсинг физических компонентов ЦОД, например хранилища, аппаратных средств, серверов и сетевых компонентов. Провайдер услуги владеет оборудованием и отвечает за его размещение, работу и обслуживание. Обычно клиент оплачивает использованные ресурсы. IaaS — модель предоставления облачных услуг.

source: Identity API
de: Identität API
ru: API Identity

source: Identity back end
de: Identitäts-Backend
ru: серверная часть службы идентификации

source: Identity service (keystone)
de: Identitätsdienst (keystone)
ru: Служба идентификации (Keystone)

source: Identity service API
de: Identitätsdienst API
ru: API службы идентификации
vi_vn: API của dịch vụ Identity

source: Identity service overview
de: Übersicht Identitätsdienst
ru: Обзор службы идентификации

source: If Object Storage finds objects, containers, or accounts that are corrupt, they are placed in this state, are not replicated, cannot be read by clients, and a correct copy is re-replicated.
ru: Когда служба объектного хранилища находит поврежденные объекты, контейнеры или учетные записи, то для таких объектов назначается состояние "карантин", в котором они не реплицируются и не могут быть прочитаны клиентами. Вместо поврежденного объекта реплицируется его корректная копия.
vi_vn: Nếu Object Storage tìm thấy các object, container hoặc các tài khoản đã bị hư hỏng, chúng sẽ được đặt vào trạng thái này, không thể được sao chép, không thể đọc được bởi các client và một bản sao chính xác sẽ được tái tái tạo lại.

source: If a requested resource such as CPU time, disk storage, or memory is not available in the parent cell, the request is forwarded to its associated child cells. If the child cell can fulfill the request, it does. Otherwise, it attempts to pass the request to any of its children.
de: Wenn eine angeforderte Ressource wie CPU-Zeit, Festplattenspeicher oder Speicher nicht in der übergeordneten Zelle verfügbar ist, wird die Anforderung an ihre zugeordneten untergeordneten Zellen weitergeleitet. Wenn die untergeordnete Zelle die Anforderung erfüllen kann, tut sie es. Andernfalls versucht es, die Anforderung an eines seiner Kinder weiterzugeben.
ru: Если запрошенный ресурс, например время ЦП, пространство жесткого диска или память, недоступен в родительской ячейке, запрос перенаправляется в эту связанную дочернюю ячейку. По возможности дочерняя ячейка удовлетворяет запрос. В противном случае она пытается передать запрос в любую из своих дочерних ячеек.
vi_vn: Nếu một yêu cầu tài nguyên như CPU time, ổ đĩa lưu trữ, hoặc bộ nhớ không có sẵn trong các parent cells, yêu cầu được chuyển tiếp đến các child cells có liên quan của nó. Các child cells sẽ đáp ứng các yêu cầu đó, nếu nó có thể. Nếu không, nó sẽ cố gắng để truyền các yêu cầu này đến bất cứ một child cells khác.

source: If a requested resource, such as CPU time, disk storage, or memory, is not available in the parent cell, the request is forwarded to associated child cells.
ru: Если запрошенный ресурс, например время ЦП, пространство жесткого диска или память, недоступен в родительской ячейке, запрос перенаправляется в связанные дочерние ячейки.
vi_vn: Nếu một tài nguyên được yêu cầu như thời gian CPU, ổ đĩa lưu trữ hoặc bộ nhớ không có trên cell mẹ, yêu cầu sẽ được chuyển tiếp đến các cell con có liên quan.

source: If above parameters are not set, Cinder uses default_volume_type which is defined in cinder.conf during volume creation.
de: Wenn obere Parameter nicht gesetzt sind, verwendet Cinder den default_volume_type, der in der cinder.conf bei der Datenträgererstellung definiert ist.
ru: Если указанные выше параметры не заданы, при создании тома Cinder использует значение default_volume_type, которое определено в файле cinder.conf.

source: If glance image has ``cinder_img_volume_type`` property, Cinder uses this parameter to specify ``volume type`` when creating a volume.
de: Wenn das Glance-Abbild die Eigenschaft `` cinder_img_volume_type`` hat, verwendet Cinder diesen Parameter, um `` volume type`` beim Erstellen eines Datenträgers festzulegen.
ru: Если для образа Glance задано свойство ``cinder_img_volume_type``, Cinder использует значение этого параметра, чтобы задать ``volume type`` при создании тома.

source: If the guest operating system is not in the database, or if the use of ``libosinfo`` is disabled, the default system values are used.
de: Wenn das Gastbetriebssystem nicht in der Datenbank vorhanden ist oder die Verwendung von ``libosinfo` deaktiviert ist, werden die Standard-Systemwerte verwendet.
ru: Если в базе данных нет сведений о гостевой операционной системе или использование базы данных ``libosinfo`` заблокировано, используются значения для системы по умолчанию.

source: If the volume has snapshots, the specified host destination cannot accept the volume. If the user is not an administrator, the migration fails.
de: Wenn der Datenträger Schattenkopien hat, kann das angegebene Host-Ziel den Datenträger nicht akzeptieren. Wenn der Benutzer kein Administrator ist, schlägt die Migration fehl.
ru: Если для тома созданы снимки, он не будет принят на указанном хосте назначения. Если пользователь не является администратором, миграция завершится ошибкой.

source: If you do not have a sufficient quota for the transfer, the transfer is refused.
de: Wenn Sie nicht über ein ausreichendes Kontingent für die Übertragung verfügen, wird die Übertragung abgelehnt.
ru: Если вашей квоты недостаточно для приема переноса, он отклоняется.

source: If you encounter problems in creating an image in the Image service or Compute, the following information may help you troubleshoot the creation process.
de: Wenn Sie beim Erstellen eines Abbildes im Abbild-Dienst oder bei Compute Probleme haben, können die folgenden Informationen Ihnen helfen, den Erstellungsprozess zu reparieren.
ru: Если при создании образа возникают проблемы в работе службы образов или службы вычислительных ресурсов, их можно устранить с помощью следующей информации.
