Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: A collection of files for a specific operating system (OS) that you use to create or rebuild a server. OpenStack provides pre-built images. You can also create custom images, or snapshots, from servers that you have launched. Custom images can be used for data backups or as "gold" images for additional servers.
de: Eine Sammlung von Dateien für ein bestimmtes Betriebssystem (OS), die Sie zum Erstellen oder Wiederherstellen eines Servers verwenden. OpenStack bietet vorgefertigte Abbilder. Sie können auch benutzerdefinierte Abbilder oder Schattenkopien von Servern erstellen, die Sie gestartet haben. Benutzerdefinierte Abilder können für Datensicherungen oder als "Gold"-Abbilder für zusätzliche Server verwendet werden.
ru: Набор файлов для определенной операционной системы (ОС), используемый для создания или восстановления сервера. OpenStack предоставляет готовые образы. Можно также создавать пользовательские образы или снимки запущенных серверов. Пользовательские образы можно использовать для резервного копирования данных или в качестве золотых образов для дополнительных серверов.
vi_vn: Một tập hợp các tập tin cho một hệ điều hành (OS) cụ thể mà bạn sẽ sử dụng để khởi tạo hoặc xây dựng lại một server. OpenStack cung cấp các image được xây dựng sẵn. Bạn cũng có thể tạo ra các image tùy chọn hoặc các snapshot từ các server mà bạn đã khởi tạo. Các image tùy chọn có thể được sử dụng để sao lưu dữ liệu hoặc được sử dụng như các "gold" image cho các server sau này.

source: A collection of hypervisors grouped together through host aggregates.
de: Eine Sammlung von Hypervisoren, die durch Host-Aggregate zusammengefasst sind.
ru: Собрание гипервизоров, сгруппированное по агрегатам хостов.
vi_vn: Một tập hợp các hypervisors nhóm lại với nhạu thông qua một khối host

source: A collection of servers that can share IPs with other members of the group. Any server in a group can share one or more public IPs with any other server in the group. With the exception of the first server in a shared IP group, servers must be launched into shared IP groups. A server may be a member of only one shared IP group.
ru: Набор серверов, которые могут использовать один или более общедоступных IP-адресов совместно с другими серверами группы. За исключением первого сервера в общей IP-группе, серверы должны запускаться в общих IP-группах. Сервер может входить только в одну общую IP-группу.
vi_vn: Một tập hợp các server có thể chia sẻ IP với các thành viên khác trong nhóm. Bất kì server nào trong nhóm cũng có thể chia sẻ một hoặc nhiều public IP với bất kì server nào khác trong nhóm. Chỉ trừ server đầu tiên trong một nhóm IP chia sẻ, các server còn lại đều phải được khởi tạo vào trong các nhóm IP chia sẻ. Một server chỉ có thể là thành viên của một nhóm IP chia sẻ.

source: A collection of specifications used to access a service, application, or program. Includes service calls, required parameters for each call, and the expected return values.
de: Eine Sammlung von Spezifikationen, die für den Zugriff auf einen Dienst, eine Anwendung oder ein Programm verwendet werden. Enthält Diensteaufrufe, erforderliche Parameter für jeden Anruf und die erwarteten Rückgabewerte.
ru: Набор спецификаций, который помогает получить доступ к службе, приложению или программе. Включает вызовы служб, необходимые параметры для каждого вызова и ожидаемые возвращаемые значения.
vi_vn: Một tập hợp các thông số kỹ thuật được sử dụng để truy cập vào một dịch vụ, ứng dụng, hoặc chương trình; bao gồm các cuộc gọi dịch vụ, các thông số được yêu cầu cho mỗi cuộc gọi và các giá trị trả về mong đợi.

source: A collector (``ceilometer-collector``)
de: Ein Sammler (``ceilometer-collector``)
ru: Сборщик (``ceilometer-collector``)

source: A comment with additional information that explains a part of the text.
de: Ein Kommentar mit zusätzlichen Informationen, der einen Teil des Textes erläutert.
ru: Комментарий с дополнительной информацией, поясняющей часть текста.

source: A common API for vendors, admins, services, and users to meaningfully define their own custom metadata. This metadata can be used on different types of resources like images, artifacts, volumes, flavors, and aggregates. A definition includes the new property's key, description, constraints, and the resource types which it can be associated with.
de: Eine gemeinsame API für Anbieter, Admins, Dienste und Benutzer, die ihre eigenen benutzerdefinierten Metadaten sinnvoll definieren. Diese Metadaten können für verschiedene Arten von Ressourcen wie Bilder, Artefakte, Volumes, Aromen und Aggregate verwendet werden. Eine Definition enthält den Schlüssel, die Beschreibung, die Beschränkungen der neuen Eigenschaft und die Ressourcentypen, mit denen sie verknüpft werden können.
ru: Общий API для поставщиков, администраторов, служб и пользователей, который помогает точно настраивать их собственные метаданные. Эти метаданные можно использовать на различных ресурсах, например образах, артефактах, томах, версиях и агрегатах. Определение включает в себя новый ключ свойств, описание, ограничения, а также типы ресурсов, которые можно привязать.

source: A community project may be elevated to this status and is then promoted to a core project.
de: Ein Gemeinschaftsprojekt kann in diesen Status erhöht werden und wird dann zu einem Kernprojekt befördert.
ru: Промежуточный статус проекта между проектом сообщества и официальным проектом.
vi_vn: Một dự án cộng đồng có thể được nâng cấp lên trạng thái này và sau đó sẽ được thằng cấp lên thành một dự án chính.

source: A compute agent (``ceilometer-agent-compute``)
de: Ein Compute Agent (``ceilometer-agent-compute``)
ru: Агент для вычислений (``ceilometer-agent-compute``)

source: A compute service that creates VPNs on a per-project basis.
de: Ein Compute Dienst, der VPNs auf per-Projekt-Basis erstellt.
ru: Служба вычислений, позволяющая создавать сети VPN для отдельных проектов.
vi_vn: Một dịch vụ tính toán có tác dụng khởi tạo các VPN trên từng project.

source: A configurable option within Object Storage to automatically delete objects after a specified amount of time has passed or a certain date is reached.
ru: Настраиваемый параметр объектного хранилища, позволяющий автоматически удалять объекты через заданный промежуток времени или по наступлению определенной даты.
vi_vn: Tùy chọn cấu hình bên trong Object Storage để tự động xóa các đối tượng sau một khoảng thời gian cụ thể hoặc đến một thời điểm cụ thể.

source: A content delivery network is a specialized network that is used to distribute content to clients, typically located close to the client for increased performance.
de: Ein Content Delivery Network ist ein spezialisiertes Netzwerk, das verwendet wird, um Inhalte an Clients zu verteilen, die typischerweise in der Nähe des Kunden für eine erhöhte Leistung liegen.
ru: Сеть доставки содержимого — это специальная сеть, по которой содержимое доставляется клиентам. Обычно ее размещают рядом с клиентом, чтобы повысить производительность.
vi_vn: Mạng phân phối nội dung là một mạng đặc biệt được sử dụng để phân phối nội dung đến người dùng, thường được đặt gần phía người dùng để tăng hiệu suất.

source: A controlled reboot where a VM instance is properly restarted through operating system commands.
ru: Управляемая перезагрузка, когда инстанс ВМ перезапускается по всем правилам с помощью команд операционной системы.
vi_vn: Một quá trình khởi động lại được kiểm soát khi mà mọt máy ảo được khởi động lại đúng cách thông qua các câu lệnh hệ thống.

source: A daemon that listens to a queue and carries out tasks in response to messages. For example, the cinder-volume worker manages volume creation and deletion on storage arrays.
de: Ein Dämon, der auf eine Warteschlange hört und Aufgaben als Antwort auf Nachrichten ausführt. Zum Beispiel verwaltet der Cinder-Volume-Worker die Erstellung und Löschung von Speicher auf Speicher-Arrays.
ru: Демон слушает очередь и выполняет задачи в соответствии с сообщениями. Например, рабочий модуль cinder-volume управляет созданием и удалением дисков в массивах хранилищ.

source: A database engine supported by the Database service.
de: Eine vom Datenbankdienst unterstützte Datenbank-Engine.
ru: Ядро СУБД, поддерживаемое службой баз данных.

source: A default role in the Compute RBAC system that can quarantine an instance in any project.
de: Eine Standardrolle im Compute-RBAC-System, die eine Instanz in jedem Projekt quarantieren kann.
ru: Роль по умолчанию в системе Compute с управлением доступом на основе ролей (RBAC), с помощью которой можно поместить в карантин инстанс любого проекта.
vi_vn: Một vai trò mặc định của hệ thống Compute RBAC có khả năng cách ly một máy ảo trong bất kì project nào.

source: A device that moves data in the form of blocks. These device nodes interface the devices, such as hard disks, CD-ROM drives, flash drives, and other addressable regions of memory.
de: Ein Gerät, dass Daten in Blöcken bewegt. Diese Knoten sind Interfaces zu den Geräten wie z.B. Festplatten, CD-ROM Laufwerken, Flash-Laufwerken und andere adressierbaren Speicherregionen.
ru: Устройство, передающее данные в форме блоков. Узлы таких устройств связывают жесткие диски, приводы CD-ROM, флэш-накопители и другие устройства, к памяти которых можно обратиться.
vi_vn: Thiết bị mà có thể dịch chuyển dữ liệu sang dạng các khối. Các nút của thiết bị này liên kết các thiết bị lại với nhau như hard disks, CD-ROM drives, flash drives và khác miền địa chỉ khác của bộ nhớ.

source: A directory service, which allows users to login with a user name and password. It is a typical source of authentication tokens.
de: Ein Verzeichnisdienst, der es Benutzern ermöglicht, sich mit einem Benutzernamen und Passwort anzumelden. Es ist eine typische Quelle von Authentifizierungs-Token.
ru: Служба каталога, которая позволяет пользователям входить в систему с помощью имени пользователя и пароля. Стандартный источник токенов аутентификации.
vi_vn: Một dịch vụ thư mục, cho phép người dùng đăng nhập bằng tên người dùng và mật khẩu. Đây là một nguồn các token xác thực phổ biến.

source: A discrete OpenStack environment with dedicated API endpoints that typically shares only the Identity (keystone) with other regions.
ru: Изолированная среда OpenStack с выделенными точками входа API. Обычно общей для разных регионов является только служба идентификации (Keystone).
vi_vn: Một môi trường OpenStack riêng biệt với các API endpoint chuyên dùng mà thường chỉ chia sẻ Identity (keystone) với các vùng khác.

source: A disk storage protocol tunneled within Ethernet.
de: Ein Plattenspeicherprotokoll, das durch Ethernet getunnelt ist.
ru: Протокол доступа к устройствам хранения данных поверх протокола Ethernet.
vi_vn: Một giao thức lưu trữ đĩa chạy ngầm trong Ethernet.

source: A distributed memory object caching system that is used by Object Storage for caching.
de: Ein verteiltes Speicherobjekt-Caching-System, das von Object Storage für das Caching verwendet wird.
ru: Система кэширования объектов распределенной памяти, которая используется объектным хранилищем для кэширования.
vi_vn: Một hệ thống phân phối đối tượng bộ nhớ đệm được sử dụng bởi Object Storage cho bộ nhớ đệm.

source: A distributed, highly fault-tolerant file system designed to run on low-cost commodity hardware.
de: Ein verteiltes, hochfehlertolerantes Dateisystem, das auf Billighardware ausgelegt ist.
ru: Распределенная файловая система с высокой отказоустойчивостью, разработанная для недорогого аппаратного обеспечения.

source: A domain within a parent domain. Subdomains cannot be registered. Subdomains enable you to delegate domains. Subdomains can themselves have subdomains, so third-level, fourth-level, fifth-level, and deeper levels of nesting are possible.
ru: Домен внутри родительского домена. Суб-домены нельзя регистрировать. Суб-домены позволяют делегировать домены. В суб-доментах можно создавать собственные суб-домены, что делает возможным вложение третьего, четвертого, пятого и следующих уровней.
vi_vn: Một miền nằm trong một miền mẹ. Các miền con không thể được đăng ký. Các miền con cho phép bạn ủy quyền các miền. Các miền con cũng có thể có các miền con của chính nó, nên việc lồng ghép các miền cấp độ ba, bốn năm là hoàn toàn có thể.

source: A driver for the Modular Layer 2 (ML2) neutron plug-in that provides layer-2 connectivity for virtual instances. A single OpenStack installation can use multiple mechanism drivers.
de: Ein Treiber für das Modular Layer 2 (ML2) Neutronen-Plug-In, das Layer-2-Konnektivität für virtuelle Instanzen bietet. Eine einzige OpenStack-Installation kann mehrere Mechanismus-Treiber verwenden.
ru: Драйвер для плагина Modular Layer 2 (ML2) службы Neutron, который обеспечивает соединение уровня 2 для виртуальных инстансов. Одна инсталляция OpenStack может использовать несколько драйверов механизмов.
vi_vn: Một trình điều khiển cho Layer Modular 2 (ML2) neutron plug-in cung cấp kết nối lớp 2 cho các máy ảo. Một cài đặt OpenStack duy nhất có thể sử dụng nhiều cơ chế điều khiển .

source: A feature of Compute that allows the unprivileged "nova" user to run a specified list of commands as the Linux root user.
ru: Функция службы вычислительных ресурсов, которая позволяет непривилегированным пользователям службы Nova выполнять определенные команды от имени корневого пользователя Linux.
vi_vn: Một tính năng của Compute cho phép người dùng "nova" ko có đặc quyền được chạy một danh sách nhất định các lệnh với tư cách là người dùng root của Linux.

source: A feature of the load-balancing service. It attempts to force subsequent connections to a service to be redirected to the same node as long as it is online.
ru: Функция службы балансировки нагрузки. Все последующие подключения к службе должны перенаправляться к одному и тому же узлу, пока он в сети.
vi_vn: Một tính năng của dịch vụ cân bằng tải. Nó cố gắng bắt buộc các kết nối tiếp theo đến một dịch vụ sẽ được điều hướng về cùng một node miễn là nó online.

source: A file sharing protocol. It is a public or open variation of the original Server Message Block (SMB) protocol developed and used by Microsoft. Like the SMB protocol, CIFS runs at a higher level and uses the TCP/IP protocol.
de: Ein Dateifreigabeprotokoll. Es ist eine öffentliche oder offene Variation des ursprünglichen SMB-Protokolls (Server Message Block), das von Microsoft entwickelt und verwendet wird. Wie das SMB-Protokoll läuft CIFS auf einer höheren Ebene und verwendet das TCP / IP-Protokoll.
ru: Протокол общего доступа к файлам. Это публичный или открытый вариант исходного протокола Server Message Block (SMB), разработанного и используемого Microsoft. Как и протокол SMB, CIFS выполняется на верхнем уровне и использует протокол TCP/IP.

source: A file system designed to aggregate NAS hosts, compatible with OpenStack.
de: Ein Dateisystem zur Aggregation von NAS-Hosts, die mit OpenStack kompatibel sind.
ru: Файловая система, предназначенная для объединения хостов сетевых хранилищ, совместимых с OpenStack.
vi_vn: Một hệ thống tập tin được thiết kế để kết hợp lại các máy chủ NAS, tương thích với OpenStack.

source: A file used to customize a Compute instance. It can be used to inject SSH keys or a specific network configuration.
ru: Файл, используемый для настройки инстанса службы вычислительных ресурсов. Может использоваться для сохранения ключей SSH или особой конфигурации сети.
vi_vn: File được sử dụng để tùy chỉnh

source: A generic term for virtualization of network functions such as switching, routing, load balancing, and security using a combination of VMs and overlays on physical network infrastructure.
de: Ein typischer Ausdruck für die Virtualisierung von Netzwerkfunktionen wie Switsching, Routing, Load Balancing und Sicherheit mittels einer Kombination aus VMs und Overlays auf physikalischer Netzwerkinfrastruktur.
ru: Общий термин, означающий виртуализацию сетевых функций, таких как коммутация, маршрутизация, балансировка нагрузки и безопасность с использованием сочетания виртуальных машин и оверлейных сетей на основе физической сетевой инфраструктуры.
vi_vn: Thuật ngữ chung dùng cho việc ảo hóa các chức năng của hệ thống mạng như chuyển mạch, định tuyến, cân bẳng tải và bảo mật bằng cách sử dụng kết hợp các máy ảo và bao trùm lên cơ sở hạ tầng hệ thống mạng vật lý.

source: A great way to get answers and insights is to post your question or problematic scenario to the OpenStack mailing list. You can learn from and help others who might have similar issues. To subscribe or view the archives, go to http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack. If you are interested in the other mailing lists for specific projects or development, refer to `Mailing Lists <https://wiki.openstack.org/wiki/Mailing_Lists>`__.
ru: Хорошая практика для получения ответов и более глубокого понимания это отправка вопроса или описания проблемного сценария в список рассылки OpenStack. С его помощью вы можете как задавать свои вопросы, так и помогать другим участникам решать похожие проблемы. Чтобы подписаться на рассылку или просмотреть архивы, посетите http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack. Если вас интересуют рассылки по конкретным проектам или разработке, обратитесь к `Mailing Lists <https://wiki.openstack.org/wiki/Mailing_Lists>`__.

source: A group of fixed and/or floating IP addresses that are assigned to a project and can be used by or assigned to the VM instances in a project.
de: Eine Gruppe von festen und/oder beweglichen IP-Adressen, die zu einem Projekt zugewiesen und von einer VM Instanz in einem Projekt benutzt oder zugewiesen sind.
ru: Группа фиксированных или плавающих IP-адресов, назначаемых проекту, которые могут использоваться или назначаться для экземпляров виртуальных машин в проекте.
vi_vn: Một tập hợp những địa chỉ IP tĩnh và địa chỉ IP động được gán cho một project và chúng được sử dụng hoặc gán cho các VM instance trong một project.

source: A group of interrelated web development techniques used on the client-side to create asynchronous web applications. Used extensively in horizon.
de: Eine Gruppe zusammenhängender Web-Entwicklungstechniken, die auf der Client-Seite verwendet werden, um asynchrone Web-Anwendungen zu erstellen. Benutzt weitgehend im Horizont.
ru: Набор связанных методов веб-разработки, который используется на стороне клиента для создания асинхронных веб-приложений. Широко используется в Horizon.
vi_vn: Một nhóm các thủ thuật phát triển web đã tương thích với nhau được sử dụng bên phía người dùng để tạo ra khác ứng dụng web không đồng bộ. Được sử dụng rộng rãi trong horizon.

source: A group of related button types within horizon. Buttons to start, stop, and suspend VMs are in one class. Buttons to associate and disassociate floating IP addresses are in another class, and so on.
de: Eine Gruppe von verwandten Schaltflächen in Horizon. Die Schaltflächen zum Starten, Stoppen und Pausieren von VMs sind in einer Klasse. Schaltflächen zum Zuweisen und Trennen von beweglichen IP-Adressen sind in einer anderen Klasse, usw.
ru: Группа связанных типов кнопок в пределах Horizon. Кнопки для запуска, остановки и временной остановки виртуальных машин находятся в одном классе. Кнопки для связывания и отмены связывания плавающих IP-адресов — в другом классе и т. д.
vi_vn: Nhóm các loại nút có trong horizon. Các nút như bắt đầu, ngưng, và tạm dừng VMs nằm trong một nhóm. Các nút tương thích và không tương thích với các địa chỉ IP tĩnh nằm trong nhóm khác,...

source: A group of users; used to isolate access to Compute resources. An alternative term for a project.
ru: Группа пользователей. Используется для разделения доступа к ресурсам службы Compute. Альтернативный термин для проекта.
vi_vn: Một nhóm các người dùng, được sử dụng để cô lập truy cập đến các tài nguyen của Compute. Một thuật ngữ thay thế cho một project.

source: A grouped release of projects related to OpenStack that came out in April 2012, the fifth release of OpenStack. It included Compute (nova 2012.1), Object Storage (swift 1.4.8), Image (glance), Identity (keystone), and Dashboard (horizon). Essex is the code name for the fifth release of OpenStack. The design summit took place in Boston, Massachusetts, US and Essex is a nearby city.
de: Ein gruppierte Release von Projekten im Zusammenhang mit Openstack , das im April 2012 rauskam. Es enthielt Compute (nova 2012.1) , Object Storage (Swift 1.4.8), Abbild-Dienst (Glance), Identitätsdienst (Keystone) und Dashboard (Horizon). Essex ist der Codename des fünften OpenStack Releases. Der Design Summit fand in Boston, Massachusetts statt und Essex ist eine Stadt in der Nähe.
ru: Групповой релиз относящихся к OpenStack проектов, состоявшийся в апреле 2012 года (пятый релиз OpenStack). Включает службу вычислительных ресурсов (Nova 2012.1), объектное хранилище (Swift 1.4.8), службу образов (Glance), службу идентификации (Keystone) и панель управления (Horizon). Essex — кодовое имя пятого релиза OpenStack. Саммит разработчиков проходил в Бостоне, штат Массачусетс, США (Эссекс — название близлежащего города).

source: A grouped release of projects related to OpenStack that came out in February of 2011. It included only Compute (nova) and Object Storage (swift). Bexar is the code name for the second release of OpenStack. The design summit took place in San Antonio, Texas, US, which is the county seat for Bexar county.
de: Eine gruppierte Freigabe von Projekten im Zusammenhang mit OpenStack, die im Februar 2011 erschien. Es enthielt nur Compute (nova) und Object Storage (swift). Bexar ist der Codename für das zweite Release von OpenStack. Der Design Summit fand in San Antonio, Texas, US, statt, was der Sitz des Landkreises Bexar ist.
ru: Групповой релиз относящихся к OpenStack проектов в феврале 2011 года. Включал только службу вычислительных ресурсов (Nova) и хранилище объектов (Swift). Bexar — это кодовое имя второго релиза OpenStack. Саммит разработчиков проходил в Сан-Антонио. Техас, США (административный центр округа Беар).

source: A grouped release of projects related to OpenStack that came out in the fall of 2011, the fourth release of OpenStack. It included Compute (nova 2011.3), Object Storage (swift 1.4.3), and the Image service (glance). Diablo is the code name for the fourth release of OpenStack. The design summit took place in the Bay Area near Santa Clara, California, US and Diablo is a nearby city.
de: Eine gruppierte Freigabe von Projekten im Zusammenhang mit OpenStack, die im Herbst 2011 herauskamen, die vierte Version von OpenStack. Es enthielt Compute (nova 2011.3), Object Storage (swift 1.4.3) und den Abbilddienst (glance). Diablo ist der Codename für die vierte Version von OpenStack. Der Design Summit fand in der Bay Area in der Nähe von Santa Clara, Kalifornien, USA und Diablo ist eine nahe gelegene Stadt.
ru: Групповой релиз относящихся к OpenStack проектов, состоявшийся осенью 2011 года (четвертый релиз OpenStack). Включает службу вычислительных ресурсов (Nova 2011.3), объектное хранилище (Swift 1.4.3) и службу Image (glance). Diablo — кодовое имя четвертого релиза OpenStack. Саммит разработчиков проходил в области залива Сан-Франциско возле Санта-Клара, Калифорния, США (Диабло — название близлежащего города).
