Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: You must set the ``OS_CACERT`` environment variable when using the https protocol in the ``OS_AUTH_URL`` environment setting because the verification process for the TLS (HTTPS) server certificate uses the one indicated in the environment. This certificate will be used when verifying the TLS (HTTPS) server certificate.
de: Sie müssen die Umgebungsvariable ``OS_CACERT` setzen, wenn Sie das https-Protokoll in der Umgebungseinstellung ``OS_AUTH_URL` verwenden, da der Prüfprozess für das TLS-Zertifikat (HTTPS) das in der Umgebung angegebene verwendet. Dieses Zertifikat wird beim Überprüfen des TLS-Serverzertifikats verwendet.
ru: Если в параметре среды ``OS_AUTH_URL`` задано использование протокола HTTPS, необходимо задать переменную среды ``OS_CACERT``. Это связано с тем, что при верификации сертификата сервера TLS (HTTPS) используется сертификат, указанный в среде.

source: `API Guide <http://developer.openstack.org/api-guide/quick-start/>`__
ru: `Руководство по API <http://developer.openstack.org/api-guide/quick-start/>`__

source: `Administrator Guide <http://docs.openstack.org/admin-guide/>`__
ru: `Руководство администратора <http://docs.openstack.org/admin-guide/>`__

source: `Architecture Design Guide <http://docs.openstack.org/arch-design/>`__
ru: `Руководство по проектированию архитектуры <http://docs.openstack.org/arch-design/>`__

source: `Block Storage <http://www.openstack.org/software/releases/newton/components/cinder>`__
ru: Хранилище блоков <http://www.openstack.org/software/releases/newton/components/cinder>`__

source: `Bugs: Application catalog (murano) <https://bugs.launchpad.net/murano>`__
ru: `Баги. Каталог приложений (Murano) <https://bugs.launchpad.net/murano>`__

source: `Bugs: Bare metal service (ironic) <https://bugs.launchpad.net/ironic>`__
ru: `Баги. Служба Bare metal (Ironic) <https://bugs.launchpad.net/ironic>`__

source: `Bugs: Clustering service (senlin) <https://bugs.launchpad.net/senlin>`__
ru: `Баги. Служба кластеризации (Senlin) <https://bugs.launchpad.net/senlin>`__

source: `Bugs: Container Infrastructure Management service (magnum) <https://bugs.launchpad.net/magnum>`__
ru: `Баги. Служба управления контейнерной инфраструктурой (Magnum) <https://bugs.launchpad.net/magnum>`__

source: `Bugs: DNS service (designate) <https://bugs.launchpad.net/designate>`__
ru: `Баги. Служба DNS (Designate) <https://bugs.launchpad.net/designate>`__

source: `Bugs: Data processing service (sahara) <https://bugs.launchpad.net/sahara>`__
ru: `Баги. Служба обработки данных (Sahara) <https://bugs.launchpad.net/sahara>`__

source: `Bugs: Database service (trove) <https://bugs.launchpad.net/trove>`__
ru: `Баги. Служба баз данных (Trove) <https://bugs.launchpad.net/trove>`__

source: `Bugs: Deployment service (fuel) <https://bugs.launchpad.net/fuel>`__
ru: `Баги. Служба развёртывания (Fuel) <https://bugs.launchpad.net/fuel>`__

source: `Bugs: Key Manager Service (barbican) <https://bugs.launchpad.net/barbican>`__
ru: `Баги. Служба управления ключами (Barbican) <https://bugs.launchpad.net/barbican>`__

source: `Bugs: Messaging service (zaqar) <https://bugs.launchpad.net/zaqar>`__
ru: `Баги. Служба сообщений (Zaqar) <https://bugs.launchpad.net/zaqar>`__

source: `Bugs: Monitoring (monasca) <https://bugs.launchpad.net/monasca>`__
ru: `Баги. Мониторинг (Monasca) <https://bugs.launchpad.net/monasca>`__

source: `Bugs: OpenStack API Documentation (developer.openstack.org) <https://bugs.launchpad.net/openstack-api-site>`__
ru: `Баги. Документация OpenStack API (developer.openstack.org) <https://bugs.launchpad.net/openstack-api-site>`__

source: `Bugs: OpenStack Block Storage (cinder) <https://bugs.launchpad.net/cinder>`__
ru: `Баги. Блочное хранилище OpenStack (Cinder) <https://bugs.launchpad.net/cinder>`__

source: `Bugs: OpenStack Compute (nova) <https://bugs.launchpad.net/nova>`__
ru: `Баги. Служба вычислительных ресурсов OpenStack (Nova) <https://bugs.launchpad.net/nova>`

source: `Bugs: OpenStack Dashboard (horizon) <https://bugs.launchpad.net/horizon>`__
ru: `Баги. Панель управления OpenStack (Horizon) <https://bugs.launchpad.net/horizon>`__

source: `Bugs: OpenStack Documentation (docs.openstack.org) <https://bugs.launchpad.net/openstack-manuals>`__
ru: `Баги. Документация OpenStack (docs.openstack.org) <https://bugs.launchpad.net/openstack-manuals>`__

source: `Bugs: OpenStack Identity (keystone) <https://bugs.launchpad.net/keystone>`__
ru: `Баги. Служба идентификации OpenStack (Keystone) <https://bugs.launchpad.net/keystone>`__

source: `Bugs: OpenStack Image service (glance) <https://bugs.launchpad.net/glance>`__
ru: `Баги. Служба образов OpenStack (Glance) <https://bugs.launchpad.net/glance>`__

source: `Bugs: OpenStack Networking (neutron) <https://bugs.launchpad.net/neutron>`__
ru: `Баги. Сетевая служба OpenStack (Neutron) <https://bugs.launchpad.net/neutron>`__

source: `Bugs: OpenStack Object Storage (swift) <https://bugs.launchpad.net/swift>`__
ru: `Баги. Хранилище объектов OpenStack (Swift) <https://bugs.launchpad.net/swift>`__

source: `Bugs: Orchestration (heat) <https://bugs.launchpad.net/heat>`__
ru: `Баги. Оркестрация (Heat) <https://bugs.launchpad.net/heat>`__

source: `Bugs: Rating (cloudkitty) <https://bugs.launchpad.net/cloudkitty>`__
ru: `Баги. Служба рейтинга (Cloudkitty) <https://bugs.launchpad.net/cloudkitty>`__

source: `Bugs: Shared file systems (manila) <https://bugs.launchpad.net/manila>`__
ru: `Баги. Общие файловые системы (Manila) <https://bugs.launchpad.net/manila>`__

source: `Bugs: Telemetry (ceilometer) <https://bugs.launchpad.net/ceilometer>`__
ru: `Баги. Телеметрия (Ceilometer) <https://bugs.launchpad.net/ceilometer>`__

source: `Bugs: Telemetry v3 (gnocchi) <https://bugs.launchpad.net/gnocchi>`__
ru: `Баги. Телеметрия v3 (Gnocchi) <https://bugs.launchpad.net/gnocchi>`__

source: `Bugs: Workflow service (mistral) <https://bugs.launchpad.net/mistral>`__
ru: `Баги. Служба потока операций (Mistral) <https://bugs.launchpad.net/mistral>`__

source: `Command-Line Interface Reference <http://docs.openstack.org/cli-reference/>`__
ru: `Справка по интерфейсу командной строки <http://docs.openstack.org/cli-reference/>`__

source: `Compute <http://www.openstack.org/software/releases/newton/components/nova>`__
ru: `Вычислительные ресурсы <http://www.openstack.org/software/releases/newton/components/nova>`__

source: `Configuration Reference <http://docs.openstack.org/newton/config-reference/>`__
ru: `Справка по конфигурации <http://docs.openstack.org/newton/config-reference/>`__

source: `Dashboard <http://www.openstack.org/software/releases/newton/components/horizon>`__
ru: `Панель управления <http://www.openstack.org/software/releases/newton/components/horizon>`__

source: `Data processing service <http://www.openstack.org/software/releases/newton/components/sahara>`__
ru: `Служба обработки данных <http://www.openstack.org/software/releases/newton/components/sahara>`__

source: `Database service <http://www.openstack.org/software/releases/newton/components/trove>`__
ru: `Служба базы данных <http://www.openstack.org/software/releases/newton/components/trove>`__

source: `Documentation Contributor Guide <http://docs.openstack.org/contributor-guide/>`__
ru: `Руководство соавтора документации <http://docs.openstack.org/contributor-guide/>`__

source: `End User Guide <http://docs.openstack.org/user-guide/>`__
ru: `Руководство конечного пользователя <http://docs.openstack.org/user-guide/>`__

source: `High Availability Guide <http://docs.openstack.org/ha-guide/>`__
ru: `Руководство по высокой доступности <http://docs.openstack.org/ha-guide/>`__

source: `Identity service <http://www.openstack.org/software/releases/newton/components/keystone>`__
ru: `Служба идентификации <http://www.openstack.org/software/releases/newton/components/keystone>`__

source: `Image service <http://www.openstack.org/software/releases/newton/components/glance>`__
ru: `Служба образов <http://www.openstack.org/software/releases/newton/components/glance>`__

source: `Installation Tutorial For Debian <http://docs.openstack.org/newton/install-guide-debian/>`__
ru: `Руководство по установке для Debian <http://docs.openstack.org/newton/install-guide-debian/>`__

source: `Installation Tutorial For Debian With Debconf <http://docs.openstack.org/newton/install-guide-debconf/>`__
ru: `Руководство по установке для Debian с Debconf <http://docs.openstack.org/newton/install-guide-debconf/>`__

source: `Installation Tutorial for Red Hat Enterprise Linux 7 and CentOS 7 <http://docs.openstack.org/newton/install-guide-rdo/>`__
ru: `Руководство по установке для Red Hat Enterprise Linux 7 и CentOS 7 <http://docs.openstack.org/newton/install-guide-rdo/>`__

source: `Installation Tutorial for Ubuntu 16.04 (LTS) <http://docs.openstack.org/newton/install-guide-ubuntu/>`__
ru: `Руководство по установке для Ubuntu 16.04 (LTS) <http://docs.openstack.org/newton/install-guide-ubuntu/>`__

source: `Installation Tutorial for openSUSE Leap 42.2 and SUSE Linux Enterprise Server 12 SP2 <http://docs.openstack.org/newton/install-guide-obs/>`__
ru: `Руководство по установке для openSUSE Leap 42.2 и SUSE Linux Enterprise Server 12 SP2 <http://docs.openstack.org/newton/install-guide-obs/>`__

source: `Networking <http://www.openstack.org/software/releases/newton/components/neutron>`__
ru: `Сеть <http://www.openstack.org/software/releases/newton/components/neutron>`__

source: `Networking Guide <http://docs.openstack.org/newton/networking-guide>`__
ru: `Руководство по сетям <http://docs.openstack.org/newton/networking-guide>`__

source: `Object Storage <http://www.openstack.org/software/releases/newton/components/swift>`__
ru: `Хранилище объектов <http://www.openstack.org/software/releases/newton/components/swift>`__

source: `Operations Guide <http://docs.openstack.org/ops/>`__
ru: `Руководство по эксплуатации <http://docs.openstack.org/ops/>`__

source: `Orchestration <http://www.openstack.org/software/releases/newton/components/heat>`__
ru: `Оркестрация <http://www.openstack.org/software/releases/newton/components/heat>`__

source: `Security Guide <http://docs.openstack.org/sec/>`__
ru: `Руководство по безопасности <http://docs.openstack.org/sec/>`__

source: `Telemetry <http://www.openstack.org/software/releases/newton/components/ceilometer>`__
ru: `Телеметрия <http://www.openstack.org/software/releases/newton/components/ceilometer>`__

source: `Virtual Machine Image Guide <http://docs.openstack.org/image-guide/>`__
ru: `Руководство по образам виртуальных машин <http://docs.openstack.org/image-guide/>`__

source: ``--checksum CHECKSUM``
ru: ``--checksum КОНТРОЛЬНАЯ_СУММА``

source: ``--container-format CONTAINER_FORMAT``
ru: ``--container-format ФОРМАТ_КОНТЕЙНЕРА``

source: ``--copy-from IMAGE_URL``
ru: ``--copy-from URL-адрес_ОБРАЗА``

source: ``--disk-format DISK_FORMAT``
ru: ``--disk-format ФОРМАТ_ДИСКА``

source: ``--file FILE``
ru: ``--file ФАЙЛ``

source: ``--location IMAGE_URL``
ru: ``--location URL-адрес_ОБРАЗА``

source: ``--min-disk DISK_GB``
ru: ``--min-disk ДИСК_ГБ``

source: ``--min-ram DISK_RAM``
ru: ``--min-ram ОЗУ``

source: ``--name NAME``
ru: ``--name ИМЯ``

source: ``--owner TENANT_ID --size SIZE``
ru: ``--owner ID_ТЕНАНТА --size РАЗМЕР``

source: ``--property KEY=VALUE``
ru: ``--property КЛЮЧ=ЗНАЧЕНИЕ``

source: ``barbican`` - Key Manager Service API
ru: ``barbican`` – API службы управления ключами

source: ``ceilometer`` - Telemetry API
ru: ``ceilometer`` – API телеметрии

source: ``cinder`` - Block Storage API and extensions
de: ``cinder`` - Block Storage API und Erweiterungen
ru: ``cinder`` – API блочного хранилища и расширений

source: ``cloudkitty`` - Rating service API
ru: ``cloudkitty`` – API службы рейтинга

source: ``designate`` - DNS service API
ru: ``designate`` – API службы DNS

source: ``fuel`` - Deployment service API
ru: ``fuel`` – API службы развертывания

source: ``glance`` - Image service API
ru: ``glance`` – API службы образов

source: ``gnocchi`` - Telemetry API v3
ru: ``gnocchi`` – API телеметрии v3

source: ``heat-api-cfn`` component
de: ``heat-api-cfn`` Komponenten
ru: Компонент ``heat-api-cfn``

source: ``heat-api`` component
de: ``heat-api`` Komponente
ru: Компонент ``heat-api``

source: ``heat`` - Orchestration API
ru: ``heat`` – API оркестрации

source: ``heat`` command-line client
de: ``heat`` Kommandozeilen-Client
ru: Клиент командной строки ``heat``

source: ``magnum`` - Container Infrastructure Management service API
ru: ``magnum`` – API службы управления инфраструктурой контейнеров

source: ``manila`` - Shared file systems API
ru: ``manila`` – API общих файловых систем

source: ``mistral`` - Workflow service API
ru: ``mistral`` – API службы потока операций

source: ``monasca`` - Monitoring API
ru: ``monasca`` – API мониторинга

source: ``murano`` - Application catalog API
ru: ``murano`` – API каталога приложений

source: ``neutron`` - Networking API
ru: ``neutron`` – API сети

source: ``nova-api-metadata`` service
de: ``nova-api-metadata`` Dienst
ru: Служба ``nova-api-metadata``

source: ``nova-api`` service
de: ``nova-api`` Dienst
ru: Служба ``nova-api``

source: ``nova-cert`` daemon
ru: Демон ``nova-cert``

source: ``nova-cert`` module
de: ``nova-cert`` Modul
ru: Модуль ``nova-cert``

source: ``nova-compute`` service
de: ``nova-compute`` Dienst
ru: Служба ``nova-compute``

source: ``nova-conductor`` module
de: ``nova-conductor`` Modul
ru: Модуль ``nova-conductor``

source: ``nova-consoleauth`` daemon
de: ``nova-consoleauth`` Dämon
ru: Демон ``nova-consoleauth``

source: ``nova-network worker`` daemon
ru: Демон ``nova-network worker``

source: ``nova-novncproxy`` daemon
de: ``nova-novncproxy`` Dämon
ru: Демон ``nova-novncproxy``

source: ``nova-scheduler`` service
de: ``nova-scheduler`` Dienst
ru: Служба ``nova-scheduler``

source: ``nova-spicehtml5proxy`` daemon
de: ``nova-spicehtml5proxy`` Dämon
ru: Демон ``nova-spicehtml5proxy``

source: ``nova-xvpvncproxy`` daemon
de: ``nova-xvpvncproxy`` Dämon
ru: Демон ``nova-xvpvncproxy``

source: ``nova`` - Compute API and extensions
de: ``nova`` - Compute API und Erweiterungen
ru: ``nova`` – API службы вычислительных ресурсов и расширения

source: ``nova`` client
ru: Клиент ``nova``

source: ``python-troveclient`` command-line client
de: ``python-troveclient`` Befehlszeilen-Client
ru: Клиент командной строки ``python-troveclient``

source: ``sahara`` - Data Processing API
ru: ``sahara`` – API службы обработки данных

source: ``senlin`` - Clustering service API
ru: ``senlin`` – API службы кластеризации

source: ``swift`` - Object Storage API
ru: ``swift`` – API хранилища объектов

source: ``trove-api`` component
de: ``trove-api`` Komponente
ru: Компонент ``trove-api``

source: ``trove-conductor`` service
de: ``trove-conductor`` Dienst
ru: Служба ``trove-conductor``

source: ``trove-guestagent`` service
de: ``trove-guestagent`` Dienst
ru: Служба ``trove-guestagent``

source: ``trove-taskmanager`` service
de: ``trove-taskmanager`` Dienst
ru: Служба ``trove-taskmanager``

source: ``trove`` - Database service API
ru: ``trove`` – API службы баз данных

source: absolute limit
de: absolutes Limit
ru: абсолютный предел
vi_vn: giới hạn tuyệt đối

source: access control list (ACL)
de: access control list (ACL) [Zugriffskontrollliste]
ru: список контроля доступа (ACL)

source: access key
de: access key [Zugriffsschlüssel]
ru: ключ доступа
vi_vn: key truy nhập

source: account
de: account [Konto]
ru: учетная запись
vi_vn: tài khoản

source: account auditor
de: Rechnungsprüfer
ru: аудитор учетной записи
vi_vn: trình kiểm tra tài khoản

source: account database
de: account database [Kontodatenbank]
ru: база данных учетных записей
vi_vn: tài khoản cơ sở dữ liệu

source: account reaper
de: account reaper [Konto Reaper]
ru: рипер учетной записи
vi_vn: trình xóa tài khoản

source: account server
de: Kontoserver
ru: сервер учетной записи
vi_vn: tài khoản server

source: account service
de: account service [Kontodienst]
ru: служба учетных записей
vi_vn: dịch vụ tài khoản

source: accounting
de: Buchhaltung
ru: учет
vi_vn: Tính tiền

source: active/active configuration
de: aktiv/aktiv Konfiguration
ru: конфигурация "активная-активная"
vi_vn: cấu hình active/active

source: active/passive configuration
de: aktiv/passiv Konfiguration
ru: конфигурация "активная-пассивная"
vi_vn: cấu hình active/passive

source: address pool
de: Adressbestand
ru: пул адресов
vi_vn: vùng địa chỉ

source: admin API
de: Administrations-API
ru: администратор API

source: admin server
de: Administrationsserver
ru: сервер администрирования

source: administrator
ru: администратор

source: alert
de: Alarm
ru: оповещение
vi_vn: cảnh báo

source: allocate
de: allocate [zuweisen]
ru: выделение
vi_vn: phân bổ

source: applet
ru: приложение

source: application server
de: Applikationsserver
ru: сервер приложений
vi_vn: server ứng dụng

source: associate
de: associate [zuweisen]
ru: связывание
vi_vn: tương thích

source: attach
de: anhängen
ru: прикрепление
vi_vn: đính kèm

source: attachment (network)
de: Anhang (Netzwerk)
ru: вложение (сеть)
vi_vn: đính kèm (mạng)

source: auditing
de: Auditieren
ru: контроль
vi_vn: kiểm tra

source: auditor
ru: аудитор
vi_vn: trình kiểm tra

source: auth node
de: Authentifizierungsknoten
ru: узел авториз.

source: authentication
de: Authentifizierung
ru: аутентификация
vi_vn: chứng thực

source: authentication token
de: Authentifizierungstoken
ru: токен аутентификации
vi_vn: thẻ chứng thực

source: authorization
de: Autorisierung
ru: авторизация
vi_vn: ủy quyền

source: authorization node
de: Autorisierungsknoten
ru: узел авторизации
vi_vn: node ủy quyền

source: auto declare
de: automatisch deklarieren
ru: автоматическое объявление
vi_vn: tự động khai báo

source: availability zone
de: Verfügbarkeitszone
ru: зона доступности
vi_vn: vùng có sẵn

source: back end
ru: серверная часть

source: back-end catalog
de: Backend Katalog
ru: внутренний каталог
vi_vn: danh mục back-end

source: back-end store
de: Backend Speicher
ru: внутреннее хранение
vi_vn: lưu trữ back-end

source: backup restore and disaster recovery as a service
ru: восстановление из резервной копии и аварийное восстановление как услуга

source: bandwidth
de: Bandbreite
ru: пропускная способность
vi_vn: băng thông

source: base image
de: Basisabbild
ru: базовый образ
vi_vn: image gốc

source: binary
de: binär
ru: двоичная
vi_vn: nhị phân

source: bit
ru: бит

source: bits per second (BPS)
de: Bits pro Sekunde (BPS)
ru: бит в секунду (бит/с)
vi_vn: bits trên giây (BPS)

source: block device
de: Blockgerät
ru: устройство блочного ввода-вывода
vi_vn: thiết bị khối

source: block migration
ru: миграция блоков
vi_vn: sự dịch chuyển block

source: bootable disk image
de: Bootfähiges Festplattenabbild
ru: образ загрузочного диска
vi_vn: image đĩa khởi động

source: browser
ru: браузер
vi_vn: trình duyệt

source: builder file
de: Builder-Datei
ru: файл построителя
vi_vn: tập tin xây dựng

source: bursting
ru: миграция приложений

source: button class
de: Schaltfläche
ru: класс кнопки
vi_vn: nhóm nút

source: byte
ru: байт

source: cache pruner
ru: очистка кэша

source: capability
de: Fähigkeit
ru: возможность
vi_vn: khả năng

source: capacity cache
de: Kapazitätszwischenspeicher
ru: емкость кэша
vi_vn: dung lượng bộ nhớ đệm

source: capacity updater
de: Kapazitäts-Aktualisierer
ru: средство обновления емкости
vi_vn: dung lượng trình cập nhật

source: catalog
de: Katalog
ru: каталог
vi_vn: danh mục

source: catalog service
de: Katalogdienst
ru: служба каталога
vi_vn: danh mục dịch vụ

source: ceilometer
ru: Сeilometer

source: cell
de: Zelle
ru: ячейка

source: cell forwarding
de: Zellenweiterleitung
ru: перенаправление по ячейкам
vi_vn: chuyển tiếp cell

source: cell manager
de: Zellenverwaltung
ru: диспетчер ячеек
vi_vn: trình quản lý cell

source: certificate authority (CA)
ru: центр сертификации (ЦС)

source: chance scheduler
ru: планировщик случайного выбора
vi_vn: lịch trình ngẫu nhiên

source: child cell
de: Kind-Zelle
ru: дочерняя ячейка
vi_vn: cell con

source: cinder-backup daemon
ru: Демон cinder-backup

source: cinder-scheduler daemon
ru: Демон cinder-scheduler

source: cinder_img_volume_type (via glance image metadata)
ru: cinder_img_volume_type (с помощью метаданных образа Glance)

source: cloud architect
de: Cloud Architekt
ru: архитектор облачных систем
vi_vn: kiến trúc sư điện toán đám mây

source: cloud computing
ru: облачные вычисления
vi_vn: điện toán đám mây

source: cloud controller
ru: контроллер облака
vi_vn: trình điều khiển cloud

source: cloud controller node
de: Cloud Controller Knoten
ru: управляющий узел облака
vi_vn: node điều khiển cloud

source: cloudadmin
ru: администратор облака

source: cloudkitty
ru: Сloudkitty

source: cloudpipe image
de: cloudpipe Abbild
ru: образ CloudPipe

source: command filter
de: Befehlsfilter
ru: фильтр команд
vi_vn: bộ lọc câu lệnh

source: community project
de: Community Projekt
ru: проект сообщества
vi_vn: dự án cộng đồng

source: compression
de: Komprimierung
ru: сжатие
vi_vn: nén

source: compute controller
ru: контроллер службы вычислительных ресурсов
vi_vn: trình điều khiển tính toán

source: compute host
ru: хост вычислений
vi_vn: Máy chủ Compute

source: compute node
de: Compute Knoten
ru: вычислительный узел
vi_vn: node tính toán

source: compute worker
ru: вычислительный рабочий модуль
vi_vn: worker tính toán

source: concatenated object
de: Verkettetes Objekt
ru: объединенный объект
vi_vn: object được ghép nối

source: conductor
ru: проводник
vi_vn: dây dẫn

source: consistency window
de: Konsistenzfenster
ru: окно согласования
vi_vn: khung thời gian cố định

source: console log
de: Konsolen-Log
ru: журнал консоли
vi_vn: log tại màn hình console

source: container
ru: контейнер

source: container auditor
de: Rechnungsprüfer
ru: аудитор контейнеров
vi_vn: công cụ kiểm tra nơi chứa

source: container database
de: Containerdatenbank
ru: база данных контейнера
vi_vn: cơ sở dữ liệu container

source: container format
ru: формат контейнера
vi_vn: định dạng container

source: container server
ru: сервер контейнера

source: container service
de: Containerdienst
ru: служба контейнеров
vi_vn: dịch vụ container

source: content delivery network (CDN)
ru: сеть доставки содержимого (CDN)
vi_vn: mạng phân phối nội dung (CDN)

source: controller node
de: Controller-Knoten
ru: управляющий узел
vi_vn: nút điều khiển

source: core API
de: Kern API
ru: основной API
vi_vn: lõi API

source: core service
de: Kerndienst
ru: официальная служба

source: cost
de: Kosten
ru: цена
vi_vn: giá

source: credentials
de: Zugangsdaten
ru: учетные данные
vi_vn: các thông tin xác thực

source: current workload
de: Aktuelle Arbeitsbelastung
ru: текущая нагрузка
vi_vn: khối lượng công việc hiện tại

source: customer
de: Kunde
ru: заказчик
vi_vn: khách hàng

source: customization module
de: Anpassungsmodul
ru: модуль настройки
vi_vn: mô hình tùy biến

source: daemon
ru: демон

source: data encryption
de: Datenverschlüsselung
ru: шифрование данных
vi_vn: mã hóa dữ liệu

source: data store
de: Datenspeicher
ru: хранилище данных

source: database ID
de: Datenbankkennung
ru: ID базы данных
vi_vn: ID cơ sở dữ liệu

source: database replicator
de: Datenbank Replikator
ru: утилита репликации баз данных
vi_vn: trình sao lưu cơ sở dữ liệu

source: deallocate
de: freigeben
ru: отмена распределения
vi_vn: giải phóng

source: deduplication
de: Deduplizierung
ru: дедупликация
vi_vn: chống trùng lặp

source: default panel
de: Standard-Paneel
ru: панель по умолчанию
vi_vn: panel mặc định

source: default project
de: Standardprojekt
ru: проект по умолчанию

source: default token
de: Standard-Token
ru: токен по умолчанию
vi_vn: token mặc định

source: default_volume_type (via cinder.conf)
ru: default_volume_type (с помощью cinder.conf)
