Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: The Telemetry Alarming services trigger alarms when the collected metering or event data break the defined rules.
de: Die Telemetrie-Alarmierungsdienste lösen Alarme aus, wenn die gesammelten Mess- oder Ereignisdaten die definierten Regeln brechen.
ru: Служба оповещений телеметрии активирует оповещение, если собранные данные о событиях или измерениях нарушают определенные правила.

source: The Telemetry Data Collection services provide the following functions:
de: Der Telemetrie Datensammeldienst stellt die folgenden Funktionen zur Verfügung:
ru: Службы сбора данных телеметрии обеспечивают следующие функции.

source: The Telemetry service consists of the following components:
de: Der Telemetriedienst besteht aus den folgenden Komponenten:
ru: Служба телеметрии состоит из следующих компонентов.

source: The URL where the data for this image resides. This option is only available in V1 API. When using it, you also need to set ``--os-image-api-version``. For example, if the image data is stored in swift, you could specify ``--os-image-api-version 1 --location swift://account:key@example.com/container/obj``.
ru: URL-адрес расположения данных для этого образа. Этот параметр доступен только для API OpenStack версии 1. При его использовании также необходимо задать значение `--os-image-api-version``. Например, если образ хранится в Swift, можно задать значение ``--os-image-api-version 1 --location swift://account:key@example.com/container/obj``.

source: The Xen administrative API, which is supported by Compute.
ru: API управления Xen, поддерживаемый Compute.
vi_vn: Giao diện quản lý Xen, được hỗ trợ bởi Compute.

source: The `OpenStack wiki <https://wiki.openstack.org/>`__ contains a broad range of topics but some of the information can be difficult to find or is a few pages deep. Fortunately, the wiki search feature enables you to search by title or content. If you search for specific information, such as about networking or OpenStack Compute, you can find a large amount of relevant material. More is being added all the time, so be sure to check back often. You can find the search box in the upper-right corner of any OpenStack wiki page.
ru: `OpenStack wiki <https://wiki.openstack.org/>`__ содержит множество тем, но определенную информацию иногда трудно найти, например она может находиться на несколько страниц глубже. К счастью, поиск Wiki позволяет вам искать по заголовкам и содержимому страниц. Доступно большое количество материалов по определенным темам, например о сетях или службе вычислительных ресурсов OpenStack. Эти материалы постоянно пополняются, проверяйте интересующие вас темы время от времени. Поле поиска расположено в правом-верхнем углу любой страницы OpenStack Wiki.

source: The ``cinder-backup`` service provides backing up volumes of any type to a backup storage provider. Like the ``cinder-volume`` service, it can interact with a variety of storage providers through a driver architecture.
de: Der ``cinder-backup`` Dienst bietet die Sicherung von Datenträgern jeglicher Art an einen Backup-Speicheranbieter. Wie der ``cinder-volume`` Dienst kann er mit einer Vielzahl von Speicheranbietern durch eine Treiberarchitektur interagieren.
ru: Служба``cinder-backup`` обеспечивает резервное копирование томов любого типа в хранилище резервного копирования. Аналогично службе ``cinder-volume`` может взаимодействовать с различными поставщиками хранилищ с помощью драйверов.

source: The ``cpu`` column shows the sum of the virtual CPUs for instances running on the host.
ru: В столбце ``cpu`` отображается количество виртуальных ЦП для инстансов, выполняющихся на хосте.

source: The ``disk_gb`` column shows the sum of the root and ephemeral disk sizes (in GB) of the instances that run on the host.
ru: В столбце ``disk_gb`` отображается суммарный размер основного и временных дисков (в ГБ) для инстансов, которые выполняются на хосте.

source: The ``memory_mb`` column shows the sum of the memory (in MB) allocated to the instances that run on the host.
ru: В столбце ``memory_mb`` отображается суммарный объем памяти (в МБ), выделенный инстансам, которые выполняются на хосте.

source: The ``nova-network`` worker daemon; provides services such as giving an IP address to a booting nova instance.
ru: Демон рабочего модуля ``nova-network``. Обеспечивает назначение IP-адресов для загружающихся инстансов Nova.

source: The ``root`` user must run commands that are prefixed with the ``#`` prompt. You can also prefix these commands with the :command:`sudo` command, if available, to run them.
de: Der ``root`` Benutzer muss Befehle ausführen, denen die ``# `` Eingabeaufforderung vorangestellt ist. Sie können diese Befehle auch mit dem Befehl: `sudo` voranstellen, falls vorhanden, um sie auszuführen.
ru: Команды, начинающиеся с ``#``, должен выполнять пользователь ``root``. Кроме того, эти команды можно начинать с команды :command:`sudo` (если доступна), чтобы выполнять их.

source: The ability to encrypt data at the file system, disk partition, or whole-disk level. Supported within Compute VMs.
de: Die Fähigkeit, Daten im Dateisystem, auf der Festplattenpartition oder auf der Festplatte zu verschlüsseln. Unterstützt in Compute VMs.
ru: ВМ службы вычислительных ресурсов поддерживают шифрование данных на уровне файловой системы, целого диска или его раздела.
vi_vn: Khả năng mã hóa dữ liệu ở cấp độ hệ thống tập tin, phân vùng đĩa hoặc cả đĩa. Được hỗ trự trong các máy ảo Compute.

source: The ability to guarantee certain network or storage requirements to satisfy a Service Level Agreement (SLA) between an application provider and end users. Typically includes performance requirements like networking bandwidth, latency, jitter correction, and reliability as well as storage performance in Input/Output Operations Per Second (IOPS), throttling agreements, and performance expectations at peak load.
ru: Возможность гарантировать определенные требования к сети или системе хранения в соответствии с соглашением об уровне обслуживания (SLA) между поставщиком приложения и конечными пользователями. Обычно в QoS входят требования производительности, например значения пропускной способности, задержки, исправления дрожания и надежности, а также значение производительности устройств хранения в операциях ввода-вывода в секунду (IOPS), соглашения о допустимом количестве запросов и ожидаемая производительность при пиковых нагрузках.

source: The ability to start new VM instances based on the actual memory usage of a host, as opposed to basing the decision on the amount of RAM each running instance thinks it has available. Also known as RAM overcommit.
de: Die Fähigkeit, neue VM-Instanzen auf der Grundlage der tatsächlichen Speichernutzung eines Hosts zu starten, im Gegensatz zur Entscheidung basierend auf die Menge an RAM jede laufende Instanz. Auch als RAM-Overcommit bekannt.
ru: Обеспечивает возможность запускать новые инстансы ВМ исходя из текущего использования памяти, а не на основе объема ОЗУ, доступного для каждого выполняющегося инстанса. Альтернативный термин — чрезмерное использование ОЗУ.
vi_vn: Khả năng khởi động các máy ảo mới dựa trên mức độ sử dụng bộ nhớ trên một máy chủ vật lý, đối lập với quyết định khởi động các máy ảo mới dựa trên lượng RAM mà mỗi máy ảo đang chạy nghĩ rằng nó có. Cũng được biết đến dưới tên gọi RAM overcommit.

source: The ability to start new VM instances based on the actual memory usage of a host, as opposed to basing the decision on the amount of RAM each running instance thinks it has available. Also known as memory overcommit.
ru: Возможность запускать новые инстансы ВМ, исходя из действительного использования памяти хоста, а не на основе объема ОЗУ, выделенного для каждого выполняемого инстанса. Также известно как чрезмерное выделение памяти (memory overcommit).
vi_vn: Khả năng khởi động các máy ảo mới dựa trên mức độ sử dụng bộ nhớ trên một máy chủ vật lý, đối lập với quyết định khởi động các máy ảo mới dựa trên lượng RAM mà mỗi instance đang chạy nghĩ rằng nó có. Cũng được biết đến dưới tên gọi memory overcommit.

source: The ability within Compute to move running virtual machine instances from one host to another with only a small service interruption during switchover.
de: Die Fähigkeit innerhalb von Compute, laufende virtuelle Maschineninstanzen von einem Host zum anderen zu bewegen, mit nur einer kleinen Dienstunterbrechung während der Umschaltung.
ru: В службе вычислительных ресурсов возможность перемещать виртуальные машины с одного хоста на другой при кратковременном прерывании обслуживания клиентов во время переключения.
vi_vn: Khả năng nằm trong Compute cho phép chuyển các instance máy ảo đang chạy từ máy chủ này sang máy chủ khác với chỉ một sự gián đoạn nhỏ trong quá trình chuyển giao.

source: The act of verifying that a user, process, or client is authorized to perform an action.
de: Der Akt der Überprüfung, ob ein Benutzer, ein Prozess oder ein Client berechtigt ist, eine Aktion durchzuführen.
ru: Проверка, в ходе которой выясняется, имеет ли пользователь, процесс или приложение право выполнить действие.
vi_vn: Việc xác nhận rằng một người dùng, quá trình hoặc client được phép thực hiện một hành động.

source: The amount of available data used by communication resources, such as the Internet. Represents the amount of data that is used to download things or the amount of data available to download.
de: Die Menge der verfügbaren Daten, die von Kommunikationsressourcen, wie das Internet verwendet werden. Stellt die Datenmenge dar, die zum Herunterladen von Daten oder zum Herunterladen der Daten verwendet wird.
ru: Объем доступных данных , используемый коммуникационными ресурсами, например Интернетом. Отображает объем данных для загрузки элементов или же объем загружаемых данных.
vi_vn: Lượng dữ liệu khả dụng được dùng bởi các tài nguyên cộng đồng như Internet. Biểu thị cho lượng dữ liệu được dùng để tải những thứ cần hoặc lượng dữ liệu khả dụng để tải về.

source: The amount of time it takes for a new Object Storage object to become accessible to all clients.
de: Die Zeitdauer, bis ein neues Objektspeicherobjekt für alle Clients zugänglich gemacht wird.
ru: Время по прошествии которого, новый объект из хранилища объектов становится доступным для всех клиентов.
vi_vn: Khoảng thời gian cần thiết để một object mới của Object Storage để có thể truy cập vào từ tất cả các client.

source: The arguments to be passed are:
de: Als Argumente sind zu nennen:
ru: Ниже перечислены возможные аргументы этой команды.

source: The association between an Image service VM image and a project. Enables images to be shared with specified projects.
de: Die Zuordnung zwischen einem Abbilddienst-VM-Abbild und einem Projekt. Ermöglicht die Freigabe von Abbildern mit bestimmten Projekten.
ru: Связь между образом ВМ службы Image и проектом. Позволяет совместно использовать образы в выбранных проектах.

source: The back-end store used by Image service to store VM images, options include Object Storage, locally mounted file system, RADOS block devices, VMware datastore, or HTTP.
de: Der Back-End-Speicher, der von Abbilddienst zum Speichern von VM-Abbildern verwendet wird, umfasst Objektspeicher, lokal installiertes Dateisystem, RADOS-Blockgeräte, VMware-Datenspeicher oder HTTP.
ru: Внутреннее хранилище, используемое службой образов для хранения образов ВМ. Варианты: объектное хранилище, локально смонтированная файловая система, блочные устройства RADOS, хранилище данных VMware или HTTP-ссылка.

source: The cloud operator assigns roles to users. Roles determine who can upload and manage images. The operator might restrict image upload and management to only cloud administrators or operators.
de: Der Cloud-Operator weist den Benutzern Rollen zu. Rollen bestimmen, wer Abbilder hochladen und verwalten kann. Der Benutzer kann das Hochladen von Bildern und die Verwaltung auf nur Cloud-Administratoren oder Operatoren beschränken.
ru: Оператор облака назначает роли пользователям. Роли определяют, кто может загружать и управлять образами. Оператор может ограничить возможность загрузки образов и управления ими, предоставив разрешения только администраторам и операторам.

source: The code name for the eighth release of OpenStack. The design summit took place in Portland, Oregon, US and Havana is an unincorporated community in Oregon.
de: Der Codename für die achte Version von OpenStack. Der Design Summit fand in Portland, Oregon, USA statt und Havanna eine uneingetragene Gemeinde in Oregon statt.
ru: Кодовое имя восьмого релиза OpenStack. Саммит разработчиков проходил в Портланде, Орегон, США (Гавана — отдельное сообщество Орегона).
vi_vn: Tên mã phiên bản thứ tám của OpenStack. Hội nghị thượng đỉnh thiết kế được tổ chức tại Portland, Oregon, US và Havana là tên của một cộng đồng chưa hợp nhất tại Oregon.

source: The code name for the eleventh release of OpenStack. The design summit took place in Paris, France. Due to delays in the name selection, the release was known only as K. Because ``k`` is the unit symbol for kilo and the reference artifact is stored near Paris in the Pavillon de Breteuil in Sèvres, the community chose Kilo as the release name.
ru: Кодовое имя одиннадцатого релиза OpenStack. Саммит разработчиков проходил в Париже, Франция. По причине задержек при выборе имени релиз известен как K. Поскольку ``k`` — это символ единицы измерения килограмм, а эталон величины хранится в Pavillon de Breteuil in Sèvres возле Парижа, сообщество выбрало Kilo как имя для релиза.

source: The code name for the fifteenth release of OpenStack. The design summit will take place in Barcelona, Spain. Ocata is a beach north of Barcelona.
ru: Кодовое имя пятнадцатого релиза OpenStack. Саммит разработчиков проходил в Барселоне, Испания. Оката — пляж на севере Барселоны.

source: The code name for the fourteenth release of OpenStack. The design summit took place in Austin, Texas, US. The release is named after "Newton House" which is located at 1013 E. Ninth St., Austin, TX. which is listed on the National Register of Historic Places.
ru: Кодовое имя четырнадцатого релиза OpenStack. Саммит разработчиков проходил в Остине, штат Техас, США. Релиз назван в честь здания "Newton House", которое расположено по адресу 1013 E. Ninth St., Austin, TX и внесено в Национальный реестр исторических мест США.

source: The code name for the initial release of OpenStack. The first design summit took place in Austin, Texas, US.
de: Der Code-Name für die initiale Version von OpenStack. Der erste Design-Summit wurde abgehalten in Austin, Texas, USA.
ru: Кодовое имя первого выпуска OpenStack. Первый саммит разработчиков проводился в Остине, штат Техас.
vi_vn: Tên mã phiên bản đầu tiên của OpenStack. Hội nghị thượng đỉnh thiết kế lần đầu tiên được tổ chức tại Austin, Texas, US.

source: The code name for the ninth release of OpenStack. The design summit took place in Hong Kong and Ice House is a street in that city.
de: Der Codename für die neunte Version von OpenStack. Der Design Summit fand in Hongkong statt und das Ice House ist eine Straße in dieser Stadt.
ru: Кодовое имя девятого релиза OpenStack. Саммит разработчиков проходил в Гонконге (Ice House — название городской улицы).
vi_vn: Tên mã phiên bản thứ chín của OpenStack. Hội nghị thượng đỉnh thiết kế được tổ chức tại Hong Kong và Ice House là tên một con phố ở Hong Kong.

source: The code name for the seventeenth release of OpenStack. The design summit will take place in Sydney, Australia. The release is named after the Queens Pound river in the South Coast region of New South Wales.
ru: Кодовое имя семнадцатого релиза OpenStack. Саммит разработчиков проходил в Сиднее, Австралия. Квинс Паунд — река в регионе Южное побережье штата Новый Южный Уэльс.

source: The code name for the seventh release of OpenStack. The design summit took place in San Diego, California, US and Grizzly is an element of the state flag of California.
de: Der Codename für die siebte Version von OpenStack. Die Design Summit fand in San Diego, Kalifornien, USA statt und Grizzly ist ein Element der Staatsflagge von Kalifornien.
ru: Кодовое имя седьмого релиза OpenStack. Саммит разработчиков проходил в Сан-Диего, Калифорния, США, и гризли является элементом государственного флага Калифорнии.
vi_vn: Tên mã phiên bản thứ bảy của OpenStack. Hội nghị thượng đỉnh thiết kế được tổ chức tại San Diego, California, US và Grizzly là một thành phần trên lá cờ của bang California.

source: The code name for the sixteenth release of OpenStack. The design summit will take place in Boston, Massachusetts, US. The release is named after the Massachusetts Turnpike, abbreviated commonly as the Mass Pike, which is the eastermost stretch of Interstate 90.
ru: Кодовое имя шестнадцатого релиза OpenStack. Саммит разработчиков проходил в Бостоне, штат Массачусетс, США. Релиз назван по имени массачусетской платной автострады (самая восточная часть шоссе I-90), широко используемое сокращение которой — Масс Пайк.

source: The code name for the tenth release of OpenStack. The design summit took place in Atlanta, Georgia, US and Juno is an unincorporated community in Georgia.
de: Der Code-Name für das zehnte Release von OpenStack. Der Design-Summit wurde in Atlanta, Georgia, USA abgehalten und Juno ist ein gemeindefreies Gebiet in Georgia.
ru: Кодовое имя десятого релиза OpenStack. Саммит разработчиков проходил в Атланте, Джорджия, США (Джуно — отдельное сообщество Джорджии).
vi_vn: Tên mã phiên bản thứ mười của OpenStack. Hội nghị thượng đỉnh thiết kế được tổ chức tại Atlanta, Georgia, US và Juno là tên của một cộng đồng chưa hợp nhất tại Georgia.

source: The code name for the thirteenth release of OpenStack. The design summit took place in Tokyo, Japan. Mitaka is a city in Tokyo.
de: Der Codename für die dreizehnte Version von OpenStack. Der Design Summit fand in Tokio, Japan statt. Mitaka ist eine Stadt in Tokio.
ru: Кодовое имя тринадцатого релиза OpenStack. Саммит разработчиков проходил в Токио, Япония. Митака — город в префектуре Токио.

source: The code name for the twelfth release of OpenStack. The design summit took place in Vancouver, Canada and Liberty is the name of a village in the Canadian province of Saskatchewan.
de: Der Code-Name für das zwölfte Release von OpenStack. Der Design-Summit wurde in Vancouver, Kanada abgehalten und Liberty ist der Name eines Dorfes in der kanadischen Provinz von Saskatchewan.
ru: Кодовое имя двенадцатого релиза OpenStack. Саммит разработчиков проходил в Ванкувере, Канада (Liberty — название деревни в канадской провинции Саскачеван.
vi_vn: Tên mã phiên bản thứ mười hai của OpenStack. Hội nghị thượng đỉnh sẽ được tổ chức tại Vancouver, Canada và Liberty là tên của một ngôi làng thuộc tỉnh Saskatchewan, Canada.

source: The collaboration site for OpenStack.
de: Die Kollaborationsplattform für OpenStack.
ru: Сайт сотрудничества для OpenStack.
vi_vn: Trang cộng tác cho OpenStack.

source: The common agents are L3 (layer 3), DHCP (dynamic host IP addressing), and a plug-in agent.
de: Die üblichen Agenten sind L3 (layer 3), DHCP (dynamic host IP addressing) und ein plug-in Agent.
ru: Общими агентам являются L3 (уровень 3), DHCP (динамическое назначение IP-адресов хостов) и подключаемый агент.

source: The container format of the image. Acceptable formats are ami, ari, aki, bare, docker, ova, and ovf.
ru: Формат контейнера для образа. Доступные форматы: AMI, ARI, AKI, BARE, DOCKER, OVA и OVF.

source: The cooperative threading model used by Python; reduces race conditions and only context switches when specific library calls are made. Each OpenStack service is its own thread.
de: Das kooperative Threading-Modell welches von Python verwendet; reduziert die Race Conditions und macht nur Context Switche, wenn bestimmte Bibliotheksaufrufe gemacht werden. Jeder OpenStack-Dienst ist ein eigener Thread.
ru: Модель кооперативной многопоточности, используемая в Python. Снижает вероятность возникновения состояния гонки и разрешает переключение контекста только при вызове определенных функций из библиотеки. Для каждой службы OpenStack создается свой поток.
vi_vn: Các mô hình kết hợp siêu phân luồng sử dụng bởi Python; làm giảm điều kiện cạnh tranh và chỉ có bối cảnh chuyển mạch khi có thủ tục gọi thư viện cụ thể được thực hiện. Mỗi dịch vụ OpenStack là của riêng chính nó.

source: The current state of a guest VM image.
de: Der derzeitige Status eines Gast-VM-Abbildes.
ru: Текущее состояние образа гостевой виртуальной машины.
vi_vn: Trạng thái hiện tại của guest VM image.

source: The current status of a VM image in Image service, not to be confused with the status of a running instance.
de: Der aktuelle Status eines VM-Abbildes im Abbilddienst, der nicht mit dem Status einer laufenden Instanz verwechselt werden soll.
ru: Текущий статус образа виртуальной машины в службе образов (не путать со статусом выполняемого инстанса).
vi_vn: Trạng thái hiện thời của một image máy ảo trong Image service, tránh nhầm lẫn với trạng thái của một máy ảo đang chạy.

source: The daemon, worker, or service that a client communicates with to access an API. API endpoints can provide any number of services, such as authentication, sales data, performance meters, Compute VM commands, census data, and so on.
de: Der Dämon, der Arbeitnehmer oder der Dienst, mit dem ein Client kommuniziert, um auf eine API zuzugreifen. API-Endpunkte können eine beliebige Anzahl von Diensten wie Authentifizierung, Verkaufsdaten, Leistungszähler, Berechnungs-VM-Befehle, Zähldaten usw. bereitstellen.
ru: Демон, рабочий процесс или служба, к которым обращается клиент, не имеющий доступа к API. Конечная точка API может предоставлять любое количество служб, например, аутентификацию, данные по продажам, метрики производительности, команды для виртуальных машин службы вычислительных ресурсов, данные Census и т.д.
vi_vn: Daemon, worker hoặc dịch vụ mà một client giao tiếp với để truy cập vào một API. Các API endpoint có thể cung cấp bất kỳ dịch vụ nào, như xác thực, dữ liệu bán hàng, các máy đo hiệu suất, các lệnh Compute VM, dữ liệu điều tra dân số và hơn thế nữa.

source: The dashboard is usually deployed through `mod_wsgi <http://code.google.com/p/modwsgi/>`__ in Apache. You can modify the dashboard code to make it suitable for different sites.
de: Das Dashboard wird normalerweise über `mod_wsgi <http://code.google.com/p/modwsgi/>` __ in Apache bereitgestellt. Sie können den Dashboard-Code ändern, damit er für verschiedene Standorte geeignet ist.
ru: Как правило, панель мониторинга развертывается с помощью`mod_wsgi <http://code.google.com/p/modwsgi/>`__ в Apache. Можно изменять код панели, чтобы она подходила для различных сайтов.

source: The default message queue software used by OpenStack.
ru: ПО очереди сообщений, используемое по умолчанию в OpenStack.
vi_vn: Phần mềm truyền tin mặc định được sử dụng bởi OpenStack.

source: The default panel that is displayed when a user accesses the horizon dashboard.
ru: Панель по умолчанию, которая отображается, если пользователь открыл панель управления Horizon.

source: The disk format of the image. Acceptable formats are ami, ari, aki, vhd, vhdx, vmdk, raw, qcow2, vdi, and iso.
ru: Формат диска образа. Доступные форматы: AMI, ARI, AKI, VHD, VHDX, VDMK, RAW, QCOW2, VDI и ISO.

source: The fibre channel protocol tunneled within Ethernet.
de: Das Fibre Channel Protokoll, getunnelt durch Ethernet.
ru: Протокол Fibre Channel поверх протокола Ethernet.
vi_vn: Giao thức fibre channel chạy ngầm trong Ethernet.

source: The following Launchpad Bugs areas are available:
de: Die folgenden Launchpad Bug Areas sind verfügbar:
ru: Доступны следующие области багтрекера Launchpad:
