Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: Users and services can locate other services by using the service catalog, which is managed by the Identity service. As the name implies, a service catalog is a collection of available services in an OpenStack deployment. Each service can have one or many endpoints and each endpoint can be one of three types: admin, internal, or public. In a production environment, different endpoint types might reside on separate networks exposed to different types of users for security reasons. For instance, the public API network might be visible from the Internet so customers can manage their clouds. The admin API network might be restricted to operators within the organization that manages cloud infrastructure. The internal API network might be restricted to the hosts that contain OpenStack services. Also, OpenStack supports multiple regions for scalability. For simplicity, this guide uses the management network for all endpoint types and the default ``RegionOne`` region. Together, regions, services, and endpoints created within the Identity service comprise the service catalog for a deployment. Each OpenStack service in your deployment needs a service entry with corresponding endpoints stored in the Identity service. This can all be done after the Identity service has been installed and configured.
de: Benutzer und Dienste können über den Dienstekatalog, der vom Identitätsdienst verwaltet wird, weitere Dienste finden. Wie der Name schon sagt, ist ein Dienstekatalog eine Sammlung verfügbarer Diensten in einer OpenStack-Implementierung. Jeder Dienst kann einen oder mehrere Endpunkte haben und jeder Endpunkt kann einer von drei Typen sein: admin, internal oder public. In einer Produktionsumgebung können sich verschiedene Endpunkttypen aus Sicherheitsgründen in separaten Netzwerken befinden, die auf verschiedene Benutzertypen begrenzt sind. Beispielsweise kann das öffentliche API-Netzwerk aus dem Internet sichtbar sein, sodass Kunden ihre Clouds verwalten können. Das Admin-API-Netz ist möglicherweise auf Betreiber innerhalb der Organisation beschränkt, die die Cloud-Infrastruktur verwaltet. Das interne API-Netz ist möglicherweise auf die Hosts beschränkt, die OpenStack-Dienste enthalten. Außerdem unterstützt OpenStack mehrere Bereiche für die Skalierbarkeit. Zur Vereinfachung verwendet dieses Handbuch das Verwaltungsnetzwerk für alle Endpunkttypen und die Standardregion ``RegionOne``. Gemeinsam bilden die im Identitätsdienst erstellten Regionen, Dienste und Endpunkte den Dienstekatalog für eine Bereitstellung. Jeder OpenStack-Dienst in Ihrer Bereitstellung benötigt einen Diensteintrag mit entsprechenden Endpunkten, die im Identitätsdienst gespeichert sind. Dies kann alles erfolgen, nachdem der Identitätsdienst installiert und konfiguriert wurde.
ru: Пользователи и службы могут находить другие службы с помощью каталога служб, которым управляет служба идентификации. Как можно догадаться по названию, каталог служб — это набор доступных служб в развертывании OpenStack. Для каждой службы должна существовать одна или несколько точек входа. Точки входа могут быть трех типов: административная, внутренняя или общая. В рабочей среде в целях безопасности точки входа разных типов можно разместить в отдельных сетях, доступных тем или иным пользователям. Например, общую сеть API можно сделать видимой из Интернета, чтобы пользователи могли управлять своими облаками. Доступ к административной сети API можно предоставить только специалистам организации, которые управляют инфраструктурой облака. Доступ ко внутренней сети API можно предоставить только хостам, на которых выполняются службы OpenStack. Кроме того, OpenStack в целях масштабируемости поддерживает несколько регионов. Для упрощения в этом руководстве рассматривается сеть управления для всех типов точек входа и одного региона ``RegionOne``, заданного по умолчанию. Регионы, службы и точки входа, созданные в службе идентификации, вместе составляют каталог служб для развертывания. Для каждой службы OpenStack в вашем развертывании необходимо создать запись службы с соответствующей точкой входа, хранящейся в службе идентификации. Это можно выполнить после установки и настройки службы идентификации.

source: Users can access OpenStack via the web-based user interface implemented by :doc:`Dashboard <get-started-dashboard>`, via `command-line clients <http://docs.openstack.org/cli-reference/>`__ and by issuing API requests through tools like browser plug-ins or :command:`curl`. For applications, `several SDKs <http://developer.openstack.org/#sdk>`__ are available. Ultimately, all these access methods issue REST API calls to the various OpenStack services.
ru: Пользователи могут получать доступ к OpenStack через пользовательский веб-интерфейс, реализованный в виде :doc:`панели управления <get-started-dashboard>`, через `клиенты командной строки <http://docs.openstack.org/cli-reference/>`__ или с помощью создания запросов API из таких инструментов как плагины браузера или команда :command:`curl`. Для приложений доступны `несколько пакетов SDK <http://developer.openstack.org/#sdk>`__. В конечном итоге все эти методы доступа создают вызовы REST API к различным службам OpenStack.

source: Users can set the operating system ID or a ``short-id`` in image properties. For example:
de: Benutzer können die Betriebssystem-ID oder eine `` short-id`` in Bildeigenschaften setzen. Beispielsweise:
ru: Можно задавать идентификатор операционной системы или значение ``short-id``в свойствах образа. Например:

source: Users of Object Storage interact with the service through the proxy server, which in turn looks up the location of the requested data within the ring and returns the results to the user.
ru: Пользователи объектного хранилища взаимодействуют с этой службой через прокси-сервер, который в ответ находит расположение запрошенных данных в кольце и возвращает результат пользователю.
vi_vn: Các người dùng của Object Storage tương tác với dịch vụ thông qua proxy server. Proxy server có nhiệm vụ tìm kiếm địa chỉ của dữ liệu được yêu cầu nằm trên ring và gửi kết quả về người dùng.

source: Utilization of unused compute power from general purpose OpenStack IaaS cloud.
de: Nutzung der unbenutzten Rechenleistung aus der OpenStack-IaaS-Cloud.
ru: Использование незадействованных вычислительных мощностей общего облака OpenStack IaaS.

source: VLAN manager
ru: диспетчер VLAN
vi_vn: Phần tử quản lí VLAN

source: VLAN network
de: VLAN Netzwerk
ru: сеть VLAN
vi_vn: hệ thống mạng VLAN

source: VM Remote Control (VMRC)
ru: Удаленное управление ВМ (VMRC)
vi_vn: Quản lý máy ảo từ xa (VMRC)

source: VM disk (VMDK)
ru: VM диск (VMDK)

source: VM image
de: VM Abbild
ru: VM образ
vi_vn: image máy ảo

source: VM image container format supported by Image service.
de: Vom Abbilddienst unterstütztes VM Abbild Containerformat.
ru: Формат контейнера виртуальной машины, поддерживаемый службой образов (Image).
vi_vn: Định dạng container image máy ảo được hỗ trợ bởi Image service.

source: VMware NSX Neutron plug-in
ru: плангин VMware NSX службы Neutron

source: VMwareAPI for VMware
de: VMwareAPI für VMware
ru: VMwareAPI для VMware.

source: VNC proxy
ru: прокси-сервер VNC

source: Various periodic processes
de: Verschiedene periodische Prozesse
ru: Различные периодические процессы

source: Various repository types are supported including normal file systems (or any filesystem mounted on the glance-api controller node), Object Storage, RADOS block devices, VMware datastore, and HTTP. Note that some repositories will only support read-only usage.
de: Es werden verschiedene Repository-Typen unterstützt, einschließlich normaler Dateisysteme (jedes auf dem glance-api Controller Knoten gemountete Dateisystem), Objekt Storage, RADOS Block Devices, VMware Datastore und HTTP. Beachten Sie, dass manche Repositories nur Lesezugriff unterstützen.
ru: Поддерживаются различные типы репозиториев, включая обычные файловые системы (или любые файловые системы, смонтированные на управляющем узле glance-api), хранилище объектов, блочные устройства RADOS и HTTP. Обратите внимание, что некоторые типы репозиториев поддерживают лишь доступ только для чтения.

source: Verify that transfer list is now empty and that the volume is again available for transfer:
de: Überprüfen Sie, dass die Übertragungsliste leer ist, und dass der Datenträger erneut für die Übertragung verfügbar ist:
ru: Убедитесь, что список переносов теперь пуст и том снова доступен для переноса:

source: View pending transfers:
de: Anstehende Transaktionen ansehen:
ru: Просмотрите список переносов в состоянии ожидания:

source: Virtual Central Processing Unit (vCPU)
ru: Виртуальный центральный процессор (vCPU)
vi_vn: Bộ Xử lý Trung Tâm Ảo (vCPU)

source: Virtual Disk Image (VDI)
de: Virtuelles Festplattenabbild (VDI)
ru: Образ виртуального диска (VDI)
vi_vn: Ảnh ảo đĩa.

source: Virtual Hard Disk (VHD)
de: Virtuelle Festplatte (VHD)
ru: виртуальный жесткий диск (VHD)
vi_vn: Ổ cứng ảo (VHD)

source: Virtual Network InterFace (VIF)
ru: Виртуальный сетевой интерфейс (VIF)
vi_vn: Thiết bị mạng ảo (VIF)

source: Virtual network type that uses neither VLANs nor tunnels to segregate project traffic. Each flat network typically requires a separate underlying physical interface defined by bridge mappings. However, a flat network can contain multiple subnets.
de: Virtueller Netzwerktyp, der weder VLANs noch Tunnel verwendet, um den Projektverkehr zu trennen. Jedes Flachnetzwerk erfordert typischerweise eine separate zugrunde liegende physikalische Schnittstelle, die durch Brückenabbildungen definiert ist. Ein flaches Netzwerk kann jedoch mehrere Subnetze enthalten.
ru: Тип виртуальной сети, в которой не используются ни VLAN, ни туннели для разделения трафика проекта. Как правило, для каждой одноуровневой сети требуется отдельный физический интерфейс, реализованный с помощью моста. Однако одноуровневая сеть может состоять из нескольких подсетей.

source: Virtualization API library used by OpenStack to interact with many of its supported hypervisors.
de: Virtualisierungs-API-Bibliothek, die von OpenStack verwendet wird, um mit vielen seiner unterstützten Hypervisoren zu interagieren.
ru: Библиотека API виртуализации, используемая OpenStack, чтобы взаимодействовать с большинством поддерживаемых гипервизоров.
vi_vn: Thư viện ảo hoát API được sử dụng bởi OpenStack để tương tác với các hypervisor được hỗ trợ.

source: Volume API
de: Datenträger API
ru: том API

source: Volume that does not save the changes made to it and reverts to its original state when the current user relinquishes control.
de: Eine Festplatte, die keine Änderungen speichert und in ihren Originalzustand zurücksetzt wird, wenn der Benutzer die Kontrolle aufgibt.
ru: Том, который не сохраняет внесенные изменения и возвращается в исходное состояние, когда текущий пользователь отказывается от его управлением.
vi_vn: Ổ lưu trữ không lưu lại các thay đổi được thực hiện trên nó và chuyển trở lại trạng thái ban đầu thì người dùng hiện tại từ bỏ quyền kiểm soát.

source: WSGI middleware
ru: Промежуточное ПО WSGI

source: WSGI middleware component of Object Storage that serves container data as a static web page.
ru: Компонент промежуточного ПО WSGI объектного хранилища, который предоставляет данные контейнера как статическую веб-страницу.
vi_vn: Thành phần middleware WSGI của Object Storage đưa ra dữ liệu container dưới dạng một trang web tĩnh.

source: What's next
de: Was kommt als nächstes
ru: Далее

source: When extending an LVM volume with a snapshot, the volume will be deactivated. The reactivation is automatic unless ``auto_activation_volume_list`` is defined in ``lvm.conf``. See ``lvm.conf`` for more information.
de: Wenn Sie ein LVM-Datenträger mit einer Schattenkopie erweitern, wird der Datenträger deaktiviert. Die Reaktivierung erfolgt automatisch, wenn nicht `` auto_activation_volume_list`` in `` lvm.conf`` definiert ist. Weitere Informationen finden Sie unter `` lvm.conf``.
ru: При расширении тома LVM с помощью снимка том деактивируется. Повторная активация выполняется автоматически, за исключением того случая, когда для параметра ``auto_activation_volume_list`` задано значение в файле ``lvm.conf``. Подробнее см. ``lvm.conf``.

source: When the volume is fully deleted, it disappears from the list of volumes:
de: Wenn der Datenträger vollständig gelöscht wurde, verschwindet er aus der Liste der Datenträger:
ru: После полного удаления том исчезает из списка:

source: When viewing a list of images, you can also use ``grep`` to filter the list, as follows:
de: Wenn Sie eine Liste von Abbildern anzeigen, können Sie auch ``grep`` verwenden, um die Liste wie folgt zu filtern:
ru: При просмотре список образов можно фильтровать с помощью команды ``grep``:

source: When you are prompted for an OpenStack password, enter the password for the user who downloaded the ``PROJECT-openrc.sh`` file.
de: Wenn Sie aufgefordert werden, ein OpenStack-Kennwort einzugeben, geben Sie das Kennwort für den Benutzer ein, der die Datei ``PROJECT-openrc.sh`` heruntergeladen hat.
ru: После отображения запроса на ввод пароля OpenStack укажите пароль для пользователя, который загрузил файл ``ПРОЕКТ-openrc.sh``.

source: When you run OpenStack client commands, you can override some environment variable settings by using the options that are listed at the end of the ``help`` output of the various client commands. For example, you can override the ``OS_PASSWORD`` setting in the ``PROJECT-openrc.sh`` file by specifying a password on a :command:`openstack` command, as follows:
de: Wenn Sie OpenStack-Client-Befehle ausführen, können Sie einige Umgebungsvariableneinstellungen überschreiben, indem Sie die Optionen verwenden, die am Ende der ``help`` Ausgabe der verschiedenen Client-Befehle aufgelistet werden. Sie können beispielsweise die ``OS_PASSWORD`-Einstellung in der ``PROJECT-openrc.sh`` -Datei überschreiben, indem Sie ein Passwort wie folgt eingeben: command: `openstack`
ru: При выполнении команд клиента OpenStack можно изменить некоторые значения переменных среды, воспользовавшись параметрами, которые перечислены в конце вывода команды ``help`` для различных клиентов. Например, можно переписать значение переменной ``OS_PASSWORD`` в файле ``ПРОЕКТ-openrc.sh``, указав пароль с помощью команды :command:`openstack`, как показано ниже:

source: When you source the file, environment variables are set for your current shell. The variables enable the OpenStack client commands to communicate with the OpenStack services that run in the cloud.
de: Wenn Sie die Datei sourcen, werden Umgebungsvariablen für Ihre aktuelle Shell festgelegt. Die Variablen ermöglichen es den OpenStack-Client-Befehlen, mit den in der Cloud ausgeführten OpenStack-Diensten zu kommunizieren.
ru: Выбрав файл среды, вы задаете значения переменных для текущей оболочки. Эти переменные позволяют командам клиента OpenStack взаимодействовать со службами OpenStack, выполняемыми в облаке.

source: When you use OpenStack with VMware vCenter Server, you need to specify the ``vmware_disktype`` and ``vmware_adaptertype`` properties with :command:`glance image-create`. Also, we recommend that you set the ``hypervisor_type="vmware"`` property. For more information, see `Images with VMware vSphere <http://docs.openstack.org/newton/config-reference/compute/hypervisor-vmware.html#images-with-vmware-vsphere>`_ in the OpenStack Configuration Reference.
ru: При использовании OpenStack совместно с VMware vCenter Server необходимо задать значения свойств ``vmware_disktype`` и ``vmware_adaptertype`` с помощью команды `glance image-create`. Кроме того, рекомендуем задавать свойство ``hypervisor_type="vmware"``. Подробнее см. раздел `Образы с VMware vSphere <http://docs.openstack.org/newton/config-reference/compute/hypervisor-vmware.html#images-with-vmware-vsphere>`_ в Руководстве по настройке OpenStack.

source: Where ``PASSWORD`` is your password.
de: ``PASSWORD`` ist Ihr Passwort.
ru: где ``PASSWORD`` — это ваш пароль.

source: While logged in as the volume donor, list the available volumes:
de: Wenn Sie als Datenträgerspender angemeldet sind, geben Sie die verfügbaren Datenträger an:
ru: Войдите в систему в роли отправителя тома и отобразите список доступных томов:

source: While the ``auth_key`` property is visible in the output of ``openstack volume transfer request create VOLUME_ID``, it will not be available in subsequent ``openstack volume transfer request show TRANSFER_ID`` command.
de: Während die Eigenschaft ``auth_key`` in der Ausgabe von ``openstack volume transfer request create VOLUME_ID`` sichtbar ist, steht sie im folgenden ``openstack volume transfer request show TRANSFER_ID``-Befehl nicht zur Verfügung.
ru: Хотя значение свойства ``auth_key``отображается в выводе команды ``openstack volume transfer request create ID_ТОМА``, оно будет недоступно в следующей команде ``openstack volume transfer request show ID_ПЕРЕНОСА``.

source: Within RabbitMQ and Compute, it is the messaging interface that is used by the scheduler service to receive capability messages from the compute, volume, and network nodes.
de: Innerhalb von RabbitMQ und Compute ist es die Messaging-Schnittstelle, die vom Scheduler-Dienst verwendet wird, um Leistungsdaten von den Compute-, Volume- und Netzwerkknoten zu empfangen.
ru: Интерфейс обмена сообщениями в RabbitMQ и Compute, который используется службой планировщика для получения сообщений о состоянии от вычислительных и сетевых узлов, а также томов.
vi_vn: Trong RabbitMQ và Compute, đó là giao diện tin nhắn được sử dụng bởi các dịch vụ lịch trình để nhận các tin nhắn có khả năng từ các node compute, volume, và network .

source: Work in progress - expected for the Mitaka release
de: In Arbeit - erwartet zum Mitaka Release
ru: В процессе реализации — ожидается в выпуске Mitaka

source: Workflow service
de: Arbeitsablaufdienst (mistral)
ru: Служба потока операций

source: Workflow service (mistral)
de: Workflow Dienst (mistral)
ru: Служба потока операций (Mistral)

source: Workflow service for OpenStack cloud.
de: Arbeitsablaufdienst für OpenStack Cloud.
ru: Служба потока операций для облака OpenStack.

source: Xen Cloud Platform (XCP)
ru: Облачная платформа Xen (XCP)

source: Xen is a hypervisor using a microkernel design, providing services that allow multiple computer operating systems to execute on the same computer hardware concurrently.
ru: Xen — это гипервизор, использующий дизайн микроядра, предоставляющий возможность одновременного запуска множества операционных систем на одном аппаратном обеспечении.
vi_vn: Xen là 1 công cụ ảo hóa sử dụng thiết kế vi nhân, cung cấp các dịch vụ mà chúng cho phép nhiều máy tính cũng như nhiều hệ điều hành hoạt động cùng một lúc trên cùng một con máy thực.

source: XenAPI for XenServer/XCP
de: XenAPI für XenServer/XCP
ru: XenAPI для XenServer/XCP;

source: You are not prompted for the password with this method. The password lives in clear text format in the ``PROJECT-openrc.sh`` file. Restrict the permissions on this file to avoid security problems. You can also remove the ``OS_PASSWORD`` variable from the file, and use the :option:`--password` parameter with OpenStack client commands instead.
ru: При использовании этого метода не запрашивается пароль. Пароль доступен в формате обычного текста в файле ``ПРОЕКТ-openrc.sh``. Ограничьте права доступа к этому файлу, чтобы избежать проблем с безопасностью. Кроме того, можно удалить переменную ``OS_PASSWORD`` из файла и задать параметр :option:`--password` с помощью команд клиента OpenStack.

source: You can install pip and use it to manage client installation:
de: Sie können pip installieren und es zur Verwaltung der Client-Installation verwenden:
ru: Можно установить pip и использовать его для управления установкой клиентов:

source: You can run the commands from the command line, or include the commands within scripts to automate tasks. If you provide OpenStack credentials, such as your user name and password, you can run these commands on any computer.
de: Sie können die Befehle von der Befehlszeile aus ausführen oder die Befehle in Skripts enthalten, um Aufgaben zu automatisieren. Wenn Sie OpenStack-Anmeldeinformationen wie Ihren Benutzernamen und Ihr Kennwort bereitstellen, können Sie diese Befehle auf jedem beliebigen Computer ausführen.
ru: Команды можно выполнять из командной строки или добавлять их в скрипты, чтобы автоматизировать выполнение задач. С помощью учетных данных OpenStack (например, имя пользователя и пароль) эти команды можно выполнять на любом компьютере.

source: You can show basic statistics on resource usage for hosts and instances.
de: Sie können grundlegende Statistiken zur Ressourcenverwendung von Hosts und Instanzen anzeigen.
ru: Позволяет отобразить базовую статистику по использованию ресурсов для хостов и инстансов.

source: You can transfer a volume from one owner to another by using the :command:`cinder transfer*` commands. The volume donor, or original owner, creates a transfer request and sends the created transfer ID and authorization key to the volume recipient. The volume recipient, or new owner, accepts the transfer by using the ID and key.
ru: Можно перенести том от одного владельца другому с помощью команды `cinder transfer*`. Отправитель тома (исходный владелец) создает запрос на перенос, а затем отправляет ID переноса и ключ авторизации получателю тома. Получатель тома (новый владелец) принимает перенос, используя ID и ключ.

source: You can upload ISO images to the Image service (glance). You can subsequently boot an ISO image using Compute.
de: Sie können ISO-Images zum Abbild-Dienst (glance) hochladen. Mit Compute können Sie anschließend ein ISO-Image starten.
ru: Образы ISO можно передавать в службу образов (Glance). Затем образ ISO можно загрузить с помощью службы вычислительных ресурсов.

source: You can upload images through the ``glance`` client or the Image service API. You can use the ``nova`` client for the image management. The latter provides mechanisms to list and delete images, set and delete image metadata, and create images of a running instance or snapshot and backup types.
de: Sie können Abbilder über den ``glance`` Client oder die Image Service API hochladen. Sie können den ``nova`` Client für die Abbildverwaltung verwenden. Letztere bietet Mechanismen zum Auflisten und Löschen von Abbildern, zum Festlegen und Löschen von Abbildmetadaten sowie zum Erstellen von Bildern einer laufenden Instanz oder eines Snapshots und von Sicherungstypen.
ru: Можно загружать образы с помощью клиента ``glance`` или API службы образов. Для управления образами можно использовать клиент ``nova``, который позволяет отображать списки образов и удалять их, настраивать и удалять метаданные образов, а также создавать образы запущенного инстанса, его моментальные и резервные копии.

source: You can use the unified ``openstack`` command (**python-openstackclient**) for the most of OpenStack services. For more information, see `OpenStackClient document <http://docs.openstack.org/developer/python-openstackclient/>`_.
ru: Можно использовать универсальную команду ``openstack`` (**python-openstackclient**) для большинства служб OpenStack. Подробнее см. в `документации OpenStackClient <http://docs.openstack.org/developer/python-openstackclient/>`_.
