Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: Released as open source by NASA in 2010 and is the basis for Compute.
de: Seit 2008 als Open Source von der NASA veröffentlicht und ist die Basis für Compute.
ru: Платформа с открытым исходным кодом, выпущенная NASA в 2010 г. Стала основой службы вычислительных ресурсов (Compute).
vi_vn: Được phát hành dưới dạng mã nguồn mở bởi NASA vào năm 2010 và là nền tảng của Compute.

source: Released as open source by Rackspace in 2010; the basis for Object Storage.
ru: служба хранения файлов с открытым исходным кодом, созданная компанией Rackspace в 2010 г. Стала основой для службы объектного хранилища OpenStack.
vi_vn: Được phát hành dưới dạng mã nguồn mở bởi Rackspace vào năm 2010; nền tảng của Object Storage.

source: Reliable, Autonomic Distributed Object Store
ru: Надежное, автоматически распределенное хранилище объектов

source: Remote Procedure Call (RPC)
ru: Удаленный вызов процедуры (RPC)
vi_vn: Thiết lập phương thức Remote (RPC)

source: Removes all data on the server and replaces it with the specified image. Server ID and IP addresses remain the same.
ru: Удаляет все данные на сервере и заменяет их на указанный образ. ID и IP-адрес сервера остаются без изменений.
vi_vn: Xóa toàn bộ dữ liệu trên server và thay thế bằng một image cụ thể. ID và địa chỉ IP của server được giữ nguyên.

source: Represents a virtual, isolated OSI layer-2 subnet in Networking.
ru: Соответствует виртуальной изолированной подсети уровня 2 модели OSI в службе Networking.
vi_vn: Đại diện cho một subnet OSI layer-2 ảo và bị cô lập trong Networking.

source: Resize a volume
de: Ändern Sie die Größe eines Datenträgers
ru: Изменение размера тома

source: Resize the volume by passing the volume ID and the new size (a value greater than the old one) as parameters:
de: Ändern Sie die Grösse des Datenträgers, indem Sie die Datenträger-ID und die neue Größe (ein größerer Wert als der alte) als Parameter übergeben:
ru: Измените размер тома, указав его идентификатор и новый размер (значение превышает прежнее) в виде параметров:

source: Responsible for managing Shared File System Service devices, specifically the back-end devices.
de: Verantwortlich für die Verwaltung von Shared File System Service Geräten, speziell die Back-End-Geräte.
ru: Отвечает за управление устройствами службы общих файловых систем, в частности устройствами сервера.

source: Role Based Access Control (RBAC)
ru: управление доступом на основе ролей (RBAC)
vi_vn: Kiểm soát quyền truy cập dựa trên vai trò (RBAC)

source: Routes information between the Block Storage processes.
de: Leitet Informationen zwischen den Blockspeicherprozessen.
ru: Перенаправляет информацию между процессами службы хранилища блоков.

source: Routes information between the Shared File Systems processes.
de: Verteilt die Informationen zwischen den Prozessen der Verteilten Dateisysteme.
ru: Маршрутизирует информацию между процессами в службе общих файловых систем.

source: Run the following command to discover the version number for a client:
de: Mit dem folgenden Kommando finden Sie die Versionsnummer eines Clients:
ru: Выполните следующую команду, чтобы просмотреть версию клиента:

source: Runs automated tests against the core OpenStack API; written in Rails.
ru: Выполняет автоматизированные тесты по отношению к основному API OpenStack. Написан на на Ruby on Rails.
vi_vn: Chạy các bài thử nghiệm tự động đối với API lõi của OpenStack; được viết bằng ngôn ngữ Rails.

source: Runs on a central management server and determines when to fire alarms. The alarms are generated based on defined rules against events, which are captured by the Telemetry Data Collection service's notification agents.
de: Läuft auf einem zentralen Verwaltungsserver und legt fest, wann Alarme ausgelöst werden sollen. Die Alarme werden auf der Grundlage definierter Regeln für Ereignisse generiert, die von den Benachrichtigungsagenten des Telemetry Data Collection Service erfasst werden.
ru: Выполняется на одном или нескольких серверах центрального управления и определяет причину оповещения. Оповещения создаются на базе определенных правил касательно событий, которые записываются агентами уведомлений (служба сбора данных телеметрии).

source: Runs on a central management server to poll for resource utilization statistics for resources not tied to instances or compute nodes. Multiple agents can be started to scale service horizontally.
de: Läuft auf einem zwentralen Management_Server, um Verwendungsstatistiken von Ressourcen abzurufen, die nicht an Instanzen oder Compute Knoten gebunden sind. Zum horizontalen Skalieren können multiple Agenten gestartet werden.
ru: Выполняется на центральном сервере управления, чтобы запрашивать статистику использования для ресурсов без привязки к экземплярам или узлам вычислений. Можно запускать несколько агентов, чтобы горизонтально масштабировать службу.

source: Runs on a central management server(s) and consumes messages from the message queue(s) to build event and metering data.
de: Läuft auf einem zentralen Management-Server und verarbeitet Nachrichten der Warteschlange zur Erstellung von Ereignis- und Messdaten.
ru: Выполняется на центральных серверах управления и принимает сообщения из очередей сообщений, чтобы создавать данные событий и измерений.

source: Runs on central management server(s) and dispatches collected telemetry data to a data store or external consumer without modification.
de: Läuft auf zentralen Management-Servern und versendet gesammelte Telemetriedaten in einen Datenspeicher oder externen Verbraucher ohne Modifikation.
ru: Выполняется на серверах центрального управления и без изменений отправляет собранные данные телеметрии в хранилище или внешнему потребителю.

source: Runs on each compute node and polls for resource utilization statistics. There may be other types of agents in the future, but for now our focus is creating the compute agent.
de: Läuft auf jedem Compute Knoten und ruft Ressourcenverwendungsstatistiken ab. Es gibt ggf. zukünftig weiter Typen von Agenten, aber derzeit liegt der Fokus auf der Erstellung des Compute Agenten.
ru: Выполняется на каждом узле вычисления и запрашивает статистику использования ресурсов. В дальнейшем могут появляться другие типы агентов, но сейчас мы остановимся на создании агента для вычислений.

source: Runs on one or more central management servers to allow alarms to be set based on the threshold evaluation for a collection of samples.
de: Läuft auf einem oder mehreren zentralen Verwaltungsservern aus, um basierend auf der Schwellenwertauswertung für eine Sammlung von Proben Alarme einzustellen.
ru: Выполняется на одном или нескольких серверах центрального управления , чтобы оповещения можно было задавать на основе оценки порогового значения для коллекции образцов.

source: Runs on one or more central management servers to determine when alarms fire due to the associated statistic trend crossing a threshold over a sliding time window.
de: Läuft auf einem oder mehreren zentralen Verwaltungsservern, um festzustellen, wann Alarme aufgrund des zugehörigen statistischen Trends einen Grenzwert über ein Zeitfenster auftreten.
ru: Выполняется на одном или нескольких серверах центрального управления. Определяет оповещения, которые переданы из-за того, что превышено пороговое значение для связанной статистической тенденции в рамках скользящего временного окна.

source: Runs on one or more central management servers to provide access to the alarm information stored in the data store.
de: Läuft auf einem oder mehreren zentralen Verwaltungsservern, um Zugriff auf die im Datenspeicher gespeicherten Alarminformationen zu gewähren.
ru: Выполняется на одном или нескольких серверах центрального управления, чтобы обеспечить доступ к информации об оповещениях в хранилище данных.

source: Runs on one or more central management servers to provide data access from the data store.
de: Läuft auf einem oder mehreren zentralen Verwaltungsservern, um Datenzugriff aus dem Datenspeicher bereitzustellen.
ru: Выполняется на одном или нескольких центральных серверах управления, чтобы обеспечить доступ к данным из хранилища.

source: Runs on the host, and receives messages from guest instances that want to update information on the host.
de: Wird auf dem Host ausgeführt und empfängt Meldungen von Gastinstanzen, die Informationen auf dem Host aktualisieren möchten.
ru: Выполняется на хосте и получает сообщения от гостевых экземпляров, для которых необходимо обновить информацию на хосте.

source: Runs operating systems and provides scratch space
de: Führt Betriebssysteme aus und stellt Arbeitsspeicher zur Verfügung
ru: Используется для запуска операционной системы и предоставляет область временных файлов

source: Runs within the guest instance. Manages and performs operations on the database itself.
de: Läuft innerhalb der Guest-Instanz. Verwaltet und führt Operationen auf der Datenbank selbst durch.
ru: Выполняется в гостевом экземпляре. Управляет базой данных и ее внутренними операциями.

source: SAML assertion
ru: утверждение SAML

source: SINA standard that defines a RESTful API for managing objects in the cloud, currently unsupported in OpenStack.
de: SINA-Standard, der eine RESTful-API für die Verwaltung von Objekten in der Cloud definiert, die derzeit nicht in OpenStack unterstützt wird.
ru: Стандарт SINA, который определяет RESTful API для управления объектами в облаке. В настоящее время не поддерживается в OpenStack.
vi_vn: Chuẩn SINA nhằm định rõ một RESTful API để quản lý các object trong cloud, hiện không được hỗ trợ trong OpenStack.

source: SNAPSHOT
ru: СНИМОК

source: SPICE provides remote desktop access to guest virtual machines. It is an alternative to VNC. SPICE is supported by OpenStack.
ru: С помощью протокола SPICE обеспечивается доступ удаленным настольным компьютерам к гостевым виртуальным машинам. Является альтернативой VNC и поддерживается OpenStack.

source: SQL database
de: SQL Datenbank
ru: База данных SQL

source: Saving ``OS_PASSWORD`` in plain text may bring a security risk. You should protect the file or not save ``OS_PASSWORD`` into the file in the production environment.
de: Das Speichern von ``OS_PASSWORD`` im Klartext kann ein Sicherheitsrisiko mit sich bringen. Sie sollten die Datei schützen oder nicht ``OS_PASSWORD`` in die Datei in der Produktionsumgebung speichern.
ru: Сохранение значения переменной ``OS_PASSWORD`` в виде обычного текста может нести угрозу безопасности. Необходимо защитить файл или не сохранять переменную ``OS_PASSWORD`` в этом файле для рабочей среды.

source: Schedules and routes requests to the appropriate share service. The scheduler uses configurable filters and weighers to route requests. The Filter Scheduler is the default and enables filters on things like Capacity, Availability Zone, Share Types, and Capabilities as well as custom filters.
de: Plant und leitet Anfragen an den entsprechenden Share Service weiter. Der Scheduler verwendet konfigurierbare Filter und Gewichtungen, um Anfragen weiterzuleiten. Der Filter-Scheduler ist die Standardeinstellung und aktiviert Filter auf Sachen wie Kapazität, Verfügbarkeitszone, Freigabearten und Fähigkeiten sowie benutzerdefinierte Filter.
ru: Планирует и маршрутизирует запросы в соответствующую общую службу. Планировщик использует настраиваемые фильтры и распределители, чтобы маршрутизировать запрос. Планировщик фильтров является планировщиком по умолчанию и включает такие фильтры, как "Емкость", "Зона доступности", "Типы общего доступа" и "Возможности", а также настраиваемые фильтры.

source: Script that initializes the building of the ring file, takes daemon names as parameter and offers commands. Documented in http://docs.openstack.org/developer/swift/admin_guide.html#managing-services.
ru: Скрипт, инициализирующий сборку файла кольца, принимает имена демонов в качестве параметров и предлагает команды. Подробнее http://docs.openstack.org/developer/swift/admin_guide.html#managing-services.

source: See API endpoint.
de: Siehe API Endpunkt.
ru: См. точка входа API.
vi_vn: Xem API endpoint.

source: Selects the optimal storage provider node on which to create the volume. A similar component to the ``nova-scheduler``.
de: Wählt den optimalen Speicheranbieterknoten aus, auf dem der Datenträger erstellt werden soll. Ein ähnlicher Bestandteil des ``nova-scheduler``.
ru: Выбирает оптимальный узел поставщика хранилища, на котором будет создан том. Похож на компонент ``nova-scheduler``.

source: Send the volume transfer ID and authorization key to the new owner (for example, by email).
de: Senden Sie die Datentransfer-ID und den Autorisierungsschlüssel an den neuen Eigentümer (z. B. per E-Mail).
ru: Отправьте ID переноса тома и ключ авторизации новому владельцу (например, по электронной почте).

source: Server
ru: Сервер

source: Service
de: Dienst
ru: Служба

source: Service Level Agreement (SLA)
ru: Соглашение об уровне обслуживания (SLA)

source: Set environment variables using the OpenStack RC file
de: Legen Sie Umgebungsvariablen mithilfe der OpenStack RC-Datei fest
ru: Настройка переменных среды с помощью RC-файла OpenStack

source: Set of bits that make up a single character; there are usually 8 bits to a byte.
de: Satz von Bits, die ein einzelnes Zeichen bilden; Es gibt normalerweise 8 Bits zu einem Byte.
ru: Набор битов, образующих один символ; обычно в байте 8 бит.
vi_vn: Tập các bit tạo thành một ký tự; thường thì 1 byte có 8 bits.

source: Setting for the Compute RabbitMQ message delivery mode; can be set to either transient or persistent.
de: Einstellung für den Compute RabbitMQ Nachrichtenliefermodus; kann temporär oder fest gesetzt werden.
ru: Настройка режима доставки сообщений RabbitMQ службой вычислительных ресурсов: временный или постоянный.
vi_vn: Tùy chỉnh cho chế độ vận chuyển tin của Compute RabbitMQ; có thể được đặt ở chế độ liên tục hoặc không liên tục.

source: Shared File Systems API
ru: API службы общих файловых систем

source: Shared File Systems service
de: Verteilter Dateisystemdienst (manila)
ru: Служба общих файловых систем

source: Shared File Systems service (manila)
ru: Служба общих файловых систем (manila)

source: Shared File Systems service overview
de: Übersicht Verteilter Dateisystemdienst
ru: Обзор службы общих файловых систем

source: Show host usage statistics
de: Zeige Hostverwendungsstatistiken
ru: Отображает статистические данные использования хостов

source: Show information for your volume:
de: Zeige Informationen über Ihren Datenträger:
ru: Отобразите сведения о томе:

source: Show instance usage statistics
de: Instanz-Verwendungsstatistiken anzeigen
ru: Показать статистику использования инстанса

source: Show usage statistics for hosts and instances
de: Verwendungsstatistiken für Hosts und Instanzen anzeigen
ru: Отображает статистические данные использования для хостов и инстансов

source: Similar to :option:`--location` in usage, but indicates that the image server should immediately copy the data and store it in its configured image store.
ru: Похож на параметр `--location`, за тем отличием, что сервер образов должен немедленно скопировать данные образа и сохранить их в настроенном хранилище образов.

source: Similar to the ``nova-compute`` service, accepts networking tasks from the queue and manipulates the network. Performs tasks such as setting up bridging interfaces or changing IPtables rules.
ru: Аналогичен службе ``nova-compute``, принимает сетевые задачи из очереди и управляет сетью. Настраивает мостовые интерфейсы или изменяет правила IPtables.

source: Simple Cloud Identity Management (SCIM)
ru: Простое управления идентификацией в облаках (SCIM)
vi_vn: Trình quản lý Cloud Identity Đơn giản (SCIM)

source: Simple Protocol for Independent Computing Environments (SPICE)
ru: простой протокол для независимой вычислительной среды (SPICE)

source: Since the installation process compiles source files, this requires the related Python development package for your operating system and distribution.
de: Da der Installationsprozess Quelldateien kompiliert, benötigt dies das zugehörige Python-Entwicklungspaket für Ihr Betriebssystem und die Distribution.
ru: Поскольку в процессе установки компилируются исходные файлы, необходим соответствующий пакет разработки Python для вашей операционной системы и дистрибутива.

source: Single-root I/O Virtualization (SR-IOV)
ru: виртуализация ввода-вывода с единым корнем (SR-IOV)

source: Sizing based on need
de: Bemessungen nach Bedarf
ru: Размер устройства определяется потребностями

source: Sizings based on need
de: Bemessungen nach Bedarf
ru: Размер устройства определяется потребностями

source: Snapshot to modify (name or ID)
de: Schattenkopie zu modifizieren (name or ID)
ru: Изменяемый снимок (имя или ID)

source: Soft limit on the amount of network traffic a Compute VM instance can send and receive.
ru: Мягкое ограничение объема сетевого трафика, которые может отправлять и принимать инстанс ВМ службы вычислительных ресурсов.
vi_vn: Giới hạn mềm về số lượng các lưu lượng mạng mà một máy ảo Compute có thể gửi và nhận.

source: Software Development Lifecycle Automation service
ru: служба автоматизации жизненного цикла разработки программного обеспечения

source: Software component providing the actual implementation for Networking APIs, or for Compute APIs, depending on the context.
ru: Компонент программного обеспечения, обеспечивающий текущую реализацию интерфейсов API службы Networking или службы Compute (в зависимости от контекста).
vi_vn: Bộ phận phần mềm cung cấp việc thực hiện thực tế cho các Quantum APIs hoặc cho các Compute API, tùy ngữ cảnh.

source: Software programs used to protect sensitive information and prevent it from leaking outside a network boundary through the detection and denying of the data transportation.
de: Software, die zum Schutz sensibler Informationen verwendet wird und durch aufspüren und verhindern des Datentransports dafür sorgt, dass diese Netzbegrenzungen nicht verlassen.
ru: Программы, которые используются для защиты важной информации и предотвращения ее утечки за пределы сети с помощью обнаружения и отклонения передачи данных.

source: Software that arbitrates and controls VM access to the actual underlying hardware.
de: Software, die den VM-Zugriff auf die tatsächlich zugrunde liegende Hardware verteilt und steuert.
ru: Программное обеспечение, управляющее доступом виртуальной машины к фактическому базовому оборудованию.
vi_vn: Phần mềm có tác dụng điều đình và kiểm soát truy cập của VM đến các phần cứng cơ bản thật.

source: Software that enables multiple VMs to share a single physical NIC within Compute.
de: Software, die es mehreren VMs ermöglicht, eine einzelne physische NIC innerhalb von Compute zu teilen.
ru: Программное обеспечение, которое позволяет нескольким виртуальным машинам совместно использовать один физический сетевой адаптер в службе вычислительных ресурсов.
vi_vn: Phần mềm cho phép nhiều máy ảo chia sẻ chung một card mạng (NIC) vật lý trong Compute.

source: Software that runs on a host or node and provides the features and functions of a hardware-based network switch.
de: Software, die auf einem Host oder Knoten läuft und die sie Funktionen eines Hardware-basierten Netzwerk-Switches bereitstellt.
ru: Программное обеспечение, которое работает на конечном устройстве или узле и предоставляет возможности и функции аппаратного сетевого коммуникатора
vi_vn: Phần mềm chạy trên một host hoặc một node, cung cấp các chức năng và tính năng của một switch mạng vật lí.

source: SolidFire Volume Driver
ru: Драйвер диска SolidFire

source: Some tips:
de: Einige Tipps:
ru: Некоторые практические советы:
vi_vn: Một số mẹo:

source: Something you must be aware of before proceeding.
de: Etwas, dass Sie zur Kenntnis nehmen müssen, bevor Sie fortfahren.
ru: Информация, которую необходимо знать прежде, чем продолжить.

source: Special project that contains all services that are listed in the catalog.
ru: специальный проект, который содержит все службы, перечисленные в каталоге.

source: Specialized microprocessor for incorporating cryptographic keys into devices for authenticating and securing a hardware platform.
ru: Специализированный микропроцессор для хранения криптографических ключей в устройствах. Предназначен для аутентификации и защиты аппаратных средств.

source: Specification for managing identity in the cloud, currently unsupported by OpenStack.
ru: Спецификация для управления идентификацией в облаках. В данный момент не поддерживается в OpenStack.
vi_vn: Đặc điểm kỹ thuật dùng để quản lý identity của cloud, hiện không được hỗ trợ bởi OpenStack.

source: Specifies additional requirements when Compute determines where to start a new instance. Examples include a minimum amount of network bandwidth or a GPU.
de: Gibt zusätzliche Anforderungen an, wenn Compute bestimmt, wo eine neue Instanz gestartet werden soll. Beispiele umfassen eine minimale Anzahl an Netzwerkbandbreite oder GPU.
ru: Указывает дополнительные требования, используемые службой Compute при определении того, где создать новый инстанс. Например, можно задать минимальную пропускную способность сети или графический процессор (GPU).
vi_vn: Xác định rõ các yêu cầu cần thêm khi Compute quyết định sẽ khởi động một instance mởi ở đâu. Ví dụ bao gồm một lượng băng thông mạng nhất định hoặc một GPU.

source: Specifies the authentication source used by Image service or Identity. In the Database service, it refers to the extensions implemented for a data store.
ru: Указывает источник аутентификации, используемый службой идентификации или службой образов. В службе базы данных этот термин относится к расширениям, реализованным для хранилища данных.

source: Standard for packaging VM images. Supported in OpenStack.
ru: Стандарт для упаковки образов ВМ. Поддерживается в OpenStack.
vi_vn: Chuẩn đóng gói các VM image. Được hỗ trợ bởi OpenStack

source: Storage concepts
de: Storage Konzepte
ru: Концепции хранения данных

source: Storage protocol similar in concept to TCP/IP; encapsulates SCSI commands and data.
de: Speicherprotokoll ähnlich im Konzept zu TCP/IP; kapselt SCSI-Befehle und Daten.
ru: Протокол хранения данных, сходный с TCP/IP; позволяет инкапсулировать команды и данные SCSI.
vi_vn: Giao thức lưu trữ tương tự như TCP/IP về mặt khái niệm, đóng gói các lệnh và dữ liệu SCSI.

source: Storage protocol that encapsulates SCSI frames for transport over IP networks. Supported by Compute, Object Storage, and Image service.
de: Speicherprotokoll, das SCSI-Frames für den Transport über IP-Netzwerke einkapselt. Unterstützt von Compute, Objektspeicher und Abbilddienst.
ru: Протокол хранения данных, инкапсулирующий фреймы SCSI для передачи по IP-сетям. Поддерживается службой вычислительных ресурсов (Compute), объектными хранилищами (Object Storage) и службой образов (Image).

source: Storage repository for image files
de: Speicher-Repository für Abbilddateien.
ru: Репозиторий для хранения файлов образов

source: Storage ring build and rebalance utility. Documented in http://docs.openstack.org/developer/swift/admin_guide.html#managing-the-rings.
ru: Служебная программа для сборки и ребалансировки кольца в хранилище. Подробнее http://docs.openstack.org/developer/swift/admin_guide.html#managing-the-rings.

source: Storage types
de: Speichertypen
ru: Типы устройств хранения

source: Stores CephFS metadata.
de: Speichert CephFS Metadaten.
ru: Хранит метаданные CephFS.
vi_vn: Lưu trữ metadata của CephFS.
