Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: delayed delete
de: Verzögertes Löschen
ru: отложенное удаление
vi_vn: xóa có trì hoãn

source: delivery mode
de: Liefermodus
ru: режим доставки
vi_vn: chết độ vận chuyển

source: denial of service (DoS)
ru: отказ в обслуживании (DoS)
vi_vn: từ chối dịch vụ (DoS)

source: deprecated auth
de: veraltete auth
ru: устаревшая аутентификация

source: developer
de: Entwickler
ru: разработчик
vi_vn: người phát triển

source: device ID
de: Geräte ID
ru: ID устройства
vi_vn: ID thiết bị

source: device weight
de: Gerätegewicht
ru: вес устройства
vi_vn: chỉ số thiết bị

source: direct consumer
de: Direktverbraucher
ru: непосредственный потребитель
vi_vn: trình tiêu thụ trực tiếp

source: direct exchange
de: Direkter Austausch
ru: прямой обмен
vi_vn: trao đổi trực tiếp

source: direct publisher
de: Direktpublisher
ru: прямой издатель
vi_vn: trình xuất bản trực tiếp

source: disassociate
de: disassoziieren
ru: отмена связи
vi_vn: tách biệt

source: disk encryption
de: Festplattenverschlüsselung
ru: шифрование дисков
vi_vn: mã hóa đĩa

source: disk format
de: Festplattenformat
ru: формат диска
vi_vn: định dạng đĩa

source: dispersion
de: Dispergierung
ru: дисперсия

source: distributed virtual router (DVR)
ru: распределенный виртуальный маршрутизатор (DVR)

source: domain
de: Domäne
ru: домен
vi_vn: miền

source: download
de: Herunterladen
ru: загрузка
vi_vn: tải về

source: durable exchange
de: Dauerhafter Austausch
ru: надежный обмен
vi_vn: trao đổi bền vững

source: durable queue
de: Dauerhafte Warteschlange
ru: надежная очередь
vi_vn: hàng đợi bền vững

source: east-west traffic
de: Ost-West-Verkehr
ru: горизонтальный трафик
vi_vn: giao thông Đông-Tây

source: encapsulation
de: Verkapselung
ru: инкапсуляция
vi_vn: đóng gói

source: encryption
de: Verschlüsselung
ru: шифрование
vi_vn: mã hóa

source: endpoint
de: Endpunkt
ru: точка входа

source: endpoint registry
de: Endpunkt-Registrierung
ru: реестр точек входа

source: endpoint template
de: Endpunkt Vorlage
ru: шаблон точки входа
vi_vn: mẫu endpoint

source: entity
de: Entität
ru: сущность
vi_vn: thực thể

source: ephemeral image
de: Flüchtiges Abbild
ru: эфемерный образ
vi_vn: image phù du

source: ephemeral volume
de: Flüchtige Festplatte
ru: эфемерный том
vi_vn: ổ lưu trữ phù du

source: evacuate
de: Evakuieren
ru: эвакуация
vi_vn: di tản

source: exchange
de: Austausch
ru: обмен
vi_vn: trao đổi

source: exchange type
de: Austauschtyp
ru: тип обмена
vi_vn: dạng trao đổi

source: exclusive queue
de: Exklusive Warteschlange
ru: эксклюзивная очередь
vi_vn: hàng đợi riêng biệt

source: extended attributes (xattr)
de: Erweiterte Attribute (xattr)
ru: расширенные атрибуты (xattr)
vi_vn: các đặc tính mở rộng (xattr)

source: extension
de: Erweiterung
ru: расширение
vi_vn: phần mở rộng

source: external network
de: externes Netzwerk
ru: внешняя сеть
vi_vn: Mạng bên ngoài

source: extra specs
de: Extra Spezifikationen
ru: Доп. параметры
vi_vn: thông số kỹ thuật thêm

source: fan-out exchange
de: Fan-Out Austausch
ru: обмен типа fan-out
vi_vn: trao đổi tín hiệu ra

source: federated identity
de: Föderierte Identität
ru: федеративное удостоверение
vi_vn: liên minh

source: fill-first scheduler
ru: планировщик выбора первого хоста
vi_vn: trình lên lịch ưu tiên làm đầy

source: filter
ru: фильтр
vi_vn: bộ lọc

source: firewall
ru: Брандмауэр
vi_vn: Tường lửa

source: fixed IP address
de: feste IP-Adresse
ru: фиксированный IP-адрес
vi_vn: địa chỉ IP cố định

source: flat mode injection
ru: внедрение одноуровневого режима
vi_vn: truyền chế độ flat

source: flat network
de: Flaches Netzwerk
ru: одноуровневая сеть
vi_vn: hệ thống mạng flat

source: flavor
de: Variante
ru: Тип инстанса

source: flavor ID
de: Varianten-ID
ru: ID типа инстанса

source: floating IP address
de: bewegliche IP-Adresse
ru: плавающий IP-адрес
vi_vn: địa chỉ IP động

source: front end
ru: внешний интерфейс

source: gateway
ru: шлюз

source: generic routing encapsulation (GRE)
ru: GRE (generic routing encapsulation)
vi_vn: giao thức đóng gói định tuyến phổ thông (GRE)

source: glance API server
ru: Сервер API Glance

source: glance registry
de: Glance Registrierung
ru: Реестр Glance

source: global endpoint template
ru: шаблон глобальной точки входа
vi_vn: mẫu endpoint toàn cầu

source: golden image
de: Goldenes Abbild
ru: золотой образ

source: guest OS
de: Gast OS
ru: гостевая ОС
vi_vn: máy khách

source: hard reboot
de: harter Reboot
ru: обязательная перезагрузка
vi_vn: phục hồi nguyên bản bằng cách khởi động lại

source: health monitor
de: Gesundheitsmonitor
ru: монитор работоспособности
vi_vn: công cụ theo dõi, giám sát sức khỏe

source: high availability (HA)
de: hochverfügbar (HA)
ru: высокая доступность (HA)
vi_vn: tính sẵn sàng cao (HA)

source: horizon plug-in
ru: модуль horizon

source: host
ru: Узел
vi_vn: Chủ

source: host aggregate
de: Host-Aggregat
ru: агрегат хостов
vi_vn: tập hợp máy chủ

source: hybrid cloud
ru: гибридное облако

source: hyperlink
ru: гиперссылка

source: hypervisor
ru: гипервизор

source: hypervisor pool
de: Hypervisor Bestand
ru: пул гипервизоров
vi_vn: tập hợp trình điều khiển máy ảo

source: iSCSI Qualified Name (IQN)
ru: Полное имя iSCSI (IQN)

source: identity provider
de: Identitätsanbieter
ru: провайдер идентификации
vi_vn: trình cung cấp identity

source: image
de: Abbild
ru: образ

source: image ID
ru: ID образа

source: image UUID
de: Abbild UUID
ru: UUID образа

source: image cache
de: Abbild Zwischenspeicher
ru: кэш образов

source: image membership
de: Abbild Mitgliedschaft
ru: членство образа
vi_vn: thành viên image

source: image owner
de: Abbild-Eigentümer
ru: владелец образа
vi_vn: chủ sở hữu image

source: image registry
de: Abbild-Registrierung
ru: реестр образов

source: image status
de: Abbildstatus
ru: статус образа
vi_vn: trạng thái của image

source: image store
de: Abbildspeicher
ru: хранилище образов
vi_vn: kho lưu trữ image

source: incubated project
de: Inkubiertes Projekt
ru: инкубационный проект
vi_vn: dự án ủ

source: ingress filtering
de: Eingangsfilterung
ru: фильтрация на входе
vi_vn: lọc đầu vào

source: injection
de: Injektion
ru: внедрение
vi_vn: Truyền

source: instance
de: Instanz
ru: инстанс

source: instance ID
de: Instanz-ID
ru: ID инстанса

source: instance UUID
de: Instanz-UUID
ru: UUID инстанса

source: instance state
de: Instanzstatus
ru: состояние инстанса
vi_vn: trạng thái instance

source: instance tunnels network
de: Instanz-Tunnelnetzwerk
ru: сетевой туннель инстанса
vi_vn: hệ thống mạng instance ngầm

source: instance type
de: Instanztyp
ru: тип инстанса
vi_vn: loại instance

source: instance type ID
de: Instanz-Typ ID
ru: ID типа инстанса
vi_vn: ID của loại instance

source: interface
de: Schnittstelle
ru: интерфейс
vi_vn: giao diện

source: interface ID
de: Schnittstellenkennung
ru: ID интерфейса
vi_vn: ID của giao diện

source: kernel-based VM (KVM)
ru: виртуальная машина на основе ядра (KVM)

source: large object
de: Grosses Objekt
ru: Большой объект
vi_vn: object lớn

source: libvirt for KVM or QEMU
de: libvirt für KVM oder QEMU
ru: библиотека виртуализации для KVM или QEMU;

source: libvirt\_type setting
de: libvirt\_type Einstellungen
ru: Параметр libvirt\_type

source: live migration
ru: живая миграция
vi_vn: di dời sống

source: load balancer
ru: балансировщик нагрузки
vi_vn: cân bằng tải (thiết bị)

source: load balancing
ru: балансировка нагрузки
vi_vn: cân bằng tải (quá trình)

source: management API
ru: IP управления
vi_vn: API quản lý

source: management network
de: Netzwerkverwaltung
ru: управляющая сеть
vi_vn: mạng quản lý

source: manager
ru: администратор (диспетчер)
vi_vn: người quản lý

source: manages and provisions physical machines.
de: Verwalten und provisionieren physikalischer Maschinen.
ru: Администрирует и развертывает физические компьютеры.

source: manifest
ru: манифест
vi_vn: bản kê khai

source: manifest object
de: Manifestobjekt
ru: объект манифеста

source: maximum transmission unit (MTU)
ru: максимальный блок передачи (MTU)
vi_vn: đơn vị truyền tải tối đa (MTU)

source: mechanism driver
de: Mechanismus-Treiber
ru: драйвер механизма

source: membership
de: Mitgliedschaft
ru: членство
vi_vn: tư cách thành viên

source: membership list
de: Mitgliederliste
ru: список членства
vi_vn: danh sách thành viên

source: memory overcommit
de: Speicherüberbelegung
ru: чрезмерное выделение памяти

source: message broker
de: Nachrichtenmakler
ru: брокер сообщений
vi_vn: kênh truyền tin

source: message bus
de: Nachrichtenbus
ru: канал сообщений

source: message queue
de: Nachrichtenwarteschlange
ru: очередь сообщений
vi_vn: hàng đợi tin

source: migration
ru: миграция
vi_vn: sự di dời

source: multi-factor authentication
de: Multi-Faktoren Authentifizierung
ru: многофакторная аутентификация
vi_vn: chứng thực đa yếu tố

source: multi-host
ru: несколько хостов
vi_vn: đa host

source: network
de: Netzwerk
ru: сеть
vi_vn: mạng

source: network ID
de: Netzwerkkennung
ru: ID сети

source: network UUID
ru: UUID сети

source: network controller
ru: контроллер сети
vi_vn: trình quản lý mạng

source: network manager
ru: диспетчер сети
vi_vn: trình quản lý mạng

source: network namespace
ru: пространство имен сети

source: network node
ru: сетевой узел
vi_vn: node mạng

source: network segment
ru: сетевой сегмент
vi_vn: phân đoạn mạng

source: network worker
ru: сетевой рабочий модуль

source: neutron API
ru: API службы Neutron

source: neutron manager
ru: диспетчер службы Neutron
vi_vn: trình quản lý neutron

source: neutron plug-in
ru: плагин neutron

source: node
de: Knoten
ru: узел

source: non-durable exchange
ru: недолговечный обмен
vi_vn: trao đổi không bền vững

source: non-durable queue
ru: недолговременная очередь
vi_vn: hàng đợi không vững chắc

source: non-persistent volume
ru: временный том
vi_vn: ổ lưu trữ không liên tục

source: north-south traffic
ru: вертикальный трафик (север-юг)
vi_vn: giao thông Bắc-Nam

source: object
de: Objekt
ru: объект

source: object auditor
ru: аудитор объектов
vi_vn: trình chỉnh sửa đối tượng

source: object expiration
ru: срок действия объекта

source: object hash
ru: хэш объекта

source: object path hash
ru: хэш пути объекта

source: object replicator
ru: утилита репликации объектов
vi_vn: trình sao lưu object

source: object server
de: Objektserver
ru: сервер объектов

source: object versioning
ru: управление версиями объектов

source: operator
ru: оператор
vi_vn: Người điều hành

source: optional service
ru: дополнительная служба

source: orphan
ru: потерянный процесс

source: parent cell
ru: родительская ячейка
vi_vn: cell mẹ

source: partition
ru: раздел
vi_vn: phân vùng

source: partition index
ru: индекс раздела
vi_vn: mục lục phân vùng

source: partition shift value
ru: значение смещения раздела
vi_vn: giá trị dịch chuyển phân vùng

source: pause
ru: Пауза
vi_vn: tạm dừng

source: persistent message
ru: постоянное сообщение
vi_vn: tin liên tục

source: persistent volume
ru: постоянный том
vi_vn: ổ lưu trữ liên tục

source: personality file
ru: файл личных параметров

source: pip package
de: pip Paket
ru: Пакеты pip

source: plug-in
ru: плагин

source: policy service
ru: служба политик
vi_vn: dịch vụ chính sách

source: pool
de: Bestand
ru: пул

source: pool member
de: Bestandteil
ru: участник пула

source: port
ru: порт
vi_vn: cổng

source: port UUID
ru: порт UUID

source: private IP address
de: private IP-Adresse
ru: частный IP-адрес
vi_vn: các địa chỉ IP riêng tư

source: private image
ru: частный образ
vi_vn: image riêng tư

source: private network
de: privates Netzwerk
ru: частная сеть
vi_vn: hệ thống mạng riêng tư

source: project
de: Projekt
ru: проект

source: project ID
de: Projektkennung
ru: ID проекта

source: project VPN
ru: VPN проекта

source: promiscuous mode
ru: неизберательный режим
vi_vn: chế độ hỗn tạp

source: protected property
de: Geschützte Eigenschaft
ru: защищенное свойство

source: provider
ru: провайдер
vi_vn: nhà cung cấp

source: proxy node
ru: прокси-узел
vi_vn: node proxy

source: proxy server
ru: прокси-сервер

source: public API
ru: публичный API

source: public IP address
de: öffentliche IP-Adresse
ru: общедоступный IP-адрес
vi_vn: địa chỉ IP public

source: public image
ru: общедоступный образ
vi_vn: ảnh công khai

source: public key authentication
ru: аутентификация при помощи открытого ключа
vi_vn: khóa công khai dùng để xác thực

source: public network
de: öffentliches Netzwerk
ru: публичная сеть
vi_vn: mạng công khai

source: qemu or kvm
de: qemu oder kvm
ru: qemu или kvm

source: quarantine
ru: карантин
vi_vn: cách ly

source: quota
ru: квота
vi_vn: hạn ngạch

source: rate limit
ru: предел скорости
vi_vn: giới hạn tỉ lệ

source: rebalance
ru: ребалансировка
vi_vn: Tái cân bằng

source: reboot
ru: перезагрузка
vi_vn: khởi động lại

source: rebuild
ru: перестроение сервера
vi_vn: Tái tạo

source: record
ru: запись
vi_vn: bản ghi

source: record ID
ru: ID записи
vi_vn: ID của bản ghi

source: reference architecture
ru: эталонная архитектура
vi_vn: mô hình tham khảo

source: region
ru: регион
vi_vn: vùng

source: registry
ru: реестр

source: registry server
ru: сервер реестра

source: replica
ru: реплика
vi_vn: bản sao

source: replica count
ru: число реплик
vi_vn: số bản sao

source: replication
ru: репликация
vi_vn: sao lưu

source: replicator
ru: утилита репликации
vi_vn: trình sao lưu

source: request ID
ru: ID запроса
vi_vn: ID của yêu cầu

source: rescue image
ru: образ восстановления
vi_vn: giải cứu ảnh

source: resize
ru: изменение размера
vi_vn: thay đổi kích cỡ

source: ring
ru: кольцо

source: ring builder
ru: построитель кольца
vi_vn: trình xây dựng ring

source: role
ru: роль
vi_vn: vai trò

source: role ID
ru: ID роли

source: round-robin scheduler
ru: циклический планировщик
vi_vn: Lịch trình xoay vòng

source: router
ru: маршрутизатор

source: routing key
ru: ключ маршрутизации
vi_vn: key định tuyến

source: scheduler manager
ru: диспетчер планировщика
vi_vn: trình quản lý trình lên lịch

source: scoped token
ru: токен с заданной областью

source: scrubber
ru: средство очистки

source: secret key
de: geheimer Schlüssel
ru: секретный ключ
vi_vn: key bí mật

source: secure boot
ru: защищенная загрузка

source: secure shell (SSH)
ru: защищенная оболочка (SSH)

source: security group
de: Sicherheitsgruppe
ru: группа безопасности
vi_vn: nhóm bảo mật

source: segmented object
ru: сегментированный объект
vi_vn: đối tượng đã phân đoạn

source: self-service
ru: самообслуживание

source: server
ru: сервер

source: server UUID
ru: UUID сервера

source: server image
ru: образ сервера

source: service
de: Dienst
ru: служба
vi_vn: dịch vụ

source: service ID
de: Dienstkennung
ru: ID службы
vi_vn: ID dịch vụ

source: service catalog
ru: каталог служб
vi_vn: danh mục dịch vụ

source: service project
ru: проект служб

source: service provider
ru: поставщик службы
vi_vn: nhà cung câp dịch vụ

source: service registration
ru: регистрация службы
vi_vn: đăng ký dịch vụ

source: service token
ru: токен службы
vi_vn: token dịch vụ

source: session back end
ru: серверная часть сеанса
vi_vn: phiên làm việc back-end

source: session persistence
ru: постоянство сеанса
vi_vn: tính liên tục của phiên làm việc

source: session storage
ru: хранилище сеанса
vi_vn: kho lưu trữ phiên làm việc

source: setuptools package
de: setuptools Paket
ru: Пакет setuptools

source: share
ru: общий ресурс

source: share network
ru: сеть общего ресурса

source: shared IP address
de: geteilte IP-Adresse
ru: общий IP-адрес
vi_vn: địa chỉ IP được chia sẻ

source: shared IP group
ru: общая IP-группа
vi_vn: nhóm IP chia sẻ

source: shared storage
ru: общее хранилище
vi_vn: Kho lưu trữ chung

source: snapshot
de: Momentaufnahme
ru: снимок

source: soft reboot
ru: горячая перезагрузка
vi_vn: Khởi động lại mà không dừng hoạt động của các thành phần

source: spread-first scheduler
ru: простой планировщик

source: stack
ru: стек

source: static IP address
de: statische IP-Adresse
ru: статический IP-адрес
vi_vn: địa chỉ IP tĩnh

source: storage back end
ru: внутреннее хранилище
vi_vn: back end lưu trữ

source: storage manager
ru: диспетчер хранилища
vi_vn: trình quản lý lưu trữ

source: storage manager back end
ru: серверная часть диспетчера хранилища
vi_vn: back end của trình quản lý lưu trữ

source: storage node
ru: узел хранилища
vi_vn: node lưu trữ

source: storage services
ru: службы хранилища
vi_vn: các dịch vụ lưu trữ

source: strategy
de: Strategie
ru: стратегия
vi_vn: chiến lược

source: subdomain
ru: суб-домен
vi_vn: tên miền con

source: subnet
ru: подсеть

source: suspend
ru: приостановка
vi_vn: tạm ngừng

source: swap
ru: подкачка

source: swift client
ru: Клиент Swift

source: swift middleware
ru: промежуточное ПО Swift

source: swift proxy server
ru: прокси-сервер службы Swift

source: swift storage node
ru: узел хранилища Swift
vi_vn: node lưu trữ swift

source: sync point
ru: точка синхронизации
vi_vn: điểm đồng bộ

source: sysadmin
ru: системный администратор

source: system usage
de: Systemauslastung
ru: использование системы
vi_vn: mức độ sử dụng hệ thống

source: tenant
ru: тенант

source: tenant ID
ru: ИД тенанта

source: tenant endpoint
ru: точка входа тенанта

source: token
ru: токен
vi_vn: Mã xác thực

source: token services
ru: службы токена
vi_vn: các dịch vụ token

source: tombstone
ru: отметка о полном удалении

source: topic publisher
ru: публикатор темы
vi_vn: trình xuất bản đề tài

source: transaction ID
ru: ID транзакции
vi_vn: ID giao dịch

source: transient
ru: временный
vi_vn: tạm thời

source: transient exchange
ru: временный обмен
vi_vn: trao đổi tạm thời

source: transient message
ru: временное сообщение
vi_vn: tin tạm thời

source: transient queue
ru: временная очередь
vi_vn: hàng đợi tạm thời

source: unscoped token
ru: простой токен
vi_vn: token không định sẵn

source: updater
de: Aktualisierer
ru: средство обновления
vi_vn: trình cập nhật

source: user
de: Benutzer
ru: пользователь
vi_vn: người dùng

source: user data
de: Benutzerdaten
ru: пользовательские данные
vi_vn: dữ liệu người dùng

source: virtual IP address (VIP)
de: virtuelle IP-Adresse (VIP)
ru: виртуальный IP-адрес

source: virtual VLAN
ru: виртуальная VLAN
vi_vn: VLAN ảo

source: virtual machine (VM)
de: virtuelle Maschine (VM)
ru: виртуальная машина (ВМ)
vi_vn: máy ảo (VM)

source: virtual network
de: virtuelles Netzwerk
ru: виртуальная сеть
vi_vn: hệ thống mạng ảo

source: virtual networking
de: Virtuelles Netzwerk
ru: виртуальные сети
vi_vn: Mạng kết nối ảo

source: virtual port
de: virtueller Port
ru: виртуальный порт
vi_vn: port ảo

source: virtual private network (VPN)
de: virtuelles privates Netzwerk (VPN)
ru: виртуальная приватная сеть (VPN)
vi_vn: hệ thống mạng riêng tư (VPN)

source: virtual server
de: virtueller Server
ru: виртуальный сервер
vi_vn: server ảo

source: virtual switch (vSwitch)
ru: виртуальный коммутатор (vSwitch)
vi_vn: switch ảo (vSwitch)

source: volume
de: Datenträger
ru: диск
vi_vn: ổ đĩa

source: volume ID
de: Datenträger ID
ru: ID диска
vi_vn: ID ổ lưu trữ

source: volume controller
de: Datenträger Controller
ru: контроллер диска
vi_vn: Hệ điều chỉnh lưu trữ dữ liệu

source: volume driver
de: Datenträgertreiber
ru: драйвер диска
vi_vn: Trình điều khiển lưu trữ

source: volume manager
ru: диспетчер тома
vi_vn: Bộ quản lý hệ thống lưu trữ

source: volume node
de: Datenträger-Knoten
ru: узел хранения диска

source: volume plug-in
de: Datenträger Plug-in
ru: плагин volume
vi_vn: Ổ cứng ngoài.

source: volume worker
ru: рабочий модуль диска

source: weight
de: Gewichtung
ru: вес
vi_vn: cao

source: weighted cost
de: Gewichtungskosten
ru: взвешенная цена
vi_vn: Tổng tài nguyên tiêu tốn

source: weighting
de: gewichten
ru: взвешивание
vi_vn: Khối lượng

source: where filePath points to a JSON file that defines the mount point for OpenStack images on your system and a unique ID. For example:
de: Wobei filePath auf eine JSON-Datei verweist, die den Einhängepunkt für OpenStack-Abbilder auf Ihrem System und eine eindeutige ID definiert. Beispielsweise:
ru: где filePath – путь к файлу JSON, который определяет уникальный ID и точку монтирования для образов OpenStack в вашей системе. Например:

source: worker
ru: рабочий модуль
vi_vn: Trình chạy ẩn.

source: x509 certificates.
ru: Сертификаты x509.

source: **Red Hat Enterprise Linux or CentOS**
de: **Red Hat Enterprise Linux oder CentOS**

source: A Certificate Revocation List (CRL) in a PKI model is a list of certificates that have been revoked. End entities presenting these certificates should not be trusted.
de: Eine Zertifikatsperrliste (CRL) in einem PKI-Modell ist eine Liste von Zertifikaten, die widerrufen wurden. Endentitäten, die diese Zertifikate vorstellen, sollten nicht vertraut werden.

source: A central hub for passing messages between daemons. Usually implemented with `RabbitMQ <https://www.rabbitmq.com/>`__, also can be implemented with another AMQP message queue, such as `ZeroMQ <http://www.zeromq.org/>`__.
de: Ein zentraler Knotenpunkt für das Übermitteln von Nachrichten zwischen Dämonen. In der Regel mit `RabbitMQ <https://www.rabbitmq.com/>` __ implementiert, kann es auch mit einer anderen AMQP-Message Queue implementiert werden, wie zB `ZeroMQ <http://www.zeromq.org/>` __.

source: A great way to get answers and insights is to post your question or problematic scenario to the OpenStack mailing list. You can learn from and help others who might have similar issues. To subscribe or view the archives, go to the `general OpenStack mailing list <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack>`_. If you are interested in the other mailing lists for specific projects or development, refer to `Mailing Lists <https://wiki.openstack.org/wiki/Mailing_Lists>`_.
de: Ein guter Weg, um Antworten und Einsichten zu erhalten, ist, Ihre Frage oder ein problematisches Szenario in die Mailingliste von OpenStack zu stellen. Sie können lernen und anderen helfen, die ähnliche Probleme haben könnten. Um die Archive zu abonnieren oder zu betrachten, gehen Sie zur "OpenStack Mailing List" <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack>`_. Wenn Sie an den anderen Mailinglisten für bestimmte Projekte oder Entwicklungen interessiert sind, finden Sie weitere Informationen unter `Mailinglisten <https://wiki.openstack.org/wiki/Mailing_Lists>`_.

source: A packaged version enables you to use :command:`dnf` to install the package:
de: Eine gepackte Version erhalten Sie mit :command: `dnf`, um das Paket zu installieren:

source: A plug-in for the OpenStack Dashboard (horizon).
de: Ein Plugin für das OpenStack Dashboard (horizon).

source: Accepts metadata requests from instances. The ``nova-api-metadata`` service is generally used when you run in multi-host mode with ``nova-network`` installations. For details, see `Metadata service <https://docs.openstack.org/admin-guide/compute-networking-nova.html#metadata-service>`__ in the OpenStack Administrator Guide.
de: Akzeptiert Metadatenanforderungen von Instanzen. Der Dienst ``nova-api-metadata`` wird in der Regel im Multi-Host-Modus mit ``nova-network`` Installationen verwendet. Weitere Informationen finden Sie unter `Metadatendienst <https://docs.openstack.org/admin-guide/compute-networking-nova.html#metadata-service>` __ im OpenStack Administratorhandbuch.

source: An open source community project by SUSE that aims to provide all necessary services to quickly deploy and manage clouds.
de: Ein Open Source Gemeinschaftsprojekt von SUSE, das alle notwendigen Dienste zur schnellen Bereitstellung und Wartung von Clouds zur Verfügung stellt.
