Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: Apache Hadoop is an open source software framework that supports data-intensive distributed applications.
de: Apache Hadoop ist ein Open-Source-Software-Framework, das datenintensive verteilte Anwendungen unterstützt.
ru: Apache Hadoop — фрейморк для разработки программ с открытым исходным кодом, в котором поддерживаются распределенные приложения, обрабатывающие большие объемы данных.
vi_vn: Apache Hadoop là một framework phần mềm mã nguồn mở hỗ trợ các ứng dụng phân tán dữ liệu.

source: Apache Web Server
ru: Веб-сервер Apache

source: Application Catalog service
de: Applikationskatalogdienst
ru: Служба каталога приложений

source: Application Catalog service (murano)
de: Applikationskatalog Dienst (murano)
ru: Служба каталога приложений (Murano)

source: Application Programming Interface (API)
de: Anwendungsprogrammierschnittstelle (API)
ru: программный интерфейс (API)
vi_vn: Giao diện lập trình ứng dụng (API)

source: Application Service Provider (ASP)
de: Anwendungsdienstleister (ASP)
ru: провайдер услуг доступа к приложениям (ASP)
vi_vn: Nhà cung cấp dịch vụ ứng dụng.

source: Arbitrary property to associate with image. This option can be used multiple times.
ru: Произвольное свойство, которое задается для образа. Этот параметр можно использовать многократно.

source: As a cloud end user, you can use the OpenStack dashboard to provision your own resources within the limits set by administrators. You can modify the examples provided in this section to create other types and sizes of server instances.
ru: Конечный пользователь облака может использовать панель управления OpenStack, чтобы развернуть свои ресурсы в пределах ограничений, заданных администраторами. Предоставленные в этом разделе примеры можно использовать для создания серверных экземпляров других типов и размеров.

source: As an administrator, you can migrate a volume with its data from one location to another in a manner that is transparent to users and workloads. You can migrate only detached volumes with no snapshots.
de: Als Administrator können Sie ein Datenträger mit seinen Daten von einem Ort zum anderen in einer für Benutzer und Arbeitsabläufe transparenten Weise migrieren. Sie können nur freigegebene Datenträger ohne Snapshots migrieren.
ru: Администратор может выполнить миграцию тома вместе с его данными из одного расположения в другое прозрачно для пользователей и рабочей нагрузки. Миграция выполняется только для отключенных томов без снимков.

source: As shown in :ref:`get_started_conceptual_architecture`, OpenStack consists of several independent parts, named the OpenStack services. All services authenticate through a common Identity service. Individual services interact with each other through public APIs, except where privileged administrator commands are necessary.
de: Wie in :ref: `get_started_conceptual_architecture`, besteht OpenStack aus mehreren unabhängigen Teilen, den sogenannten OpenStack-Diensten. Alle Dienste authentifizieren sich über einen gemeinsamen Identitätsdienst. Einzelne Dienste interagieren miteinander durch öffentliche APIs, außer wo privilegierte Administratorbefehle erforderlich sind.
ru: Как показано в :ref:`get_started_conceptual_architecture`, OpenStack состоит из нескольких независимых компонентов, которые называются службами OpenStack. Для аутентификации во всех службах используется общая служба идентификации. Отдельные службы взаимодействуют друг с другом посредством общих API, за исключением тех случаев, когда требуется использование команд администратора с привилегированным доступом.

source: As the volume donor, request a volume transfer authorization code for a specific volume:
de: Als Datenträgerspender fordern Sie einen Datentransfer-Autorisierungscode für einen bestimmten Datenträger:
ru: Как отправитель тома запросите код авторизации на перенос тома для определенного тома:

source: As the volume recipient, you must first obtain the transfer ID and authorization key from the original owner.
de: Als Datenträgerempfänger müssen Sie zunächst die Transfer-ID und den Autorisierungsschlüssel vom ursprünglichen Besitzer erhalten.
ru: Получатель тома сначала должен получить ID переноса и ключ авторизации от предыдущего владельца.

source: Association of an interface ID to a logical port. Plugs an interface into a port.
de: Verbindung einer Schnittstellen-ID zu einem logischen Port. Steckt eine Schnittstelle in einen Port.
ru: Связывание ID интерфейса с логическим портом. Подключает интерфейс к порту.
vi_vn: Sự kết hợp của một ID giao diện với một port logic. Cắm một giao diện vào một port.

source: Asynchronous JavaScript and XML (AJAX)
de: Asynchrones JavaScript und XML (AJAX)
ru: асинхронный JavaScript и XML (AJAX)
vi_vn: Javascript không đồng bộ và XML (AJAX)

source: Attach a volume to an instance
de: Datenträger an eine Instanz anhängen
ru: Подключение тома к инстансу

source: Attach your volume to a server, specifying the server ID and the volume ID:
de: Schließen Sie den Datenträger an einen Server an und geben Sie die Server-ID und die Datenträger-ID an:
ru: Подключите том к серверу, указав идентификаторы сервера и тома:

source: Attachment point where a virtual interface connects to a virtual network.
de: Anhängepunkt zur Verbindung einer virtuellen Schnittstelle mit einem virtuellen Netzwerk.
ru: Точка подключения виртуального интерфейса к виртуальной сети.
vi_vn: Điểm gắn vào khi một giao diện ảo muốn kết nối với một hệ thống mạng ảo.

source: Authentication and identity service by Microsoft, based on LDAP. Supported in OpenStack.
de: Authentifizierung und Identitätsservice von Microsoft, basierend auf LDAP. Unterstützt in OpenStack.
ru: Служба аутентификации и идентификации Microsoft на базе LDAP. Поддерживается OpenStack.
vi_vn: Dịch vụ chứng thực và Identity của Microsoft, dựa trên nền tảng LDAP, được hỗ trợ trong OpenStack.

source: Authentication method that uses keys rather than passwords.
ru: Метод аутентификации, в котором вместо паролей используются ключи.
vi_vn: Phương pháp chứng thực sử dụng key thay cho mật khẩu.

source: Authentication method that uses two or more credentials, such as a password and a private key. Currently not supported in Identity.
de: Authentifizierungsmethode, die zwei oder mehr Anmeldeinformationen verwendet, z. B. ein Kennwort und einen privaten Schlüssel. Wird derzeit in Identity nicht unterstützt.
ru: Метод аутентификации, в котором используются учетные данные, состоящие их двух или более компонентов, например, пароль и частный ключ. В настоящий момент в службе идентификации этот метод не поддерживается.
vi_vn: Phương pháp xác thực sử dụng hai hoặc nhiều thông tin xác thực, như một mật khẩu và một khóa riêng tư. Hiện không được hỗ trợ trong Identity.

source: Authorizes tokens for users that console proxies provide. See ``nova-novncproxy`` and ``nova-xvpvncproxy``. This service must be running for console proxies to work. You can run proxies of either type against a single nova-consoleauth service in a cluster configuration. For information, see `About nova-consoleauth <http://docs.openstack.org/admin-guide/compute-remote-console-access.html#about-nova-consoleauth>`__.
ru: Авторизует токены для пользователей, которые предоставляют прокси-серверы консоли. См. службы``nova-novncproxy`` и ``nova-xvpvncproxy``. Эта служба обеспечивает работу прокси-серверов консоли. Можно запускать прокси-серверы любого типа с одной службой nova-consoleauth в конфигурации кластера. Подробнее см. в разделе `О nova-consoleauth <http://docs.openstack.org/admin-guide/compute-remote-console-access.html#about-nova-consoleauth>`__.

source: Automated software test suite designed to run against the trunk of the OpenStack core project.
ru: Пакет автоматизированных программных тестов, предназначенных для выполнения по отношению к стволу официального проекта OpenStack.
vi_vn: Bộ phần mềm tự động thử nghiệm phần mềm được thiết kế để chạy với các phần dự án chính của OpenStack.

source: Available from anywhere
de: Von überall aus verfügbar
ru: Доступ из любого места

source: Available instance types
de: Verfügbare Instanztypen
ru: доступные типы экземпляров;

source: Available networks
de: Verfügbare Netzwerke
ru: доступные сети;

source: BMC (Baseboard Management Controller)
ru: BMC (контроллер управления основной платой)

source: Bare Metal service
de: Bare Metal Dienst
ru: Служба Bare Metal

source: Bare Metal service (ironic)
de: Bare Metal Dienst (ironic)
ru: служба Bare Metal (Ironic)

source: Be sure to include the software and package versions that you are using, especially if you are using a development branch, such as, ``"Kilo release" vs git commit bc79c3ecc55929bac585d04a03475b72e06a3208``.
de: Seien Sie sicher, die Software und Paketversionen einzuschließen, die Sie verwenden, besonders wenn Sie einen Entwicklungszweig verwenden, wie ``"Kilo Version" gegen git commit bc79c3ecc55929bac585d04a03475b72e06a3208``.
ru: Не забудьте обозначить версии использованных программ и пакетов, особенно если использовалась версия, находящаяся в разработке. Например ``"Kilo release" из резервной копии Git bc79c3ecc55929bac585d04a03475b72e06a3208``.

source: Before you can run client commands, you must create and source the ``PROJECT-openrc.sh`` file to set environment variables. See :doc:`../common/cli-set-environment-variables-using-openstack-rc`.
de: Bevor Sie Client-Befehle ausführen können, müssen Sie die ``PROJECT-openrc.sh``-Datei erstellen und ausgeben, um Umgebungsvariablen festzulegen. Siehe: doc: `../ common / cli-set-umgebungsvariablen-using-openstack-rc`.
ru: Для выполнения клиентских команд необходимо загрузить и указать файл ``PROJECT-openrc.sh``, чтобы задать переменные окружения. См. :doc:`../common/cli-set-environment-variables-using-openstack-rc`.

source: Bell-LaPadula model
de: Bell-LaPadula-Modell
ru: модель Белла-Лападулы
vi_vn: mô hình Bell-LaPadula

source: Belongs to a particular domain and is used to specify information about the domain. There are several types of DNS records. Each record type contains particular information used to describe the purpose of that record. Examples include mail exchange (MX) records, which specify the mail server for a particular domain; and name server (NS) records, which specify the authoritative name servers for a domain.
ru: Запись принадлежит определенному домену и содержит сведения о нем. Существует несколько типов записей DNS. В записях каждого типа содержатся определенные сведения, описывающие предназначение этой записи. Например, в записях MX (mail exchange) указывается почтовый сервер для определенного домена, а в записях NS (name server) — авторитетные серверы имен для домена.

source: Benchmark service (rally)
de: Benchmark Dienst (rally)
ru: Служба измерения производительности (Rally)

source: Block Storage API
ru: API блочных хранилищ

source: Block Storage service
de: Blockspeicherdienst (cinder)
ru: Служба хранилища блоков

source: Block Storage service (cinder)
de: Block Storage Dienst (cinder)
ru: Служба блочных хранилищ (Cinder)

source: Block Storage service overview
de: Übersicht Blockspeicherdienst
ru: Обзор службы хранилища блоков

source: Block storage (cinder)
ru: Хранилище блоков (Cinder)

source: Block storage that is simultaneously accessible by multiple clients, for example, NFS.
ru: Блочное хранилище, которое одновременно доступно многим клиентам, например, NFS.
vi_vn: Block storage mà được truy cập cùng lúc bởi nhiều client khác nhau, ví dụ như NFS.

source: Bootstrap Protocol (BOOTP)
ru: протокол Bootstrap (BOOTP)

source: Border Gateway Protocol (BGP)
ru: протокол пограничного шлюза (BGP)
vi_vn: Giao thức định tuyến liên vùng (BGP)

source: Both Image service and Compute support encrypted virtual machine (VM) images (but not instances). In-transit data encryption is supported in OpenStack using technologies such as HTTPS, SSL, TLS, and SSH. Object Storage does not support object encryption at the application level but may support storage that uses disk encryption.
de: Sowohl Abbilddienst als auch Compute unterstützen verschlüsselte virtuelle Maschine (VM) Abbilder (aber nicht Instanzen). In-Transit-Datenverschlüsselung wird in OpenStack mit Technologien wie HTTPS, SSL, TLS und SSH unterstützt. Object Storage unterstützt keine Objektverschlüsselung auf Applikationsebene, kann aber auch Speicher unterstützen, der die Festplattenverschlüsselung verwendet.
ru: Службы образов и вычислительных ресурсов поддерживают шифрование образов виртуальных машин (ВМ), но не экземпляров. В OpenStack поддерживается шифрование данных при передаче, например HTTPS, SSL, TLS и SSH. Хранилище объектов не поддерживает шифрование объектов на уровне приложения, однако может поддерживать хранилища, использующие шифрование дисков.

source: Both a VM container format and disk format. Supported by Image service.
de: VM Container- und Festplattenformat. Unterstützt vom Abbild-Dienst.
ru: Формат контейнера виртуальной машины и формат диска. Поддерживается службой образов.
vi_vn: Vừa là định dạng container vừa là định dạng đĩa của máy ảo. Được hỗ trợ bởi dịch vụ Image.

source: Bring down a physical storage device for maintenance without disrupting workloads.
de: Bringen Sie ein physisches Speichermedium in Wartung ohne Unterbrechung der Arbeitsabläufe.
ru: Отключение физического устройства хранения для технического обслуживания без прерывания работы.

source: Builds and manages rings within Object Storage, assigns partitions to devices, and pushes the configuration to other storage nodes.
ru: Создает и управляет кольцами в объектном хранилище, назначает разделы устройствам и отправляет сведения о конфигурации другим узлам хранилища.
vi_vn: Xây dựng và quản lý các ring nằm trong Object Storage, gán các phân vùng vào các thiết bị và đẩy cấu hình sang các node lưu trữ khác.

source: By default, hardware properties are retrieved from the image properties. However, if this information is not available, the ``libosinfo`` database provides an alternative source for these values.
de: Standardmäßig werden die Hardwareeigenschaften von den Abbildeigenschaften abgerufen. Wenn diese Informationen jedoch nicht verfügbar sind, stellt die ``libosinfo``-Datenbank eine alternative Quelle für diese Werte dar.
ru: По умолчанию свойства оборудования извлекаются из свойств образа. Однако если они недоступны, эти значения можно найти в базе данных ``libosinfo``.

source: CALL
ru: ВЫЗОВ

source: Can concurrently use multiple layer-2 networking technologies, such as 802.1Q and VXLAN, in Networking.
de: Kann gleichzeitig mehrere Layer-2-Netzwerktechnologien wie 802.1Q und VXLAN in Networking nutzen.
ru: Позволяет в службе сети одновременно использовать несколько сетевых технологий уровня 2, например 802.1Q и VXLAN.
vi_vn: Có thể sử dụng đồng thời nhiều công nghệ networking layer-2 như 802.1Q và VXLAN trong Networking.

source: Causes the network interface to pass all traffic it receives to the host rather than passing only the frames addressed to it.
ru: В этом режиме сетевой интерфейс передает на хост весь трафик, а не только кадры, адресованные этому хосту.
vi_vn: Khiến cho giao diện mạng chuyển tất cả lưu lượng nó nhận được đến host thay vì chỉ chuyển các frame được chỉ định đến host.

source: Ceph component that enables a Linux block device to be striped over multiple distributed data stores.
ru: Компонент Ceph, который позволяет реализовать чередование данных для блочных устройств Linux на нескольких распределенных хранилищах данных.

source: Challenge-Handshake Authentication Protocol (CHAP)
ru: Протокол CHAP (Challenge Handshake Authentication Protocol)
vi_vn: Giao thức Xác thực Bắt tay Ba bước (CHAP)

source: Changes to these types of disk volumes are saved.
ru: Для этого типа томов изменения сохраняются.
vi_vn: Những thay đổi đôi với các ổ đĩa lưu trữu dạng này đều được lưu lại.

source: Checks for and deletes unused VMs; the component of Image service that implements delayed delete.
ru: Выявляет и удаляет неиспользуемые ВМ. Компонент службы образов, который осуществляет отложенное удаление.
vi_vn: Kiểm tra và xóa các máy ảo không được sử dụng; Thành phần của dịch vụ Image có nhiệm vụ thực hiện việc xóa có thời gian chờ.

source: Checks for missing replicas and incorrect or corrupted objects in a specified Object Storage account by running queries against the back-end SQLite database.
de: Überprüft auf fehlende Replikate und falsche oder beschädigte Objekte in einem angegebenen Objektspeicherkonto, indem es Abfragen gegen das SQLite-Backend-Datenbank ausführt.
ru: Проверяет пропущенные реплики и неправильные или поврежденные объекты в указанной учетной записи хранилища объектов, запрашивая внутреннюю базу данных SQLite.
vi_vn: Kiểm tra lỗi các bản sao, các đối tượng lỗi hoặc bị hỏng của một tài khoản Oject Storage bằng cách truy vấn cơ sỏ dữ liệu back-end SQLite.

source: Checks for missing replicas or incorrect objects in specified Object Storage containers through queries to the SQLite back-end database.
de: Überprüft auf fehlende Replikate oder falsche Objekte in angegebenen Containern für Objektspeicher durch Abfragen auf der SQLite-Backend-Datenbank.
ru: Выявляет недостающие реплики или неправильные объекты в указанных контейнерах хранилища объектов с помощью запросов к внутренней базе данных SQLite.
vi_vn: Kiểm tra các bản sao bị mất hoặc các object không chính xác trong các container cụ thể thông qua các chất vấn với cơ sở dữ liệu back-end SQLite.

source: Choose glance image which has ``cinder_img_volume_type`` property and create a volume from the image.
de: Wählen Sie ein Abbild mit der Eigenschaft `` cinder_img_volume_type`` und erstellen Sie einen Datenträger aus dem Abbild.
ru: Выберите образ Glance, для которого задано свойство ``cinder_img_volume_type`` и создайте том из образа.

source: Choosing a host based on the existence of a GPU is currently unsupported in OpenStack.
de: Die Auswahl eines Hosts, der auf der Existenz eines GPU basiert, wird derzeit in OpenStack nicht unterstützt.
ru: Выбор хоста на основе GPU, в данный момент не поддерживаемый OpenStack.
vi_vn: Việc chọn một máy vật lý dựa trên sự tồn tại của một GPU hiện không được hỗ trợ trong OpenStack.

source: Cinder supports these three ways to specify ``volume type`` during volume creation.
de: Cinder unterstützt diese drei Möglichkeiten, ``volume type`` bei der Datenträgererstellung anzugeben.
ru: В Cinder можно указать ``volume type`` во время создания тома тремя способами.

source: Cisco neutron plug-in
ru: Плагин Cisco Neutron

source: Client
ru: Клиент

source: Cloud Auditing Data Federation (CADF)
ru: CADF (Cloud Auditing Data Federation)

source: Cloud Auditing Data Federation (CADF) is a specification for audit event data. CADF is supported by OpenStack Identity.
de: Cloud Auditing Data Federation (CADF) ist eine Spezifikation für Audit-Ereignis-Daten. CADF wird von OpenStack Identity unterstützt.
ru: CADF (Cloud Auditing Data Federation) — спецификация для данных событий аудита. CADF поддерживается службой идентификации OpenStack.
vi_vn: Cloud Auditing Data Federation (CADF) là một đặc điểm kĩ thuật phục vụ cho việc kiểm tra các dữ liệu sự kiện. CADF được hỗ trợ bởi OpenStack Identity.

source: Cloud Data Management Interface (CDMI)
ru: CDMI (Cloud Data Management Interface )
vi_vn: Giao diện Quản lý Thông tin Điện toán Đám Mây (CDMI)

source: Cloud Infrastructure Management Interface (CIMI)
ru: CIMI (Cloud Infrastructure Management Interface )
vi_vn: Giao diện Quản lý Cơ sở hạ tầng Cloud (CIMI)

source: Clustering service
de: Clusterdienst
ru: Служба кластеризации

source: Code name for :term:`Workflow service <Workflow service (mistral)>`.
de: Code name für :term:`Workflow service <Workflow service (mistral)>`.
ru: Кодовое имя для :term:`службы потока операций <Workflow service (mistral)>`.

source: Code name for the :term:`Containers Infrastructure Management service<Container Infrastructure Management service (magnum)>`.
de: Code name für :term:`Containers Infrastructure Management service<Container Infrastructure Management service (magnum)>`.
ru: Кодовое имя для :term:`службы управления инфраструктурой контейнеров<Container Infrastructure Management service (magnum)>`.

source: Code name for the DNS service project for OpenStack.
ru: Кодовое имя проекта службы DNS для OpenStack.

source: Code name of the :term:`Key Manager service <Key Manager service (barbican)>`.
de: Code-Name von :term:`Schlüsselverwaltungsdienst <Key Manager service (barbican)>`.
ru: Кодовое имя :term:`службы диспетчера ключей <Key Manager service (barbican)>`.

source: Codename for :term:`Block Storage service <Block Storage service (cinder)>`.
de: Codename für :term:`Block Storage Dienst <Block Storage service (cinder)>`.
ru: Кодовое имя :term:`службы блочных хранилищ <Block Storage service (cinder)>`.

source: Codename for OpenStack :term:`Compute service <Compute service (nova)>`.
ru: Кодовое имя :term:`службы вычислительных ресурсов <Compute service (nova)>` OpenStack.

source: Codename for OpenStack :term:`Database service <Database service (trove)>`.
ru: Кодовое имя :term:`службы баз данных <Database service (trove)>` OpenStack.

source: Codename for OpenStack :term:`Monitoring <Monitoring (monasca)>`.
de: Codename für OpenStack :term:`Monitoring <Monitoring (monasca)>`.
ru: Кодовое имя :term:`мониторинга <Monitoring (monasca)>` OpenStack.

source: Codename for OpenStack :term:`Networking service <Networking Service (neutron)>`.
ru: Кодовое имя :term:`службы управления сетью <Networking Service (neutron)>`.

source: Codename for OpenStack :term:`Object Storage service<Object Storage service (swift)>`.
ru: Кодовое имя :term:`службы объектного хранилища<Object Storage service (swift)>`.

source: Codename for OpenStack :term:`Shared File Systems service<Shared File Systems service (manila)>`.
de: Codename für OpenStack :term:`Shared File Systems service<Shared File Systems service (manila)>`.
ru: Кодовое имя для :term:`службы общих файловых систем <Shared File Systems service (manila)>` OpenStack.

source: Codename for the :term:`Application Catalog service <Application Catalog service (murano)>`.
de: Codename für den :term:`Application Catalog service <Application Catalog service (murano)>`.
ru: Кодовое имя :term:`службы каталога приложений <Application Catalog service (murano)>`.

source: Codename for the :term:`Bare Metal service <Bare Metal service (ironic)>`.
de: Codename für den :term:`Bare Metal Dienst <Bare Metal service (ironic)>`.
ru: Кодовое имя для :term:`Bare Metal service <Bare Metal service (ironic)>`.

source: Codename for the :term:`Benchmark service<Benchmark service (rally)>`.
ru: Кодовое имя :term:`службы измерения производительности<Benchmark service (rally)>`.

source: Codename for the :term:`Common Libraries project<Common Libraries (oslo)>`.
ru: Кодовое имя :term:`проекта общих библиотек<Common Libraries (oslo)>`.

source: Codename for the :term:`Dashboard <Dashboard (horizon)>`.
de: Codename für das :term:`Dashboard <Dashboard (horizon)>`.
ru: Кодовое имя :term:`панель управления <Dashboard (horizon)>`.

source: Codename for the :term:`Data Processing service<Data Processing service (sahara)>`.
ru: Кодовое имя :term:`службы обработки данных<Data Processing service (sahara)>`.

source: Codename for the :term:`Image service<Image service (glance)>`.
de: Codename für den :term:`Abbilddienst <Image service (glance)>`.
ru: Кодовое имя :term:`службы образов<Image service (glance)>`.

source: Codename for the :term:`Message service <Message service (zaqar)>`.
de: Codename für :term:`Nachrichtendienst <Message service (zaqar)>`.
ru: Кодовое имя :term:`службы сообщений <Message service (zaqar)>`.
