Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: Depending on context, the core API is either the OpenStack API or the main API of a specific core project, such as Compute, Networking, Image service, and so on.
de: Je nach Kontext ist die Kern-API entweder die OpenStack API oder die Haupt-API eines bestimmten Kernprojekts wie Compute, Networking, Abbilddienst und so weiter.
ru: В зависимости от контекста: OpenStack API или основной API определенного официального проекта, например службы вычислительных ресурсов, сетевой службы, службы образов и др.
vi_vn: Dựa vào từng văn cảnh mà lõi API hoặc là API OpenStack hoặc là API chính của một dự án lõi cụ thể, như Compute, Networking, dịch vụ Image,...

source: Deployment service
de: Bereitstellungsdienst (fuel)
ru: Служба развертывания

source: Describes the parameters of the various virtual machine images that are available to users; includes parameters such as CPU, storage, and memory. Alternative term for flavor.
de: Beschreibt die Parameter der verschiedenen virtuellen Maschinenabilder, die den Benutzern zur Verfügung stehen; Enthält Parameter wie CPU, Speicher und RAM. Alternativer Begriff für Variante.
ru: Описывает параметры образов различных виртуальных машин, которые доступны пользователю, включая такие параметры, как ЦП, хранилище и память. Альтернативный термин для flavor.
vi_vn: Mô tả các thông số của một loạt các image máy ảo hiện hành với người dùng; bao gồm các thông số như CPU, kho lưu trữ và bộ nhớ. Thuật ngữ thay thế cho flavor.

source: Description
de: Beschreibung
ru: Описание

source: Designed as an OpenStack component.
de: Entworfen als OpenStack-Komponente.
ru: Спроектировано как компонент OpenStack.

source: Desktop-as-a-Service
ru: Компьютер как услуга
vi_vn: Desktop như là một Dịch vụ

source: Determines whether back-end members of a VIP pool can process a request. A pool can have several health monitors associated with it. When a pool has several monitors associated with it, all monitors check each member of the pool. All monitors must declare a member to be healthy for it to stay active.
de: Legt fest, ob Back-End-Mitglieder eines VIP-Pools eine Anfrage bearbeiten können. Ein Pool kann mehrere Gesundheitsmonitoren mit ihm verbunden haben. Wenn ein Pool mehrere Monitore mit ihm verbunden ist, überprüfen alle Monitore jedes Mitglied des Pools. Alle Monitore müssen ein Mitglied erklären, um gesund zu sein, damit es aktiv bleibt.
ru: Определяет, могут ли обрабатывать запрос серверные участники пула с определенным VIP. С пулом могут быть связаны несколько мониторов работоспособности. В этом случае все мониторы проверяют каждого участника пула. Чтобы участник остался активным, все мониторы должны о его работоспособности.
vi_vn: Xác định xem các thành viên back-end của một pool VIP có thể xử lý yêu cầu hay không. Một pool có thể có một số kiểm tra tình trạng liên kết với nó. Khi một pool có nhiều giám sát liên kết với nó, tất cả các giám sát kiểm tra từng thành viên của pool. Tất cả các giám sát phải khai báo thành viên ở trạng thái tốt để tiếp tục hoạt động.

source: Device plugged into a PCI slot, such as a fibre channel or network card.
de: Gerät eingesteckt in einen PCI-Steckplatz, wie z.B. ein Fibre Channel oder eine Netzwerkkarte.
ru: Устройство, подключенное к разъему PCI, например оптоволоконный канал или сетевая карта.
vi_vn: Thiết bị được cắm vào một khe PCI như là một fibre channel hoặc card mạng.

source: Disables server-side message acknowledgment in the Compute RabbitMQ. Increases performance but decreases reliability.
ru: Отключает подтверждение сообщений на стороне сервера в RabbitMQ службы вычислительных ресурсов. Производительность увеличивается, но надежность снижается.
vi_vn: Vô hiệu hóa những tin nhắn server-side trong Compute RabbitMQ. Tăng hiệu suất nhưng giảm độ tin cậy.

source: Discover the version number for a client
de: Herausfinden der Versionsnummer eines Clients
ru: Просмотр версии клиента

source: Discretionary Access Control (DAC)
ru: Дискреционное управление доступом (DAC)

source: Disk-based data storage generally represented as an iSCSI target with a file system that supports extended attributes; can be persistent or ephemeral.
de: Festplatten-basierte Datenspeicherung allgemein als iSCSI-target mit einem Dateisystem dargestellt, das erweiterte Attribute unterstützt; Kann persistent oder vergänglich sein.
ru: Дисковое хранилище данных, которое обычно предоставляется как цель iSCSI с помощью файловой системы, поддерживающей расширенные атрибуты. Может быть постоянным или временным (эфемерным).
vi_vn: Hệ thống lưu trữ dưới dạng đĩa cứng thường được biểu diễn như là một iSCSI target với một hệ thống tập tin mà hỗ trợ nhiều tính năng mở rộng, có thẻ sử dụng lâu dài hoặc tạm thời.

source: Disk-based virtual memory used by operating systems to provide more memory than is actually available on the system.
ru: Виртуальная память на диске, используемая операционными системами для предоставления большего объема памяти, чем действительно доступно в системе.
vi_vn: Bộ nhớ ảo nền tảng đĩa được sử dụng bởi các hệ điều hành để cung cấp nhiều bộ nhớ hơn khả năng cung cấp của hệ thống.

source: Distributed block storage system for QEMU, supported by OpenStack.
ru: Система распределенного блочного хранилища для QEMU, поддерживаемая OpenStack.
vi_vn: Hệ thống phân phối block storage cho QEMU, được hỗ trợ bởi OpenStack.

source: Distributes partitions proportionately across Object Storage devices based on the storage capacity of each device.
de: Verteilt Partitionen proportional über Objektspeichergeräte basierend auf der Speicherkapazität jedes Geräts.
ru: Пропорционально распределяет разделы по устройствам хранилища объектов на основе емкости хранилища каждого устройства.
vi_vn: Phân phối các phân vùng một cách cân đối trên các thiết bị của Object Storage dựa trên khả năng lưu trữ của từng thiết bị.

source: Documentation
de: Dokumentation
ru: Документация

source: Documentation feedback
de: Dokumentation Feedback
ru: Отзывы о документации

source: Domain Name System (DNS)
ru: Служба доменных имен (DNS)
vi_vn: Hệ thống Tên Miền (DNS)

source: Download and source the OpenStack RC file
de: Downloaden und sourcen Sie die OpenStack RC-Datei
ru: Загрузка и выбор RC-файла OpenStack

source: Drivers
de: Treiber
ru: Драйверы

source: Drivers or a service back end are integrated to the centralized server. They are used for accessing identity information in repositories external to OpenStack, and may already exist in the infrastructure where OpenStack is deployed (for example, SQL databases or LDAP servers).
de: Treiber oder ein Dienste-Backend sind auf dem zentralen Server integriert. Sie werden für den Zugriff auf Identitätsinformationen in Repositorys außerhalb von OpenStack verwendet und können bereits in der Infrastruktur vorhanden sein, die in OpenStack implementiert sind (z. B. SQL-Datenbanken oder LDAP-Server).
ru: Драйверы или серверная часть службы устанавливаются на централизованном сервере. Они обеспечивают доступ к сведениям для проверки подлинности в репозиториях, внешних по отношению OpenStack. Эти репозитории могут уже существовать в инфраструктуре, где развернута OpenStack (например, базы данных SQL или серверы LDAP).

source: During the set up or testing of OpenStack, you might have questions about how a specific task is completed or be in a situation where a feature does not work correctly. Use the `ask.openstack.org <https://ask.openstack.org>`__ site to ask questions and get answers. When you visit the https://ask.openstack.org site, scan the recently asked questions to see whether your question has already been answered. If not, ask a new question. Be sure to give a clear, concise summary in the title and provide as much detail as possible in the description. Paste in your command output or stack traces, links to screen shots, and any other information which might be useful.
ru: Во время установки или тестирования OpenStack у вас могут возникнуть вопросы как решить определенную задачу или вы можете оказаться в ситуации некорректной работы определенной функции. Используйте ресурс `ask.openstack.org <https://ask.openstack.org>`__, чтобы задавать вопросы и получать на них ответы. Посетите сайт https://ask.openstack.org, прочитайте недавно заданные вопросы, чтобы найти ответ на свой вопрос. Если ответ найти не удалось, задайте вопрос. Для этого составьте понятный краткий заголовок вопроса и подробно опишите свою проблему. Скопируйте вывод своих команд или трассировки стека, добавьте ссылки на снимки экрана и другую полезную информацию.

source: Dynamic Host Configuration Protocol (DHCP)
ru: Протокол динамической настройки хостов (DHCP)
vi_vn: Giao thức Cấu hình Động Máy chủ (DHCP)

source: Dynamic HyperText Markup Language (DHTML)
ru: Динамический язык описания структуры (DHTML)
vi_vn: Ngôn ngữ Đánh dấu Siêu Văn bản Động (DHTML)

source: EBS boot volume
de: EBS Boot-Datenträger
ru: Загрузочный том EBS
vi_vn: khối lượng khởi chạy EBS

source: EC2 access key
de: EC2 Zugriffsschlüssel
ru: Ключ доступа к EC2
vi_vn: key truy cập EC2

source: EC2 secret key
de: EC2 Geheimschlüssel
ru: секретный ключ EC2
vi_vn: key bí mật EC2

source: Each OpenStack release has a code name. Code names ascend in alphabetical order: Austin, Bexar, Cactus, Diablo, Essex, Folsom, Grizzly, Havana, Icehouse, Juno, Kilo, Liberty, Mitaka, Newton, Ocata, Pike, and Queens. Code names are cities or counties near where the corresponding OpenStack design summit took place. An exception, called the Waldon exception, is granted to elements of the state flag that sound especially cool. Code names are chosen by popular vote.
ru: Для каждого релиза OpenStack выбирается кодовое имя. Кодовые имена в алфавитном порядке: Austin, Bexar, Cactus, Diablo, Essex, Folsom, Grizzly, Havana, Icehouse, Juno, Kilo, Liberty, Mitaka, Newton, Ocata, Pike и Queens. Кодовые имена выбираются в соответствии с городами или географическими названиями, рядом с которыми проходил соответствующий саммит разработчиков OpenStack. Исключение сделано для релиза Grizzly, который назван в честь элемента на флаге штата США. Кодовые имена выбираются всеобщим голосованием.

source: Easily scalable for future growth
de: Einfache Skalierbarkeit für zukünftiges Wachstum
ru: Удобная масштабируемость для расширения в будущем

source: Efficiently polls metering data related to OpenStack services.
de: Ruft Messwerte der OpenStack Dienste effizient ab.
ru: Эффективно запрашивают данные измерений, относящиеся к службам OpenStack.

source: Either a soft or hard reboot of a server. With a soft reboot, the operating system is signaled to restart, which enables a graceful shutdown of all processes. A hard reboot is the equivalent of power cycling the server. The virtualization platform should ensure that the reboot action has completed successfully, even in cases in which the underlying domain/VM is paused or halted/stopped.
ru: Бывает горячая или холодная перезагрузка сервера. При горячей перезагрузке операционная система получает сигнал на перезапуск, что позволяет нормально завершить работу всех процессов. Холодная перезагрузка это процесс выключения и включения питания сервера. Платформа виртуализации должна гарантировать, что перезагрузка выполняется успешно, даже когда базовый домен или ВМ остановлены или приостановлены.
vi_vn: Một máy chủ có thể khởi động lại bằng phần cứng hay phần mềm. Với khởi động lại bằng phần mềm, hệ điều hành được báo hiệu để khởi động lại, cho phép tắt toàn diện tất cả các tiến trình. Khởi động lại bằng phần cứng tương đương với tái tạo lại chu kì năng lượng các máy chủ. Các nền tảng ảo hóa phải đảm bảo rằng các hành động khởi động lại hoàn toàn thành công, thậm chí trong trường hợp, trong đó domain/máy ảo VM cơ bản bị tạm dừng hoặc dừng hẳn.

source: Element of RabbitMQ that provides a response to an incoming MQ message.
de: Element von RabbitMQ, das eine Antwort auf eine eingehende MQ-Nachricht liefert.
ru: Элемент RabbitMQ, который отвечает на входящее сообщение MQ.
vi_vn: Một thành phần của RabbitMQ cung cấp một hồi đáp cho các tin nhắn MQ đang đến.

source: Enables Compute and Networking integration, which enables Networking to perform network management for guest VMs.
ru: Обеспечивает интеграцию служб Compute и Networking integration, что позволяет Networking управлять сетью для работы гостевых ВМ.
vi_vn: Cho phép việc tích hợp Compute và Networking qua đó cho phép Networking thực hiện công việc quản lý mạng cho các máy ảo khách.

source: Enables Compute to communicate with NetApp storage devices through the NetApp OnCommand Provisioning Manager.
de: Aktiviert Compute, um mit NetApp-Speichergeräten über den NetApp OnCommand Provisioning Manager zu kommunizieren.
ru: Позволяет службе вычислительных ресурсов взаимодействовать с устройствами хранения NetApp через NetApp OnCommand Provisioning Manager.

source: Enables Network-Connectivity-as-a-Service for other OpenStack services, such as OpenStack Compute. Provides an API for users to define networks and the attachments into them. Has a pluggable architecture that supports many popular networking vendors and technologies.
de: Aktiviert Network-Connectivity-as-a-Service für andere OpenStack-Dienste wie OpenStack Compute. Stellt eine API für Benutzer zur Verfügung, um Netzwerke und die Anlagen in ihnen zu definieren. Hat eine umsteckbare Architektur, die viele populäre Netzwerktreiber und Technologien unterstützt.
ru: Реализует модель «подключение по сети как услуга» для других служб OpenStack, например для службы вычислительных ресурсов. Предоставляет пользователям API-интерфейс для создания сетей и настройки дополнительных функций. Имеет расширяемую архитектуру, которая поддерживает многие популярные сетевые технологии и сетевые устройства.

source: Enables Networking to distribute incoming requests evenly between designated instances.
de: Ermöglicht Networking, eingehende Anfragen gleichmäßig zwischen bestimmten Instanzen zu verteilen.
ru: Позволяет службе управления сетью равномерно распределять входящие запросы между инстансами.
vi_vn: Cho phép Networking phân bổ đồng đều các yêu cầu được gửi tới giữa các máy ảo được chỉ định.

source: Enables a Linux bridge to understand a Networking port, interface attachment, and other abstractions.
de: Ermöglicht eine Linux-Bridge, einen Networking-Port, eine Schnittstellenanbindung und andere Abstraktionen zu verstehen.
ru: Позволяет Linux Bridge взаимодействовать с портом службы сети (Networking), подключением интерфейса и другими абстракциями.
vi_vn: Cho phép một Linux bridge hiểu một cổng Networking, giao diện tích hợp, và các khái niệm khác.

source: Enables users to submit commands as a tenant administrator or end user.
ru: Позволяет пользователям работать с командами в качестве администратора тенанта или конечного пользователя.

source: Enables users to submit commands to the REST API through a command-line client authorized as either a admin user, reseller user, or swift user.
de: Ermöglicht es Benutzern, Befehle an die REST-API über einen Befehlszeilenclient zu senden, der als Administratorbenutzer, Wiederverkäuferbenutzer oder schneller Benutzer autorisiert ist.
ru: Позволяет пользователям (администраторам, торговым посредникам и пользователям swift) отправлять команды в REST API с помощью авторизованного клиента командной строки.

source: Encryption is available
de: Verschlüsselung ist verfügbar
ru: Доступна возможность шифрования

source: Encryption is not available yet
de: Verschlüsselung ist noch nicht verfügbar.
ru: Шифрование пока недоступно

source: Ensure that the ``C:\Python27\Scripts`` directory is defined in the ``PATH`` environment variable, and use the ``easy_install`` command from the setuptools package:
de: Stellen Sie sicher, dass das Verzeichnis `` C: \ Python27 \ Scripts`` in der Umgebungsvariablen `` PATH` definiert ist und verwenden Sie den ``easy_install`` Befehl aus dem Paket setuptools:
ru: Убедитесь, что в переменной среды ``PATH`` указан каталог ``C:\Python27\Scripts`` и используйте команду ``easy_install`` из пакета setuptools:

source: Ensure that the version of qemu you are using is version 0.14 or later. Earlier versions of qemu result in an ``unknown option -s`` error message in the ``/var/log/nova/nova-compute.log`` file.
de: Stellen Sie sicher, dass die Version von qemu, die Sie verwenden, Version 0.14 oder höher ist. Frühere Versionen von qemu führen zu einer `` unknown Option -s`` Fehlermeldung in der ``/ var / log / nova / nova-compute.log`` Datei.
ru: Убедитесь в том, что используется версия qemu 0.14 или более поздняя. Если использовать более ранние версии qemu, в файле ``/var/log/nova/nova-compute.log`` отобразится сообщение об ошибке ``unknown option -s``.

source: Eucalyptus Kernel Image (EKI)
ru: Образ ядра Eucalyptus (EKI)

source: Eucalyptus Machine Image (EMI)
ru: Образ машины Eucalyptus (EMI)

source: Eucalyptus Ramdisk Image (ERI)
ru: Образ Ramdisk Eucalyptus (ERI)

source: Examine the ``/var/log/nova/nova-api.log`` and ``/var/log/nova/nova-compute.log`` log files for error messages.
de: Überprüfen Sie die Protokolldateien ``/ var / log / nova / nova-api.log`` und ``/ var / log / nova / nova-compute.log`` für Fehlermeldungen.
ru: Проверьте файлы журналов ``/var/log/nova/nova-api.log`` и ``/var/log/nova/nova-compute.log`` на наличие сообщений об ошибках.

source: Example cinder.conf file configuration.
de: Beispielkonfiguration cinder.conf.
ru: Пример файла конфигурации cinder.conf.

source: Example: 1 TB "extra hard drive"
de: Beispiel: 1 TB "extra Festplatte"
ru: Пример: "дополнительный жесткий диск" размером 1 ТБ

source: Example: 1 TB of file share
de: Beispiel: 1 TB der Dateifreigabe
ru: Пример: 1 ТБ общего ресурса

source: Example: 10 GB first disk, 30 GB/core second disk
de: Beispiel: 10 GB erste Platte, 30 GB/Kern zweite Platte
ru: Пример: первый диск размером 10 ГБ, основной второй диск размером 30 ГБ

source: Example: 10s of TBs of data set storage
ru: Пример: десятки терабайт наборов данных в хранилище данных

source: Extension to iptables that allows creation of firewall rules that match entire "sets" of IP addresses simultaneously. These sets reside in indexed data structures to increase efficiency, particularly on systems with a large quantity of rules.
de: Erweiterung auf iptables, die die Erstellung von Firewall-Regeln ermöglicht, die mit allen "Sets" von IP-Adressen gleichzeitig übereinstimmen. Diese Sets befinden sich in indizierten Datenstrukturen, um die Effizienz zu erhöhen, insbesondere bei Systemen mit einer großen Anzahl von Regeln.
ru: Расширение для iptables позволяющее создавать правила брандмауэров, которые одновременно соответствуют целым "наборам" IP-адресов. Эти наборы находятся в структурах индексированных данных, чтобы повысить эффективность, особенно для систем с о значительным количеством правил.
vi_vn: Phần mở rộng của iptables cho phép khởi tạo các quy tắc tường lửa cho một bộ các địa chỉ IP cùng một lúc. Các bộ này nằm trong các cấu trúc dữ liệu được lập chỉ mục để tăng hiệu quả, đặc biệt trên các hệ thống có số lượng lớn các quy tắc.

source: F
ru: Ф

source: Facility in Compute that allows each virtual machine instance to have more than one VIF connected to it.
de: Facility in Compute, die jedem virtuellen Maschineninstanz erlaubt, mehr als ein VIF damit verbunden zu haben.
ru: Возможность службы вычислительных ресурсов, которая позволяет каждому инстансу ВМ подключаться к более чем одному виртуальному интерфейсу (VIF).
vi_vn: Cơ sở nằm trong Compute cho phép mỗi instance máy ảo có thể có nhiều hơn một VIF kết nối vào nó.

source: Facility in Compute that enables a virtual machine instance to have more than one VIF connected to it.
ru: Возможность службы вычислительных ресурсов, которая позволяет каждому инстансу ВМ подключаться к более чем одному виртуальному интерфейсу (VIF).

source: Fast provisioning of Hadoop clusters on OpenStack for development and QA.
de: Schnelle Bereitstellung von Hadoop-Clustern auf OpenStack für Entwicklung und QA.
ru: Быстрая подготовка кластеров Hadoop в OpenStack для разработки и контроля качества.

source: Feature in modern Ethernet networks that supports frames up to approximately 9000 bytes.
de: Eine Eigenschaft moderner Ethernet-Netzwerke, die Frame-Größen bis zu etwa 9000 Bytes ermöglicht.
ru: Функция в современных сетях Ethernet, поддерживающая фреймы размером приблизительно до 9000 байтов.
vi_vn: Có mặt trong các hệ thống mạng Ethernet hiện đại hỗ trợ các frame lên tới xấp xỉ 9000 bytes.

source: Feature of certain network interface drivers that combines many smaller received packets into a large packet before delivery to the kernel IP stack.
de: Feature von bestimmten Netzwerk-Interface-Treiber, die viele kleinere empfangene Pakete in ein großes Paket vor der Lieferung an den Kernel IP-Stack kombiniert.
ru: Функция некоторых драйверов сетевого интерфейса, которые объединяют небольшие полученные пакеты в один большой пакет перед его отправкой на сетевой (IP) стек ядра.
vi_vn: Tính năng của một số trình điều khiển giao diện mạng kết hợp nhiều gói tin đã nhận nhỏ hơn vào một gói tin lớn trước khi chuyển đến cho kernel IP stack.

source: Feedback
ru: Отзыв

source: File Storage (manila)
de: Datei Storage (manila)
ru: Общая файловая система (manila)

source: File system option that enables storage of additional information beyond owner, group, permissions, modification time, and so on. The underlying Object Storage file system must support extended attributes.
de: Dateisystemoption, die die Speicherung zusätzlicher Informationen über Besitzer, Gruppe, Berechtigungen, Änderungszeit und so weiter ermöglicht. Das zugrunde liegende Object Storage Dateisystem muss erweiterte Attribute unterstützen.
ru: Параметр файловой системы, благодаря которому можно хранить дополнительную информацию помимо владельца, группы, разрешений, времени изменения и прочего. Базовая файловая система объектного хранилища должна поддерживать дополнительные атрибуты.
vi_vn: Tùy chọn của hệ thống file cho phép chức năng lưu trữ các thông tin bổ sung ngoài chủ ở hữu, nhóm, các quyền, thời gian sửa, và nhiều hơn thế. Hệ thống file cơ bản của Object Storage phải hỗ trợ các đặc tính mwor rộng.

source: Filtering tool for a Linux bridging firewall, enabling filtering of network traffic passing through a Linux bridge. Used in Compute along with arptables, iptables, and ip6tables to ensure isolation of network communications.
de: Filter-Tool für eine Linux-Bridging-Firewall, ermöglicht die Filterung von Netzwerk-Verkehr durch eine Linux-Bridge. Verwendet in Compute zusammen mit arptables, iptables und ip6tables, um die Isolierung der Netzwerkkommunikation zu gewährleisten.
ru: Инструмент фильтрации сетевого трафика для брандмауэров на программных мостах Linux. Используется в вычислительной службе совместно с arptables, iptables и ip6tables для обеспечения изоляции сетевых коммуникаций.

source: Find the matching transfer ID:
de: Finden Sie die übereinstimmende Transfer-ID:
ru: Найдите соответствующий ID переноса:

source: First, add the Open Build Service repository:
ru: Сначала добавьте репозиторий сервиса Open Build:

source: Flat Manager
ru: Диспетчер одноуровневой сети

source: For IaaS, ability for a regular (non-privileged) account to manage a virtual infrastructure component such as networks without involving an administrator.
ru: Для IaaS возможность обычной (непривилегированной) учетной записи управлять компонентом виртуальной инфраструктуры (например, сетью) без помощи администратора.

source: For Mac OS X or Linux:
de: Für Mac OS X oder Linux:
ru: Для Mac OS X или Linux:

source: For Microsoft Windows:
de: Für Microsoft Windows:
ru: Для Microsoft Windows:
