Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: The Network Controller provides virtual networks to enable compute servers to interact with each other and with the public network. All machines must have a public and private network interface. A VLAN network is a private network interface, which is controlled by the ``vlan_interface`` option with VLAN managers.
de: Der Netzwerkcontroller stellt virtuelle Netzwerke zur Verfügung, um Computing-Servern zu ermöglichen, miteinander und mit dem öffentlichen Netzwerk zu interagieren. Alle Maschinen müssen über eine öffentliche und private Netzwerkschnittstelle verfügen. Ein VLAN-Netzwerk ist eine private Netzwerkschnittstelle, die von der `` vlan_interface`` Option mit VLAN-Managern gesteuert wird.
ru: Контроллер сети обеспечивает работу виртуальных сетей, позволяя вычислительным серверам взаимодействовать друг с другом и с общедоступной сетью. Все компьютеры должны иметь интерфейс подключения к общедоступной и к частной сети. Сеть VLAN это интерфейс частной сети, который управляется с помощью диспетчеров VLAN и параметра `vlan_interface`` .

source: The Network Controller provides virtual networks to enable compute servers to interact with each other and with the public network. All machines must have a public and private network interface. A private network interface can be a flat or VLAN network interface. A flat network interface is controlled by the flat_interface with flat managers. A VLAN network interface is controlled by the ``vlan_interface`` option with VLAN managers.
ru: Сетевой контроллер позволяет виртуальным сетям использовать вычислительные серверы для взаимодействия друг с другом и с публичной сетью. Каждый компьютер должен иметь интерфейс подключения к публичной и к частной сети. Интерфейс частной сети может быть сетевым интерфейсом одноранговой сети или сети VLAN. Управление сетевым интерфейсом однораноговой сети осуществляют диспетчеры одноранговой сети с помощью параметра flat_interface. Для управления сетевым интерфейсом VLAN диспетчеры VLAN используют параметр ``vlan_interface``.

source: The Network Controller provides virtual networks to enable compute servers to interact with each other and with the public network. All machines must have a public and private network interface. The public network interface is controlled by the ``public_interface`` option.
ru: Сетевой контроллер позволяет виртуальным сетям использовать вычислительные серверы для взаимодействия друг с другом и с публичной сетью. Каждый компьютер должен иметь интерфейс подключения к публичной и к частной сети. Для управления интерфейсом публичной используется параметр ``public_interface``.

source: The Object Storage back-end process that creates and manages object replicas.
ru: Внутренний процесс объектного хранилища, который создает и управляет репликами объектов.
vi_vn: Quy trình back-end của Object Storage có nhiệm vụ khởi tạo và quản lý các bản sao object.

source: The Object Storage component that provides container services, such as create, delete, list, and so on.
de: Die Objektspeicherungskomponente, die Containerdienste bereitstellt, z. B. Erstellen, Löschen, Listen und so weiter.
ru: Компонент хранилища объектов, который предоставляет службы контейнеров, например создание, удаление, список и др.
vi_vn: Thành phần của Object Storage cung cấp các dịch vụ container như khởi tạo, xóa, liệt kê, và hơn thế nữa.

source: The Object Storage context of an account. Do not confuse with a user account from an authentication service, such as Active Directory, /etc/passwd, OpenLDAP, OpenStack Identity, and so on.
de: Der Objektspeicherungskontext eines Kontos. Verwechseln Sie es nicht mit einem Benutzerkonto von einem Authentifizierungsdienst wie Active Directory, / etc / passwd, OpenLDAP, OpenStack Identity usw.
ru: Контекст хранилища объектов для учетной записи. Не путать с учетной записью пользователя из службы аутентификации, например Active Directory, /etc/passwd, OpenLDAP, OpenStack Identity и т. д.
vi_vn: Khái niệm về một tài khoản trong Object Storage. Tránh nhầm lẫn với một tài khoản người dùng từ dịch vụ xác thực như Active Directory, /etc/passwd, OpenLDAP, OpenStack Identity,...

source: The OpenStack :term:`Identity service <Identity service (keystone)>` provides a single point of integration for managing authentication, authorization, and a catalog of services.
de: Der OpenStack :term: `Identitätsdienst <Identity service (keystone)>` bietet einen einzigen Integrationspunkt für die Verwaltung der Authentifizierung, Autorisierung und eines Dienstkatalogs.
ru: Служба идентификации OpenStack :term:`Identity <Identity service (keystone)>` интегрирует управление аутентификацией, авторизацию и каталог служб.

source: The OpenStack Administrator configures the basic infrastructure using the following steps:
de: Der OpenStack Administrator konfiguriert die Grundinfrastruktur mit den folgenden Schritten:
ru: Администратор OpenStack настраивает базовую инфраструктуру следующим образом.

source: The OpenStack Block Storage service (cinder) adds persistent storage to a virtual machine. Block Storage provides an infrastructure for managing volumes, and interacts with OpenStack Compute to provide volumes for instances. The service also enables management of volume snapshots, and volume types.
de: Der OpenStack-Blockspeicherdienst (cinder) fügt einem virtuellen Computer persistenten Speicher hinzu. Blockspeicher bietet eine Infrastruktur zur Verwaltung von Datenträgern und interagiert mit OpenStack Compute, um Datenträger für Instanzen bereitzustellen. Der Dienst ermöglicht auch die Verwaltung von Datenträger-Schattenkopien und Datenträger-Typen.
ru: Служба хранилища блоков OpenStack (Cinder) добавляет виртуальным машинам постоянное хранилище. Оно предоставляет инфраструктуру для управления дисками и взаимодействует с вычислительными ресурсами OpenStack чтобы предоставить экземплярам диски. Служба также позволяет управлять снимками томов и типами томов.

source: The OpenStack IRC channel
de: Der OpenStack IRC Kanal
ru: IRC канал OpenStack
vi_vn: kênh IRC trao đổi về OpenStack

source: The OpenStack Image service includes the following components:
de: Der OpenStack Abbilddienst besteht aus den folgenden Komponenten:
ru: Служба образов OpenStack включает следующие компоненты.

source: The OpenStack Image service is central to Infrastructure-as-a-Service (IaaS) as shown in :ref:`get_started_conceptual_architecture`. It accepts API requests for disk or server images, and metadata definitions from end users or OpenStack Compute components. It also supports the storage of disk or server images on various repository types, including OpenStack Object Storage.
de: Der OpenStack Abbilddienst ist zentral für den Infrastruktur-as-a-Service (IaaS), wie in :ref: `get_started_conceptual_architecture`. Es akzeptiert API-Anforderungen für Platten- oder Server-Abbilder und Metadaten-Definitionen von Endbenutzern oder OpenStack Compute-Komponenten. Es unterstützt auch die Speicherung von Disk- oder Server-Abbilder auf verschiedenen Repository-Typen, einschließlich OpenStack Object Storage.
ru: Служба образов OpenStack — центральный элемент модели "инфраструктура как услуга" (IaaS), как показано в :ref:`get_started_conceptual_architecture`. Она принимает запросы API для образов дисков и серверов, а также определения метаданных от конечных пользователей или от компонентов службы вычислительных ресурсов OpenStack. Кроме того, служба сохраняет образы дисков и серверов в репозиториях различного типа, включая хранилище объектов OpenStack.

source: The OpenStack Object Storage is a multi-tenant object storage system. It is highly scalable and can manage large amounts of unstructured data at low cost through a RESTful HTTP API.
ru: Хранилище объектов OpenStack — это мультитенантная система хранения объектов. Обладает высокой масштабируемостью и с помощью RESTful HTTP API может управлять большими объемами неструктурированных данных при низких затратах.

source: The OpenStack Shared File Systems service (manila) provides file storage to a virtual machine. The Shared File Systems service provides an infrastructure for managing and provisioning of file shares. The service also enables management of share types as well as share snapshots if a driver supports them.
de: Der OpenStackdienst Verteilte Dateisysteme Systems (Manila) stellt Dateispeicher für eine virtuelle Maschine bereit. Der Dienst "Verteilte Dateisysteme" bietet eine Infrastruktur zum Verwalten und Bereitstellen von Dateifreigaben. Der Dienst ermöglicht auch das Verwalten von Freigabetypen sowie das Teilen von Schattenkopien, wenn ein Treiber diese unterstützt.
ru: Служба общих файловых систем OpenStack (Manila) предоставляет хранилище файлов для виртуальных машин. Эта служба предоставляет инфраструктуру для управления общими файлами и их предоставления. Кроме того, служба позволяет управлять типами и снимками общего доступа, если они поддерживаются драйвером.

source: The OpenStack community lives in the #openstack IRC channel on the Freenode network. You can hang out, ask questions, or get immediate feedback for urgent and pressing issues. To install an IRC client or use a browser-based client, go to `https://webchat.freenode.net/ <https://webchat.freenode.net>`__. You can also use Colloquy (Mac OS X, http://colloquy.info/), mIRC (Windows, http://www.mirc.com/), or XChat (Linux). When you are in the IRC channel and want to share code or command output, the generally accepted method is to use a Paste Bin. The OpenStack project has one at http://paste.openstack.org. Just paste your longer amounts of text or logs in the web form and you get a URL that you can paste into the channel. The OpenStack IRC channel is ``#openstack`` on ``irc.freenode.net``. You can find a list of all OpenStack IRC channels at https://wiki.openstack.org/wiki/IRC.
ru: Сообщество OpenStack находится на канале #openstack IRC в сети Freenode. Вы можете общаться, задавать вопросы и быстро получать ответы на сложные вопросы. Чтобы установить клиент IRC или использовать браузерный клиент, перейдите на страницу `https://webchat.freenode.net/ <https://webchat.freenode.net>`__. Кроме того, можно использовать Colloquy (Mac OS X, http://colloquy.info), mIRC (Windows, http://www.mirc.com) или XChat (Linux). Если вы зашли на канал IRC и хотите поделиться кодом или командой, обычно используется Pastebin. Проект OpenStack имеет такое приложение на странице http://paste.openstack.org. Просто вставьте большой фрагмент текста или журнала в веб-форму и получите URL-адрес, который можно вставить на канале. Канал OpenStack IRC — ``#openstack`` на ``irc.freenode.net``. Полный список каналов OpenStack IRC представлен на сайте https://wiki.openstack.org/wiki/IRC.

source: The OpenStack community values your set up and testing efforts and wants your feedback. To log a bug, you must sign up for a Launchpad account at https://launchpad.net/+login. You can view existing bugs and report bugs in the Launchpad Bugs area. Use the search feature to determine whether the bug has already been reported or already been fixed. If it still seems like your bug is unreported, fill out a bug report.
ru: Участники сообщества OpenStack высоко ценят ваши попытки по установке и тестированию и всегда рады получить ваши отзывы. Чтобы сообщить о проблеме, войдите в учетную запись Launchpad по адресу https://launchpad.net/+login. Здесь вы сможете ознакомиться с существующими проблемами и сообщить о новых в багтрекер Launchpad. Чтобы определить, известно ли уже о вашей проблеме и была ли она исправлена, воспользуйтесь поиском. Если все же окажется, что проблема новая, заполните отчет об ошибке.

source: The OpenStack configuration files use an INI format to describe options and their values. It consists of sections and key value pairs.
de: Die OpenStack-Konfigurationsdateien verwenden ein INI-Format, um Optionen und deren Werte zu beschreiben. Es besteht aus Abschnitten und Schlüsselwertpaaren.
ru: Для файлов конфигурации OpenStack используется формат INI, чтобы описывать параметры и их значения. Формат состоит из разделов и пар из ключа и значения.
vi_vn: Các tập tin cấu hình của OpenStack sử dụng định dạng INI để mô tả các tùy chọn và giá trị của hcungs. Nó bao gồm các mục và các cặp giá trị của key.

source: The OpenStack core project that implements services and associated libraries to provide massively-scalable, on-demand, self-service access to compute resources, including bare metal, virtual machines, and containers.
de: Das OpenStack Kernprojekt, dass Dienste und Bibliotheken implementiert und massiv-skalierbaren, Selbstbedienungszugriff auf Verlangen für Compute Ressourcen bereit stellt, einschließlich Bare Metal, virtuellen Maschinen und Containern.
ru: Официальный проект OpenStack, который реализует службы и связанные с ними библиотеки с целью предоставления массово масштабируемого самостоятельного доступа к вычислительным ресурсам, включая физические устройства, виртуальные машины и контейнеры.

source: The OpenStack core project that provides eventually consistent and redundant storage and retrieval of fixed digital content.
ru: Официальный проект OpenStack, который предоставляет согласованное хранилище с избыточностью и обеспечивает предоставление сохраненного цифрового контента.

source: The OpenStack dashboard is a modular `Django web application <https://www.djangoproject.com/>`__ that provides a graphical interface to OpenStack services.
ru: Панель мониторинга OpenStack — это модульное `веб- приложение Django <https://www.djangoproject.com/>`__, предоставляющее графический интерфейс службам OpenStack.

source: The OpenStack documentation uses several typesetting conventions.
de: Die Openstack-Dokumentation verwendet mehrere Schreibweisen.
ru: В документации OpenStack используется несколько типографских условных обозначений.

source: The OpenStack end user deploys the Database service using the following steps:
de: Der OpenStack-Endbenutzer erstellt den Datenbankdienst mit den folgenden Schritten:
ru: Конечные пользователи OpenStack развертывают службу баз данных следующим образом.

source: The OpenStack project is an open source cloud computing platform for all types of clouds, which aims to be simple to implement, massively scalable, and feature rich. Developers and cloud computing technologists from around the world create the OpenStack project.
de: Das OpenStack-Projekt ist eine Open-Source-Cloud-Computing-Plattform für alle Arten von Clouds, die einfach zu implementieren, massiv skalierbar und funktionsreich sind. Entwickler und Cloud-Computing-Techniker aus der ganzen Welt erstellten das OpenStack-Projekt.
ru: Проект OpenStack — это платформа для облачных вычислений с открытым исходным кодом для всех типов облаков, которая отличается удобством внедрения, широким масштабированием и разнообразием функций. Над проектом OpenStack работают разработчики и технологи облачных вычислений.

source: The OpenStack project that implements clustering services and libraries for the management of groups of homogeneous objects exposed by other OpenStack services. The project name of Clustering service is senlin.
ru: Проект OpenStack, который реализует службы кластеризации и библиотеки для управления группами однородных объектов, предоставляемых другими службами OpenStack. Имя проекта службы кластеризации — Senlin.

source: The OpenStack project that provides integrated tooling for backing up, restoring, and recovering file systems, instances, or database backups. The project name is freezer.
ru: Проект OpenStack, обеспечивающий интегрированные средства для резервного копирования и восстановления файловых систем, экземпляров и копий баз данных. Проект называется Freezer.

source: The OpenStack project which collects measurements of the utilization of the physical and virtual resources comprising deployed clouds, persists this data for subsequent retrieval and analysis, and triggers actions when defined criteria are met.
ru: Проект OpenStack, который собирает данные измерений об использовании физических и виртуальных ресурсов, входящих в развернутые облака. Служба телеметрии предоставляет эти данные для дальнейшего анализа и при достижении заданных показателей активизирует определенные действия.

source: The OpenStack project which implements services and associated libraries to provide on-demand, scalable, and technology-agnostic network abstraction.
ru: Проект OpenStack, который реализует службы и связанные с ними библиотеки для обеспечения масштабируемых, предоставляемых по требованию и независимых от технологий сетевых абстракций.

source: The OpenStack service that implement services and libraries to provide on-demand, self-service access to Block Storage resources via abstraction and automation on top of other block storage devices.
de: Der OpenStack-Dienst, der Dienste und Bibliotheken implementiert, um On-Demand-Self-Service-Zugriff auf Block Storage-Ressourcen über Abstraktion und Automatisierung über andere Blockspeichergeräte zu ermöglichen.
ru: Служба OpenStack, которая реализует службы и библиотеки, которые обеспечивают доступ по требованию к ресурсам блочного хранилища с помощью уровня абстракции и автоматизации поверх других устройств блочного хранения.

source: The OpenStack service that provide services and associated libraries to store, browse, share, distribute and manage bootable disk images, other data closely associated with initializing compute resources, and metadata definitions.
de: Der OpenStack-Dienst, der Dienste und zugehörige Bibliotheken zur Verfügung stellt, um bootfähige Datenträgerabbilder zu speichern, zu durchsuchen, zu teilen, zu verteilen und zu verwalten, andere Daten, die eng mit der Initialisierung von Berechnungsressourcen und Metadatendefinitionen verbunden sind.
ru: Служба OpenStack, которая предоставляет службы и связанные с ними библиотеки для хранения, поиска, совместного использования, распространения и управления загрузочными образами дисков, а также другие данные, тесно связанные с инициализацией вычислительных ресурсов и определениями метаданных.

source: The OpenStack service that provides a multi-tenant, highly scalable, performant, fault-tolerant monitoring-as-a-service solution for metrics, complex event processing and logging. To build an extensible platform for advanced monitoring services that can be used by both operators and tenants to gain operational insight and visibility, ensuring availability and stability.
ru: Служба OpenStack, которая обеспечивает мультенантный высокопроизводительный отказоустойчивый "мониторинг как услугу" для создания метрик, сложной обработки событий и ведения журналов. Используется для построения расширяемых платформ по предоставлению расширенных услуг мониторинга, которые могут использоваться операторами и тенантами для анализа работы, обеспечения контроля, доступности и надежности.

source: The OpenStack service that provides a service and associated libraries capable of managing and provisioning physical machines in a security-aware and fault-tolerant manner.
de: Der OpenStack-Dienst, der einen Dienst und die zugehörigen Bibliotheken zur Verfügung stellt, die in der Lage sind, physische Computer in sicherheitstechnischer und fehlertoleranter Weise zu verwalten und bereitzustellen.
ru: Служба OpenStack для безопасного и надежного управления физическими компьютерами и их подготовкой к работе, а также связанные со службой библиотеки.

source: The OpenStack service that provides a simple YAML-based language to write workflows (tasks and transition rules) and a service that allows to upload them, modify, run them at scale and in a highly available manner, manage and monitor workflow execution state and state of individual tasks.
de: Der OpenStack-Dienst, der eine einfache YAML-basierte Sprache zur Verfügung stellt, um Workflows (Aufgaben und Übergangsregeln) zu schreiben, und einen Dienst, der es erlaubt, sie hochzuladen, zu modifizieren, sie im Maßstab und in einer hochverfügbaren Weise auszuführen, zu verwalten und zu überwachen.
ru: OpenStack проект, предоставляющий простой YAML-подобный язык для описания потоков операций, задач и правил переходов, а так же служба, позволяющая загружать, изменять и запускать их в режиме высокой готовности, управлять и следить за ходом выполнения потока операций, а так же за состоянием отдельных задач.

source: The OpenStack service which orchestrates composite cloud applications using a declarative template format through an OpenStack-native REST API.
ru: Служба OpenStack, которая согласовывает работу составных облачных приложений с помощью декларативных шаблонов через собственный интерфейс REST API платформы OpenStack.

source: The OpenStack stack uses the following storage types:
de: Der OpenStack Stack verwendet die folgenden Storage Typen:
ru: В OpenStack поддерживаются следующие типы устройств хранения.

source: The OpenStack wiki
de: Das OpenStack Wiki
ru: OpenStack Wiki

source: The Orchestration service consists of the following components:
de: Der Orchestrierungsdienst besteht aus folgenden Komponenten:
ru: Служба оркестрации состоит из следующих компонентов.

source: The Orchestration service provides a template-based orchestration for describing a cloud application by running OpenStack API calls to generate running cloud applications. The software integrates other core components of OpenStack into a one-file template system. The templates allow you to create most OpenStack resource types such as instances, floating IPs, volumes, security groups, and users. It also provides advanced functionality such as instance high availability, instance auto-scaling, and nested stacks. This enables OpenStack core projects to receive a larger user base.
de: Der Orchestrierungsdienst bietet eine Vorlagen-basierte Orchestrierung für die Beschreibung einer Cloud-Anwendung, indem Sie OpenStack-API-Aufrufe ausführen, um laufende Cloud-Anwendungen zu generieren. Die Software integriert weitere Kernkomponenten von OpenStack in ein 1-Datei-Template-System. Mit den Vorlagen können Sie die meisten OpenStack-Ressourcentypen wie Instanzen, Floating IPs, Datenträger, Sicherheitsgruppen und Benutzer erstellen. Es bietet auch erweiterte Funktionen wie Instanz-Hochverfügbarkeit, Instanz-Auto-Skalierung und verschachtelte Stacks. Damit können OpenStack-Kernprojekte eine größere Benutzerbasis erhalten.
ru: Служба оркестрации обеспечивает оркестрацию на базе шаблонов, чтобы описывать облачное приложение путем вызовов OpenStack API. Программное обеспечение интегрирует другие ключевые компоненты OpenStack в систему однофайлового шаблона. Шаблоны позволяют создавать большинство типов ресурсов OpenStack: экземпляры, плавающие IP-адреса, тома, группы безопасности и пользователей. Кроме того, служба предоставляет дополнительные функциональные возможности, например высокую доступность экземпляров, их автоматическое масштабирование и вложенные стеки. Это позволяет основным проектам OpenStack использовать более крупные базы пользователей.

source: The POSIX-compliant file system provided by Ceph.
de: Das von Ceph bereitgestellte POSIX-konforme Dateisystem.
ru: POSIX-совместимая файловая система, предоставляемая Ceph.
vi_vn: Hệ thống tập tin phù hợp với POSIX được cung cấp bởi Ceph.

source: The Shared File Systems service consists of the following components:
de: Der Dienst Verteiltes Dateisystem besteht aus den folgenden Komponenten:
ru: Служба общих файловых систем содержит следующие компоненты.

source: The Telemetry Alarming service consists of the following components:
de: Der Telemetrie Alarmdienst besteht aus den folgenden Komponenten:
ru: Служба оповещений телеметрии состоит из следующих компонентов.
