Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: The following Linux distributions provide community-supported packages for OpenStack:
de: Die folgenden Linuxdistributionen bieten Community-Unterstützung für OpenStack:
ru: Следующие дистрибутивы Linux предоставляют поддерживаемые сообществом пакеты OpenStack.

source: The following books explain how to configure and run an OpenStack cloud:
de: Die folgenden Bücher erläutern die Konfiguration und den Betrieb von OpenStack Cloud:
ru: В следующих руководствах рассматривается, как настроить и запустить облако OpenStack.

source: The following books explain how to install an OpenStack cloud and its associated components:
de: Die folgenden Bücher erklären wie man OpenStack Cloud und die damit verbundenen Komponenten installiert:
ru: В следующих руководствах рассматривается, как установить облако OpenStack и связанные с ним компоненты.

source: The following books explain how to use the OpenStack dashboard and command-line clients:
ru: В следующих руководствах рассматривается, как использовать веб-портал OpenStack и клиентов командной строки.

source: The following diagram shows the most common, but not the only possible, architecture for an OpenStack cloud:
de: Das folgende Diagramm zeigt die häufigste, aber nicht die einzig mögliche Architektur für eine OpenStack Cloud:
ru: На представленной ниже схеме показана наиболее распространенная, но не единственная, архитектура облака OpenStack.

source: The following diagram shows the relationships among the OpenStack services:
de: Das folgende Diagramm zeigt die Beziehungen zwischen den OpenStack-Diensten:
ru: Следующая схема показывает взаимосвязи между службами OpenStack.

source: The following documentation provides reference and guidance information for the OpenStack APIs:
de: Die folgende Dokumentation dient als Referenz und Information zu den OpenStack APIs:
ru: Следующая документация содержит справку и руководство по API OpenStack.

source: The following example shows how to update an existing image with a properties that describe the disk bus, the CD-ROM bus, and the VIF model:
de: Das folgende Beispiel zeigt, wie ein bestehendes Abbild mit einer Eigenschaft aktualisiert wird, die den Diskbus, den CD-ROM-Bus und das VIF-Modell beschreibt:
ru: В следующем примере показано, как обновить существующий образ с использованием свойств, описывающих шину диска, шину компакт-диска и модель VIF.

source: The following example shows the command for installing the OpenStack client with ``pip``, which supports multiple services.
de: Das folgende Beispiel zeigt den Befehl zur Installation des OpenStack-Clients mit `` pip``, der mehrere Dienste unterstützt.
ru: В следующем примере показана команда для установки клиента OpenStack с помощью ``pip``, который поддерживает разные службы.

source: The following example shows the command that you would use to upload a CentOS 6.3 image in qcow2 format and configure it for public access:
de: Das folgende Beispiel zeigt den Befehl, den Sie verwenden möchten, um ein CentOS 6.3-Abbild im qcow2-Format hochzuladen und für den öffentlichen Zugriff zu konfigurieren:
ru: В следующем примере показана команда для загрузки образа CentOS 6.3 в формат QCOW2 и предоставления к нему общего доступа.

source: The following example unmanages the ``my-snapshot-id`` image:
de: Das folgende Beispiel unverwaltet das ``my-snapshot-id`` Abbild:
ru: В следующем примере отменяется управление снимком ``my-snapshot-id``:

source: The following examples show the host usage statistics for a host called ``devstack``.
de: Die folgenden Beispiele zeigen die Host-Verwendungsstatistik für einen Host mit dem Namen ``devstack``.
ru: В следующих примерах показана статистика использования ресурсов хоста под названием ``devstack``.

source: The following guide provides how to contribute to OpenStack documentation:
de: Die folgende Anleitung beschreibt, wie Sie bei der OpenStack Dokumentation mitwirken können:
ru: Следующее руководство содержит информацию о том, как внести свой вклад в документацию OpenStack.

source: The following individual clients are deprecated in favor of a common client. Instead of installing and learning all these clients, we recommend installing and using the OpenStack client. You may need to install an individual project's client because coverage is not yet sufficient in the OpenStack client. If you need to install an individual client's project, replace the ``PROJECT`` name in this ``pip install`` command using the list below.
de: Die folgenden einzelnen Clients werden zugunsten eines gemeinsamen Clients aufgegeben. Anstatt alle Clients zu installieren und zu lernen, empfehlen wir, den OpenStack Client zu installieren und zu benutzen. Möglicherweise müssen Sie den Client eines einzelnen Projekts installieren, da die Abdeckung im OpenStack-Client noch nicht ausreichend ist. Wenn Sie ein einzelnes Client-Projekt installieren müssen, ersetzen Sie den `` PROJECT``-Namen in diesem `` pip install`` Befehl unter Verwendung der folgenden Liste.
ru: Общий клиент заменил перечисленные ниже отдельные клиенты. Вместо того чтобы устанавливать и изучать эти клиенты, рекомендуем устанавливать и использовать клиент OpenStack. Возможно, потребуется установить отдельный клиент для проекта, поскольку клиент OpenStack еще не имеет полного охвата. Если необходимо установить клиент для определенного проекта, замените в следующей команде ``pip install`` слово ``PROJECT`` на имя клиента из представленного ниже списка.

source: The following list explains the optional arguments that you can use with the ``create`` and ``set`` commands to modify image properties. For more information, refer to Image service chapter in the `OpenStack Command-Line Interface Reference <http://docs.openstack.org/cli-reference/index.html>`__.
ru: В представленном ниже списке поясняются дополнительные аргументы, которые можно использовать для команд ``create`` и ``set``, чтобы изменить свойства образа. Подробнее см. главу о службе образов в `Справке по интерфейсу командной строки OpenStack <http://docs.openstack.org/cli-reference/index.html>`__.

source: The following resources are available to help you run and use OpenStack. The OpenStack community constantly improves and adds to the main features of OpenStack, but if you have any questions, do not hesitate to ask. Use the following resources to get OpenStack support and troubleshoot your installations.
de: Die folgenden Ressourcen sind vorhanden, um Ihnen bei der Verwendung von OpenStack zu helfen. Die OpenStack Gemeinschaft fügt kontinuierlich neue Eigenschaften hinzu bzw. verbessert sie. Wenn Sie Fragen haben, zögern Sie nicht, sie zu stellen. Über die folgenden Ressourcen erhalten Sie Unterstützung und Hilfe zur Fehlersuche in Ihren Installationen.
ru: Чтобы помочь вам запустить и использовать OpenStack доступны следующие ресурсы. Сообщество OpenStack постоянно улучшает и дополняет основные функции OpenStack, и мы всегда готовы ответить на любые вопросы. Используйте эти ресурсы, чтобы получить поддержку по OpenStack и устранить проблемы своих инсталляций.

source: The following table describes the OpenStack services that make up the OpenStack architecture:
de: Die folgende Tabelle beschreibt die OpenStack-Dienste, die die OpenStack-Architektur bilden:
ru: В следующей таблице перечислены службы OpenStack, которые формируют архитектуру OpenStack.

source: The intelligence in the IPMI architecture, which is a specialized micro-controller that is embedded on the motherboard of a computer and acts as a server. Manages the interface between system management software and platform hardware.
de: Die Intelligenz in der IPMI Architektur, ein spezieller auf einer Computerhauptplatine eingebetteter Microcontroller, der als Server agiert. Verwaltet die Schnittstelle zwischen Systemverwaltungssoftware und Plattformhardware.
ru: Модуль аналитики в архитектуре IPMI, являющийся специализированным микроконтроллером, встроенным в материнскую плату компьютера и работающим как сервер. Контролирует связь программ для систем управления с оборудованием платформ.

source: The main virtual communication line used by all AMQP messages for inter-cloud communications within Compute.
de: Die wichtigste virtuelle Kommunikationslinie, die von allen AMQP-Nachrichten für die Inter-Cloud-Kommunikation in Compute verwendet wird.
ru: Основная линия виртуального соединения, используемая всеми сообщениями AMQP для межоблачных соединений в рамках службы вычислительных ресурсов.
vi_vn: Đường dây liên lạc ảo chính được sử dụng bởi tất cả các tin AMQP phục vụ cho giao tiếp nội vùng cloud nằm trong Compute.

source: The method of storage used by horizon to track client sessions, such as local memory, cookies, a database, or memcached.
ru: Метод хранения данных службой Horizon для мониторинга сеансов клиентов, а именно: объема локальной оперативной памяти, файлов cookie, базы данных или кэширования данных в ОЗУ (memcached).
vi_vn: Phương thức của storage được horizon sử dụng để dò các phiên làm việc của khách hàng, như bộ nhớ, bản ghi trình duyệt web, cơ sở dữ liệu hay bộ nhớ đệm trên RAM.

source: The method that a service uses for persistent storage, such as iSCSI, NFS, or local disk.
ru: Метод создания постоянного хранилища для службы, например iSCSI, NFS или локальный диск.
vi_vn: Phương pháp mà một dịch vụ sử dụng cho việc lưu trữ liên tục, như iSCSI, NFS hoặc ổ địa nội vùng.

source: The method used by the Compute RabbitMQ for intra-service communications.
ru: Метод, используемый сервером RabbitMQ службы вычислительных ресурсов для внутренних соединений между службами.
vi_vn: Phương thức được sử dụng bởi Compute RabbitMQ cho các giao tiếp dịch vụ nội bộ.

source: The minimum amount of RAM needed to boot the image, in megabytes.
ru: Минимальный объем оперативной памяти, необходимой для загрузки образа (Мбайт).

source: The minimum size of the disk needed to boot the image, in gigabytes.
ru: Минимальный размер диска, необходимого для загрузки образа (Гбайт).

source: The most common web server software currently used on the Internet.
de: Die häufigste Webserver-Software, die momentan im Internet verwendet wird.
ru: На данный момент самое популярное в Интернете программное обеспечение для веб-серверов.
vi_vn: Trang web phổ biến nhất về phần mềm server hiện đang được sử dụng trên Internet.

source: The name of the image.
ru: Имя образа.

source: The nova-api daemon provides access to nova services. Can communicate with other APIs, such as the Amazon EC2 API.
de: Der nova-api-Daemon bietet Zugriff auf nova-Dienste. Kann mit anderen APIs wie der Amazon EC2 API kommunizieren.
ru: Демон nova-api предоставляет доступ к службам Nova. Он поддерживает обмен данными с другими API, например API Amazon EC2.

source: The number of replicas of the data in an Object Storage ring.
ru: Количество реплик данных в кольце объектного хранилища.
vi_vn: Số các bản sao dữ liệu trên một Object Storage ring.

source: The open standard messaging protocol used by OpenStack components for intra-service communications, provided by RabbitMQ, Qpid, or ZeroMQ.
de: Das von den OpenStack Komponenten verwendete offene Standard Nachrichtenprotokoll für interne Kommunikationsdienste wird zur Verfügung gestellt von RabbitMQ, Qpid oder ZeroMQ.
ru: Протокол обмена сообщениями по открытым стандартам, который используется компонентами OpenStack для обмена данными между службами, предоставляемый RabbitMQ, Qpid или ZeroMQ.
vi_vn: Giao thức truyền tin mở tiêu chuẩn được sử dụng bởi các thành phần của OpenStack nhằm mục đích liên lạc dịch vụ nội vùng, được cung cấp bởi RabbitMQ, Qpid hoặc ZeroMQ.

source: The output shows that the volume is attached to the server with ID ``84c6e57d-a6b1-44b6-81eb-fcb36afd31b5``, is in the nova availability zone, and is bootable.
de: Die Ausgabe zeigt, dass der Datenträger am Server mit der ID `` 84c6e57d-a6b1-44b6-81eb-fcb36afd31b5`` angehängt ist, sich in der Verfügbarkeitszone Nova befindet und bootfähig ist.
ru: Результат выполнения команды расшифровывается так: том подключен к серверу с ID ``84c6e57d-a6b1-44b6-81eb-fcb36afd31b5``, находится в зоне доступности nova и является загрузочным.

source: The output shows the volume transfer ID in the ``id`` row and the authorization key.
de: Die Ausgabe zeigt die Datentransfer-ID in der Zeile `` id`` und den Autorisierungsschlüssel.
ru: В выводе команды отображается ключ авторизации и ID трансфера тома в строке ``id`.

source: The persistent data store used to save and retrieve information for a service, such as lists of Object Storage objects, current state of guest VMs, lists of user names, and so on. Also, the method that the Image service uses to get and store VM images. Options include Object Storage, locally mounted file system, RADOS block devices, VMware datastore, and HTTP.
de: Der persistente Datenspeicher, der zum Speichern und Abrufen von Informationen für einen Dienst verwendet wird, z. B. Listen von Objekterspeicherobjekten, aktueller Status von Gast-VMs, Listen von Benutzernamen usw. Auch die Methode, die der Abbilddienst zum Abrufen und Speichern von VM-Abildern verwendet. Zu den Optionen gehören Objektspeicher, lokales Dateisystem, RADOS-Blockgeräte, VMware-Datenspeicher und HTTP.
ru: Хранение долговременных данных, используемое, чтобы хранить и извлекать информацию для таких служб, как списки объектов в хранилище объектов, текущее состояние гостевых виртуальных машин и т. д. Кроме того, это метод используется службой образов, чтобы получать и хранить образы виртуальных машин. Параметры включают хранилище объектов, локальную файловую систему, устройства блочного ввода-вывода RADOS, хранилище данных VMware, а также HTTP.

source: The person responsible for installing, configuring, and managing an OpenStack cloud.
de: Die für die Installation, Konfiguration und Verwaltung der OpenStack Cloud verantwortliche Person.
ru: Лицо, ответственное за инсталляцию, настройку и управление облаком OpenStack.

source: The person responsible for planning and maintaining an OpenStack installation.
ru: Лицо, ответственное за планирование и управление инсталляцией OpenStack.
vi_vn: Người chịu trách nhiệm lên kế hoạch và duy trì một cài đặt OpenStack.

source: The point where a user interacts with a service; can be an API endpoint, the horizon dashboard, or a command-line tool.
ru: Точка, в которой пользователь взаимодействует со службой. Это может быть точка входа API, панель управления Horizon или инструмент командной строки.

source: The practice of placing one packet type within another for the purposes of abstracting or securing data. Examples include GRE, MPLS, or IPsec.
de: Die Praxis, einen Pakettyp innerhalb eines anderen für die Zwecke der Abstraktion oder Sicherung von Daten zu platzieren. Beispiele sind GRE, MPLS oder IPsec.
ru: Метод размещения пакетов одного типа в пакетах другого типа в целях абстрагирования или обеспечения безопасности данных. Примеры: GRE, MPLS и IPsec.
vi_vn: Quá trình đặt một dạng gói tin vào trong một dạng gói tin khác nhằm mục đích trừu tượng hóa hoặc bảo mật dữ liêu. Các ví dụ bao gồm GRE, MPLS hoặc IPsec.

source: The practice of utilizing a secondary environment to elastically build instances on-demand when the primary environment is resource constrained.
de: Die Praxis der Nutzung einer zweiten Umgebung, um Instanzen auf Anforderung elastisch aufzubauen, wenn die Resourcen der primäre Umgebung eingeschränkt sind.
ru: Набор методов использования резервной среды, чтобы по запросу динамически создавать экземпляры при пиковых нагрузках на основную среду.
vi_vn: Trong việc luyện tập sử dụng môi trường phụ để dựng linh hoạt các máy ảo theo nhu cầu nhất định khi môi trường chính bị hạn chế nguồn.

source: The procedure for volume transfer is intended for tenants (both the volume donor and recipient) within the same cloud.
ru: Процедурой переноса тома могут воспользоваться тенанты (отправитель и получатель тома), которые находятся в одном облаке.

source: The process associating a Compute floating IP address with a fixed IP address.
de: Der Prozess weist einem Computer eine bewegliche IP-Adresse eine feste IP-Adresse zu.
ru: Процесс связывания назначаемого IP-адреса службы вычислительных ресурсов с фиксированным IP-адресом.
vi_vn: Quá trình liên kết một địa chỉ IP Compute động với một địa chỉ IP tĩnh.

source: The process of automating IP address allocation, deallocation, and management. Currently provided by Compute, melange, and Networking.
de: Der Prozess der Automatisierung der IP-Adresszuweisung, der Freigabe und des Managements. Derzeit zur Verfügung gestellt von Compute, Melange und Networking.
ru: Процесс автоматизированного выделения и освобождения IP-адресов, а также управления ими. На данный момент поддерживается службой вычислительных ресурсов (Compute), melange и службой управления сетью (Networking).
vi_vn: Quá trình tự động phân bổ, xóa và quản lí địa chỉ IP, hiện tại đã được cung cấp bởi Compute, melange và Networking.

source: The process of connecting a VIF or vNIC to a L2 network in Networking. In the context of Compute, this process connects a storage volume to an instance.
de: Der Prozess der Verbindung eines VIF oder vNIC zu einem L2-Netzwerk in Networking. Im Rahmen von Compute verbindet dieser Prozess ein Speicherdatenträger mit einer Instanz.
ru: Процесс подключения VIF или vNIC к сети уровня L2 в компоненте Networking. В контексте Compute этот процесс описывает подключение тома хранилища к экземпляру.
vi_vn: Quá trình kết nối một VIF hoặc một vNIC tới một mạng L2 trong Networking. Trong văn cảnh của Compute, quá trình này kết nối một lượng lưu trữ nhất định tới một instance.

source: The process of copying data to a separate physical device for fault tolerance and performance.
ru: Процесс копирования данных на отдельное физическое устройство в целях отказоустойчивости и производительности.
vi_vn: Quá trình sao chép dữ liệu sang một thiết bị vật lý riêng biệt nhằm mục đích chống chịu lỗi và hiệu suất làm việc.

source: The process of distributing Object Storage partitions across all drives in the ring; used during initial ring creation and after ring reconfiguration.
ru: Процесс распределения разделов объектного хранилища на все диски в кольце. Используется при создании кольца и после его реконфигурации.
vi_vn: Quá trình phân phối phân vùng đối tượng lưu trữ Object Storage trên tất cả các ổ đĩa trong vòng; được sử dụng trong quá trình tạo vòng ban đầu và sau vòng cấu hình lại.

source: The process of filtering incoming network traffic. Supported by Compute.
de: Der Prozess der Filterung eingehenden Netzwerkverkehr. Unterstützt von Compute.
ru: Фильтрация входящего сетевого трафика. Поддерживается службой вычислительных ресурсов.
vi_vn: Quá trình lọc lưu lượng mạng đến. Được hỗ trợ bởi Compute.

source: The process of finding duplicate data at the disk block, file, and/or object level to minimize storage use—currently unsupported within OpenStack.
de: Der Prozess der Suche nach doppelten Daten auf der Festplatte auf Block, Datei und / oder Objekt-Ebene zur Minimierung der Speicherauslastung - derzeit nicht unterstützt in OpenStack.
ru: Процесс обнаружения повторяющихся данных на уровне блоков, файлов или объектов, который помогает высвобождать дисковое пространство. На данный момент не поддерживается OpenStack.

source: The process of migrating one or all virtual machine (VM) instances from one host to another, compatible with both shared storage live migration and block migration.
de: Der Prozess des Migrierens einer oder aller Virtuelle Maschinen (VM) Instanzen von einem Host zu einem anderen, kompatibel mit Shared Storage Migration und Block Migration.
ru: Процесс миграции одного или всех инстансов виртуальных машин (ВМ) с одного хоста на другой, совместимый с живой миграцией общего хранилища и блочной миграцией.
vi_vn: Qua trình di chuyển một hay nhiều máy ảo đang hoạt động từ một host sang các host khác, tương thích với cả việc di chuyển có sử dụng storage chung và di chuyển theo khối.

source: The process of moving a VM instance from one host to another.
de: Der Vorgang des Verschiebens einer VM-Instanz von einem Host zum anderen.
ru: Перемещение инстанса виртуальной машины из одного хоста в другой.
vi_vn: Quá trình chuyển một máy ảo VM từ host này sang host khác.

source: The process of putting a file into a virtual machine image before the instance is started.
de: Der Vorgang des Einlegens einer Datei in ein virtuelles Maschinenabbild, bevor die Instanz gestartet wird.
ru: Процесс помещения файла в образ виртуальной машины перед запуском инстанса.
vi_vn: Quá trình đưa file vào image máy ảo trước khi máy ảo được khởi động.

source: The process of removing the association between a floating IP address and a fixed IP address. Once this association is removed, the floating IP returns to the address pool.
de: Der Prozess zum Löschen der Zuweisung zwischen einer beweglichen IP-Adresse und einer festen IP-Adresse. Wenn die Zuweisung gelöscht ist, wandert die bewegliche IP-Adresse zurück in den Adressbestand.
ru: Процесс удаления связи между плавающим и фиксированным IP-адресом. После удаления этой связи плавающий IP-адрес возвращается в пул адресов.
vi_vn: Bất kỳ thành phần nào của phần cứng hay phần mềm muốn kết nối tới các dịch vụ mạng của Networking, dịch vụ kết nối mạng. Một thực thể có thể sử dụng Networking để thực hiện một VIF

source: The process of removing the association between a floating IP address and fixed IP and thus returning the floating IP address to the address pool.
de: Der Prozess zur Löschung der Zuweisung von einer beweglichen IP-Adresse und festen IP-Adressen und Rückführung der beweglichen IP-Adresse in den Adressbestand.
ru: Процесс удаления связи между плавающим и фиксированным IP-адресом, который приводит к возвращению плавающего IP-адреса в пул адресов.
vi_vn: Quá trình loại bỏ các mối liên hệ giữa một địa chỉ IP nổi và IP cố định và do đó trả về địa chỉ IP nổi đến địa chỉ pool.

source: The process of spreading client requests between two or more nodes to improve performance and availability.
de: Der Prozess der Verbreitung von Client-Anfragen zwischen zwei oder mehr Knoten zur Verbesserung der Leistung und Verfügbarkeit.
ru: Распределение запросов клиентов между двумя или более узлами для повышения производительности и доступности.
vi_vn: Quá trình trải đều các yêu cầu của client giữa hai hoặc nhiều node để tăng hiệu năng và tính sẵn sàng.

source: The process of taking a floating IP address from the address pool so it can be associated with a fixed IP on a guest VM instance.
de: Der Prozess, um eine bewegliche IP-Adresse vom Adressbestand zu nehmen, damit sie als feste IP-Adresse an eine Gast-VM-Instanz zugewiesen werden kann.
ru: Процесс выбирает назначаемый IP-адрес из пула IP-адресов, чтобы связать его с фиксированным IP-адресом на гостевой виртуальной машине.
vi_vn: Quá trình lấy địa chỉ IP động từ vùng địa chỉ khiến cho địa chỉ IP động này có thể tương thích với IP tĩnh ở trên guest VM instance.

source: The process that confirms that the user, process, or client is really who they say they are through private key, secret token, password, fingerprint, or similar method.
de: Der Prozess, der bestätigt, dass der Benutzer, Prozess oder Client der ist fuer den er sich ausgibt durch privaten Schlüssel, geheimes Token, Passwort, Fingerabdruck oder eine ähnliche Methode ausgibt.
ru: Процесс, подтверждающий подлинность пользователя, другого процесса или клиента с помощью закрытого ключа, секретного токена, пароля, отпечатка пальцев или аналогичным способом.
vi_vn: Quá trình xác nhận người dùng, quá trình hoặc client là chính nó thông qua private key, thẻ bí mật, mật khẩu, vân tay hoặc các phương thức tương tự.
