Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: Lists containers in Object Storage and stores container information in the account database.
de: Listet Container in Object Storage auf und speichert Container-Informationen in der Account-Datenbank.
ru: Перечисляет контейнеры в хранилище объектов и сохраняет информацию о них в базе данных учетных записей.
vi_vn: Liệt kê các container ở trong Object Storage và lưu trữ thông tin về các container trong cơ sở dữ liệu tài khoản.

source: Load-Balancer-as-a-Service (LBaaS)
ru: Балансировщик нагрузки как служба (LBaaS)

source: Local file that contains the disk image to be uploaded during the update. Alternatively, you can pass images to the client through stdin.
ru: Локальный файл, в котором содержится образ диска, который будет загружаться при обновлении. Кроме того, можно отправить образы клиенту с помощью stdin.

source: Log in to the dashboard and from the drop-down list select the project for which you want to download the OpenStack RC file.
de: Melden Sie sich im Dashboard an und wählen Sie in der Dropdown-Liste das Projekt aus, für das Sie die OpenStack RC-Datei herunterladen möchten.
ru: Войдите на панель управления и выберите в раскрывающемся списке проект, для которого необходимо загрузить RC-файл OpenStack.

source: Logical Volume Manager (LVM)
ru: Администратор логического тома (LVM)

source: Logical architecture
de: Logische Architektur
ru: Логическая архитектура

source: Logical groupings of related code, such as the Block Storage volume manager or network manager.
de: Logische Gruppierungen von verwandtem Code, wie z. B. der Block Storage Volume Manager oder Netzwerk Manager.
ru: Логическое объединение связанных программ, например администратор тома блочного хранилища или диспетчер сети.
vi_vn: Nhóm logic các tên mã có liên quan, như trình quản lý ổ lưu trữ hoặc trình quản lý mạng của Block Storage.

source: Logical subdivision of an IP network.
ru: Логическое подразделение IP-сети.
vi_vn: Một phân vùng logic của một mạng IP.

source: Lower power consumption CPU often found in mobile and embedded devices. Supported by OpenStack.
de: CPUs mit niedrigem Stromverbrauch sind oft anzutreffen in mobilen und eingebetteten Geräten. Unterstützt von OpenStack.
ru: ЦП с низким энергопотреблением, всегда присутствующий в мобильных и встраиваемых устройствах. Поддерживается OpenStack.
vi_vn: CPU tiêu thụ điện năng thấp hơn thường được tìm thấy trên các thiết bị nhúng và di động. Được hỗ trợ bởi OpenStack.

source: MD5 hash of an object within Object Storage, used to ensure data integrity.
de: MD5 Hash eines Objektes im Objekt Storage zur Sicherstellung der Datenintegrität.
ru: Хэш md5 объекта в объектном хранилище, который используется для контроля целостности данных.
vi_vn: Mã băm MD5 của một object nằm trong Object Storage, được sử dụng để đảm bảo tính toàn vẹn của dữ liệu.

source: Makes an image accessible for all the tenants (admin-only by default).
ru: Разрешает или запрещает доступ к образу всем тенантам (по умолчанию доступ разрешен только администратору)

source: Manage a snapshot
de: Verwalten einer Schattenkopie.
ru: Управление снимками

source: Manage a snapshot with the :command:`cinder snapshot-manage` command:
ru: Для управления снимками можно использовать команду :command:`cinder snapshot-manage`:

source: Manage and unmanage a snapshot
de: Verwalten/Nichtverwalten einer Schattenkopie.
ru: Управление и отмена управления снимками

source: Manage images
de: Verwalten von Abbildern
ru: Управление образами

source: Manage volumes
de: Datenträger verwalten
ru: Управление томами

source: Managed through REST API with UI available as part of OpenStack dashboard.
ru: Управляется с помощью REST API посредством интерфейса, являющегося частью панели мониторинга OpenStack.

source: Manages accounts defined with Object Storage.
de: Verwaltet Konten, die mit Object Storage definiert sind.
ru: Управляет учетными записями, определенными хранилищем объектов.

source: Manages actual objects, such as files, on the storage nodes.
de: Verwaltet aktuelle Objekte wie Dateien auf den Speicherknoten.
ru: Управляют фактическими объектами (например, файлами) в узлах хранилища.

source: Manages back-end devices that provide shared file systems. A manila-share process can run in one of two modes, with or without handling of share servers. Share servers export file shares via share networks. When share servers are not used, the networking requirements are handled outside of Manila.
de: Verwaltet Back-End-Geräte, die gemeinsam genutzte Dateisysteme bereitstellen. Ein Manila-Share-Prozess kann in einem von zwei Modi ausgeführt werden, mit oder ohne Handhabung von Share-Servern. Freigabe-Server exportieren Dateifreigaben über Freigabenetzwerke. Wenn Freigabe-Server nicht verwendet werden, werden die Netzwerkanforderungen außerhalb von Manila abgewickelt.
ru: Управляет внутренними устройствами, которые предоставляют общие файловые системы. Процесс manila-share запускается в одном или двух режимах с обработкой общих серверов или без нее. Общие серверы экспортируют файлы, к которым имеется доступ через общие сети. Если такие серверы не используются, требования к управлению сетями обрабатываются вне пределов Manila.

source: Manages the lifecycle of compute instances in an OpenStack environment. Responsibilities include spawning, scheduling and decommissioning of virtual machines on demand.
de: Verwaltet den Lebenszyklus von Compute-Instanzen in einer OpenStack-Umgebung. Zu den Aufgaben gehören das Starten, die Terminierung und die Stilllegung von virtuellen Maschinen auf Anfrage.
ru: Управляет жизненным циклом экземпляров вычислительных ресурсов в среде OpenStack. К ее функциям относятся создание, планирование и удаление виртуальных машин по требованию пользователя.

source: Manages the mapping of containers or folders, within Object Storage.
de: Verwaltet die Zuordnung von Containern oder Ordnern innerhalb von Object Storage.
ru: Управляет сопоставлением контейнеров или папок в службе хранилища объектов.

source: Many Linux distributions provide packages to make setuptools easy to install. Search your package manager for setuptools to find an installation package. If you cannot find one, download the setuptools package directly from https://pypi.python.org/pypi/setuptools.
ru: В большинстве дистрибутивов Linux предоставляются пакеты, упрощающие установку пакета setuptools. С помощью своего диспетчера пакетов найдите установочный пакет setuptools. Если его найти не удалось, скачайте пакет setuptools непосредственно с сайта https://pypi.python.org/pypi/setuptools.

source: Maps Object Storage partitions to physical storage devices.
de: Maps Object Speicher-Partitionen zu physischen Speichergeräten.
ru: Сопоставляет разделы хранилища объектов с физическими хранилищами.
vi_vn: Kết nối các phân vùng Object Storage với các thiết bị lưu trữ vật lý.

source: Massively scalable distributed storage system that consists of an object store, block store, and POSIX-compatible distributed file system. Compatible with OpenStack.
de: Massiv skalierbares verteiltes Speichersystem, das aus einem Objektspeicher, einem Blockspeicher und einem POSIX-kompatiblen verteilten Dateisystem besteht. Kompatibel mit OpenStack.
ru: Масштабируемая распределенная система хранения большого объема, которая состоит из хранилища объектов, блочного хранилища, а также POSIX-совместимой распределенной файловой системы. Совместима с OpenStack.
vi_vn: Một hệ thóng phân phối lưu trữ có khả năng mở rộng lớn bao gồm một object store, block store, và một hệ thống phân phối file tương thích với POSIX. Tương thích với OpenStack.

source: Maximum frame or packet size for a particular network medium. Typically 1500 bytes for Ethernet networks.
de: Maximale Frame- oder Paketgröße für ein bestimmtes Netzwerkmedium. Typisch 1500 Bytes für Ethernet-Netzwerke.
ru: Максимальный размер кадра или пакета для конкретной сети. Стандартное значение для сетей Ethernet — 1500 байт.
vi_vn: Kích thước tối đa của khung hoặc gói tin của một môi trường mạng cụ thể, thường là 1500 bytes đối với các hệ thống mạng Ethernet.

source: Mechanism for highly available multi-host routing when using OpenStack Networking (neutron).
de: Mechanismus zum hochverfügbaren multi-host Routing bei der Verwendung von OpenStack Netzwerk (neutron).
ru: Механизм маршрутизации высокой доступности для подключения к нескольким хостам при использовании службы OpenStack Networking (Neutron).

source: Mechanism in IP networks to detect end-to-end MTU and adjust packet size accordingly.
ru: Механизм в IP-сетях для определения наименьшего MTU на пути следования пакета и соответствующей настройки размера пакета.
vi_vn: Cơ chế trong các mạng IP để phát hiện end-to-end MTU và điều chỉnh kích thước gói tin cho phù hợp.

source: Mediates interactions between the ``nova-compute`` service and the database. It eliminates direct accesses to the cloud database made by the ``nova-compute`` service. The ``nova-conductor`` module scales horizontally. However, do not deploy it on nodes where the ``nova-compute`` service runs. For more information, see `Configuration Reference Guide <http://docs.openstack.org/newton/config-reference/compute/conductor.html>`__.
ru: Является посредником для взаимодействия между службой``nova-compute`` и базой данных. Предотвращает прямой доступ службы ``nova-compute`` к базе данных облака. Модуль ``nova-conductor`` масштабируется горизонтально. Однако его не следует развертывать на узлах, на которых выполняется служба ``nova-compute``. Подробнее см. в `Руководстве по настройке OpenStack <http://docs.openstack.org/newton/config-reference/compute/conductor.html>`__.

source: Message exchange that is cleared when the service restarts. Its data is not written to persistent storage.
ru: Обмен сообщениями, который очищается при перезапуске службы. Данные этого обмена не записываются в постоянное хранилище.
vi_vn: Trao đổi tin được xóa đi khi dịch vụ khởi động lại. Dữ liệu của nó khong được viết vào kho lưu trữ liên tục.

source: Message queue software supported by OpenStack. An alternative to RabbitMQ. Also spelled 0MQ.
ru: Программное обеспечение для очереди сообщений, поддерживаемое OpenStack. Альтернатива RabbitMQ. Вариант написания: 0MQ.
vi_vn: Phần mềm sắp xếp tin nhắn được hỗ trợ bởi OpenStack. Một sự thay thế cho RabbitMQ. Có cách viết khác là 0MQ

source: Message queue software supported by OpenStack; an alternative to RabbitMQ.
ru: Программное обеспечение для очереди сообщений, поддерживаемое OpenStack. Альтернатива RabbitMQ.
vi_vn: Phần mềm truyền tin được hỗ trợ bởi OpenStackp; một sự thay thế cho RabbitMQ.

source: Message queue that is cleared when the service restarts. Its data is not written to persistent storage.
ru: Очередь сообщений, которая очищается при перезапуске службы. Ее данные не записываются в постоянное хранилище.
vi_vn: Trình tự tin nhắn được xóa khi các dịch vụ khởi động lại. Các dữ liệu của nó không được viết vào kho lưu trữ liên tục.

source: Message service (zaqar)
de: Nachrichtendienst (zaqar)
ru: Служба сообщений (Zaqar)

source: Messaging queue
de: Nachrichtenwarteschlange
ru: Очередь сообщений

source: Meta-Data Server (MDS)
ru: Сервер метаданных (MDS)

source: Metadata agent
de: Metadatenagent
ru: Агент метаданных

source: Metadata definition service
de: Metadatendefinitionsdienst
ru: Служба определения метаданных

source: Method of keeping a clock for a host or node correct via communication with a trusted, accurate time source.
ru: Метод обеспечения правильного времени на хосте или узле благодаря соединению с надежным источником точного времени.

source: Method to access VM instance consoles using a web browser. Supported by Compute.
de: Methode zum Zugriff auf eine VM Instanz-Konsole mittels Webbrowser. Von Compute unterstützt.
ru: Метод доступа к консолям инстансов ВМ с помощью веб-браузера. Поддерживается службой вычислительных ресурсов.
vi_vn: Phương pháp để truy cập các giao diện điều khiển của một VM instance thông qua trình duyệt web. Được hỗ trợ bởi Compute.

source: Middleware modules run in the address space of the OpenStack component that is using the Identity service. These modules intercept service requests, extract user credentials, and send them to the centralized server for authorization. The integration between the middleware modules and OpenStack components uses the Python Web Server Gateway Interface.
de: Middleware-Module werden im Adressraum der OpenStack-Komponente ausgeführt, die den Identitätsdienst verwenden. Diese Module unterbrechen Dienstanforderungen, extrahieren Benutzeranmeldeinformationen und senden sie an den zentralen Server zur Autorisierung. Die Integration zwischen den Middleware-Modulen und den OpenStack-Komponenten erfolgt über das Gateway-Interface von Python Web Server.
ru: Модули промежуточного слоя выполняются в адресном пространстве компонента OpenStack, использующего службу идентификации. Эти модули перехватывают запросы служб, извлекают учетные данные пользователей и отправляют их на централизованный сервер для авторизации. Для взаимодействия между модулями промежуточного слоя и компонентами OpenStack используется Python-интерфейс WSGI (Web Server Gateway Interface).

source: Migrate a volume
de: Migration eines Datenträgers
ru: Миграция тома

source: Migrate a volume with the :command:`cinder migrate` command, as shown in the following example:
ru: Чтобы выполнить миграцию тома, используйте `cinder migrate`:

source: Modify the properties of a volume.
de: Eigenschaften eines Datenträgers modifizieren.
ru: Изменение свойств тома.

source: Modular Layer 2 (ML2) neutron plug-in
ru: Плагин Modular Layer 2 (ML2) службы Neutron

source: Modular system that allows the underlying message queue software of Compute to be changed. For example, from RabbitMQ to ZeroMQ or Qpid.
ru: Модульная система, которая позволяет менять базовое программное обеспечение очереди сообщений для службы вычислительных ресурсов. Например, можно изменить RabbitMQ на ZeroMQ или Qpid.
vi_vn: Hệ thống module cho phép các phần mềm trình tự thông điệp cơ bản của Compute được thay đổi. Ví dụ, từ RabbitMQ đến ZeroMQ hoặc Qpid.

source: Modules
de: Module
ru: Модули

source: Monitor (LBaaS)
ru: Монитор (LBaaS)

source: Monitoring
ru: Мониторинг

source: Monitoring (monasca)
ru: Мониторинг (Monasca)

source: Monitoring solution.
de: Monitoringlösung
ru: Выполняет мониторинг.

source: Monitors and meters the OpenStack cloud for billing, benchmarking, scalability, and statistical purposes.
de: Überwacht und misst die OpenStack Cloud für Abrechnung, Benchmarking, Skalierbarkeit und statistische Zwecke.
ru: Мониторинг и сбор измерений в облаке OpenStack, которые помогают выставлять счета, измерять производительность, обеспечивать масштабируемость и составлять статистические отчеты.

source: Most Linux distributions include packaged versions of the command-line clients that you can install directly, see Installing_from_packages_.
ru: В большинство дистрибутивов Linux входят пакеты клиентов командной строки, которые можно устанавливать без каких-либо дополнительных средств, см. раздел Установка_из_пакетов_.

source: Mounted via OpenStack Block Storage controlled protocol (for example, iSCSI)
de: Eingehängt über OpenStack Blockspeichergesteuertes Protokoll (zB iSCSI)
ru: Монтируется с помощью протокола, управляемого хранилищем блоков OpenStack (например, iSCSI)

source: Name for the Compute component that manages VMs.
ru: Название компонента службы вычислительных ресурсов, который управляет виртуальными машинами.

source: Name or ID of the snapshot to unmanage.
ru: Имя или ID снимка, управление которым отменяется.

source: Name or ID of transfer to delete.
de: Name oder ID der zu löschenden Übertragung.
ru: Имя или ID удаляемого переноса.

source: NetApp volume driver
de: NetApp-Datenträger-Treiber
ru: драйвер тома NetApp

source: Network Address Translation (NAT)
ru: Трансляция сетевых адресов (NAT)

source: Network File System (NFS)
ru: Сетевая файловая система (NFS)

source: Network Time Protocol (NTP)
ru: Протокол сетевого времени (NTP)

source: Network traffic between a user or client (north) and a server (south), or traffic into the cloud (south) and out of the cloud (north). See also east-west traffic.
ru: Сетевой трафик между пользователем или клиентом (север) и сервером (юг) или трафик в облаке (юг) и за его пределами (север). См. также горизонтальный трафик.
vi_vn: Lưu lượng truy cập mạng giữa một người dùng hoặc client (bắc) và một server (nam), hoặc lưu lượng truy cập vào (nam) và ra (bắc) các cloud. Đồng thời cũng xem lưu lượng truy cập hướng đông-tây.

source: Network traffic between servers in the same cloud or data center. See also north-south traffic.
de: Netzwerkverkehr zwischen Servern in derselben Cloud oder Rechenzentrum. Siehe auch Nord-Süd-Verkehr.
ru: Сетевой трафик между серверами одного облака или ЦОД. См. также "вертикальный трафик".
vi_vn: Lưu lượng mạng giữa các máy chủ trong cùng các cloud hoặc cùng một datacenter. Xem thêm north-south traffic.

source: Networking API (Neutron API)
ru: API службы управления сетями (API службы Neutron )

source: Networking service
de: Netzwerkdienst (neutron)
ru: Служба сети

source: Networking service (neutron)
ru: Служба управления сетью (Neutron)

source: Networking service overview
de: Netzwerkdienst Überblick
ru: Обзор сетевой службы

source: New snapshot description
de: Neue Schattenkopiebeschreibung
ru: Описание нового снимка

source: New snapshot name
de: Neuer Schattenkopiename
ru: Имя нового снимка

source: New snapshot state. (“available”, “error”, “creating”, “deleting”, or “error_deleting”) (admin only) (This option simply changes the state of the snapshot in the database with no regard to actual status, exercise caution when using)
de: Neue Schattenkopiezustand. ("available", "error", "creating", "deleting" oder "error_deleting") (Diese Option ändert einfach den Zustand der Schattenkopien in der Datenbank ohne Rücksicht auf den aktuellen Status )
ru: Состояние нового снимка (available, error, creating, deleting или error_deleting) может задавать только администратор. Этот параметр просто изменяет состояние снимка в базе данных независимо от действительного состояния (используйте его осторожно).

source: New users are assigned to this project if no project is specified when a user is created.
de: Neue Benutzer werden diesem Projekt zugewiesen, sofern bei ihrer Erstellung kein anderes Projekt angegeben wird.
ru: Новые пользователи назначаются этому проекту, если проект не указан при создании пользователя.

source: Nexenta volume driver
ru: драйвер тома Nexenta

source: Note that extra dependencies may be required, per operating system, depending on the package being installed, such as is the case with Tempest.
de: Beachten Sie, dass je nach installiertem Paket zusätzliche Abhängigkeiten je Betriebssystem erforderlich sein können, wie es beispielsweise bei Tempest der Fall ist.
ru: Обратите внимание: могут потребоваться дополнительные зависимости для операционной системы, исходя из установленного пакета, например как в случае с Tempest.

source: Note that the volume is now available.
de: Beachten SIe, dass der Datenträger jetzt verfügbar ist.
ru: Обратите внимание: теперь том является доступным.

source: Notices
de: Benachrichtigungen
ru: Заметки

source: Notices take these forms:
de: Benachrichtigungen haben diese Formen:
ru: Заметки оформляются следующим образом.

source: Nova API
ru: API службы Nova

source: Number that is unique to every computer system on the Internet. Two versions of the Internet Protocol (IP) are in use for addresses: IPv4 and IPv6.
de: Nummer, die für jedes Computersystem im Internet einzigartig ist. Für die Adressen: IPv4 und IPv6 werden zwei Versionen des Internet Protocol (IP) verwendet.
ru: Уникальный номер для каждой компьютерной системы в Интернете. Для адресов используются две версии интернет-протокола (IP): IPv4 и IPv6.
vi_vn: Chuỗi số đặc trưng cho mỗi hệ thống máy tính trên Internet. Hai phiên bản của Giao thức Liên mạng (IP) được sử dụng cho việc khai báo địa chỉ: IPv4 và IPv6.

source: Object Storage (swift)
de: Objekt Storage (swift)
ru: Хранилище объектов (Swift)

source: Object Storage API
ru: API объектного хранилища

source: Object Storage middleware that uploads (posts) an image through a form on a web page.
de: Object Storage Middleware, die ein Abbild über ein Formular auf einer Webseite hochlädt (posten).
ru: Промежуточное ПО объектного хранилища, передающее (публикующее) изображение с помощью формы на веб-странице.
vi_vn: Middleware của Object Storage có tác dụng tải lên (đăng lên) một image thông qua một mẫu trên một trang web.

source: Object Storage service
de: Objektspeicherdienst (swift)
ru: Служба хранилища объектов

source: Object Storage service (swift)
ru: Служба объектного хранилища (Swift)

source: Object Storage service overview
de: Übersicht Objektspeicherdienst
ru: Обзор хранилища объектов

source: Object servers (swift-object-server)
de: Object Server (swift-object-server)
ru: Серверы объектов (swift-object-server)

source: On Red Hat Enterprise Linux, CentOS, or Fedora, use ``yum`` to install the clients from the packaged versions available in `RDO <https://www.rdoproject.org/>`__:
ru: В системах Red Hat Enterprise Linux, CentOS и Fedora используйте команду ``yum``, чтобы устанавливать упакованные клиенты, доступные в `RDO <https://www.rdoproject.org/>`__:

source: On any shell from which you want to run OpenStack commands, source the ``PROJECT-openrc.sh`` file for the respective project.
de: Sourcen Sie auf jeder Shell, von der Sie OpenStack-Befehle ausführen möchten, die Datei `` PROJECT-openrc.sh`` für das jeweilige Projekt.
ru: В любой оболочке, из которой необходимо выполнять команды OpenStack, выберите файл ``ПРОЕКТ-openrc.sh`` для соответствующего проекта.

source: On any shell from which you want to run OpenStack commands, source the ``PROJECT-openrc.sh`` file for the respective project. In this example, you source the ``admin-openrc.sh`` file for the admin project:
de: Geben Sie auf jeder Shell, von der Sie OpenStack-Befehle ausführen möchten, die Datei ``PROJECT-openrc.sh`` für das jeweilige Projekt. In diesem Beispiel sourcen Sie die Datei "admin-openrc.sh" für das admin-Projekt:
ru: В любой оболочке, из которой необходимо выполнять команды OpenStack, выберите файл ``ПРОЕКТ-openrc.sh`` для соответствующего проекта. В этом случае выбран файл ``admin-openrc.sh`` для проекта admin:

source: On the :guilabel:`API Access` tab, click :guilabel:`Download OpenStack RC File` and save the file. The filename will be of the form ``PROJECT-openrc.sh`` where ``PROJECT`` is the name of the project for which you downloaded the file.
de: Auf der Registerkarte: guilabel: `API Zugriff` klicken Sie auf: guilabel:` Download OpenStack RC File` und speichern Sie die Datei. Der Dateiname hat die Form `` PROJECT-openrc.sh``, wobei `` PROJECT`` der Name des Projekts ist, für das Sie die Datei heruntergeladen haben.
ru: На вкладке :guilabel:`Доступ к API` щелкните :guilabel:`Загрузить RC-файл OpenStack` и сохраните файл. Имя файла будет в виде ``ПРОЕКТ-openrc.sh``, где ``ПРОЕКТ`` — это имя проекта, для которого вы загрузили файл.

source: On the :guilabel:`Project` tab, open the :guilabel:`Compute` tab and click :guilabel:`Access & Security`.
de: Auf der Registerkarte: guilabel: `Projekt` öffnen Sie die Registerkarte: guilabel:` Compute` und klicken Sie auf: guilabel: `Zugriffe & Sicherheit`.
ru: На вкладке :guilabel:`Проект` откройте вкладку `Compute` и щелкните `Доступ и безопасность`.

source: On-instance / ephemeral
de: On-instance / flüchtig
ru: Для экземпляра / временное
