Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: If you need to install the source package for the command-line package, the following table lists the software needed to run the command-line clients, and provides installation instructions as needed.
de: Wenn Sie das Quellpaket für das Befehlszeilenpaket installieren müssen, enthält die folgende Tabelle die Software, die zum Ausführen der Befehlszeilenclients erforderlich ist, und enthält nach Bedarf Installationsanweisungen.
ru: Если необходимо установить исходный пакет для клиентов командной строки, в следующей таблице перечислено программное обеспечение, которое используется для запуска клиентов командной строки, а также предоставлены инструкции по установке.

source: If you specify a disk or CD-ROM bus model that is not supported, see the Disk_and_CD-ROM_bus_model_values_table_. If you specify a VIF model that is not supported, the instance fails to launch. See the VIF_model_values_table_.
de: Wenn Sie ein Laufwerk oder ein CD-ROM-Busmodell angeben, das nicht unterstützt wird, finden Sie weitere Informationen unter Disk_and_CD-ROM_bus_model_values_table_. Wenn Sie ein VIF-Modell angeben, das nicht unterstützt wird, wird die Instanz nicht gestartet. Siehe VIF_model_values_table_.
ru: Если вы задали неподдерживаемую модель шины диска или компакт-диска, см. Disk_and_CD-ROM_bus_model_values_table_. Если вы задали неподдерживаемую модель устройства VIF, инстанс не запустится. См. VIF_model_values_table_.

source: If your volume was created successfully, its status is ``available``. If its status is ``error``, you might have exceeded your quota.
de: Wenn Ihr Datenträger erfolgreich erstellt wurde, ist sein Status ``available``. Wenn es sich um ``error`` handelt, haben Sie möglicherweise Ihr Kontingent überschritten.
ru: Состояние успешно созданного тома — ``available``. Если состояние тома — ``error``, вероятно, вы превысили свою квоту.

source: Image API
de: Abbild API
ru: API службы образов

source: Image service
de: Abbilddienst (glance)
ru: Служба образов

source: Image service (glance)
de: Abbilddienst (glance)
ru: Служба образов (Glance)

source: Image service overview
de: Abbilddienst Überblick
ru: Обзор службы образов

source: Impassable limits for guest VMs. Settings include total RAM size, maximum number of vCPUs, and maximum disk size.
de: Unpassierbare Grenzen für Gast-VMs. Die Einstellungen umfassen die gesamte RAM-Größe, die maximale Anzahl an vCPUs und die maximale Festplattengröße.
ru: Непреодолимые пределы для гостевых виртуальных машин. Настройки включают общий объем ОЗУ, максимальное число процессоров vCPU и максимальный объем диска.
vi_vn: Những giới hạn không thể vượt qua được dành cho các máy ảo của khách. Sự điều chỉnh bao gồm tổng kích thước về RAM, số lượng vCPU tối đa và kích thước tối đa của ổ.

source: Implemented as a filesystem underlying OpenStack Compute
de: Implementiert als Dateisystem unterhalb von OpenStack Compute
ru: Реализуется как файловая система службы вычислительных ресурсов OpenStack

source: In Compute and Block Storage, the ability to set resource limits on a per-project basis.
ru: В службе вычислительных ресурсов и блочного хранилища возможность определить предельное значение использования ресурсов для конкретного проекта.

source: In Compute, conductor is the process that proxies database requests from the compute process. Using conductor improves security because compute nodes do not need direct access to the database.
de: In Compute ist der Conductor der Prozess, der für eine Annäherung von Datenbankanfragen vom Compute Prozess sorgt. Die Verwendung des Conductors erhöht die Sicherheit, da Compute Knoten keinen direkten Zugriff auf die Datenbank benötigen.
ru: Проводник службы вычислительных ресурсов — это процесс, который проксирует запросы вычислительных ресурсов к базе данных. Использование проводника повышает безопасность, поскольку вычислительным узлам не требуется прямой доступ к базе данных.
vi_vn: Trong Compute, dây dẫn là quá trình yêu cầu ủy quyền cơ sở dữ liệu từ các quá trình tính toán. Sử dụng dây dẫn nâng cao bảo mật vì các node compute không cần truy cập trực tiếp đến các cơ sở dữ liệu.

source: In Object Storage, tools to test and ensure dispersion of objects and containers to ensure fault tolerance.
de: In Object Storage Werkzeuge zum Testen und Dispersion von Objekten und Containern zu gewährleisten, um Fehlertoleranz sicherzustellen.
ru: Средства для тестирования и дисперсии объектов и контейнеров в объектном хранилище, гарантирующие отказоустойчивость.
vi_vn: Trong Object Storage, các công cụ để kiểm tra và đảm bảo sự phân tán của các object và container để đảm bảo tính chống chịu lỗi.

source: In OpenStack Identity, entities represent individual API consumers and are owned by a specific domain. In OpenStack Compute, a user can be associated with roles, projects, or both.
ru: В службе идентификации OpenStack пользователь — отдельный потребитель API, который принадлежит определенному домену. В службе вычислительных ресурсов OpenStack пользователь может быть связан с ролями, проектами или и ролями, и проектами.

source: In OpenStack, the API version for a project is part of the URL. For example, ``example.com/nova/v1/foobar``.
de: In OpenStack ist die API-Version für ein Projekt Teil der URL. Beispiel: `example.com/nova/v1/foobar``.
ru: В OpenStack версия API для проекта — это часть URL-адреса. Например, ``example.com/nova/v1/foobar``.

source: In a high-availability setup with an active/active configuration, several systems share the load together and if one fails, the load is distributed to the remaining systems.
de: In einer Hochverfügbarkeitseinrichtung mit aktiv/aktiv Konfiguration wird die Last auf verschiedene Systeme und im Falle eins Ausfalls auf die verbleibenden Systeme verteilt.
ru: В схемах высокой доступности с конфигурацией "активная-активная" несколько систем подключены к общей нагрузке, и если одна из систем выходит из строя, нагрузка распределяется между оставшимися.
vi_vn: Trong một thiết lập có độ sẵn sàng cao với cấu hình active/active , nhiều hệ thống chịu tải cùng nhau và nếu một hệ thống hỏng, công việc sẽ được phân bổ đến các hệ thống còn lại.

source: In a high-availability setup with an active/passive configuration, systems are set up to bring additional resources online to replace those that have failed.
de: In einer Hochverfügbarkeitseinrichtung mit aktiv/passiv Konfiguration werden zusätzliche Resourcen online gebracht, um ausgefallene zu ersetzen.
ru: В схемах высокой доступности с конфигурацией "активная-пассивная" системы запускают дополнительные ресурсы, чтобы заменить вышедшие из строя элементы.
vi_vn: Độ sẵn sàng cao được thiết lập với một cấu hình tĩnh hoặc động, các hệ thống được cấu hình như vậy giúp đem lại các nguồn online có thể dùng để thay thế những hệ thống bị lỗi trước đó.

source: In a text editor, create a file named ``PROJECT-openrc.sh`` and add the following authentication information:
de: Erstellen Sie in einem Texteditor eine Datei mit dem Namen ``PROJECT-openrc.sh`` und fügen Sie die folgenden Authentifizierungsinformationen hinzu:
ru: В текстовом редакторе создайте файл ``ПРОЕКТ-openrc.sh``и добавьте в него следующие сведения для аутентификации:

source: In cryptography, an entity that issues digital certificates. The digital certificate certifies the ownership of a public key by the named subject of the certificate. This enables others (relying parties) to rely upon signatures or assertions made by the private key that corresponds to the certified public key. In this model of trust relationships, a CA is a trusted third party for both the subject (owner) of the certificate and the party relying upon the certificate. CAs are characteristic of many public key infrastructure (PKI) schemes. In OpenStack, a simple certificate authority is provided by Compute for cloudpipe VPNs and VM image decryption.
de: In der Kryptographie eine Einheit, die digitale Zertifikate ausstellt. Das digitale Zertifikat bescheinigt das Eigentum an einem öffentlichen Schlüssel durch den benannten Gegenstand des Zertifikats. Dies ermöglicht es anderen (vertrauende Parteien), sich auf Signaturen oder Behauptungen zu verlassen, die durch den privaten Schlüssel, der dem zertifizierten öffentlichen Schlüssel entspricht, gemacht werden. In diesem Modell der Vertrauensstellungen ist eine CA ein vertrauenswürdiger Dritter sowohl für das Subjekt (Besitzer) des Zertifikats als auch für die Partei, die sich auf das Zertifikat stützt. CAs sind charakteristisch für viele PKI-Systeme (Public Key Infrastructure). In OpenStack wird eine einfache Zertifizierungsstelle von Compute für Cloudpipe-VPNs und VM-Image-Entschlüsselung bereitgestellt.
ru: В криптографии — организация, выпускающая цифровые сертификаты. Цифровой сертификат подтверждает подлинность открытого ключа по имени владельца сертификата. Это позволяет другим организациям (проверяющие стороны) доверять подписям или утверждениям, создаваемым с помощью закрытого ключа, который соответствует открытому ключу владельца сертификата. В этой модели отношений доверия ЦС является надежной третьей стороной для владельца сертификата и стороны, которая доверяет этому сертификату. Центры сертификации используется во многих схемах с инфраструктурой открытого ключа (PKI). В OpenStack служба вычислительных ресурсов предоставляет простой центр сертификации, который обеспечивает расшифровку образов CloudPipe (VPN) и ВМ.

source: In the Image service, run the following command:
de: Führen Sie im Abbild-Dienst den folgenden Befehl aus:
ru: В службе образов выполните следующую команду:

source: In the context of Object Storage, this is a process that is not terminated after an upgrade, restart, or reload of the service.
ru: В контексте объектного хранилища это процесс, который не завершается после обновления, перезапуска или перезагрузки службы.
vi_vn: Trong văn cảnh của Object Storage, đây là một quá trình mà không bị dừng lại sau khi nâng cấp, khởi động lại hoặc nạp lại dịch vụ.

source: In the context of the Identity service, the worker process that provides access to the admin API.
de: Im Kontext des Identitätsdienstes ist dies der Worker-Prozess, der Zugriff zur Admin-API zur Verfügung stellt.
ru: В контексте идентификатора это рабочий процесс, предоставляющий доступ к API администрирования.
vi_vn: Trong phạm vi của dịch vụ Identity, là quá trình worker cung cấp truy cập đến admin API.

source: In the following example, the ``demo-openrc.sh`` file is sourced for the demo project:
de: Im folgenden Beispiel wird für das Demo-Projekt die Datei ``demo-openrc.sh`` gesourct:
ru: В следующем примере для учебного проекта выбран файл ``demo-openrc.sh``:

source: In this example, :option:`--force-host-copy True` forces the generic host-based migration mechanism and bypasses any driver optimizations. :option:`--lock-volume <True|False>` applies to the available volume. To determine whether the termination of volume migration caused by other commands. ``True`` locks the volume state and does not allow the migration to be aborted.
ru: В этом примере параметр`--force-host-copy True` принудительно запускает универсальный механизм миграции для хоста без оптимизации драйверов. Параметр `--lock-volume <True|False>` применяется по отношению к доступным томам, чтобы определить возможность прерывания миграции тома с помощью других команд. Если задать значение ``True``, состояние тома блокируется и миграцию прервать невозможно.

source: Individual command-line clients
de: Individuelle Befehlszeilenclients
ru: Отдельные клиенты командной строки

source: Information that consists solely of ones and zeroes, which is the language of computers.
de: Informationen, die nur aus Einsern und Nullern bestehen. Die Sprache der Computer.
ru: Информация, содержащая только нули или единицы, — основа любого языка программирования.
vi_vn: Thông tin chỉ bao gồm các số 1 và số 0, và là ngôn ngữ của các máy tính.

source: Infrastructure-as-a-Service (IaaS)
ru: Инфраструктура как услуга (IaaS)

source: Input/Output Operations Per Second (IOPS)
ru: Количество операций ввода-вывода в секунду (IOPS)

source: Install each client separately by using the following command:
de: Installieren Sie jeden Client separat mit dem folgenden Befehl:
ru: Установите каждый клиент отдельно, используя следующие команды.

source: Install pip through the package manager for your system:
de: Installieren Sie pip durch den Paket-Manager für Ihr System:
ru: Установите pip с помощью диспетчера пакетов своей системы.

source: Install the Database service.
de: Datenbankdienst installieren.
ru: Устанавливает службу баз данных.

source: Install the OpenStack client
de: Installieren Sie den OpenStack Client
ru: Установка клиента OpenStack

source: Install the OpenStack command-line clients
de: Installation des OpenStack Kommandozeilen-Clients
ru: Установка клиентов командной строки OpenStack

source: Install the prerequisite software
de: Installation der erforderlichen Software
ru: Установка необходимого программного обеспечения

source: Install the prerequisite software and the Python package for each OpenStack client.
de: Installieren Sie die erforderliche Software und die Python-Pakete für jeden OpenStack Client.
ru: Установите необходимое программное обеспечение и пакет Python для каждого клиента OpenStack.

source: Installed by default on Mac OS X.
de: Standardmäßig auf Mac OS X installiert.
ru: Устанавливается по умолчанию на Mac OS X.

source: Installing from packages
de: Installieren von Paketen
ru: Установка из пакетов

source: Installing with pip
de: Installation mit pip
ru: Установка с помощью pip

source: Instances in use
de: Benutzte Instanzen
ru: используемые экземпляры;

source: Instruments the complex system flows that support provisioning instances, managing the lifecycle of instances, and performing operations on instances.
de: Instrumentiert die komplexen Systemflüsse, die die Bereitstellung der Instanzen unterstützen, den Lebenszyklus von Instanzen verwalten und Operationen auf Instanzen ausführen.
ru: Создает сложные системные потоки, поддерживающие выделение экземпляров, управление их жизненным циклом и выполнение операций над ними.

source: Integration with vendor specific management tools, such as Apache Ambari or Cloudera Management Console.
de: Integration mit herstellerspezifischen Management-Tools wie Apache Ambari oder Cloudera Management Console.
ru: Интеграция со средствами управления определенного поставщика, например Apache Ambari или Cloudera Management Console.

source: Intelligent Platform Management Interface (IPMI)
ru: Интерфейс для интеллектуальной платформы управления (IPMI)

source: Interactions and processes that are obfuscated from the user, such as Compute volume mount, data transmission to an iSCSI target by a daemon, or Object Storage object integrity checks.
de: Interaktionen und Prozesse, die für den Benutzer unsichtbar sind, wie Compute Datenträger Mount, Datenübertragung zu einem iSCSI Ziel durch einem Dämon oder Objekt Storage Objekt-Integritätsprüfungen.
ru: Взаимодействия и процессы, обфусцированные для пользователя, например подключение томов вычислительных ресурсов, передача данных целевым элементам iSCSI с помощью демонов или проверки целостности объектов в хранилище объектов.
vi_vn: Các giao tiếp và quá trình không rõ ràng đối với người dùng, như việc gắn ổ lưu trữ của Compute, việc truyền dữ liệu từ một daemon đến một iSCSI target hoặc các kiểm tra tính toàn vẹn của object thuộc Object Storage.

source: Interacts directly with the Block Storage service, and processes such as the ``cinder-scheduler``. It also interacts with these processes through a message queue. The ``cinder-volume`` service responds to read and write requests sent to the Block Storage service to maintain state. It can interact with a variety of storage providers through a driver architecture.
de: Interagiert direkt mit dem Blockspeicherdienst und Prozessen wie dem ``Cinder-Scheduler``. Es interagiert auch mit diesen Prozessen durch eine Nachrichtenwarteschlange. Der ``Cinder-Volume``-Dienst antwortet auf Lese- und Schreibanforderungen, die an den Blockspeicherdienst gesendet werden, um den Zustand zu erhalten. Es kann durch eine Treiberarchitektur mit einer Vielzahl von Speicheranbietern interagieren.
ru: Взаимодействует напрямую со службой хранилища блоков и с такими процессами как ``cinder-scheduler``. Кроме того, взаимодействует с этими процессами при помощи очереди сообщений. Служба ``cinder-volume`` отвечает на отправленные службе хранилища блоков запросы чтений и записи, чтобы поддерживать состояние. Может взаимодействовать с разными поставщиками хранилищ с помощью драйверов.

source: Interface within Networking that enables organizations to create custom plug-ins for advanced features, such as QoS, ACLs, or IDS.
ru: Интерфейс службы управления сетью, который позволяет организациям создавать пользовательские плагины для расширенных функций, например QoS, ACL или IDS.
vi_vn: Giao diện nằm trong Networking cho phép các tổ chức tạo ra các plug-in riêng cho các tính năng tiên tiến, như QoS, ACLs hoặc IDS.

source: Internally, OpenStack services are composed of several processes. All services have at least one API process, which listens for API requests, preprocesses them and passes them on to other parts of the service. With the exception of the Identity service, the actual work is done by distinct processes.
de: Intern sind OpenStack-Dienste aus mehreren Prozessen zusammengesetzt. Alle Dienste haben mindestens einen API-Prozess, der auf API-Anfragen hört, diese vorverarbeitet und an andere Teile des Dienstes weitergibt. Mit Ausnahme des Identitätsdienstes erfolgt die eigentliche Arbeit durch unterschiedliche Prozesse.
ru: Службы OpenStack состоят из нескольких процессов. В каждой службе есть хотя бы один процесс API, который ожидает запросы API, предварительно обрабатывает их и передает другим элементам службы. За исключением службы идентификации фактическая работа выполняется отдельными процессами.

source: Internally, each command uses cURL command-line tools, which embed API requests. OpenStack APIs are RESTful APIs, and use the HTTP protocol. They include methods, URIs, media types, and response codes.
de: Intern verwendet jeder Befehl CURL-Befehlszeilentools, die API-Anfragen einbetten. OpenStack-APIs sind REST-APIs und verwenden das HTTP-Protokoll. Dazu gehören Methoden, URIs, Medientypen und Antwortcodes.
ru: Для внутренней обработки каждая команда использует инструменты командной строки cURL, которые встраивают запросы API. API OpenStack — это RESTful API, которые используют протокол HTTP. Они содержат методы, коды URI, типы носителей и коды ответов.

source: Internet Control Message Protocol (ICMP)
ru: Протокол управления сообщениями в Интернете (ICMP)

source: Internet Service Provider (ISP)
ru: поставщик интернет-услуг (ISP)
vi_vn: Nhà cung cấp dịch vụ Internet (ISP)

source: Internet Small Computer System Interface (iSCSI)
ru: Интерфейс малых вычислительных систем для Интернета (iSCSI)

source: Internet protocol (IP)
de: Internetprotokoll (IP)
ru: интернет-протокол (IP)

source: It includes the following components:
de: Es besteht aus den folgenden Komponenten:
ru: Она включает в себя следующие компоненты.

source: JavaScript Object Notation (JSON)
ru: Нотация объектов JavaScript (JSON)

source: Key Manager service
de: Schlüsselverwaltungsdienst (barbican)
ru: Служба управления ключами

source: Key Manager service (barbican)
de: Schlüsselmanager-Dienst (barbican)
ru: Служба управления ключами (barbican)

source: Key features are:
de: Schlüsselfunktionen sind:
ru: Основные особенности

source: LBaaS feature that provides availability monitoring using the ``ping`` command, TCP, and HTTP/HTTPS GET.
de: LBaaS-Funktion, die die Verfügbarkeitsüberwachung mit dem ``ping`` Befehl, TCP und HTTP / HTTPS GET zur Verfügung stellt.
ru: Функция LBaaS, которая обеспечивает мониторинг доступности с помощью команды ``ping``, протокола TCP и метода GET в HTTP/HTTPS.

source: Launches stacks from templates, views details of running stacks including events and resources, and updates and deletes stacks.
de: Startet Stacks von Vorlagen, zeigt detailierte Ansichten der laufenden Stacks einschließlich Ereignisse und Ressourcen, und aktualisiert und löscht Stacks.
ru: Запускает стеки из шаблонов, выводит сведения о выполняющихся стеках, включая события и ресурсы, а также обновляет и удаляет стеки.

source: Layer-2 (L2) agent
ru: агент Layer-2 (L2)

source: Layer-3 (L3) agent
ru: агент Layer-3 (L3)

source: Lightweight Directory Access Protocol (LDAP)
ru: Упрощенный протокол доступа к каталогам (LDAP)

source: Linux Bridge neutron plug-in
ru: Плагин Linux Bridge службы Neutron

source: Linux containers (LXC)
ru: Контейнеры Linux (LXC)

source: Linux kernel feature that provides independent virtual networking instances on a single host with separate routing tables and interfaces. Similar to virtual routing and forwarding (VRF) services on physical network equipment.
ru: Функция ядра Linux, которая обеспечивает создание независимых инстансов виртуальной сети на одном хосте с различными интерфейсами и таблицами маршрутизации. Подобна технологии виртуальной маршрутизации и перенаправления (VRF) на физическом сетевом оборудовании.
vi_vn: Tính năng của nhân Linux có khả năng cung cấp các instance mạng ảo độc lập trên một máy chủ vật lý đơn lẻ với các bảng định tuyến và giao diện đơn lẻ.

source: Linux kernel security module that provides the mechanism for supporting access control policies.
ru: Модуль безопасности ядра Linux, который обеспечивает механизм по реализации политик контроля доступа.
vi_vn: module bảo mật nhân Linux cung cấp cơ chế hỗ trợ các chính sách kiểm soát truy cập.

source: List available volumes and their statuses:
de: Liste der verfügbaren Datenträger und deren Status:
ru: Откройте список доступных томов и их состояний:

source: List images, and note the ID of the image that you want to use for your volume:
de: Listen Sie Abbilder auf und notieren Sie die ID des Abbildes, das Sie für Ihren Datenträger verwenden möchten:
ru: Отобразите список образов и найдите идентификатор образа, который необходимо использовать для тома:

source: List instances:
de: Instanzen anzeigen:
ru: Список инстансов:

source: List or get details for images (glance)
de: Auflisten oder Details anzeigen für Abbilder (glance)
ru: Отображение списка образов и получение дополнительных сведений (Glance)

source: List the availability zones, and note the ID of the availability zone in which you want to create your volume:
de: Geben Sie die Verfügbarkeitszonen an und notieren Sie sich die ID der Verfügbarkeitszone, in der Sie Ihr Datenträger erstellen möchten:
ru: Отобразите список зон доступности и найдите идентификатор зоны доступности, в которой необходимо создать том:

source: List the hosts and the nova-related services that run on them:
ru: Отображает хосты и выполняющиеся на них службы Nova:

source: List the volumes again, and note that the status of your volume is ``deleting``:
de: Listen Sie die Datenträger erneut auf, und beachten Sie, dass der Status Ihres Datenträgers ``deleting`` ist:
ru: Повторно отобразите список томов и убедитесь, что состояние вашего тома — ``deleting``:

source: List volumes:
de: Datenträger auflisten:
ru: Отобразите список томов:

source: Lists allowed commands within the Compute rootwrap facility.
de: Listet die zulässigen Befehle in der Berechnungsrootwrap-Einrichtung auf.
ru: Содержит разрешенные команды для службы вычислительных ресурсов.
vi_vn: Liệt kê ra các câu lệnh được cho phép nằm trong cơ sở rootwrap của Compute.
