Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: A grouped release of projects related to OpenStack that came out in the fall of 2012, the sixth release of OpenStack. It includes Compute (nova), Object Storage (swift), Identity (keystone), Networking (neutron), Image service (glance), and Volumes or Block Storage (cinder). Folsom is the code name for the sixth release of OpenStack. The design summit took place in San Francisco, California, US and Folsom is a nearby city.
de: Eine gruppierte Freigabe von Projekten im Zusammenhang mit OpenStack, die im Herbst 2012 herauskamen, die sechste Version von OpenStack. Es enthält Compute (nova), Object Storage (swift), Identity (keystone), Networking (neutron), Abbilddienst (glance) und Datenträger oder Blockspeicher (cinder). Folsom ist der Codename für die sechste Version von OpenStack. Der Design Summit fand in San Francisco, Kalifornien, USA statt und Folsom ist eine nahe gelegene Stadt.
ru: Групповой релиз относящихся к OpenStack проектов, состоявшийся осенью 2012 года (шестой релиз OpenStack). Включает службу вычислительных ресурсов (Nova), объектное хранилище (Swift), службу идентификации (Keystone), службу сети (Neutron) , службу Image (Glance), а также службу томов или блочное хранилище (Cinder) . Folsom — кодовое имя шестого релиза OpenStack. Саммит разработчиков проходил в Сан-Франциско, Калифорния, США (Фолсом — название близлежащего города).

source: A high availability system design approach and associated service implementation ensures that a prearranged level of operational performance will be met during a contractual measurement period. High availability systems seek to minimize system downtime and data loss.
de: Ein hochverfügbarer Systemdesignansatz und die damit verbundene Serviceimplementierung sorgen dafür, dass während einer vertraglichen Messperiode ein vorgegebenes operatives Leistungsniveau erreicht wird. Hochverfügbarkeits-Systeme versuchen, Systemausfallzeiten und Datenverluste zu minimieren.
ru: Подход к разработке систем высокой доступности и реализации связанных служб, гарантирующий, что запланированный уровень рабочей эффективности будет поддерживаться на протяжении всего договорного срока. Системы высокой доступности минимизируют время простоя и утерю данных.

source: A horizon component that stores and tracks client session information. Implemented through the Django sessions framework.
ru: Компонент службы Horizon, который хранит и отслеживает информацию о сеансе. Реализовано через инфраструктуру сеансов Django.
vi_vn: Một thành phần của horizon có tác dụng lưu trữ và theo dõi thông tin phiên làm việc của client. Được cài đặt thông qua framework của các phiên làm việc của Django.

source: A hybrid cloud is a composition of two or more clouds (private, community or public) that remain distinct entities but are bound together, offering the benefits of multiple deployment models. Hybrid cloud can also mean the ability to connect colocation, managed and/or dedicated services with cloud resources.
de: Eine Hybrid-Cloud ist eine Komposition von zwei oder mehreren Cloud (privat, gemeinschaftlich oder öffentlich), die unterschiedliche Einheiten bleiben, aber zusammengebunden sind und die Vorteile von mehreren Einsatzmodellen bieten. Hybrid-Cloud kann auch die Möglichkeit sein, Colocation, verwaltete und/oder dedizierte Dienste mit Cloud-Ressourcen zu verbinden.
ru: Гибридное облако — это соединение двух или более облаков (частного, общедоступного и облака сообщества), которые остаются отдельными экземплярами, но связаны друг с другом, предоставляя преимущества нескольких моделей развертывания. Гибридное облако также позволяет подключать службы совместного расположения облачных ресурсов, управления ими и специальные службы к облачным ресурсам.

source: A kind of web service API that uses REST, or Representational State Transfer. REST is the style of architecture for hypermedia systems that is used for the World Wide Web.
ru: Тип интерфейса API веб-службы, который использует концепцию REST (передача состояния представления). REST — архитектурный стиль, используемый в проектировании гипермедиа-систем для Всемирной паутины.
vi_vn: Một loại APi dịch vụ web sử dụng REST, hoặc Chuyển tải Trạng thái Đại diện (Representational State Transfer). REST là một dạng kiến trúc cho các hệ thống siêu phương tiện (hypermedia) được sử dụng cho World Wide Web

source: A lightweight SQL database, used as the default persistent storage method in many OpenStack services.
ru: Облегченная база данных SQL, которая используется в качестве постоянного хранилища по умолчанию во многих службах OpenStack.
vi_vn: Một cơ sở dữ liệu SQL hạng nhẹ, được sử dụng làm phương thức lưu trữ liên tục mặc định trong nhiều dịch vụ OpenStack.

source: A list of API endpoints that are available to a user after authentication with the Identity service.
de: Eine Liste von API-Endpunkten, die einem Benutzer nach der Authentifizierung mit dem Identitätsdienst zur Verfügung stehen.
ru: Список точек доступа к API, доступных пользователю после аутентификации с помощью службы идентификации.
vi_vn: Một danh sách các API endpoint hiện hành đối với người dùng sau khi xác thực với dịch vụ Identity.

source: A list of URL and port number endpoints that indicate where a service, such as Object Storage, Compute, Identity, and so on, can be accessed.
de: Eine Liste von URL- und Portnummernendpunkten, die angeben, wo ein Dienst, wie z. B. Objektspeicher, Berechnungen, Identität usw., zugegriffen werden kann.
ru: Перечень URL-адресов и номеров портов точек входа, в котором указано, как можно получить доступ к службе, например к службе объектного хранилища, вычислительных ресурсов, идентификации и т.д.
vi_vn: Một danh sách các endpoint URL và port được đánh số chỉ định nơi mà một dịch vụ, ví dụ như Object Storage, Compute, Identity,... có thể được truy cập.

source: A list of VM images that are available through Image service.
de: Eine Liste der VM-Abbilder, die über den Abbilddienst verfügbar sind.
ru: Список образов виртуальных машин, доступных с помощью службы образов.
vi_vn: Một danh sách các image máy ảo hiện có thông qua dịch vụ Image.

source: A list of permissions attached to an object. An ACL specifies which users or system processes have access to objects. It also defines which operations can be performed on specified objects. Each entry in a typical ACL specifies a subject and an operation. For instance, the ACL entry ``(Alice, delete)`` for a file gives Alice permission to delete the file.
de: Eine Liste der an ein Objekt angehängten Berechtigungen. Eine ACL gibt an, welche Benutzer oder Systemprozesse auf Objekte zugreifen können. Es definiert auch, welche Operationen an bestimmten Objekten durchgeführt werden können. Jeder Eintrag in einer typischen ACL gibt einen Betreff und einen Vorgang an. Zum Beispiel gibt der ACL-Eintrag ``(Alice, delete) `` für eine Datei Alice die Berechtigung zum Löschen der Datei.
ru: Прикрепленный к объекту список разрешений. ACL указывает, каким пользователям или системным процессам предоставляется доступ к объектам. Он также определяет, какие операции выполняются с определенными объектами. Каждая запись стандартного списка ACL указывает субъект и операцию. Например, запись ACL ``(Alice, delete)`` для файла разрешает пользователю Alice удалить файл.

source: A list of projects that can access a given VM image within Image service.
de: Eine Liste von Projekten, die auf ein bestimmtes VM-Abbild im Abbilddienst zugreifen können.
ru: Перечень проектов, которые могут получать доступ к данному образу ВМ в службе образов.

source: A load balancer is a logical device that belongs to a cloud account. It is used to distribute workloads between multiple back-end systems or services, based on the criteria defined as part of its configuration.
de: Ein Loadbalancer ist ein logisches Gerät, das zu einem Cloud Account gehört. Es wird verwendet, um Workloads zwischen mehreren Back-End-Systemen oder -Diensten zu verteilen, basierend auf den Kriterien, die als Teil seiner Konfiguration definiert wurden.
ru: Балансировщик нагрузки — логическое устройство учетной записи облака. Используется для распределения рабочих нагрузок между несколькими конечными системами или службами на основе критериев, определенных в составе конфигурации.
vi_vn: Một cân bằng tải là một thiết bị logic thuộc về một tài khoản đám mây. Nó được sử dụng để phân bổ khối lượng công việc giữa nhiều hệ thống hoặc dịch vụ back-end, dựa trên các tiêu chí được định nghĩa trong phần cấu hình của nó.

source: A logical set of devices, such as web servers, that you group together to receive and process traffic. The load balancing function chooses which member of the pool handles the new requests or connections received on the VIP address. Each VIP has one pool.
ru: Логический набор устройств, например веб-серверы, объединенных для получения и обработки трафика. С помощью функции балансировки нагрузки выбирается, какой участник пула обрабатывает новые запросы или подключения, полученные на Адрес VIP. У каждого адреса VIP есть один пул.
vi_vn: Một tập hợp các thiết bị, chẳng hạn như máy chủ web, mà bạn nhóm lại với nhau để nhận và quá trình lưu lượng truy cập. Các chức năng cân bằng tải chọn thành viên của pool mà xử lý các yêu cầu mới hoặc kết nối được vào địa chỉ VIP. Mỗi VIP có một pool.

source: A mechanism that allows IPv6 packets to be transmitted over an IPv4 network, providing a strategy for migrating to IPv6.
de: Ein Mechanismus, der es ermöglicht, IPv6-Pakete über ein IPv4-Netzwerk zu übertragen und so eine Strategie für die Migration zu IPv6 bereitzustellen.
ru: Механизм, который позволяет передавать пакеты IPv6 по сети IPv4 и предоставляет стратегию перехода на IPv6.
vi_vn: Cơ chế mà cho phép các gói tin của IPv6 được truyền qua dải mạng của IPv4, nhằm cung cấp một chiến lược cho việc dịch chuyển sang việc sử dụng IPv6.

source: A mechanism that allows many resources (for example, fonts, JavaScript) on a web page to be requested from another domain outside the domain from which the resource originated. In particular, JavaScript's AJAX calls can use the XMLHttpRequest mechanism.
de: Ein Mechanismus, der viele Ressourcen (z. B. Schriftarten, JavaScript) auf einer Webseite erlaubt, die von einer anderen Domäne außerhalb der Domäne angefordert werden soll, von der die Ressource entstanden ist. Insbesondere JavaScripts AJAX-Aufrufe können den XMLHttpRequest-Mechanismus verwenden.
ru: Механизм, который позволяет запрашивать многие ресурсы на веб-странице (например, шрифты, JavaScript) из другого домена, не связанного с этим ресурсом. В частности, вызовы JavaScript AJAX могут использовать механизм XMLHttpRequest.
vi_vn: Một cơ chế cho phép nhiều tài nguyên (ví dụ như font chữ, JavaScript) trên một trang web được yêu cầu từ một miền khác nằm ngoài miền mà tài nguyên nằm trong miền đó. Cụ thể, các cuộc gọi JavaScript's AJAX có thể sử dụng cơ chế XMLHttpRequest.

source: A message that is stored both in memory and on disk. The message is not lost after a failure or restart.
ru: Сообщение, которое хранится в памяти и на диске. Это сообщение не теряется после сбоя или перезапуска.
vi_vn: Một mẩu tin được lưu trữ trên cả bộ nhớ và đĩa. Mẩu tin này sẽ không mất đi kể cả khi hệ thống bị hư hỏng hoặc khởi động lại.

source: A message that is stored in memory and is lost after the server is restarted.
ru: Сообщение, которое хранится в памяти и удаляется после перезагрузки сервера.
vi_vn: Một mẩu tin được lưu trữ trong bộ nhớ và sẽ bị mất đi sau khi server khởi động lại.

source: A method for making file systems available over the network. Supported by OpenStack.
ru: Метод обеспечения доступности файловой системы по сети. Поддерживается OpenStack.
vi_vn: Một phương pháp giúp cho các hệ thống file trở nên hiện hữu qua hệ thống mạng. Được hỗ trợ bởi OpenStack.

source: A method of VM live migration used by KVM to evacuate instances from one host to another with very little downtime during a user-initiated switchover. Does not require shared storage. Supported by Compute.
de: Eine von KVM zum Evakuieren von Instanzen von einem Host zu einem anderen genutzte Methode der VM Livemigration mit sehr geringer Downtime, während der vom Benutzer initiierten Umschaltung. Benötigt keinen gemeinsam genutzten Speicher. Unterstützt von Compute.
ru: Метод миграции виртуальных машин в реальном времени, используемый KVM, чтобы переносить экземпляры с одного хоста на другой, минимизируя простои. Не требует общих хранилищ данных. Поддерживается службой вычислительных ресурсов.
vi_vn: Một cách di chuyển trực tiếp máy ảo được sử dụng bởi Kernel-based Virtual Machine (KVM) để di rời các máy ảo từ một host này sang host khác với thời gian chết tối thiểu trong quá trình chuyển mạch khởi-tạo-bởi-người-dùng. Không yêu cầu chia sẻ Storage. Hỗ trợ bởi Compute.

source: A method of operating system installation where a finalized disk image is created and then used by all nodes without modification.
de: Eine Methode der Betriebssysteminstallation, bei der ein finalisiertes Diskabbild erstellt und dann von allen Knoten ohne Modifikation verwendet wird.
ru: Метод установки операционной системы, при котором окончательный образ диска создается, а затем без изменений используется всеми узлами.
vi_vn: Một phương pháp cài đặt hệ điều hành mà ở đó một image hoàn chỉnh được tạo ra và sau đó được sử dụng bởi tất cả các node mà không có thêm bất kì chỉnh sửa nào.

source: A method to establish trusts between identity providers and the OpenStack cloud.
de: Eine Methode, um Trusts zwischen Identitätsanbietern und der OpenStack Cloud zu etablieren.
ru: Метод установки доверительных отношений между провайдерами идентификации и облаком OpenStack.
vi_vn: Một phượng thức để xây dựng niềm tin giữa các trình cung cấp identity và OpenStack cloud.

source: A method to further subdivide availability zones into hypervisor pools, a collection of common hosts.
de: Eine Methode zur weiteren Unterteilung von Verfügbarkeitszonen in Hypervisor-Pools, eine Sammlung von gemeinsamen Hosts.
ru: Метод разделения зон доступности в пуле гипервизора; набор обычных хостов.
vi_vn: Một phương pháp để chia nhỏ hơn nữa các khu sẵn có vào pool hypervisor, một tập hợp các hosts phổ biến.

source: A minimal Linux distribution designed for use as a test image on clouds such as OpenStack.
de: CirrOS
ru: CirrOS
vi_vn: Một phiên bản hệ điều hành nền tảng Linux tối giản được thiết kế dùng cho mục đích kiểm tra trên các cloud như OpenStack.

source: A model that enables access to a shared pool of configurable computing resources, such as networks, servers, storage, applications, and services, that can be rapidly provisioned and released with minimal management effort or service provider interaction.
de: Ein Modell, das den Zugriff auf einen gemeinsam genutzten Pool von konfigurierbaren Rechenressourcen wie Netzwerken, Servern, Speichern, Anwendungen und Diensten ermöglicht, die mit minimalem Verwaltungsaufwand oder Dienstanbieterinteraktion schnell bereitgestellt und freigegeben werden können.
ru: Концепция, подразумевающая обеспечение сетевого доступа к общему пулу конфигурируемых вычислительных ресурсов (например, сетям передачи данных, серверам, устройствам хранения данных, приложениям и службам), которые могут быть оперативно предоставлены и освобождены с минимальными эксплуатационными затратами или обращениями к провайдеру.
vi_vn: Một mô hình cho phép truy cập vào một pool được chia sẻ cấu hình tài nguyên máy tính, chẳng hạn như các mạng, máy chủ, lưu trữ, ứng dụng và dịch vụ, mà có thể được cung nhanh chóng và đưa ra với nỗ lực quản lý tối thiểu hoặc tương tác cung cấp dịch vụ.

source: A network authentication protocol which works on the basis of tickets. Kerberos allows nodes communication over a non-secure network, and allows nodes to prove their identity to one another in a secure manner.
de: Ein Netzwerk-Authentifizierungsprotokoll, das auf der Basis von Tickets arbeitet. Kerberos ermöglicht die Kommunikation von Knoten über ein nicht sicheres Netzwerk und ermöglicht es den Knoten, ihre Identität auf sichere Weise zu beweisen.
ru: Протокол аутентификации сети, работающий на базе заявок. Kerberos позволяет незащищенную связь между узлами, а также предоставляет им возможность взаимной безопасной идентификации.

source: A network protocol that configures devices that are connected to a network so that they can communicate on that network by using the Internet Protocol (IP). The protocol is implemented in a client-server model where DHCP clients request configuration data, such as an IP address, a default route, and one or more DNS server addresses from a DHCP server. A method to automatically configure networking for a host at boot time. Provided by both Networking and Compute.
de: Ein Netzwerkprotokoll, das Geräte, die mit einem Netzwerk verbunden sind, so konfiguriert, dass diese unter Benutzung des Interneprotokolls (IP) kommunizieren können. Das Protokoll ist implementiert in einem Client-Server-Modell, wo DHCP-Clients vom DHCP-Server Konfigurationsdaten anfragen, wie IP-Adresse, Default-Route, und eine oder mehrere DNS-Server-Adressen. Eine Methode zur automatischen Konfiguration des Netzwerkes für einen Host beim booten. Wird von Netzwerk und Compute bereitgestellt.
ru: Сетевой протокол для настройки подключенных к сети устройств для их взаимодействия по протоколу IP. Протокол реализован по модели клиент-сервер, в которой DHCP-клиенты запрашивают у DHCP-сервера конфигурационные данные, например IP-адрес, маршрут по умолчанию и адрес одного или более серверов DNS. Представляет собой метод автоматической настройки для работы хоста в сети во время его загрузки. Предоставляется службами Networking и Compute.

source: A network protocol used by a network client to obtain an IP address from a configuration server. Provided in Compute through the dnsmasq daemon when using either the FlatDHCP manager or VLAN manager network manager.
de: Ein Netzwerkprotokoll, das von einem Netzwerk-Client verwendet wird, um eine IP-Adresse von einem Konfigurationsserver zu erhalten. Wird in Compute über den dnsmasq-Daemon bereitgestellt, wenn entweder der FlatDHCP-Manager oder der VLAN-Manager-Netzwerkmanager verwendet wird.
ru: Сетевой протокол, используемый клиентом сети, чтобы получить IP-адрес от сервера конфигурации. Предоставляется в рамках службы вычислительных ресурсов с помощью демона dnsmasq при использовании диспетчера FlatDHCP или диспетчера сети VLAN.
vi_vn: Một giao thức mạng được sử dụng bởi client trong mạng để nhận được địa chỉ IP từ một server cấu hình. Được cung cấp trong Compute thông qua dnsmasq daemon khi sử dụng FlatDHCP manager hoặc VLAN manager network manager.

source: A network protocol used by network devices for control messages. For example, :command:`ping` uses ICMP to test connectivity.
de: Ein Netzwerkprotokoll, das von Netzwerkgeräten für Steuerungsnachrichten verwendet wird. Zum Beispiel: :command: `ping` verwendet ICMP, um Konnektivität zu testen.
ru: Сетевой протокол, используемый устройствами в сети для управления сообщениями. Например, команда :command:`ping` использует ICMP, чтобы проверять подключение.

source: A network segment typically used for instance Internet access.
de: Ein üblicherweise von den Instanzen für den Zugriff auf das Internet benutztes Netzwerksegment.
ru: Сетевой сегмент, как правило, используемый для быстрого доступа к Интернету.
vi_vn: Một phân đoạn mạng thường được sử dụng để truy cập Internet.

source: A network segment used for administration, not accessible to the public Internet.
de: Ein Netzwerk-Segment für die Verwaltung verwendet, nicht zugänglich für das öffentliche Internet.
ru: Сетевой сегмент, который используется для целей администрирования и не имеет доступа к Интернету.
vi_vn: Một phân đoạn mạng được sử dụng cho mục đích quản trị, không thể truy cập thông qua Internet.

source: A network segment used for instance traffic tunnels between compute nodes and the network node.
de: Ein Netzwerksegment, das zum Beispiel Verkehrstunnel zwischen Rechnerknoten und dem Netzknoten verwendet wird.
ru: Сетевой сегмент, используемый для передачи трафика от инстансов между вычислительными узлами и сетевым узлом.
vi_vn: Một phần mạng được sử dụng cho các kênh truyền tín hiệu giữa các compute node và network node.

source: A network virtualization technology that attempts to reduce the scalability problems associated with large cloud computing deployments. It uses a VLAN-like encapsulation technique to encapsulate Ethernet frames within UDP packets.
de: Eine Netzwerk-Virtualisierungstechnologie, die versucht, die Skalierbarkeitsprobleme zu reduzieren, die mit großen Cloud-Computing-Implementierungen verbunden sind. Es verwendet eine VLAN-ähnliche Verkapselungstechnik, um Ethernet-Frames innerhalb von UDP-Paketen zu kapseln.
ru: Технология сетевой виртуализации, созданной для решения проблем масштабируемости в больших системах облачных вычислений. Она использует схожий с VLAN метод инкапсуляции Ethernet-кадров в UDP-пакеты.
vi_vn: Một công nghệ ảo hóa hệ thống mạng dùng để giảm tính phức tạp của bài toán liên quan tới sự triển khai của một hệ thống điện toán đám mây lớn. Nó sử dụng công nghệ tương tự như công nghệ đóng gói VLAN để đóng gói các frames vào trong những gói tin UDP.

source: A node that provides the Object Storage proxy service.
ru: Узел, который предоставляет прокси-службу объектного хранилища.
vi_vn: Một node cung cấp dịch vụ proxy của Object Storage.

source: A node that runs Object Storage account, container, and object services.
ru: Узел, на котором выполняются службы учетных записей, контейнеров и объектов объектного хранилища.
vi_vn: Một node chạy các dịch vụ tài khoản, container và object của Object Storage.

source: A node that runs network, volume, API, scheduler, and image services. Each service may be broken out into separate nodes for scalability or availability.
de: Ein Knoten, der Netzwerk-, Volumen-, API-, Scheduler- und Abbilddienste ausführt. Jeder Dienst kann in separate Knoten für die Skalierbarkeit oder Verfügbarkeit gebrochen werden.
ru: Узел, на котором запускаются службы: сетевые службы, службы хранилищ, API, службы образов и планировщика. В целях улучшения масштабируемости и доступности каждую службу можно установить на отдельный узел.
vi_vn: Một node chạy các các dịch vụ mạng, ổ lưu trữ, API, trình lên lịch và image. Mỗi dịch vụ có thể được chia ra thành các node riêng biệt nhằm mục đích cải thiện khả năng mở rộng và tính sẵn sàng.

source: A node that runs the nova-compute daemon that manages VM instances that provide a wide range of services, such as web applications and analytics.
de: Ein Knoten, auf dem der nova-compute Dämon zur Verwaltung von VM Instanzen läuft und der eine Vielzahl an Diensten bereit stellt, wie Web Applikationen und Analysen.
ru: Узел, на котором выполняется демон nova-compute, управляющий экземплярами ВМ. Он предоставляет широкий спектр служб, например веб-приложения и анализ.

source: A notification agent (``ceilometer-agent-notification``)
de: Ein Benachrichtigungsagent (``ceilometer-agent-notification``)
ru: Агент уведомления (``ceilometer-agent-notification``)

source: A notification driver that monitors VM instances and updates the capacity cache as needed.
de: Ein Benachrichtigungstreiber, der VM-Instanzen überwacht und den Kapazitätscache bei Bedarf aktualisiert.
ru: Драйвер уведомления, который отслеживает экземпляры виртуальных машин и обновляет емкость кэша при необходимости.
vi_vn: Một thông báo driver về việc giám sát các máy ảo VM và cập nhật dung lượng bộ nhớ đệm khi cần thiết

source: A notification listener (``aodh-listener``)
de: Ein Benachrichtigungs-Listener (``aodh-listener``)
ru: Прослушиватель оповещений (``aodh-listener``)
