Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: An OpenStack service, such as Compute, Object Storage, or Image service. Provides one or more endpoints through which users can access resources and perform operations.
ru: Служба OpenStack, например служба вычислительных ресурсов, объектного хранилища или образов. Предоставляет одну или более точек входа, через которые пользователи могут получать доступ к ресурсам и выполнять операции.
vi_vn: Một dịch vụ OpenStack, như là Compute, Object Storage hoặc dịch vụ Image. Cung cấp một hoặc nhiều endpoint mà qua đó người dùng có thể truy cập tài nguyên và thực hiện các tác vụ.

source: An OpenStack-native REST API that processes API requests by sending them to the ``heat-engine`` over :term:`Remote Procedure Call (RPC)`.
de: Eine OpenStack-native REST-API, die API-Anfragen verarbeitet, indem sie sie an die ``heat-engine`` übergibt über :term: `Remote Procedure Call (RPC)`.
ru: Собственный REST API для OpenStack, который обрабатывает запросы API, отправляя их в ``heat-engine`` с помощью :term:`Remote Procedure Call (RPC)`.

source: An OpenStack-provided image.
de: Ein durch OpenStack bereitgestelltes Abbild.
ru: Образ, предоставленный OpenStack.
vi_vn: Một image được cung cấp bởi OpenStack.

source: An OpenStack-supported hypervisor.
de: Ein von OpenStack unterstützter Hypervisor.
ru: Поддерживаемый OpenStack гипервизор.
vi_vn: Một hypervisor được hỗ trợ bởi OpenStack

source: An OpenStack-supported hypervisor. KVM is a full virtualization solution for Linux on x86 hardware containing virtualization extensions (Intel VT or AMD-V), ARM, IBM Power, and IBM zSeries. It consists of a loadable kernel module, that provides the core virtualization infrastructure and a processor specific module.
de: Ein OpenStack-unterstützter Hypervisor. KVM ist eine vollständige Virtualisierungslösung für Linux auf x86-Hardware mit Virtualisierungserweiterungen (Intel VT oder AMD-V), ARM, IBM Power und IBM zSeries. Es besteht aus einem ladbaren Kernelmodul, das die zentrale Virtualisierungsinfrastruktur und ein prozessorspezifisches Modul zur Verfügung stellt.
ru: Гипервизор, поддерживаемый OpenStack. KVM — полномасштабное решение в сфере виртуализации для Linux на 32-разрядном оборудовании, содержащее расширения виртуализации (Intel VT или AMD-V), ARM, IBM Power и IBM zSeries. Состоит из загружаемых модулей ядра, предоставляющих основную инфраструктуру виртуализации и модуль для конкретного процессора.
vi_vn: Một hypervisor được hỗ trợ bởi OpenStack. KVM là một giải pháp ảo hóa toàn diện cho Linux trên phần cứng x86 có chứa các phần mở rộng ảo hóa (Intel VT hoặc AMD-V), ARM, IBM Power và IBM zSeries. Nó bao gồm một module nhân có thể nạp được nhằm mục đích cung cấp các cơ sở hạ tần ảo hóa cốt lõi và một module xử lý cụ thể.

source: An administrator who has access to all hosts and instances.
ru: Администратор, которому предоставлен доступ ко всем хостам и инстансам.
vi_vn: Một quản trị viên có quyền truy cập vào tất cả các host và instance.

source: An administrator-defined token used by Compute to communicate securely with the Identity service.
ru: Заданный администратором токен, который используется службой вычислительных ресурсов для безопасного взаимодействия со службой идентификации.
vi_vn: Một token định nghĩa bởi admin được sử dụng bởi Compute để giao tiếp an toàn với dịch vụ Identity.

source: An alarm evaluator (``aodh-evaluator``)
de: Eine Alarmauswertung (``aodh-evaluator``)
ru: Средство оценки оповещений (``aodh-evaluator``)

source: An alarm notifier (``aodh-notifier``)
de: Ein Alarmmelder (``aodh-notifier``)
ru: Уведомитель (``aodh-notifier``)

source: An alpha-numeric string of text used to access OpenStack APIs and resources.
ru: Буквенно-цифровая строка текста, используемая для доступа к API и ресурсам OpenStack.
vi_vn: Một chuỗi số-ký tự được sử dụng để truy cập vào các API và tài nguyên của OpenStack.

source: An alternative name for :term:`Networking API <Networking API (Neutron API)>`.
ru: Альтернативный термин для :term:`API службы управления сетью <Networking API (Neutron API)>`.

source: An alternative term for :term:`project ID`.
ru: Альтернативный термин для :term:`ID проекта`.

source: An application protocol for accessing and maintaining distributed directory information services over an IP network.
de: Ein Applikationsprotokoll für den Zugriff und die Wartung von Informationen in einem Verzeichnisdienst über ein IP Netzwerk.
ru: Протокол прикладного уровня для доступа к распределенным службам каталога по IP-сети и поддержки этих служб.

source: An application protocol for distributed, collaborative, hypermedia information systems. It is the foundation of data communication for the World Wide Web. Hypertext is structured text that uses logical links (hyperlinks) between nodes containing text. HTTP is the protocol to exchange or transfer hypertext.
de: Ein Anwendungsprotokoll für verteilte, kollaborative, hypermedia Informationssysteme. Es ist die Grundlage der Datenkommunikation für das World Wide Web. Hypertext ist strukturierter Text, der logische Verknüpfungen (Hyperlinks) zwischen Knoten enthält, die Text enthalten. HTTP ist das Protokoll zum Austausch oder Übertragung von Hypertext.
ru: Протокол прикладного уровня для распределенных совместно используемых информационных систем гипермедиа. Лежит в основе обмена данным во Всемирной паутине. Гипертекст это структурированный текст, в котором используются логические ссылки (гиперссылки) на узлы, содержащие текст. HTTP — протокол для обмена или передачи гипертекста.

source: An application that runs on the back-end server in a load-balancing system.
ru: Приложение, которое выполняет внутренний сервер в системе с балансировкой нагрузки.
vi_vn: Một ứng dụng chạy trên back-end server trong một hệ thống cân bằng tải.

source: An authentication and authorization service for Object Storage, implemented through WSGI middleware; uses Object Storage itself as the persistent backing store.
de: Ein Authentifizierungs- und Autorisierungsdienst für Objekt Storage, durch WSGI Middleware implementiert. Verwendet selbst Objekt Storage als dauerhaften Speicher.
ru: Служба аутентификации и авторизации для объектного хранилища, реализуемая с помощью промежуточного ПО WSGI. Использует объектное хранилище в качестве постоянного резервного хранилища.

source: An authentication facility within Object Storage that enables Object Storage itself to perform authentication and authorization. Frequently used in testing and development.
ru: Функция аутентификации в объектном хранилище, которая позволяет последнему самостоятельно выполнять аутентификацию и авторизацию. Часто используется для тестирования и разработки.
vi_vn: Một cơ sở xác thực nằm trong Object Storage cho phép bản thân Object Storage thực hiện quy trình xác thực và ủy quyề. Thường được sử dụng trong thử nghiệm và phát triển.

source: An easy method to create a local LDAP directory for testing Identity and Compute. Requires Redis.
de: Eine einfache Methode zur Erstellung eines lokalen LDAP-Verzeichnisses zum testen von Identity und Compute. Benötigt Redis.
ru: Удобный метод создания локального каталога LDAP для тестирования службы идентификации и вычислительных ресурсов. Требования: Redis.
vi_vn: Một phương thức dễ dàng để khởi tạo một thư mục LDAP nội bộ nhằm mục đích thử nghiệm Identity và Compute. Yêu cầu phải có Redis.

source: An element of the Compute RabbitMQ that comes to life when a RPC call is executed. It connects to a direct exchange through a unique exclusive queue, sends the message, and terminates.
de: Ein Element des Compute RabbitMQ, das zum Leben erweckt wird, wenn ein RPC-Aufruf ausgeführt wird. Es verbindet sich mit einem direkten Austausch durch eine exklusive Warteschlange, sendet die Nachricht und beendet sich.
ru: Элемент RabbitMQ службы вычислительных ресурсов, который используется при выполнении вызова RPC. Он подключается к прямому обмену через уникальную эксклюзивную очередь, отправляет сообщение и удаляется.
vi_vn: Một yếu tố của Compute RabbitMQ trở thành hiện thực khi một thủ tục gọi RPC được thực thi. Nó kết nối để trao đổi trực tiếp thông qua một trình tự riêng biệt độc nhất , gửi tin nhắn, và chấm dứt.

source: An element of the Compute capacity cache that is calculated based on the number of build, snapshot, migrate, and resize operations currently in progress on a given host.
de: Ein Element des Compute-Kapazitätscache, das auf der Grundlage der Anzahl der Build-, Snapshot-, Migrations- und Resize-Operationen berechnet wird, die derzeit auf einem bestimmten Host ausgeführt werden.
ru: Элемент кэша службы вычислительных ресурсов, который рассчитывается на основе числа операций создания, снимков, переноса и изменения размера, выполняющихся на данный момент на определенном хосте.
vi_vn: Một yếu tố của dung lượng bộ nhớ đệm của Compute được tính toán dựa trên số lượng build, ảnh chụp, các dịch chuyển, thay đổi kích thước và các hoạt động đang diễn ra trong tiến trình trên một host nhất định.

source: An encrypted communications protocol for secure communication over a computer network, with especially wide deployment on the Internet. Technically, it is not a protocol in and of itself; rather, it is the result of simply layering the Hypertext Transfer Protocol (HTTP) on top of the TLS or SSL protocol, thus adding the security capabilities of TLS or SSL to standard HTTP communications. Most OpenStack API endpoints and many inter-component communications support HTTPS communication.
de: Ein verschlüsseltes Kommunikationsprotokoll für eine sichere Kommunikation über ein Computernetzwerk mit besonders breiter Bereitstellung im Internet. Technisch ist es kein Protokoll an und für sich; Vielmehr ist es das Ergebnis der einfachen Überlagerung des Hypertext Transfer Protocol (HTTP) über das TLS- oder SSL-Protokoll und damit die Sicherheitsfunktionen von TLS oder SSL zu Standard-HTTP-Kommunikation. Die meisten OpenStack API-Endpunkte und viele Inter-Komponenten-Kommunikation unterstützen HTTPS-Kommunikation.
ru: Протокол шифрования соединений компьютерных сетей, широко распространенный в Интернете. С технической точки зрения, сам по себе не является протоколом; скорее, это результат простого использования защищенной передачи гипертекста (HTTP) наряду с протоколом TLS или SSL. Таким образом, защитные возможности TLS или SSL добавляются к стандартному HTTP-соединению. Большинство точек доступа API и многие межкомпонентные соединения используют HTTPS.

source: An entity in the context of the :term:`Shared File Systems service<Shared File Systems service (manila)>` that encapsulates interaction with the Networking service. If the driver you selected runs in the mode requiring such kind of interaction, you need to specify the share network to create a share.
ru: Сущность в контексте :term:`службы общих файловых систем<Shared File Systems service (manila)>`, которая инкапсулирует взаимодействие в службе управления сетями. Если выбранный вами драйвер выполняется в режиме, требующем такого взаимодействия, необходимо указать сеть общего ресурса, чтобы создать общий ресурс.

source: An entity that maps Object Storage data to partitions. A separate ring exists for each service, such as account, object, and container.
ru: Сущность, которая сопоставляет данные объектного хранилища по разделам. Для каждой службы (например, учетной записи, объекта, контейнера) создается отдельное кольцо.
vi_vn: Một thực thể có tác dụng sắp xếp dữ liệu của Object Storage vào các phân vùng. Mỗi dịch vụ có một ring riêng biệt như account, object, container.

source: An extra but helpful piece of practical advice.
de: Ein besonders hilfreicher praktischer Hinweis.
ru: Необязательный, но весьма полезный совет.

source: An iSCSI authentication method supported by Compute.
de: Eine von Compute unterstützte iSCSI Authentifizierungsmethode.
ru: Метод аутентификации объектов iSCSI, поддерживаемый службой вычислительных ресурсов.
vi_vn: Một phương pháp xác thực iSCSI được hỗ trợ bởi Compute.

source: An in-progress specification for cloud management. Currently unsupported in OpenStack.
de: Eine ununterbrochene Spezifikation für Cloud-Management. Derzeit nicht in OpenStack unterstützt.
ru: Спецификация по управлению облаками, которая находится в стадии разработки. В настоящее время не поддерживается в OpenStack.
vi_vn: Một đặc điểm kỹ thuật dùng để quản lý cloud theo tiến độ. Hiện không được hỗ trợ bởi OpenStack.

source: An integrated project that provides scalable and reliable Cloud Database-as-a-Service functionality for both relational and non-relational database engines.
de: Ein integriertes Projekt, dass skalierbare und zuverlässige Cloud Database-as-a-Service Funktionalität für relationale sowie nicht-relationale Datenbanken bietet.
ru: Интегрированный проект, который предоставляет масштабируемую и надежную облачную функцию «база данных как услуга» как для реляционных, так и для нереляционных ядер баз данных. Кодовое имя проекта службы базы данных — Trove.

source: An interface that is plugged into a port in a Networking network. Typically a virtual network interface belonging to a VM.
de: Ein mit einem Port in der Netzwerkumgebung verbundenes Plugin. Typischerweise eine zu einer VM gehörende virtuelle Netzwerkschnittstelle.
ru: Интерфейс, подключаемый в порт в сети службы Networking. Обычно виртуальный сетевой интерфейс виртуальный машины.
vi_vn: Một thiết bị ghép nối mà được cắm vào một cổng trong hệ thống mạng Networking. Thường là một hệ thống mạng ảo thuộc về một máy ảo.

source: An object state in Object Storage where a new replica of the object is automatically created due to a drive failure.
de: Ein Objektstatus in Objektspeicher, bei dem aufgrund eines Laufwerksfehlers automatisch eine neue Replik des Objekts erstellt wird.
ru: Состояние объекта в хранилище объектов, когда новая копия объекта автоматически создания в результате сбоя диска.
vi_vn: Một trạng thái của object trong Object Storage khi một bản sao mới của object được tự động tạo ra do xảy ra hư hỏng ổ đĩa.

source: An object within Object Storage that is larger than 5 GB.
de: Ein Objekt im Objektspeicher grösser als 5 GB.
ru: Объект в объектном хранилище размером больше 5 ГБ.

source: An official OpenStack service defined as core by DefCore Committee. Currently, consists of Block Storage service (cinder), Compute service (nova), Identity service (keystone), Image service (glance), Networking service (neutron), and Object Storage service (swift).
de: Ein offizieller OpenStack-Dienst, der als Kern von DefCore Committee definiert wurde. Derzeit besteht er aus Blockspeicherdienst (Cinder), Compute Dienst (Nova), Identitätsdienst (Keystone), Abbilddienst (Glance), Networking Dienst (Neutron) und Object Storage Dienst (Swift).
ru: Служба OpenStack, которая признана официальной комитетом DefCore. На данный момент к ним относится служба блочных хранилищ (Cinder), служба вычислительных ресурсов (Nova), служба идентификации (Keystone), служба образов (Glance), сетевая служба (Neutron) и хранилище объектов (Swift).

source: An official OpenStack service defined as optional by DefCore Committee. Currently, consists of Dashboard (horizon), Telemetry service (Telemetry), Orchestration service (heat), Database service (trove), Bare Metal service (ironic), and so on.
ru: Официальная служба OpenStack, которая определена как дополнительная комитетом DefCore. В настоящее время к таким службам относится панель управления (Horizon), служба телеметрии (Telemetry), служба оркестрации (Heat), служба базы данных (Trove), служба Bare Metal (Ironic) и т.д.

source: An open source LDAP server. Supported by both Compute and Identity.
ru: Сервер LDAP с открытым исходным кодом. Поддерживается службами вычислительных ресурсов и идентификации.
vi_vn: Một server LDAP mã nguồn mở. Được hỗ trợ bởi cả dịch vụ Compute và Identity.

source: An open source SQL toolkit for Python, used in OpenStack.
ru: Набор инструментов SQL с открытым исходным кодом для Python, который используется в OpenStack.
vi_vn: Một bộ công cụ SQL mã nguồn mở dành cho Python, được sử dụng trong OpenStack.

source: An open source community project by Dell that aims to provide all necessary services to quickly deploy clouds.
ru: Проект сообщества с открытым исходным кодом Dell, который предоставляет все службы, необходимые для быстрого развертывания облаков.

source: An operating system configuration management tool supporting OpenStack deployments.
de: Ein Betriebssystem-Konfigurations-Management-Tool unterstützt OpenStack-Implementierungen.
ru: Инструмент управления конфигурацией операционной системы, поддерживаемый OpenStack.
vi_vn: Một công cụ quản lý cấu hình hệ điều hành hỗ trợ các triển khai OpenStack.

source: An operating system configuration-management tool supported by OpenStack.
ru: Средство по настройке и управлению операционной системой, поддерживаемое OpenStack.
vi_vn: Một công cụ cấu hình-quản lý được hỗ trợ bởi OpenStack.

source: An operating system instance running under the control of a hypervisor.
de: Eine Betriebssysteminstanz, die unter der Kontrolle eines Hypervisor läuft.
ru: Инстанс операционной системы, запускаемый под управлением гипервизора.
vi_vn: Một máy ảo hệ điều hành chạy dưới quyền kiểm soát của một hypervisor.

source: An operating system instance that runs on top of a hypervisor. Multiple VMs can run at the same time on the same physical host.
de: Eine Betriebssysteminstanz, die auf einem Hypervisor läuft. Mehrere VMs können gleichzeitig auf demselben physischen Host laufen.
ru: Инстанс операционной системы, который выполняется поверх гипервизора. На одном физическом хосте одновременно могут выполняться несколько ВМ.
vi_vn: Một máy ảo hệ điều hành chạy phía trên một hypervisor. Nhiều VM có thể chạy cùng một lúc trên cùng một host vật lý.

source: An operator-grade open source scalable load balancer.
ru: Масштабируемый балансировщик нагрузки с открытым исходным кодом и поддержкой различных категорий операторов.

source: An option within Compute that enables administrators to create and manage users through the ``nova-manage`` command as opposed to using the Identity service.
de: Eine Option innerhalb von Compute, die es Administratoren ermöglicht, Benutzer über den Befehl ``nova-manage`` zu erstellen und zu verwalten, im Gegensatz zur Verwendung des Identitätsdienst.
ru: Параметр службы вычислительных ресурсов (Compute), который позволяет администраторам создавать и администрировать пользователей с помощью команды nova-manage вместо службы идентификации (Identity).

source: An option within Image service so that an image is deleted after a predefined number of seconds instead of immediately.
de: Eine Option im Abbilddienst, nachdem ein Abbild nach einer vordefinierten Anzahl von Sekunden statt sofort gelöscht wird.
ru: Параметр службы Image, который откладывает удаление образа на указанное число секунд.
vi_vn: Một tùy chọn nằm trọng Image service cho phép một image sẽ được xóa sau một vài giây được định trước thay vì ngay lập tức.

source: Analytics-as-a-Service for ad-hoc or bursty analytic workloads.
de: Analytics-as-a-Service für ad-hoc oder busty analytische Workloads.
ru: "Аналитика как услуга" для динамических или пиковых нагрузок аналитических данных.

source: Another option is to use the unofficial binary installer maintained by Christoph Gohlke (http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools).
ru: Кроме того, можно использовать неофициальный двоичный установщик, созданный Кристофом Гольке (http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools).

source: Another option is to use the unofficial binary installer provided by Christoph Gohlke (http://www.lfd.uci.edu/~gohlke/pythonlibs/#pip).
ru: Кроме того, можно использовать неофициальный двоичный установщик, созданный Кристофом Гольке (http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools).

source: Any business that provides Internet access to individuals or businesses.
de: Jedes Unternehmen, das Internet-Zugang zu Einzelpersonen oder Unternehmen bietet.
ru: Любая организация, предоставляющая доступ к Интернету для компаний и частных лиц.
vi_vn: Bất kì doanh nghiệp nào cung cấp truy cập Internet cho các cá nhân hoặc tập thể.

source: Any client software that enables a computer or device to access the Internet.
de: Jede Client-Software, die es einem Computer oder Gerät ermöglicht, auf das Internet zuzugreifen.
ru: Любое программное обеспечение клиента, позволяющее компьютеру или устройству получить доступ к Интернету.
vi_vn: Bất kì phần mềm client nào cho phép một máy tính hoặc thiết bị truy cập Internet.

source: Any compute node that runs the network worker daemon.
ru: Любой вычислительный узел, на котором выполняется демон сетевого рабочего модуля.
vi_vn: Bất kì node tính toán nào chạy network worker daemon.

source: Any deployment-specific information is helpful, such as whether you are using Ubuntu 14.04 or are performing a multi-node installation.
de: Alle implementierungsspezifischen Informationen sind hilfreich, z. B. ob Sie Ubuntu 14.04 verwenden oder eine Mehrknoteninstallation durchführen.
ru: Пригодиться может любая информация об установке, например использование Ubuntu 14.04 или установка на несколько узлов.

source: Any kind of text that contains a link to some other site, commonly found in documents where clicking on a word or words opens up a different website.
de: Jede Art von Text, der einen Link zu einer anderen Website enthält, die häufig in Dokumenten gefunden wird, in denen das Anklicken eines Wortes oder der Wörter eine andere Website öffnet.
ru: Любой тип текста, содержащий ссылку на другое расположение, как правило, используемый в документации, где щелчок мышью слова или фразы открывает новый веб-сайт.
vi_vn: Bất kì loại văn bản nào có chứa một liên kết đến một nơi khác, thường được tìm thấy trong các tài liệu khi nháy vào một từ hoặc cụm từ sẽ dẫn đến một trang web khác.

source: Any node running a daemon or worker that provides an API endpoint.
de: Jeder Knoten, der einen Daemon oder Worker ausführt, der einen API-Endpunkt bereitstellt.
ru: Любой узел, на котором выполняется демон или рабочий процесс, которые предоставляют конечную точку API.
vi_vn: Bất kì node nào đang chạy một daemon hoặc worker cung cấp một API endpoint.

source: Any piece of hardware or software that wants to connect to the network services provided by Networking, the network connectivity service. An entity can make use of Networking by implementing a VIF.
de: Jedes Stück Hardware oder Software, die eine Verbindung zu den Netzwerkdiensten herstellen möchte, die von Networking, dem Netzwerkkonnektivitätsdienst, bereitgestellt werden. Eine Entität kann das Netzwerk nutzen, indem es ein VIF implementiert.
ru: Любая часть аппаратного или программного обеспечения, которой требуется подключение к сетевым службам, предоставляемым службой Networking. Для использования сущностью возможностей Networking, можно создать VIF.
vi_vn: Bất kỳ thành phần nào của phần cứng hay phần mềm muốn kết nối tới các dịch vụ mạng của Networking, dịch vụ kết nối mạng. Một thực thể có thể sử dụng Networking để thực hiện một VIF.

source: Any user, including the ``root`` user, can run commands that are prefixed with the ``$`` prompt.
de: Jeder Benutzer, auch der Benutzer ``root``, kann Befehle ausführen, denen die `` $ `` Eingabeaufforderung vorangestellt ist.
ru: Любой пользователь, включая пользователя ``root``, может выполнять команды начинающиеся с``$``.
