Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: To verify that your volume was created successfully, list the available volumes:
de: Um zu überprüfen, ob Ihr Datenträger erfolgreich erstellt wurde, geben Sie die verfügbaren Datenträger an:
ru: Чтобы проверить результат создания тома, отобразите список доступных томов:

source: Tool used for maintaining Address Resolution Protocol packet filter rules in the Linux kernel firewall modules. Used along with iptables, ebtables, and ip6tables in Compute to provide firewall services for VMs.
de: Tool, das für die Verwaltung der Adressfilterprotokoll-Paketfilterregeln in den Linuxkernel-Firewallmodulen verwendet wird. Wird zusammen mit iptables, ebtables und ip6tables in Compute verwendet, um Firewall-Services für VMs bereitzustellen.
ru: Инструмент используется для поддержки правил фильтрации ARP-пакетов на модулях межсетевого экрана, встроенных в ядро Linux. Может использоваться совместно с iptables, ebtables и ip6tables в компоненте Compute, чтобы предоставить службу межсетевого экрана для виртуальных машин.
vi_vn: Công cụ được dùng cho việc duy trì các luật lọc gói tin trong giao thức phân giải địa chỉ trong các module tường lửa nhân Linux. Thường được sử dụng cùng với iptables, ebtalbes, và ip6tables trong Compute để cung cấp các dịch vụ tường lửa cho VMs.

source: Tool used in OpenStack development to ensure correctly ordered testing of changes in parallel.
ru: Инструмент, используемый при разработке OpenStack, чтобы обеспечить надлежащую очередность тестирования изменений.

source: Tool used to run jobs automatically for OpenStack development.
ru: Средство, используемое для автоматического выполнения заданий при разработке OpenStack.

source: Tool used to set up, maintain, and inspect the tables of IPv6 packet filter rules in the Linux kernel. In OpenStack Compute, ip6tables is used along with arptables, ebtables, and iptables to create firewalls for both nodes and VMs.
de: Tool zum Einrichten, Verwalten und Prüfen der Tabellen von IPv6-Paketfilterregeln im Linux-Kernel. In OpenStack Compute werden ip6tables zusammen mit arptables, ebtables und iptables verwendet, um Firewalls für beide Knoten und VMs zu erstellen.
ru: Инструмент, используемый для настройки, обслуживания и проверки таблиц с правилами фильтров для пакетов IPv6 ядра Linux. В службе вычислительных ресурсов OpenStack (Compute) ip6tables используется наряду с arptables, ebtables и iptables, чтобы создавать брандмауэры для узлов и виртуальных машин.
vi_vn: Công cụ được sử dụng để thiết lập, duy trì và kiểm tra các bảng luật lệ lọc gói tin IPv6 trong nhân Linux. Trong OpenStack Compute, ip6tables được sử dụng bênh cạnh arptables,ebtables và iptables để khởi tạo tường lửa cho các node và máy ảo.

source: Transfer a volume
de: Einen Datenträger transferieren
ru: Перенос тома

source: Troubleshoot image creation
de: Fehlersuche bei der Abbilderstellung
ru: Устранение неполадок при создании образа

source: Type of Compute scheduler that evenly distributes instances among available hosts.
ru: Тип планировщика службы вычислительных ресурсов, который равномерно распределяет инстансы по доступным хостам.
vi_vn: Lịch trình của dịch vụ Compute để phân phối các máy ảo về các host đang sẵn sàng.

source: UUID for each Compute or Image service VM flavor or instance type.
de: UUID für jede Compute- oder Abbilddienst VM-Variante oder jeden Instanztyp.
ru: UUID для каждого типа инстанса виртуальной машины в службе вычислительных ресурсов или образов.
vi_vn: UUID cho mỗi flavor hoặc dạng máy ảo của Compute hoặc Image service.

source: UUID used by Image service to uniquely identify each VM image.
de: UUID, die von Abbilddienst verwendet wird, um jedes VM-Abbild eindeutig zu identifizieren.
ru: UUID, используемый службой образов, чтобы однозначно идентифицировать каждый образ виртуальной машины.
vi_vn: UUID được sử dụng bởi Image service để xác định duy nhất từng image máy ảo một.

source: Under the Compute distributed scheduler, this is calculated by looking at the capabilities of each host relative to the flavor of the VM instance being requested.
de: Unter dem Compute verteilten Scheduler wird dies durch Betrachten der Fähigkeiten jedes Hosts relativ zur Variante der VM-Instanz berechnet, die angefordert wird.
ru: В распределенном планировщике вычислительных ресурсов рассчитывается исходя из возможностей каждого хоста по отношению к типу запрашиваемого экземпляра ВМ.
vi_vn: Theo lịch trình phân bố Compute, điều này được tính toán bằng cách nhìn vào khả năng của mỗi host tương đối so với chất lượng của các máy ảo VM được yêu cầu.

source: Unified command-line client
de: Einheitliche Kommandozeilen-Client
ru: Универсальный клиент командной строки

source: Unique ID applied to each storage volume under the Block Storage control.
de: Eindeutige ID, die auf jedem Speichervolumen unter dem Block Storage Control angewendet wird.
ru: Уникальный ID, назначаемый каждому диску хранилища, которым управляет блочное хранилище.
vi_vn: ID duy nhất được gán cho mỗi ổ lưu trữ thuộc quyền kiểm soát của Block Storage.

source: Unique ID assigned to each Networking VIF.
de: Eindeutige ID zugewiesen zu jeder Networking VIF.
ru: Уникальный ID, присваиваемый каждому VIF службы Networking.
vi_vn: ID duy nhất được gán cho mỗi Networking VIF.

source: Unique ID assigned to each Object Storage request; used for debugging and tracing.
ru: Уникальный ID, назначаемый каждому запросу объектного хранилища. Используется для отладки и трассировки.

source: Unique ID assigned to each guest VM instance.
de: Eindeutige ID zugewiesen zu jeder Gast-VM-Instanz.
ru: Уникальный ID, назначаемый каждому инстансу гостевой виртуальной машины.

source: Unique ID assigned to each network segment within Networking. Same as network UUID.
ru: Уникальный ID, назначенный каждому сетевому сегменту в рамках управления сетью. Аналогичен UUID сети.
vi_vn: Một ID duy nhất được gán cho mỗi phân đoạn mạng nằm trong Networking, cũng giống như network UUID.

source: Unique ID assigned to each project by the Identity service.
ru: Уникальный ID, назначаемый каждому проекту службой идентификации.

source: Unique ID assigned to each request sent to Compute.
ru: Уникальный ID, назначаемый каждому запросу, отправленному службе идентификации.
vi_vn: ID duy nhất được gán cho mỗi yêu cầu được gửi đến Compute.

source: Unique ID assigned to each service that is available in the Identity service catalog.
ru: Уникальный ID, назначаемый каждой службе, доступной в каталоге служб Identity.
vi_vn: ID riêng biệt được gán cho từng dịch vụ hiện có trong danh mục dịch vụ Identity.

source: Unique ID for a Networking VIF or vNIC in the form of a UUID.
de: Einzigartige ID für eine Netzwerk-VIF oder vNIC in Form einer UUID.
ru: Уникальный ID для интерфейсов управления сетями VIF или vNIC в форме UUID.
vi_vn: ID duy nhất của một Networking VIF hoặc vNIC dưới dạng một UUID.

source: Unique ID for a Networking network segment.
ru: Уникальный идентификатор сетевого сегмента службы Networking.

source: Unique ID for a Networking port.
ru: Уникальный ID для службы Networking.
vi_vn: ID duy nhất cho một Networking port.

source: Unique ID for an Object Storage object.
ru: Уникальный ID для объекта в объектном хранилище.

source: Unique numeric ID associated with each user in Identity, conceptually similar to a Linux or LDAP UID.
de: Einzigartige numerische ID, die jedem Benutzer in Identität zugeordnet ist, konzeptionell ähnlich einer Linux- oder LDAP-UID.
ru: Уникальный числовой ID, который присваивается каждому пользователю в службе идентификации. Подобен UID в Linux или в LDAP.
vi_vn: ID dạng số duy nhất được liên kết với mỗi người dùng trong Dịch vụ Identity, về mặt khái niệm thì giống với UID của Linux hoặc LDAP.

source: Unless the unified OpenStack Client (**python-openstackclient**) is used, the following table lists the command-line client for each OpenStack service with its package name and description.
de: Wenn der vereinheitlichte OpenStack-Client (** python-openstackclient **) nicht verwendet wird, enthält die folgende Tabelle den Befehlszeilenclient für jeden OpenStack-Dienst mit seinem Paketnamen und seiner Beschreibung.
ru: Если не используется универсальный клиент OpenStack (**python-openstackclient**), в следующей таблице перечисляются клиенты командной строки для каждой службы OpenStack, а также имена пакетов и описания.

source: Unmanage a snapshot
de: Unverwalte eine Schattenkopie
ru: Отмена управления снимками

source: Unmanage a snapshot with the :command:`cinder snapshot-unmanage` command:
ru: Чтобы прекратить управление снимками, воспользуйтесь командой :command:`cinder snapshot-unmanage`:

source: Upgrade or remove clients
de: Aktualisieren oder entfernen Sie Clients
ru: Установка и удаление клиентов

source: Use OpenStack Compute to host and manage cloud computing systems. OpenStack Compute is a major part of an :term:`Infrastructure-as-a-Service (IaaS)` system. The main modules are implemented in Python.
de: Verwenden Sie OpenStack Compute, um Cloud-Computing-Systeme zu hosten und zu verwalten. OpenStack Compute ist ein wichtiger Bestandteil eines: "Infrastructure-as-a-Service (IaaS)" -Systems. Die Hauptmodule sind in Python implementiert.
ru: Используйте службу вычислительных ресурсов OpenStack, чтобы размещать облачные вычислительные системы и управлять ими. Эта служба является основной частью системы :term:`Infrastructure-as-a-Service (IaaS)`. Основные модули реализованы с помощью Python.

source: Use cases include:
de: Anwendungsfälle sind:
ru: Сценарии использования:

source: Use pip to install the OpenStack clients on a Linux, Mac OS X, or Microsoft Windows system. It is easy to use and ensures that you get the latest version of the client from the `Python Package Index <https://pypi.python.org/pypi>`__. Also, pip enables you to update or remove a package.
de: Verwenden Sie pip, um die OpenStack-Clients auf einem Linux-, Mac OS X- oder Microsoft Windows-System zu installieren. Es ist einfach zu bedienen und stellt sicher, dass Sie die neueste Version des Clients aus dem `Python Package Index <https://pypi.python.org/pypi>` __ erhalten. Pip ermöglicht es Ihnen, ein Paket zu aktualisieren oder zu entfernen.
ru: Чтобы установить клиенты OpenStack в системах Linux, Mac OS X или Microsoft Windows, используйте диспетчер пакетов pip. Он прост в использовании и помогает установить последнюю версию клиента из `Каталога пакетов Python <https://pypi.python.org/pypi>`__, а также позволяет обновлять или удалять пакеты.

source: Use the :command:`trove list` command to get the ID of the instance, followed by the :command:`trove show` command to get the IP address of it.
de: Erstellen Sie eine Datenbankdienstinstanz mit dem Befehl: `trove create`.
ru: Используют команду :command:`trove list`, чтобы получить ID экземпляра, а затем — команду :command:`trove show`, чтобы получить соответствующий IP-адрес.

source: Use the :command:`trove-manage` command to import images and offer them to tenants.
ru: Использует команду :command:`trove-manage`, чтобы импортировать образы и предложить их тенантам.

source: Used along with an EC2 access key when communicating with the Compute EC2 API; used to digitally sign each request.
de: Dient zusammen mit einem EC2 Zugriffsschlüssel zur Kommunikation mit der Compute EC2 API; wird zum digitalen signieren jeder Anfrage verwendet.
ru: Используется совместно с ключом доступа к EC2 при взаимодействии с Compute EC2 API. Позволяет добавлять цифровую подпись в каждый запрос.
vi_vn: Được sử dụng cung với key truy cập EC2 khi giao tiếp với Compute EC2 API; được sử dụng để đánh dấu kỹ thuật số cho mỗi yêu cầu.

source: Used along with an EC2 secret key to access the Compute EC2 API.
de: Dient zusammen mit einem EC2 Geheimschlüssel zum Zugriff auf die Compute EC2 API.
ru: Используется совместно с секретным ключом EC2 для доступа к EC2 API службы вычислительных ресурсов.
vi_vn: Được sử dụng cung với key bí mật EC2 để truy cập vào Compute EC2 API.

source: Used along with an EKI to create an EMI.
de: Wird zusammen mit einem EKI zur Erstellung eines EMI verwendet.
ru: Используется наряду с EKI, чтобы создать EMI.
vi_vn: Được sử dụng cùng với EKI để khởi tạo EMI.

source: Used along with an ERI to create an EMI.
de: Wird mit einem ERI zur Erstellung eines EMI verwendet.
ru: Используется наряду с ERI, чтобы создать EMI.
vi_vn: Được sử dụng cùng với ERI để khởi tạo EMI.

source: Used along with arptables and ebtables, iptables create firewalls in Compute. iptables are the tables provided by the Linux kernel firewall (implemented as different Netfilter modules) and the chains and rules it stores. Different kernel modules and programs are currently used for different protocols: iptables applies to IPv4, ip6tables to IPv6, arptables to ARP, and ebtables to Ethernet frames. Requires root privilege to manipulate.
de: Verwendet zusammen mit arptables und ebtables, iptables zum Erstellen von Firewalls in Compute. Iptables sind die Tabellen, die von der Linux-Kernel-Firewall bereitgestellt werden (implementiert als verschiedene Netfilter-Module) und die Ketten und Regeln, die es speichert. Verschiedene Kernmodule und Programme werden derzeit für verschiedene Protokolle verwendet: iptables gilt für IPv4, ip6tables zu IPv6, arptables zu ARP und ebtables zu Ethernet Frames. Benötigt root-Berechtigung zum Manipulieren.
ru: Используется наряду с arptables, ebtables и iptables, чтобы создавать брандмауэры в службе вычислительных ресурсов (Compute). iptables — это таблицы, предоставленные брандмауэром ядра Linux (реализовано в качестве различных модулей межсетевого экрана), а также с помощью цепочек и правил в нем сохраненных. На данный момент для различных протоколов используются различные модули ядра и программы: iptables применяются для IPv4, ip6tables — для IPv6, arptables — для ARP, а ebtables для фреймов Ethernet. Чтобы управлять средством, понадобятся корневые права.
vi_vn: Được sử dụng bên cạnh arptables và ebtables, iptables khởi tạo các tường lửa trong Compute. iptables là các bảng được cung cấp bởi tường lửa của nhân Linux (được cài đặt như các module Netfilter khác nhau) và các chuỗi và quy tắc nó lưu trữ. Các module và chương trình nhân khác nhau dược sử dụng cho các giao thức khác nhau: iptables ứng dụng cho IPv4, ip6tables cho IPv6, arptables cho ARP và ebtalbes cho các frame Ethernet. Yêu cầu quyền root để thực hiện các thay đổi.

source: Used by Image service to obtain images on the local host rather than re-downloading them from the image server each time one is requested.
de: Wird von Abbilddienst verwendet, um Abbilder auf dem lokalen Host zu erhalten, anstatt sie vom Abbildserver jedes Mal erneut herunterzuladen, wenn man angefordert wird.
ru: Используется службой образов для получения образов на локальном хосте вместо их повторной загрузки с серверва образов при каждой регистрации.
vi_vn: Được sử dụng bởi Image service để nhận về các image trên các máy vật lý nội vùng thay vì phải tải lại chúng từ image server mỗi lần nó được yêu cầu.

source: Used by Object Storage devices to determine which storage devices are suitable for the job. Devices are weighted by size.
de: Wird von Object Storage-Geräten verwendet, um festzustellen, welche Speichergeräte für den Job geeignet sind. Geräte werden nach Größe gewichtet.
ru: Используется устройствами объектного хранилища чтобы определить, какие устройства хранилища подходят для выполнения задания. Устройства взвешиваются по размеру.
vi_vn: Được sử dụng bởi các thiết bị đối tượng lưu trữ để quyết địch xem thiết bị lưu trữ nào thích hợp cho công việc. Các thiết bị được đánh giá theo dung lượng.

source: Used by Object Storage to determine the location of an object in the ring. Maps objects to partitions.
ru: Используется объектным хранилищем, чтобы определять расположение объекта в кольце. Сопоставляет объекты с разделами.
vi_vn: Được sử dụng bởi Object Storage để xác định địa điểm của một object trên ring. Sắp xếp các object vào các phân vùng.

source: Used by Object Storage to determine which partition data should reside on.
ru: Используется объектным хранилищем, чтобы определить, в каком разделе должны храниться данные.
vi_vn: Được sử dụng bởi Object Storage để quyest định xem dữ liệu sẽ nằm trên phân vùng nào.

source: Used by Object Storage to push object replicas.
ru: Используется объектным хранилищем, чтобы отправлять реплики объектов.
vi_vn: Được sử dụng bởi Object Storage để đấy các bản sao object.

source: Used by most OpenStack Networking installations to route information between the neutron-server and various agents. Also acts as a database to store networking state for particular plug-ins.
de: Wird von den meisten OpenStack Netzwerkinstallationen verwendet, um Informationen zwischen dem Neutronenserver und verschiedenen Agenten weiterzuleiten. Funktioniert auch als Datenbank, um den Netzwerkzustand für bestimmte Plug-ins zu speichern.
ru: Используется большинством инсталляций сетевой службы OpenStack, чтобы маршрутизировать информацию между сервером neutron-server и различными агентами. Кроме того, выступает в роли базы данных, в которой хранятся сетевые статусы отдельных плагинов.

source: Used for adding additional persistent storage to a virtual machine (VM)
de: Wird zum Hinzufügen von beständigem Speicher zu einer Virtuellen Maschine (VM) verwendet.
ru: Добавляет дополнительные устройства постоянного хранения виртуальным машинам (ВМ)

source: Used for providing file shares to a virtual machine
de: Wird für die Bereitstellung von Dateifreigaben für eine virtuelle Maschine verwendet
ru: Используется для предоставления общих файловых ресурсов виртуальным машинам

source: Used for storing virtual machine images and data
de: Wird zum Speichern von Virtuellen Maschinen Abbildern und Daten verwendet.
ru: Используется для хранения образов и данных виртуальных машин

source: Used to mark Object Storage objects that have been deleted; ensures that the object is not updated on another node after it has been deleted.
ru: Используется для обозначения объектов объектного хранилища, которые были удалены. Гарантирует, что объект не будет обновлен на другом узле после его удаления.
vi_vn: Được dùng để dánh dấu các object của Object Storage đã bị xóa; đảm bảo rằng các object này không được cập nhật trên một node khác sau khi nó đã bị xóa.

source: Used to restrict communications between hosts and/or nodes, implemented in Compute using iptables, arptables, ip6tables, and ebtables.
de: Wird verwendet, um die Kommunikation zwischen Hosts und/oder Knoten zu beschränken, die in Compute mit iptables, arptables, ip6tables und ebtables implementiert wurden.
ru: Используется для ограничения соединений между хостами и узлами. Реализуется в службе Compute с помощью iptables, arptables, ip6tables и ebtables.

source: Used to track segments of a large object within Object Storage.
de: Wird verwendet, um Segmente eines großen Objekts innerhalb des Objektspeichers zu verfolgen.
ru: Используется для отслеживания большого объекта в объектном хранилище.
vi_vn: Được sử dụng để theo dõi các phân đoạn của các object lớn nằm trong Object Storage.

source: User Mode Linux (UML)
ru: Пользовательский режим Linux (UML)

source: User can specify `volume type` when creating a volume.
de: Benutzer können bei der Datenträgererstellung 'volume_type` spezifizieren.
ru: При создании тома можно указать `volume type`.

source: User-friendly UI for ad-hoc analytics queries based on Hive or Pig.
de: Benutzerfreundliche Benutzeroberfläche für Ad-hoc-Analytics-Abfragen basierend auf Hive oder Pig.
ru: Удобный пользовательский интерфейс для динамических запросов аналитики на базе Hive или Pig.
