Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: Alternative term for an API extension or plug-in. In the context of Identity service, this is a call that is specific to the implementation, such as adding support for OpenID.
de: Alternativer Ausdruck für eine API Erweiterung oder ein Plug-in. Im ZUsammenhang mit dem Identitätsdienst ist dies ein implementierungsspezifischer Aufruf, wie z.B. das Hinzufügen der Unterstützung für OpenID.
ru: Альтернативный термин для расширения или модуля API. В контексте службы идентификации это вызов, соответствующий реализации, например добавление поддержки OpenID.
vi_vn: thuật ngữ thay thế cho một API mở rộng hoặc plug-in. Trong bối cảnh dịch vụ Identity, đây là một thủ tục gọi mà cụ thể cho việc thực hiện, chẳng hạn như bổ sung hỗ trợ cho OpenID.

source: Alternative term for an API token.
de: Alternativer Ausdruck für einen API Token.
ru: Вариант термина для токена API.
vi_vn: Thuật ngữ thay thế cho một thẻ bài API.

source: Alternative term for an Amazon EC2 access key. See EC2 access key.
de: Alternative Bezeichnung für einen Amazon EC2-Zugriffsschlüssel. Siehe EC2-Zugriffschluessel.
ru: Альтернативный термин для ключа доступа Amazon EC2. См. ключ доступа EC2.
vi_vn: Thuật ngữ thay thế cho một khóa truy nhập Amazon EC2. Xem khóa truy nhập EC2.

source: Alternative term for an Identity service catalog.
de: Alternativer Name des Identitäts-Dienste-Katalogs.
ru: Альтернативный термин для каталога службы идентификации (Identity).
vi_vn: Thuật ngữ thay thế cho danh mục dịch vụ Identity.

source: Alternative term for an Identity service default token.
ru: Альтернативный термин для токена по умолчанию для службы идентификации.
vi_vn: thuật ngữ thay thế cho một mã token dịch vụ nhận dạng mặc định

source: Alternative term for an Object Storage authorization node.
de: Alternativer Begriff für einen Objektspeicherberechtigungsknoten.
ru: Вариант термина для узла авторизации в хранилище объектов.
vi_vn: Thuật ngữ thay thế cho một nút ủy quyền của Object Storage.

source: Alternative term for an admin API.
de: Alternativer Ausdruck für die Admin API.
ru: Альтернативный термин для API администрирования.
vi_vn: Tên gọi khác của admin API.

source: Alternative term for an ephemeral volume.
ru: Альтернативный термин для эфемерного тома.
vi_vn: Thuật ngữ thay thế cho ổ lưu trữ phù du.

source: Alternative term for an image.
de: Alternativer Ausdruck für ein Abbild.
ru: Альтернативный термин для образа.
vi_vn: Thuật ngữ thay thế cho một image.

source: Alternative term for instance UUID.
de: Alternativer Ausdruck für Instanz-UUID.
ru: Альтернативный термин для UUID инстанса.
vi_vn: Thuật ngữ thay thế cho UUID instance.

source: Alternative term for non-durable.
ru: Альтернативный термин для непродолжительного.
vi_vn: Thuật ngữ thay thế cho không bền vững.

source: Alternative term for project.
de: Alternativer Ausdrück für Projekt.
ru: Вариант названия для проекта.

source: Alternative term for the :term:`Compute API <Compute API (nova API)>`.
ru: Альтернативный термин для :term:`API службы Compute <Compute API (nova API)>`.

source: Alternative term for the Identity service API.
de: Alternativer Ausdruck für die Identitätsdienst API.
ru: Альтернативный термин для API службы идентификации.
vi_vn: Thuật ngữ thay thế cho API của dịch vụ Identity.

source: Alternative term for the Identity service catalog.
ru: Альтернативный термин для каталога служб Identity.
vi_vn: Thuật ngữ thay thế cho danh mục dịch vụ Identity.

source: Alternative term for the Image service :term:`image registry`.
de: Alternativer Ausdruck für den Abbilddienst :term:`Abbildregistrierung`.
ru: Альтернативный термин для службы образов :term:`реестр образов`.

source: Alternative term for the Image service registry.
ru: Альтернативный термин для реестра службы образов (Image).
vi_vn: Thuật ngữ thay thế cho Image service registry.

source: Alternatively, users can set ``id`` to a URL:
de: Alternativ können Benutzer ``id`` zu einer URL setzen:
ru: Также можно задать для параметра ``id`` значение в виде URL-адреса:

source: Alternatively, you can create the ``PROJECT-openrc.sh`` file from scratch, if you cannot download the file from the dashboard.
de: Alternativ können Sie die ``PROJECT-openrc.sh`` Datei von Grund auf neu erstellen, wenn Sie die Datei nicht aus dem Dashboard herunterladen können.
ru: Кроме того, если файл ``ПРОЕКТ-openrc.sh`` невозможно загрузить с панели управления, его можно создать.

source: An API endpoint used for both service-to-service communication and end-user interactions.
ru: Точка входа API, которая используется для соединений между службами и взаимодействия конечных пользователей.
vi_vn: Một API endpoint được sử dụng cho cả giao tiếp giữa các dịch vụ và các tương tác với người dùng cuối.

source: An API on a separate endpoint for attaching, detaching, and creating block storage for compute VMs.
de: Eine API auf einem separaten Endpunkt für das Anhängen, Ablösen und Erstellen von Blockspeicher für Compute-VMs.
ru: API отдельной конечной точки для прикрепления, отсоединения и создания блочных хранилищ для вычислительных виртуальных машин.
vi_vn: Một API nằm trên một endpoint riêng biệt dùng để gắn, tháo rời và khởi tạo block storage cho các máy ảo tính toán.

source: An API server (``aodh-api``)
de: Ein API Server (``aodh-api``)
ru: Сервер API (``aodh-api``)

source: An API server (``ceilometer-api``)
de: Ein API Server (``ceilometer-api``)
ru: Сервер API (``ceilometer-api``)

source: An API that is accessible to projects.
ru: Интерфейс API, к которому имеют доступ проекты

source: An AWS Query API that is compatible with AWS CloudFormation. It processes API requests by sending them to the ``heat-engine`` over RPC.
de: Eine AWS-Abfrage-API, die mit AWS CloudFormation kompatibel ist. Sie verarbeitet API-Anfragen, indem sie sie an `` heat-engine`` über RPC sendet.
ru: Интерфейс AWS Query API совместим с AWS CloudFormation. Он обрабатывает запросы API, отправляя их в ``heat-engine`` с помощью RPC.

source: An Amazon EBS storage volume that contains a bootable VM image, currently unsupported in OpenStack.
de: Ein Amazon EBS Speicherdatenträger, der ein bootfähiges VM Abbild enthät, derzeit in OpenStack nicht unterstützt.
ru: Том устройства хранения Amazon EBS, в котором содержится загрузочный образ ВМ. В настоящий момент не поддерживается в OpenStack.
vi_vn: Một ổ lưu trữ Amazon EBS chứa một image máy ảo có thể khởi động đươc, hiện không được hỗ trợ trong OpenStack.

source: An Amazon EC2 concept of an isolated area that is used for fault tolerance. Do not confuse with an OpenStack Compute zone or cell.
de: Ein Amazon EC2 Konzept von isoliertem Gebiet, welches für Fehlertoleranz benutzt wird. Nicht zu verwechseln mit einer OpenStack Compute Zone oder Zelle.
ru: Концепция Amazon EC2 для изолированной области, которая используется, чтобы повысить отказоустойчивость. Не путать с зоной или ячейкой службы вычислительных ресурсов OpenStack.
vi_vn: Một khái niệm của Amazon EC2 về một vùng cô lập được sử dụng để chống chịu lỗi. Tránh nhầm lẫn với zone hoặc cell của OpenStack Compute.

source: An HTTP and reverse proxy server, a mail proxy server, and a generic TCP/UDP proxy server.
ru: HTTP- и обратный прокси-сервер, почтовый прокси-сервер и универсальный прокси-сервер TCP/UDP.

source: An IP address that a project can associate with a VM so that the instance has the same public IP address each time that it boots. You create a pool of floating IP addresses and assign them to instances as they are launched to maintain a consistent IP address for maintaining DNS assignment.
de: Eine IP-Adresse, die ein Projekt mit einer VM verknüpfen kann, so dass die Instanz bei jedem Start die gleiche öffentliche IP-Adresse hat. Sie erstellen einen Pool von FLoating- IP-Adressen und ordnen sie den Instanzen zu, wenn sie gestartet werden, um eine konsistente IP-Adresse für die Beibehaltung der DNS-Zuweisung zu pflegen.
ru: IP-адрес, назначаемый проектом виртуальной машине таким образом, чтобы инстанс получал один и тот же общедоступный IP-адрес при каждой загрузке. Можно создать пул плавающих IP-адресов и назначать их инстансам при запуске, чтобы поддерживать постоянство IP-адреса и сохранять назначенные DNS-имена.
vi_vn: Một địa chỉ IP mà một project có thể liên kết với một máy ảo sao cho instance đó có cùng một địa chỉ IP public mỗi lần nó khởi động. Bạn có thể tạo ra một tập hợp các địa chỉ IP động và gán chúng cho các instance khi chúng chạy để duy trì địa chỉ IP thống nhất nhằm mục đích duy trì DNS.

source: An IP address that can be assigned to a VM instance within the shared IP group. Public IP addresses can be shared across multiple servers for use in various high-availability scenarios. When an IP address is shared to another server, the cloud network restrictions are modified to enable each server to listen to and respond on that IP address. You can optionally specify that the target server network configuration be modified. Shared IP addresses can be used with many standard heartbeat facilities, such as keepalive, that monitor for failure and manage IP failover.
ru: IP-адрес, который может быть назначен инстансу ВМ в общей IP-группе. Общедоступные IP-адреса могут быть распределены по нескольким серверам для различных решений с высокой доступностью. Когда IP-адрес является общим для нескольких серверов, то в измененной конфигурации облачной сети каждый из этих серверов может прослушивать и отвечать на запросы по этому IP-адресу. Можно дополнительно указать, что конфигурация сети целевого сервера была изменена. Общие IP-адреса могут использоваться для многих стандартных функций пульса, например, проверки активности сети (keepalive), при которой отслеживается возникновение ошибок и выполняется переключение IP-адресов.
vi_vn: Một địa chỉ IP có thể được gán cho một máy ảo nằm trong một nhóm IP được chia sẻ. Các địa chỉ IP public có thể được chia sẻ trên nhiều server để sử dụng trong nhiều trường hợp yêu cầu tính sẵn sàng cao. Khi một địa chỉ IP được chia sẻ với một server khác, các giới hạn hệ thống mạng đám mây được chỉnh sửa để cho phép mỗi server nghe và trả lời trên địa chỉ IP đó. Các địa chỉ IP được chia sẻ có thể được sử dụng với nhiều tiện ích heartbeat tiêu chuẩn như keepalive - một dịch vụ dùng để theo dõi các hư hỏng và quản lý IP failover.

source: An IP address that is accessible to end-users.
ru: IP-адрес, доступный конечным пользователям.
vi_vn: Một địa chỉ IP mà người dùng cuối có thể truy cập được.

source: An IP address that is associated with the same instance each time that instance boots, is generally not accessible to end users or the public Internet, and is used for management of the instance.
de: Eine IP-Adresse, die mit der gleichen Instanz verbunden ist, jedes Mal, wenn die Instanz bootet, ist im Allgemeinen nicht für Endbenutzer oder das öffentliche Internet zugänglich und wird für die Verwaltung der Instanz verwendet.
ru: IP-адрес, связываемый с одним и тем же инстансом при каждой загрузке, как правило, недоступный для конечных пользователей Интернета и используемый для управления инстансом.
vi_vn: Một địa chỉ IP duy nhất được gán cho một máy ảo mỗi lần máy ảo đó được khởi động. Thường thì các người dùng cuối hoặc mạng Internet công cộng không thể truy cập được vào địa chỉ này và nó được dùng để quản lý một máy ảo.

source: An IP address used for management and administration, not available to the public Internet.
ru: Частный IP-адрес используется для управления и администрирования, недоступен в обычном Интернете.
vi_vn: Địa chỉ IP được sử dụng cho mục đích quản lý và quản trị, khôn

source: An IP address, typically assigned to a router, that passes network traffic between different networks.
de: Eine IP-Adresse, üblicherweise einem Router zugewiesen, über die Netzwerkverkehr an andere Netzwerke geleitet wird.
ru: IP-адрес, как правило, назначаемый маршрутизатору, который передает сетевой трафик другим сетям.
vi_vn: Một địa chỉ IP thường được gán cho một router, dùng để truyền lưu lượng mạng giữa các hệ thống mạng khác nhau.

source: An Identity API v3 entity. Represents a collection of projects, groups and users that defines administrative boundaries for managing OpenStack Identity entities. On the Internet, separates a website from other sites. Often, the domain name has two or more parts that are separated by dots. For example, yahoo.com, usa.gov, harvard.edu, or mail.yahoo.com. Also, a domain is an entity or container of all DNS-related information containing one or more records.
de: Eine Identity API v3 Entity. Stellt eine Sammlung von Projekten, Gruppen und Benutzern dar, die administrative Grenzen für die Verwaltung von OpenStack Identity Entities definieren. Im Internet trennt man eine Website von anderen Seiten. Oft hat der Domain-Name zwei oder mehr Teile, die durch Punkte getrennt sind. Zum Beispiel, yahoo.com, usa.gov, harvard.edu oder mail.yahoo.com. Außerdem ist eine Domäne eine Entität oder ein Container aller DNS-bezogenen Informationen, die einen oder mehrere Datensätze enthalten.
ru: В API службы идентификации (Identity) версии 3 домен — метод объединения проектов, групп и пользователей, который задает административные границы для управления сущностями службы идентификации OpenStack. В Интернете домены служат для разделения сайтов. Доменное имя часто состоит из двух или трех частей, разделенных точками. Например, yahoo.com, usa.gov, harvard.edu, or mail.yahoo.com. Также домен это сущность или контейнер всей информации, связанной с DNS, где содержится одна или более записей.

source: An Identity service API access token that is associated with a specific project.
ru: Токен доступа API службы идентификации, связанный с определенным проектом.

source: An Identity service API endpoint that is associated with one or more projects.
ru: Точка входа службы идентификации, которая связана с одним или более проектами.

source: An Identity service component that manages and validates tokens after a user or project has been authenticated.
ru: Компонент службы идентификации, который управляет и проверяет токены после аутентификации пользователя или проекта.

source: An Identity service feature that enables services, such as Compute, to automatically register with the catalog.
ru: Функция службы идентификации, которая позволяет службам (например, службе вычислительных ресурсов), автоматически регистрироваться в каталоге.
vi_vn: Một tính năng của dịch vụ Identity cho phép các dịch vụ như là Compute, tự động đăng ký với danh mục.

source: An Identity service that lists API endpoints that are available to a user after authentication with the Identity service.
de: Ein Identitätsdienst, der API-Endpunkte auflistet, die einem Benutzer nach der Authentifizierung mit dem Identitätsdienst zur Verfügung stehen.
ru: Служба идентификации выводит список конечных точек API, доступных пользователю после аутентификации с помощью службы идентификации.
vi_vn: Một dịch vụ Identity có nhiệm vụ liệt kê ra danh sách các API endpoint hiện hành đối với người dùng sau khi xác thực với dịch vụ Identity.

source: An Identity service token that is not associated with a specific project and is exchanged for a scoped token.
de: Ein Token des Identitätsdienstes, das nicht mit einem speziellen Projekt verbunden ist und gegen ein scoped Token ausgetauscht wird.
ru: Токен службы идентификации (Identity), который не связан с определенным проектом и заменяется на заданный токен.

source: An Identity v3 API entity. Represents a collection of users that is owned by a specific domain.
de: Eine Identity v3 API Entität. Stellt eine Sammlung von Benutzern dar, die einer bestimmten Domäne angehört.
ru: Сущность API службы идентификации версия 3. Относится к набору пользователей, которые владеют опеределенным доменом.

source: An Image service VM image that is available to all projects.
ru: Образ ВМ службы Image, который доступен всем проектам.

source: An Image service VM image that is only available to specified projects.
ru: Образ виртуальной машины в службе образов, который доступен только для выбранных проектов.

source: An Image service container format that indicates that no container exists for the VM image.
de: Ein Abbilddienst-Containerformat, welches anzeigt, daß noch kein Container für ein VM-Abbild existiert.
ru: Формат контейнеров службы образов, указывающий на отсутствие контейнеров для образа виртуальной машины.
vi_vn: Một định dạng container của dịch vụ Image có tác dụng chỉ ra rằng không có container nào tồn tại cho image máy ảo.

source: An Image service that provides VM image metadata information to clients.
ru: Служба образов, которая предоставляет клиентам метаданные образа ВМ.
vi_vn: Một dịch vụ Image cung cấp thông tin metadata của image máy ảo đến các client.

source: An Internet Protocol (IP) address configured on the load balancer for use by clients connecting to a service that is load balanced. Incoming connections are distributed to back-end nodes based on the configuration of the load balancer.
de: Eine Internetprotokoll-Adresse (IP-Adresse), die auf dem Load-Balancer konfiguriert ist, für die Verwendung von Clients, die mit einem Dienst verbunden sind, der loadbalanct ist. Eingehende Verbindungen werden auf der Grundlage der Konfiguration des Load Balancers an Back-End-Knoten verteilt.
ru: IP-адрес, настроенный на балансировщике нагрузки для использования клиентами, подключающимися к службе с функцией балансировки нагрузки. Входящие подключения распределяются по внутренним узлам на основе конфигурации балансировщика нагрузки.
vi_vn: Một địa chỉ IP ảo được cấu hình trên thiết bị cân bằng tải để ác client có thể kết nối tới một server được cân bằng tải. Các kết nối đến được phân bố tới các node back-end dựa theo cấu hình của thiết bị cân bằng tải.

source: An L2 network segment within Networking.
de: Ein L2-Netzwerksegment im Networking
ru: Сетевой сегмент уровня L2 в службе управления сетями.
vi_vn: Một phân khúc mạng lớp 2 với Networking

source: An Object Storage component that collects meters.
ru: Компонент объектного хранилища, который собирает метрики.
vi_vn: Một thành phần của Object Storage có tác dụng thu thập các meters

source: An Object Storage component that copies an object to remote partitions for fault tolerance.
ru: Компонент объектного хранилища, который копирует объект в удаленные разделы в целях обеспечения отказоустойчивости.
vi_vn: Một thành phần của Object Storage có nhiệm vụ sao chép một object đến các phân vùng từ xa để giúp chống chịu lỗi.

source: An Object Storage component that copies changes in the account, container, and object databases to other nodes.
de: Eine Object Storage Komponente, die Änderungen in den Konto-, Container- und Objektdatenbanken auf andere Knoten kopiert.
ru: Компонент хранилища объектов, который копирует изменения в базах данных учетных записей, контейнеров и объектов на другие узлы.
vi_vn: Một thành phần của Object Storage có nhiệm vụ sao chép các thay đổi đối với cơ sở dữ liệu tài khoản, container và object đến các node khác.

source: An Object Storage component that is responsible for managing objects.
ru: Компонент объектного хранилища, который выполняет функции управления объектами.
vi_vn: Một thành phần của Object Storage chịu trách nhiệm quản lý các object.

source: An Object Storage component that provides account services such as list, create, modify, and audit. Do not confuse with OpenStack Identity service, OpenLDAP, or similar user-account services.
de: Eine Objektspeicherungskomponente, die Kontodienste wie Liste, Erstellen, Ändern und Überprüfen bereitstellt. Verwechseln Sie nicht mit OpenStack Identity Service, OpenLDAP oder ähnlichen Benutzerkonten.
ru: Компонент хранилища объектов, предоставляющий службы учетных записей, например перечисление, создание, изменение и аудит. Не путать со службой идентификации OpenStack, OpenLDAP или аналогичными службами для учетных записей пользователя.
vi_vn: Một thành phần của Object Storage có nhiệm vụ cung cấp các dịch vụ tài khoản như liệt kê, khởi tạo, chỉnh sửa và kiểm tra. Tránh nhầm lẫn với dịch vụ Identity của OpenStack, OpenLDAP hoặc các dịch vụ tài khoản tương tự khác.

source: An Object Storage large object that has been broken up into pieces. The re-assembled object is called a concatenated object.
ru: Большой объект объектного хранилища, который был разделен на части. Заново собранный объект называется объединенным объектом.
vi_vn: Một object lớn cuar Object Storage được chia nhỏ ra làm nhiều phần. Object này khi được ráp lại được gọi là object được ghép nối.

source: An Object Storage middleware component that enables creation of URLs for temporary object access.
ru: Компонент промежуточного ПО объектного хранилища, который позволяет создавать URL-адреса для временного доступа к объектам.
vi_vn: Một thành phần middleware của Object Storage cho phéo khởi tạo các URL để truy cập tạm thời vào object.

source: An Object Storage node that provides authorization services.
de: Ein Objektspeicherungsknoten, der Berechtigungsdienste bereitstellt.
ru: Узел хранилища объектов, предоставляющий услуги авторизации.
vi_vn: Một node của Object Storage cung cấp các dịch vụ ủy quyền.

source: An Object Storage node that provides container services, account services, and object services; controls the account databases, container databases, and object storage.
ru: Узел объектного хранилища, который предоставляет службы контейнеров, службы учетных записей и службы управления объектами. Управляет базами данных учетных записей, контейнеров и объектов.
vi_vn: Một node của Object Storage, có nhiệm vụ cung cấp các dịch vụ container, tài khoản và object; kiểm soát các cơ sở dữ liệu của container, tài khoản và object.

source: An Object Storage server that manages containers.
de: Ein Objektspeicherserver, der Container verwaltet.
ru: Сервер хранилища объектов, который управляет контейнерами.
vi_vn: Một server của Object Storage có nhiệm vụ quản lý các container.

source: An Object Storage worker that scans for and deletes account databases and that the account server has marked for deletion.
de: Ein Objektspeicher-Worker, der Kontodatenbanken scannt und löscht sowie den Kontoserver zum Löschen markiert hat.
ru: Рабочий процесс хранилища объектов, сканирующий и удаляющий базы данных учетных записей и элементы, отмеченные сервером учетных записей для удаления.
vi_vn: Một phần tử của Object Storage có chức năng tìm và xóa cơ sở dữ liệu của những tài khoản đã được tài khoản server đánh dấu cần xóa.

source: An OpenStack grouped release of projects that came out in the spring of 2011. It included Compute (nova), Object Storage (swift), and the Image service (glance). Cactus is a city in Texas, US and is the code name for the third release of OpenStack. When OpenStack releases went from three to six months long, the code name of the release changed to match a geography nearest the previous summit.
de: Eine OpenStack-gruppierte Freigabe von Projekten, die im Frühjahr 2011 erschienen sind. Dazu gehörten Compute (nova), Object Storage (swift) und der Abbilddienst (swift). Cactus ist eine Stadt in Texas, USA und ist der Codename für das dritte Release von OpenStack. Als sich der OpenStack-Release-Zyklus von drei auf sechs Monate änderte, änderte sich der Codename des Releases zu einer Geographie, die dem vorherigen Gipfel am nächsten liegt.
ru: Групповой релиз проектов OpenStack, выпущенный весной 2011 г. Включает в себя службу вычислительных ресурсов (Nova), объектное хранилище (Swift) и службу образов (Glance). Кактус — город в Техасе, США — является кодовым именем третьего релиза OpenStack. Когда релизы OpenStack появлялись каждые три–шесть месяцев, кодовые имена выбирались согласно географическим объектам, ближайшим к месту проведения предыдущих саммитов.
