Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: Stores and retrieves arbitrary unstructured data objects via a RESTful, HTTP based API. It is highly fault tolerant with its data replication and scale-out architecture. Its implementation is not like a file server with mountable directories. In this case, it writes objects and files to multiple drives, ensuring the data is replicated across a server cluster.
de: Speichert und ruft beliebige unstrukturierte Datenobjekte über eine RESTful, HTTP-basierte API ab. Es ist sehr fehlertolerant mit seiner Datenreplikation und Scale-out-Architektur. Seine Implementierung ist nicht wie ein Dateiserver mit einhängbaren Verzeichnissen. In diesem Fall schreibt er Objekte und Dateien auf mehrere Laufwerke, so dass die Daten über einen Servercluster repliziert werden.
ru: Хранит и получает произвольные неструктурированные объекты данных через RESTful API, реализованный на базе протокола HTTP. Обеспечивает хранение с высокой отказоустойчивостью с помощью репликации данных и расширяемой архитектуры. Его реализация не похожа на файловый сервер с монтируемыми каталогами. В этом случае объекты и файлы записываются на разные диски, обеспечивая репликацию данных в кластере, одна из машин которого выполняет функции сервера.

source: Stores and retrieves virtual machine disk images. OpenStack Compute makes use of this during instance provisioning.
de: Speichert und empfängt Virtuelle Maschinen Abbilder. OpenStack Compute verwendet dies bei der Bereitstellung von Instanzen.
ru: Хранит и получает образы дисков виртуальных машин. Служба вычислительных ресурсов OpenStack использует эти образы во время развертывания экземпляра.

source: Stores image metadata and you can choose your database depending on your preference. Most deployments use MySQL or SQLite.
de: Speichert Abbild-Metadaten und Sie können eine Datenbank nach Ihren Vorstellungen auswählen. Die meisten Installationen verwenden MySQL oder SQLite.
ru: Сохраняет метаданные образов. Можно выбрать базу данных согласно своим предпочтениям. Большинство развертываний используют MySQL или SQLite.

source: Stores most build-time and run-time states for a cloud infrastructure, including:
de: Speichert die meisten Build-Time- und Laufzeitzustände für eine Cloud-Infrastruktur, einschließlich:
ru: Хранит большинство состояний построения и выполнения, включая следующее:

source: Stores, processes, and retrieves metadata about images. Metadata includes items such as size and type.
de: Speichert, verarbeitet und ruft Metadaten zu Abbildern ab. Metadaten beinhalten Werte wie z.B. Größe und Typ.
ru: Сохраняет, обрабатывает и извлекает метаданные об образах. К метаданным относятся сведения о размере и типе образа.

source: String of text known only by the user; used along with an access key to make requests to the Compute API.
ru: Текстовая строка, известная только пользователю. Используется только совместно с ключом доступа для создания запросов к API службы вычислительных ресурсов.
vi_vn: Một chuỗi ký tự mà chỉ người dùng mới biết; được sử dụng cùng với một key truy cập để gửi yêu cầu đén Compute API.

source: Subdivides physical CPUs. Instances can then use those divisions.
de: Unterteilt physikalische CPUs. Instanzen können diese Divisionen dann nutzen.
ru: Создаются в результате разделения ресурсов физических ЦП. Экземпляры могут затем использовать эти подразделения.
vi_vn: Những bộ vi xử lí CPU có thể chia thành nhiều phần. Các máy ảo sau đó sử dụng những phần bị chia ra đó.

source: Support for different Hadoop distributions:
de: Unterstützung für verschiedene Hadoop-Distributionen:
ru: Поддержка различных дистрибутивов Hadoop:

source: Supported model values
de: Unterstützte Modellwerte
ru: Поддерживаемые значения модели

source: Supports interaction with VMware products in Compute.
de: Unterstützt die Interaktion mit VMware Produkten in Compute.
ru: Поддерживает взаимодействие с продуктами VMware в службе вычислительных ресурсов.
vi_vn: Hỗ trợ tương tác với các sản phẩm của VMware trên Compute.

source: Takes a virtual machine instance request from the queue and determines on which compute server host it runs.
de: Nimmt eine Instanzanforderung einer virtuellen Maschine aus der Warteschlange und legt fest, auf welchem Compute-Knoten diese ausgeführt wird.
ru: Получает запрос на экземпляр виртуальной машины из очереди и определяет, на каком хосте вычислительного сервера его запускать.

source: Telemetry Alarming service
de: Telemetry Alarming Dienst
ru: Служба оповещений телеметрии

source: Telemetry Data Collection service
de: Telemetrie Datensammeldienst
ru: Служба сбора данных телеметрии

source: Telemetry service
de: Telemetrydienst (ceilometer)
ru: Служба телеметрии

source: Telemetry service (telemetry)
ru: Служба телеметрии (Telemetry)

source: Telemetry service overview
de: Telemetriedienst Überblick
ru: Обзор службы телеметрии

source: Telemetry v3
ru: Служба телеметрии v3

source: Tenant API
ru: API тенанта

source: Term for an :term:`Object Storage<Object Storage service (swift)>` process that runs for a long time. Can indicate a hung process.
ru: Термин для процесса :term:`объектного хранилища<Object Storage service (swift)>`, который выполняется в течение длительного времени. Может указывать на процесс, который "завис".

source: Term used in the OSI network architecture for the data link layer. The data link layer is responsible for media access control, flow control and detecting and possibly correcting errors that may occur in the physical layer.
de: Begriff, der in der OSI-Netzwerkarchitektur für die Datenverbindungsschicht verwendet wird. Die Datenverbindungsschicht ist für die Medienzugriffskontrolle, die Flusskontrolle und die Erkennung und gegebenenfalls Korrektur von Fehlern, die in der physikalischen Schicht auftreten können, verantwortlich.
ru: Термин, используемый в сетевой архитектуре OSI для канального уровня. Этот уровень отвечает за управление доступом к медиафайлам, управление потоками, определение и (по возможности) устранение ошибок физического слоя.
vi_vn: Thuật ngữ được sử dụng trong mô hình mạng OSI cho tầng liên kết dữ liệu. Tầng liên kết dữ liệu chịu trách nhiệm trong việc kiểm soát truy cập phương tiện truyền thông, kiểm soát luồng, phát hiện và có khả năng sửa chữa các lỗi có thể xảy ra trong tầng vật lý.

source: Term used in the OSI network architecture for the network layer. The network layer is responsible for packet forwarding including routing from one node to another.
de: Begriff, der in der OSI-Netzwerkarchitektur für die Netzwerkschicht verwendet wird. Die Netzwerkschicht ist für die Paketweiterleitung einschließlich des Routings von einem Knoten zum anderen verantwortlich.
ru: Термин, используемый в сетевой архитектуре OSI для сетевого уровня. Этот уровень отвечает за переадресацию пакетов, в том числе за маршрутизацию с одного узла на другой.
vi_vn: Thuật ngữ sử dụng trong mô hình mạng OSI cho tầng mạng. Tầng mạng chịu trách nhiệm chuyển các gói tin bao gồm cả việc định tuyến giữa các node.

source: The API used to access the OpenStack Identity service provided through keystone.
de: Die API wurde für den Zugriff auf den OpenStack Identitätsdienst verwendet, der über Keystone bereitgestellt wird.
ru: API-интерфейс, который используется для доступа к службе идентификации OpenStack (Keystone).
vi_vn: API được cung cấp thông qua keystone, sử dụng để truy cập dich vụ Identity của OpenStack.

source: The Amazon commercial block storage product.
de: Kommerzielles Blockspeicherprodukt von Amazon.
ru: Коммерческий продукт компании Amazon для использования виртуальных блочных устройств.
vi_vn: Sản phẩm block storage thương mại của Amazon.

source: The Amazon commercial compute product, similar to Compute.
de: Das kommerzielle Compute-Produkt von Amazon, ähnlich dem Compute von OpenStack.
ru: Коммерческий продукт Amazon — служба по предоставлению вычислительных ресурсов, подобная службе Compute.
vi_vn: Sản phẩm tính toán thương mại của Amazon, tương tự như Compute.

source: The Apache Software Foundation supports the Apache community of open-source software projects. These projects provide software products for the public good.
de: Die Apache Software Foundation unterstützt die Apache-Gemeinschaft von Opensource-Software-Projekten. Diese Projekte stellen Produkte für die Public Cloud zur Verfügung.
ru: Организация Apache Software Foundation поддерживает сообщество Apache по открытым проектам в сфере программного обеспечения. Эти проекты предоставляют программные продукты на благо общества.
vi_vn: Nhà sáng lập Apache hỗ trợ các dự án mã nguồn mở của cộng đồng Apache. Những dự án này cung cấp các phần mềm phục vụ cho lợi ích của cộng đồng.

source: The Block Storage driver for the SolidFire iSCSI storage appliance.
ru: Драйвер блочного хранилища для iSCSI-устройства хранения SolidFire.
vi_vn: Block Storage driver cho thiết bị lưu trữ iSCSI SolidFire .

source: The Block Storage service consists of the following components:
de: Der Block Storage Dienst besteht aus den folgenden Komponenten:
ru: Служба хранилища блоков состоит из следующих компонентов.

source: The Border Gateway Protocol is a dynamic routing protocol that connects autonomous systems. Considered the backbone of the Internet, this protocol connects disparate networks to form a larger network.
de: Das Border Gateway Protocol ist ein dynamisches Routing-Protokoll, das autonome Systeme miteinander verbindet. Als das Rückgrat des Internets, verbindet dieses Protokoll disparate Netzwerke zu einem größeren Netzwerk.
ru: Протокол BGP — протокол динамической маршрутизации для подключения автономных систем. Считается основным протоколом маршрутизации в Интернете. Используется для подключения отдельных подсетей к большой сети.

source: The Ceph storage daemon.
ru: Демон хранилища Ceph.
vi_vn: daemon lưu trữ của Ceph.

source: The Compute RabbitMQ message exchange that remains active when the server restarts.
de: Der Compute RabbitMQ Nachrichtenaustausch, der beim Neustart des Servers aktiv bleibt.
ru: Обмен сообщениями RabbitMQ службы вычислительных ресурсов, который остается активным при перезагрузке сервера.
vi_vn: Trao đổi tin của Compute RabbitMQ mà vẫn hoạt động kể cả khi server khởi động lại

source: The Compute VM scheduling algorithm that attempts to start a new VM on the host with the least amount of load.
ru: Алгоритм планирования в службе вычислительных ресурсов, при котором для запуска новой ВМ выбирается хост с наименьшей нагрузкой.
vi_vn: Thuật toán lên lịch trình của máy ảo Compute có nhiệm vụ thử khởi động một máy ảo mới trên một máy vậy lý với số lần tải ít nhất.

source: The Compute component that chooses suitable hosts on which to start VM instances.
de: Die Compute Komponente, die einen passenden Host zum starten von VM Instanzen auswählt.
ru: Компонент службы вычислительных ресурсов (Compute), который выбирает хосты, подходящие для выполнения экземпляров ВМ.
vi_vn: Thành phần của Compute có nhiệm vụ chọn các máy chủ thích hợp để trên đó khởi tạo các máy ảo .

source: The Compute component that contains a list of the current capabilities of each host within the cell and routes requests as appropriate.
de: Die Computerkomponente, die eine Liste der aktuellen Fähigkeiten eines jeden Hosts innerhalb der Zelle enthält, und leitet die Anforderungen entsprechend ab.
ru: Компонент службы вычислительных ресурсов, который содержит список текущих возможностей каждого хоста в ячейке, а также отвечает за правильную маршрутизацию запросов.
vi_vn: Thành phần của Compute chứa danh sách các khả năng hiện thời của các máy vật lý nằm trong một cell và điều hướng các yêu cầu sao cho phù hợp.

source: The Compute component that gives IP addresses to authorized nodes and assumes DHCP, DNS, and routing configuration and services are provided by something else.
de: Die Compute-Komponente, die IP-Adressen an autorisierte Knoten angibt und DHCP-, DNS- und Routing-Konfiguration und Dienste übernimmt, wird von etwas anderem bereitgestellt.
ru: Компонент службы вычислительных ресурсов (Compute), который назначает IP-адреса авторизованным узлам. Предполагается, что службы и настройки DHCP, DNS и маршрутизации уже предоставлены.
vi_vn: Thành phần của Compute đảm nhận việc cấp địa chỉ IP cho các node đã được xác thực và giả định rằng DHCP, DNS, các cấu hình và dịch vụ định tuyến được cung cấp bởi một thành phần khác.

source: The Compute component that manages various network components, such as firewall rules, IP address allocation, and so on.
ru: Компонент службы вычислительных ресурсов, который управляет различными компонентами сети, например правилами брандмауэра, распределением IP-адресов и т.д.
vi_vn: Thành phần của Compute phụ trách các thành phần hệ thống mạng như các quy tắc của tường lửa, phân bổ địa chỉ IP và hơn thế nữa.

source: The Compute component that provides dnsmasq (DHCP, DNS, BOOTP, TFTP) and radvd (routing) services.
de: Eine Komponente von Compute, die dnsmasq (DHCP, DNS, BOOTP, TFTP) und radvd (routing) Dienste zur Verfügung stellt
ru: Компонент службы вычислительных ресурсов (Compute), который предоставляет службы dnsmasq (DHCP, DNS, BOOTP, TFTP) и radvd (маршрутизация).
vi_vn: Thành phần của Compute cung cấp các dịch vụ dnsmasq (DHCP, DNS, BOOTP, TFTP) và radvd (routing).

source: The Compute component that runs on each compute node and manages the VM instance lifecycle, including run, reboot, terminate, attach/detach volumes, and so on. Provided by the nova-compute daemon.
de: Die Compute Komponente, die auf jedem Compute-Knoten läuft und die VM Instanzen währen ihres Lebenszyklus verwaltet, einschließlich laufen lassen, neu starten, beenden, hinzufügen oder wegnehmen von Datenträgern und so weiter. Bereitgestellt durch den nova-compute Dämon.
ru: Компонент службы вычислительных ресурсов, который выполняется на каждом вычислительном узле и управляет жизненным циклом экземпляра ВМ, включая выполнение, перезагрузку, удаление, подключение или отключение томов и др. Предоставляется демоном nova-compute.

source: The Compute direct exchanges, fanout exchanges, and topic exchanges use this key to determine how to process a message; processing varies depending on exchange type.
ru: В прямых обменах службы Compute, обменах разветлений и обменах тем этот ключ используется, чтобы определить метод обработки сообщения. Вариант обработки зависит от типа обмена.
vi_vn: Các Compute trực tiếp trao đổi, trao đổi fanout, và trao đổi chủ đề sử dụng từ khóa để xác định làm thế nào để xử lý tin nhắn; xử lý khác nhau tùy thuộc vào loại hình trao đổi.

source: The Compute scheduling method that attempts to fill a host with VMs rather than starting new VMs on a variety of hosts.
de: Die Compute-Scheduling-Methode, die versucht, einen Host mit VMs zu füllen, anstatt neue VMs auf einer Vielzahl von Hosts zu starten.
ru: Используемый Compute метод выбора одного хоста для размещения ВМ вплоть его заполнения (в отличие от запуска новых виртуальных машин на разных хостах).
vi_vn: Phương pháp lên lịch của Compute nhằm mục đích thử làm đầy một máy vật lý bằng các máy ảo thay vì khởi đọng các máy ảo mới trên nhiều máy vật lý.

source: The Compute service can send alerts through its notification system, which includes a facility to create custom notification drivers. Alerts can be sent to and displayed on the horizon dashboard.
ru: Служба вычислительных ресурсов может отправлять оповещения с помощью собственной системы уведомлений, в которую входят средства для создания пользовательских драйверов уведомлений. Оповещения могут отправляться на панель управления Horizon и отображаться на ней.

source: The Compute service provides accounting information through the event notification and system usage data facilities.
de: Der Compute-Service liefert Informationen über die Ereignisbenachrichtigung und die Systemnutzungsdaten.
ru: Служба вычислительных ресурсов предоставляет информацию об учете с помощью уведомлений о событиях и средств, отслеживающих использование системы.
vi_vn: Dịch vụ của Compute có tác dụng cung cấp thông tin tính toán thông qua các thông báo sự kiện và mức độ sử dụng hệ thống dữ liệu.

source: The Compute setting that enables or disables RAM overcommitment.
ru: Параметр службы вычислительных ресурсов, который включает или отключает чрезмерное выделение ОЗУ (RAM overcommitment).
vi_vn: Tùy chỉnh của Compute có tác dụng bạt tắt tính năng RAM overcommitment.

source: The Data processing service for OpenStack (sahara) aims to provide users with a simple means to provision data processing (Hadoop, Spark) clusters by specifying several parameters like Hadoop version, cluster topology, node hardware details and a few more. After a user fills in all the parameters, the Data processing service deploys the cluster in a few minutes. Sahara also provides a means to scale already provisioned clusters by adding or removing worker nodes on demand.
de: Der Datenverarbeitungsdienst für OpenStack (Sahara) zielt darauf ab, Benutzern mit einfachen Mitteln die Bereitstellung von Datenverarbeitungs-Clustern (Hadoop, Spark) zu ermöglichen, indem sie mehrere Parameter wie die Hadoop-Version, die Cluster-Topologie, die Knoten-Hardware-Details und einige mehr angeben. Wenn ein Benutzer alle Parameter ausfüllt, entfaltet der Datenverarbeitungsdienst den Cluster in wenigen Minuten. Sahara bietet auch Mittel zur Skalierung bereits vorhandener Cluster durch Hinzufügen oder Entfernen von Worker-Knoten auf Anfrage.
ru: С помощью службы обработки данных для OpenStack (Sahara) пользователи могут легко подготовить кластеры обработки данных (Hadoop, Spark), указав несколько параметров, например версию Hadoop, топологию кластеров, сведения об оборудовании узла и т. п. После того как пользователь укажет все параметры, служба обработки данных развернет кластер за считаные минуты. Sahara также помогает масштабировать уже подготовленные кластеры, добавляя или удаляя рабочие узлы по необходимости.

source: The Database service includes the following components:
de: Der Datenbankdienst umfasst die folgenden Komponenten:
ru: Служба баз данных включает следующие компоненты.

source: The Database service provides resource isolation at high performance levels and automates complex administrative tasks such as deployment, configuration, patching, backups, restores, and monitoring.
de: Der Datenbankdienst bietet die Ressourcenisolierung auf hohem Leistungsniveau und automatisiert komplexe administrative Aufgaben wie Bereitstellung, Konfiguration, Patching, Sicherungen, Wiederherstellung und Überwachung.
ru: Служба баз данных эффективно изолирует ресурсы и автоматизирует сложные задачи администрирования, например развертывание, настройку, внесение исправлений, резервное копирование, восстановление и мониторинг.

source: The Database service provides scalable and reliable cloud provisioning functionality for both relational and non-relational database engines. Users can quickly and easily use database features without the burden of handling complex administrative tasks. Cloud users and database administrators can provision and manage multiple database instances as needed.
de: Der Datenbankdienst bietet skalierbare und zuverlässige Cloud-Provisioning-Funktionen für relationale und nicht relationale Datenbank-Maschinen. Benutzer können schnell und einfach Datenbank-Funktionen ohne die Belastung von komplexen administrativen Aufgaben verwenden. Cloud-Benutzer und Datenbankadministratoren können bei Bedarf mehrere Datenbankinstanzen bereitstellen und verwalten.
ru: Служба баз данных предоставляет масштабируемые и надежные облачные службы для реляционных и нереляционных ядер баз данных. Пользователи могут быстро и удобно использовать функции баз данных, не погружаясь в сложные административные задачи. Если необходимо, пользователи облаков и администраторы баз данных могут подготавливать несколько экземпляров баз данных и управлять ими.

source: The Identity component that provides high-level authorization services.
de: Die Identitätskomponente, die hochrangige Berechtigungsdienste bereitstellt.
ru: Компонент идентификации, предоставляющий услуги авторизации высокого уровня.
vi_vn: Thành phần của dịch vụ Identity có vai trò cung cấp các dịch vụ xác thực cấp độ cao.

source: The Identity service component that provides authentication services.
de: Die Identitätsdienstkomponente, die Authentifizierungsdienste bereitstellt.
ru: Компонент службы идентификации, предоставляющий услуги аутентификации.
vi_vn: Thành phần của dịch vụ Identity có vai trò cung cấp các dịch vụ xác thưc.

source: The Identity service contains these components:
de: Der Identitätsdienst enthält die folgenden Komponenten:
ru: Служба идентификации состоит из следующих компонентов.

source: The Identity service endpoint template that contains services available to all projects.
de: Die Identitätsdienst-Endpunktvorlage, die Dienste enthält, die für alle Projekte verfügbar sind.
ru: Шаблон точки входа службы идентификации, где содержатся службы, доступные для всех проектов.

source: The Identity service is typically the first service a user interacts with. Once authenticated, an end user can use their identity to access other OpenStack services. Likewise, other OpenStack services leverage the Identity service to ensure users are who they say they are and discover where other services are within the deployment. The Identity service can also integrate with some external user management systems (such as LDAP).
de: Der Identitätsdienst ist typischerweise der erste Dienst, mit dem ein Benutzer interagiert. Nach der Authentifizierung kann ein Endbenutzer seine Identität verwenden, um auf andere OpenStack-Dienste zuzugreifen. Ebenso nutzen andere OpenStack-Dienste den Identitätsdienst, um sicherzustellen, dass Benutzer die sind für die sie sich ausgeben und entdecken, wo andere Dienste innerhalb der Bereitstellung sind. Der Identitätsdienst kann auch mit einigen externen Benutzerverwaltungssystemen (wie LDAP) integriert werden.
ru: Как правило, это первая служба, с которой начинает работать пользователь. После аутентификации конечный пользователь может использовать свои учетные данные для доступа к другим службам OpenStack. Подобным образом, службы OpenStack используют службу идентификации для проверки подлинности пользователей и обнаружения других служб в рамках развертывания. Служба идентификации также может интегрироваться с некоторыми внешними системами управления пользователями (например, LDAP).

source: The Image service API endpoint for management of VM images. Processes client requests for VMs, updates Image service metadata on the registry server, and communicates with the store adapter to upload VM images from the back-end store.
de: Der Abbilddienst-API-Endpunkt für die Verwaltung von VM-Abbildern. Verarbeitet Client-Anfragen für VMs, aktualisiert Abbilddienst-Metadaten auf dem Registrierungsserver und kommuniziert mit dem Speicheradapter zum Hochladen von VM-Abbildern aus dem Back-End-Speicher
ru: Точка входа API службы образов для управления виртуальными машинами. Обрабатывает запросы клиентов на поиск виртуальных машин, обновляет метаданные службы образов на сервере реестра и взаимодействует с адаптером хранилища для передачу образов ВМ из внутреннего хранилища.

source: The Launchpad Bugs area
de: Die Launchpad Bugs Area
ru: Багтрекер Launchpad
