Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: Pages that use HTML, JavaScript, and Cascading Style Sheets to enable users to interact with a web page or show simple animation.
de: Seiten, die HTML-, JavaScript- und Cascading-Stylesheets verwenden, um Benutzern die Möglichkeit zu geben, mit einer Webseite zu interagieren oder eine einfache Animation zu zeigen.
ru: На веб-страницах DHTML используется HTML, JavaScript и Cascading Style Sheets, чтобы реализовать интерактивное взаимодействие с пользователями или показать простую анимацию.
vi_vn: Các trang sử dụng HTML, JavaScript và Cascading Style Sheets để cho phép người dùng tương tác với một trang web hoặc hiển thị hình động đơn giản.

source: Part of the OpenStack :term:`Telemetry service <Telemetry service (telemetry)>`; gathers and stores metrics from other OpenStack services.
de: Teil des OpenStack :term: `Telemetriedienst <Telemetry service (telemetry)>`; Sammelt und speichert Metriken aus anderen OpenStack-Diensten.
ru: Компонент OpenStack :term:`служба телеметрии <Telemetry service (telemetry)>`; собирает и хранит метрики от других служб OpenStack.

source: Part of the OpenStack :term:`Telemetry service <Telemetry service (telemetry)>`; provides alarming functionality.
de: Teil des OpenStack: Begriff: `Telemetriedienst <Telemetry service (telemetry)>`; Bietet alarmierende Funktionalität.
ru: Компонент OpenStack :term:`Служба телеметрии <Telemetry service (telemetry)>`; предоставляет функцию оповещений.

source: Part of the OpenStack :term:`Telemetry service <Telemetry service (telemetry)>`; provides an indexer and time-series database.
de: Teil des OpenStack :term:`Telemetriedienstes <Telemetry service (telemetry)>`; bietet eine Indexer- und Zeitreihen-Datenbank.
ru: Часть :term:`службы телеметрии <Telemetry service (telemetry)>` OpenStack. Предоставляет индексатор и базу данных временных рядов.

source: Part of the OpenStack :term:`Telemetry service <Telemetry service (telemetry)>`; provides event storage.
ru: Компонент :term:`службы телеметрии <Telemetry service (telemetry)>` OpenStack . Предоставляет хранилище событий.

source: Passed to API requests and used by OpenStack to verify that the client is authorized to run the requested operation.
de: An API-Anforderungen übergeben und von OpenStack verwendet, um zu überprüfen, dass der Client autorisiert ist, den angeforderten Vorgang auszuführen.
ru: Передается запросам API и используется OpenStack, чтобы проверить право клиента выполнять запрошенную операцию.
vi_vn: Được chuyển tới các yêu cầu API và được OpenStack sử dụng để xác minh client được phép thực hiện các thao tác đã yêu cầu.

source: Passes requests from clients to the appropriate workers and returns the output to the client after the job completes.
de: Übergibt Anfragen von Clients an die entsprechenden Worker und gibt die Ausgabe an den Client zurück, nachdem der Job abgeschlossen ist.
ru: Передает запросы от клиентов соответствующим рабочим модулям и возвращает вывод клиентам после выполнения задания.
vi_vn: Chuyển các yêu cầu từ các client đến các worker thích hợp và sau đó gửi kết quả trả vê về client sau khi hoàn thành công việc.

source: Performs housekeeping tasks on the large data store. The replication services ensure consistency and availability through the cluster. Other periodic processes include auditors, updaters, and reapers.
de: Führt Haushaltungsaufgaben auf dem großen Datenspeicher durch. Die Replikationsdienste sorgen für Konsistenz und Verfügbarkeit im Cluster. Andere periodische Prozesse beinhalten Auditoren, Aktualisierer und Reapers.
ru: Выполняют служебные задачи для крупных хранилищ данных. Службы репликации гарантируют однородность и доступность данных в пределах кластера. Другие периодические процессы включают работу аудиторов, корректоров и риперов.

source: Persists until VM is terminated
de: Besteht, bis die VM beendet wird.
ru: Существует до остановки виртуальной машины

source: Persists until deleted
de: Besteht bis zur Löschung
ru: Существует до удаления пользователем

source: Physical host dedicated to running compute nodes.
de: Physischer Host, der zum laufenlassen von Compute Knoten vorgesehen ist.
ru: Физический хост, который выделен для выполнения вычислительных узлов.
vi_vn: Máy chủ vật lý được dành riêng để chạy các node tính toán.

source: Plans deployments.
de: Plant Bereitstellungen
ru: Планирует развертывания.

source: Platform-as-a-Service (PaaS)
ru: Платформа как услуга (PaaS)
vi_vn: Dịch vụ cung cấp nền tảng (Paas)

source: Plug and unplug ports, create networks or subnets, and provide IP addressing. These plug-ins and agents differ depending on the vendor and technologies used in the particular cloud. OpenStack Networking ships with plug-ins and agents for Cisco virtual and physical switches, NEC OpenFlow products, Open vSwitch, Linux bridging, and the VMware NSX product.
de: Ports ein- und ausschalten, Netzwerke oder Subnetze erstellen und IP-Adressierung. Diese Plug-ins und Agenten unterscheiden sich je nach Anbieter und Technologien, die in der jeweiligen Cloud verwendet werden. OpenStack Networking wird mit Plug-Ins und Agenten für Cisco virtuelle und physische Switches, NEC OpenFlow-Produkte, Open vSwitch, Linux Bridging und das VMware NSX-Produkt geliefert.
ru: Подключают и отключают порты, создают сети и подсети, а также поддерживают IP-адресацию. Эти плагины и агенты отличаются в зависимости от поставщика и технологий, используемых в определенном облаке. С их помощью сетевая служба OpenStack взаимодействует с виртуальными и физическими коммутаторами Cisco, продуктами NEC OpenFlow, Open vSwitch, мостами Linux и платформой VMware NSX.

source: Pluggable system of Hadoop installation engines.
de: Steckbares System von Hadoop Installationsmaschinen.
ru: Подключаемая система установочных модулей Hadoop.

source: Point in time since the last container and accounts database sync among nodes within Object Storage.
ru: Момент времени, в который была выполнена последняя синхронизация базы данных учетных записей и контейнеров на узлах объектного хранилища.
vi_vn: Mốc thời gian kể từ lần cuối cơ sở dữ liệu tài khoản và container được đồng bộ giữa các node nằm trong Object Storage.

source: Possible use cases for data migration include:
de: Mögliche Anwendungsfälle für die Datenmigration sind:
ru: Ниже приведены вероятные сценарии миграции данных.

source: Predefined templates of Hadoop configurations with the ability to modify parameters.
de: Vordefinierte Vorlagen von Hadoop-Konfigurationen mit der Möglichkeit, Parameter zu ändern.
ru: Предопределенные шаблоны конфигураций Hadoop с возможностью изменять параметры.

source: Prerequisite
de: Voraussetzung
ru: Необходимое условие

source: Prevents an image from being deleted.
ru: Запрещает удаление образа.

source: Principal communications protocol in the internet protocol suite for relaying datagrams across network boundaries.
de: Hauptkommunikationsprotokoll in der Internetprotokoll-Suite zum Weiterleiten von Datagrammen über Netzwerkgrenzen hinweg.
ru: Протокол Principal communications protocol in the internet protocol suite for relaying datagrams across network boundaries.
vi_vn: Giao thức truyền thông chủ đạo trong bộ giao thức internet dùng để chuyển tiếp các gói tin qua các biên giới mạng.

source: Prints the image size in a human-friendly format.
ru: Отображает размер образа в понятном для человека формате.

source: Process of modifying IP address information while in transit. Supported by Compute and Networking.
ru: Процесс преобразования IP-адреса при его передаче по сети. Поддерживается службами Compute и Networking.

source: Process whereby the system firmware validates the authenticity of the code involved in the boot process.
ru: Процесс, при котором встроенное ПО системы проверяет подлинность кода, используемого в процессе загрузки.

source: Processing is fairly complex. Basically, the daemon accepts actions from the queue and performs a series of system commands such as launching a KVM instance and updating its state in the database.
de: Die Verarbeitung ist ziemlich komplex. Grundsätzlich akzeptiert der Dämon Aktionen aus der Warteschlange und führt eine Reihe von Systembefehlen wie das Starten einer KVM-Instanz und das Aktualisieren seines Zustands in der Datenbank durch.
ru: Обработка достаточно сложная. Обычно демон принимает действия из очереди и выполняет последовательность системных команд, например запускает экземляр KVM и обновляет его статус в базе данных.

source: Programming language used extensively in OpenStack.
ru: Язык программирования, широко используемый в OpenStack.
vi_vn: Ngôn ngữ lập trình được sử dụng rộng rãi trong OpenStack.

source: Project name
de: Projektname
ru: Название проекта

source: Project name for OpenStack Network Information Service. To be merged with Networking.
de: Projektname für OpenStack Network Information Service. Um mit Networking verschmolzen zu werden.
ru: Кодовое имя проекта OpenStack для службы сетевой информации. Планируется объединение этой службы со службой управления сети (Networking).
vi_vn: Tên dự án của Dịch vụ Thông Tin Mạng OpenStack. Sẽ được hợp nhất với Networking.

source: Projects
de: Projekte
ru: проекты.

source: Projects represent the base unit of “ownership” in OpenStack, in that all resources in OpenStack should be owned by a specific project. In OpenStack Identity, a project must be owned by a specific domain.
ru: Базовый элемент владения в OpenStack — все ресурсы OpenStack должны принадлежать определенному проекту. В службе идентификации OpenStack проект должен принадлежать определенному домену.

source: Property to add or modify for this snapshot (repeat option to set multiple properties)
de: Eigenschaft zum Hinzufügen oder Ändern für diese Schattenkopie (Wiederholungsoption zum Festlegen mehrerer Eigenschaften)
ru: Свойство, которое используется при добавлении или изменении данного снимка (этот параметр можно использовать многократно, чтобы задать несколько свойств)

source: Protocol that encapsulates a wide variety of network layer protocols inside virtual point-to-point links.
de: Protokoll, das eine Vielzahl von Netzwerkschichtprotokollen in virtuellen Punkt-zu-Punkt-Verbindungen einkapselt.
ru: Протокол, который инкапсулирует пакеты различных протоколов сетевого уровня внутри виртуальных соединений точка-точка.
vi_vn: Giao thức mà gói gọn một loạt các giao thức lớp mạng bên trong đường dẫn ảo point-to-point.

source: Provide as much detail as possible in the description. Paste in your command output or stack traces, links to screen shots, and any other information which might be useful.
de: Geben Sie so viele Details wie möglich in der Beschreibung an. Fügen Sie in Ihre Befehlsausgabe oder Stack-Traces, Links zu Screenshots und alle anderen Informationen, die nützlich sein könnten, hinzu.
ru: Подробно опишите проблему. Предоставьте весь вывод выполняемых команд, трассировки стека, ссылки на снимки экрана и другую полезную информацию.

source: Provided by Compute in the form of cloudpipes, specialized instances that are used to create VPNs on a per-project basis.
de: Bereitgestellt von Compute in Form von Cloudpipes, spezialisierte Instanzen, die verwendet werden, um VPNs auf einer pro-Projekt-Basis zu erstellen.
ru: Предоставляется службой вычислительных ресурсов в виде программных VPN (cloudpipe) — специализированных инстансов, которые используются для создания сетей VPN для отдельных проектов.

source: Provided in Compute through the system usage data facility.
de: Wird in Compute über die Systemverwendungsdaten-Einrichtung bereitgestellt.
ru: Предоставляется в службе вычислительных ресурсов с помощью средства для работы с данными об использовании системы.
vi_vn: Được cung cấp trong Compute thông qua cơ sở dữ liệu sử dụng hệ thống.

source: Provides Shared File System service via nfs, cifs, glusterfs, or hdfs protocol
de: Stellt den Dienst für freigegebene Dateisysteme über nfs, cifs, glusterfs oder hdfs-Protokoll zur Verfügung
ru: Предоставляет службу общей файловой системы по протоколу NFS, CIFS, GlusterFS или HDFS

source: Provides a high availability load balancer and proxy server for TCP and HTTP-based applications that spreads requests across multiple servers.
ru: Предоставляет балансировщик нагрузки с высокой доступностью и прокси-сервер для приложений на основе TCP или HTTP, которые рассылают запросы на разные серверы.

source: Provides a method of allocating space on mass-storage devices that is more flexible than conventional partitioning schemes.
de: Bietet eine Methode zur Platzierung von Speicherplatz auf Massenspeichergeräten, die flexibler ist als herkömmliche Partitionierungsschemata.
ru: Обеспечивает более гибкое распределение дискового пространства на устройствах массового хранения по сравнению с традиционными схемами создания разделов.
vi_vn: Cung cấp một phương pháp phẩn bổ không gian trên các thiết bị lưu trữ lớn linh hoạt hơn các phương pháp phân vùng thông thường.

source: Provides a predefined list of actions that the user can perform, such as start or stop VMs, reset passwords, and so on. Supported in both Identity and Compute and can be configured using the horizon dashboard.
ru: Предоставляет предопределенный список действий, которые разрешено выполнять пользователю, например, запуск или остановка ВМ, сброс паролей и т.д. Поддерживается в службах идентификации и вычислительных ресурсов и может быть настроено с помощью панели управления Horizon.

source: Provides a proxy for accessing running instances through a SPICE connection. Supports browser-based HTML5 client.
de: Stellt einen Proxy für den Zugriff auf laufende Instanzen über eine SPICE-Verbindung zur Verfügung. Unterstützt Browser-basierten HTML5-Client.
ru: Предоставляет прокси-сервер для доступа к запущенным экземплярам с помощью соединения SPICE. Поддерживает клиенты HTML5 для браузеров.

source: Provides a proxy for accessing running instances through a VNC connection. Supports an OpenStack-specific Java client.
de: Stellt einen Proxy für den Zugriff auf laufende Instanzen über eine VNC-Verbindung zur Verfügung. Unterstützt einen OpenStack-spezifischen Java-Client.
ru: Предоставляет прокси-сервер для доступа к запущенным экземплярам с помощью соединения VNC. Поддерживает специальный клиент Java для OpenStack.

source: Provides a proxy for accessing running instances through a VNC connection. Supports browser-based novnc clients.
de: Stellt einen Proxy für den Zugriff auf laufende Instanzen über eine VNC-Verbindung zur Verfügung. Unterstützt browserbasierte novnc-Clients.
ru: Предоставляет прокси-сервер для доступа к запущенным экземплярам с помощью соединения VNC. Поддерживает клиенты novnc для браузеров.

source: Provides a web-based self-service portal to interact with underlying OpenStack services, such as launching an instance, assigning IP addresses and configuring access controls.
de: Bietet ein webbasiertes Self-Service-Portal für die Interaktion mit zugrunde liegenden OpenStack-Diensten, wie das Starten einer Instanz, das Zuweisen von IP-Adressen und das Konfigurieren von Zugriffssteuerungen.
ru: Предоставляет веб-портал самообслуживания для взаимодействия с базовыми службами OpenStack, такими как запуск экземпляра, назначение IP-адресов и настройка доступа.

source: Provides an OpenStack-native RESTful API that supports JSON to provision and manage Trove instances.
de: Bietet eine OpenStack-native RESTful-API, die JSON zur Bereitstellung und Verwaltung von Trove-Instanzen unterstützt.
ru: Предоставляет собственный RESTful API OpenStack, который поддерживает JSON для развертывания и управления экземплярами Trove.

source: Provides an authentication and authorization service for other OpenStack services. Provides a catalog of endpoints for all OpenStack services.
de: Stellt einen Authentifizierungs- und Autorisierungsdienst für andere OpenStack Dienste bereit. Liefert einen Katalog von Endpunkten für alle OpenStack Dienste.
ru: Обеспечивает работу службы аутентификации и авторизации для других служб OpenStack. Предоставляет централизованный каталог точек входа для всех служб OpenStack.

source: Provides an interface to the underlying Open vSwitch service for the Networking plug-in.
ru: Обеспечивает интерфейс к базовой службе Open vSwitch для плагина Networking.
vi_vn: Cung cấp một giao diện cho dịch vụ Open vSwitch cơ bản để phục vụ cho plug-in của Networking.

source: Provides capabilities to provision and scale Hadoop clusters in OpenStack by specifying parameters like Hadoop version, cluster topology and nodes hardware details.
de: Bietet die Möglichkeit, Hadoop-Cluster in OpenStack bereitzustellen und zu skalieren, indem Parameter wie die Hadoop-Version, die Cluster-Topologie und die Hardware-Hardware der Knoten angegeben werden.
ru: Предоставляет возможности для развертывания и масштабирования кластеров Hadoop в OpenStack с помощью настройки таких параметров как версия Hadoop, топология кластера и сведения об оборудовании узлов.

source: Provides data redundancy and fault tolerance by creating copies of Object Storage objects, accounts, and containers so that they are not lost when the underlying storage fails.
ru: Обеспечивает избыточность данных и отказоустойчивость, создавая копии объектов объектного хранилища, учетных записей и контейнеров на случай сбоя основного хранилища.
vi_vn: Cung cấp tính năng dự phòng dữ liệu và khả năng chống chịu lỗi bằng cách tạo ra các bản sao của các object, tài khoản và container của Object Storage làm sao cho chúng không bị mất khi storage cơ sở xảy ra lỗi.

source: Provides logical partitioning of Compute resources in a child and parent relationship. Requests are passed from parent cells to child cells if the parent cannot provide the requested resource.
de: Stellt eine logische Partitionierung von Compute-Ressourcen in einer untergeordneten und übergeordneten Beziehung bereit. Anfragen werden von übergeordneten Zellen an untergeordnete Zellen übergeben, wenn das übergeordnete Element die angeforderte Ressource nicht bereitstellen kann.
ru: Обеспечивает логическое разбиение вычислительных ресурсов в виде родительских и дочерних взаимосвязей. Если родительская ячейка не может предоставить запрошенный ресурс, запрос передается дочерней ячейке.
vi_vn: Cung cấp việc phân vùng logic các tài nguyên của Compute theo quan hệ mẹ và con. Các yêu cầu được thông qua lớp cha rồi đến lớp con nếu lớp mẹ không thể đáp ứng được nhu cầu tài nguyên.

source: Provides persistent block storage to running instances. Its pluggable driver architecture facilitates the creation and management of block storage devices.
de: Stellt permanente Blockspeicherung für laufende Instanzen bereit. Seine steckbare Treiberarchitektur erleichtert die Erstellung und Verwaltung von Blockspeichergeräten.
ru: Предоставляет постоянное хранилище блоков для выполняющихся экземпляров. Расширяемая архитектура драйвера упрощает создание и управление устройствами хранения блоков.

source: Provides scalable and reliable Cloud Database-as-a-Service functionality for both relational and non-relational database engines.
de: Bietet skalierbare und zuverlässige Cloud Database-as-a-Service Funktionalität für relationale sowie nicht-relationale Datenbanken.
ru: Предоставляет масштабируемую и надежную облачную функцию «база данных как услуга» как для реляционных, так и для нереляционных ядер баз данных.

source: Provides support for NexentaStor devices in Compute.
ru: Обеспечивает поддержку устройств NexentaStor в службе вычислительных ресурсов.
vi_vn: Cung cấp các sự hỗ trợ cho các thiết bị NexentaStor trong Compute.

source: Provides support for Open vSwitch in Networking.
ru: Обеспечивает поддержку Open vSwitch в службе Networking.
vi_vn: Cung cấp hỗ trợ cho Open vSwitch trong Networking.

source: Provides support for VMware NSX in Neutron.
de: Bietet Unterstützung für VMware NSX in Neutron.
ru: Обеспечивает поддержку VMware NSX в Neutron.
vi_vn: Cung cấp sự hỗ trợ cho VMware NSX trong Neutron.

source: Provides support for new and specialized types of back-end storage for the Block Storage volume manager.
de: Bietet Unterstützung für neue und spezielle Backend-Storage Typen durch die Block Storage Datenträgerverwaltung.
ru: Обеспечивает поддержку новых и специализированных внутренних хранилищ для диспетчера томов блочного хранилища.
vi_vn: Cung cấp hỗ trợ cho các phiên bản mới và chuyên dụng của back-end storage và cho hệ quản trị khối lưu trữ.

source: Provides to the consumer the ability to deploy applications through a programming language or tools supported by the cloud platform provider. An example of Platform-as-a-Service is an Eclipse/Java programming platform provided with no downloads required.
ru: Предоставляет заказчику возможность развертывать приложение с помощью языка программирования или инструментов, поддерживаемых поставщиком облачной платформы. Примером PaaS является программная платформа Eclipse/Java, для использования которой не требуется никаких загрузок.

source: Proxy servers (swift-proxy-server)
de: Proxyserver (swift-proxy-server)
ru: Прокси-серверы (swift-proxy-server)

source: Publishes collected data to various targets including data stores and message queues.
de: Veröffentlicht die gesammelten Daten von verschiedenen Zielen einschließlich Datenspeichern und Nachrichtenwarteschlangen.
ru: Публикуют собранные данные для различных целевых объектов, включая хранилища данных и очереди сообщений.

source: Python 2.7 or later
de: Python 2.7 oder neuer
ru: Python 2.7 или более поздней версии

source: QEMU is a generic and open source machine emulator and virtualizer. One of the hypervisors supported by OpenStack, generally used for development purposes.
ru: QEMU — эмулятор и виртуализатор различных платформ компьютера с открытым исходным кодом. Один из гипервизоров, поддерживаемых OpenStack, использовался для целей разработки.

source: Quality of Service (QoS)
ru: Качество обслуживания (QoS)

source: RADOS Block Device (RBD)
ru: Блочное устройство RADOS (RBD)

source: RAM overcommit
ru: чрезмерное выделение ОЗУ (RAM overcommit)

source: RDO, openSUSE, SUSE Linux Enterprise, Debian, and Ubuntu have client packages that can be installed without ``pip``.
ru: Для RDO, openSUSE, SUSE Linux Enterprise, Debian и Ubuntu созданы упакованные клиенты, которые можно устанавливать, не используя ``pip``.

source: RPC driver
de: RPC-Treiber
ru: драйвер RPC

source: RXTX cap
ru: предел RXTX
vi_vn: hạn mức RXTX

source: RXTX quota
ru: квота RXTX
vi_vn: hạn ngạch RXTX

source: Rating service
de: Ratingdienst (cloudkitty)
ru: Служба рейтинга

source: Rating service.
de: Ratingdienst.
ru: Определяет рейтинги.

source: Reducing the size of files by special encoding, the file can be decompressed again to its original content. OpenStack supports compression at the Linux file system level but does not support compression for things such as Object Storage objects or Image service VM images.
de: Wenn Sie die Größe der Dateien durch spezielle Codierung reduzieren, kann die Datei wieder auf ihren ursprünglichen Inhalt dekomprimiert werden. OpenStack unterstützt die Komprimierung auf Linux-Dateisystemebene, unterstützt jedoch keine Komprimierung für Objekte wie Objektspeicherobjekte oder Abbilddienst-VM-Abbilder.
ru: Уменьшение размера файлов с помощью специальной кодировки, после которого их можно восстановить до исходного состояния. OpenStack поддерживает сжатие на уровне файловой системы Linux, однако не поддерживает сжатие до объектов для хранилища объектов или до образов ВМ службы образов.
vi_vn: Giảm kích thước của tập tin bằng một mã hóa đặc biệt, tập tin sau đó có thể được giải nén về lại kich cỡ ban đầu. OpenStack hỗ trợ nén ở cấp độ hệ thống tập tin nhưng không hỗ trợ nén những thứ như các object của Object Storage hoặc các image máy ảo của dịch vụ Image.
