Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: The code name for the eleventh release of OpenStack. The design summit took place in Paris, France. Due to delays in the name selection, the release was known only as K. Because ``k`` is the unit symbol for kilo and the kilogram reference artifact is stored near Paris in the Pavillon de Breteuil in Sèvres, the community chose Kilo as the release name.
de: Der Codename für die elfte Version von OpenStack. Der Design Summit fand in Paris, Frankreich statt. Wegen der Verzögerungen bei der Namensauswahl war die Freigabe nur als K bekannt. Weil `` k`` das Einheitssymbol für Kilo ist und das Kilogramm Referenzartefakt in der Nähe von Paris im Pavillon de Breteuil in Sèvres gespeichert ist, wählte die Gemeinde Kilo als den Versionsname.

source: The default panel that is displayed when a user accesses the dashboard.
de: Das Paneel, das einem Benutzer beim Zugriff auf das Dashboard als Standard angezeigt wird.

source: The following books explain how to use the OpenStack Dashboard and command-line clients:
de: Die folgenden Bücher erläutern die Verwendung des OpenStack Dashboards und des Kommandozeileninterfaces:

source: The following list explains the optional arguments that you can use with the ``create`` and ``set`` commands to modify image properties. For more information, refer to the `OpenStack Image command reference <https://docs.openstack.org/developer/python-openstackclient/command-objects/image.html>`_.
de: Die folgende Liste erläutert die optionalen Argumente, die Sie mit den Befehlen ``create`` und ``set`` verwenden können, um die Abbildeigenschaften zu ändern. Weitere Informationen finden Sie in der `OpenStack Image-Befehlsreferenz <https://docs.openstack.org/developer/python-openstackclient/command-objects/image.html>` _.

source: The packaged version might install older clients. If you want to make sure the latest clients are installed, you might need to :ref:`install the clients with pip <installing_with_pip>`.
de: Die gepackte Version kann ältere Clients installieren. Wenn Sie sicherstellen möchten, dass die neuesten Clients installiert sind, brauchen Sie möglicherweise :ref: `Installieren Sie die Clients mit pip <installing_with_pip>`.

source: The point where a user interacts with a service; can be an API endpoint, the dashboard, or a command-line tool.
de: Der Punkt, an dem ein Benutzer mit einem Dienst interagiert; Kann ein API-Endpunkt, das Dashboard oder ein Befehlszeilentool sein.

source: The procedure for volume transfer is intended for projects (both the volume donor and recipient) within the same cloud.
de: Das Verfahren für die Datenträgerübertragung ist für Projekte (sowohl der Datenträgersender als auch der Empfänger) innerhalb derselben Cloud vorgesehen.

source: The project that aims to provide scalable, on demand, self service access to load-balancer services, in technology-agnostic manner.
de: Das Projekt, das auf technisch-agnostische Weise skalierbare, bedarfsgerechte Selbstbedienungs-Zugang zu Loadbalancer-Diensten anbietet.

source: The project that facilitates API client authentication, service discovery, distributed multi-project authorization, and auditing. It provides a central directory of users mapped to the OpenStack services they can access. It also registers endpoints for OpenStack services and acts as a common authentication system.
de: Das Projekt, das die API-Client-Authentifizierung, die Service-Ermittlung, die verteilte Multiprojekt-Autorisierung und die Auditierung erleichtert. Es bietet ein zentrales Verzeichnis von Benutzern, die den OpenStack-Diensten zugeordnet sind, auf die sie zugreifen können. Es registriert auch Endpunkte für OpenStack-Dienste und fungiert als gemeinsames Authentifizierungssystem.

source: The project that implements clustering services and libraries for the management of groups of homogeneous objects exposed by other OpenStack services.
de: Das Projekt, das Clustering-Dienste und Bibliotheken für das Management von Gruppen von homogenen Objekten implementiert, die von anderen OpenStack-Diensten ausgesetzt sind.

source: The project that provides Governance-as-a-Service across any collection of cloud services in order to monitor, enforce, and audit policy over dynamic infrastructure.
de: Das Projekt, das Governance-as-a-Service über jede Sammlung von Cloud-Diensten zur Überwachung, Durchsetzung und Überwachung von Richtlinien über dynamische Infrastruktur bietet.

source: The project that provides integrated tooling for backing up, restoring, and recovering file systems, instances, or database backups.
de: Das Projekt, das integrierte Tools für das Sichern, Wiederherstellen und Wiederherstellen von Dateisystemen, Instanzen oder Datenbanksicherungen bereitstellt.

source: The recommended way to install setuptools on Microsoft Windows is to follow the documentation provided on the `Python Setuptools <https://pypi.python.org/pypi/setuptools>`_ website.
de: Die empfohlene Methode zur Installation von setuptools unter Microsoft Windows beschreibt die Dokumentation auf der Seite `Python Setuptools <https://pypi.python.org/pypi/setuptools>` _.

source: Theoretically, OpenStack Compute can support any database that SQLAlchemy supports. Common databases are SQLite3 for test and development work, MySQL, MariaDB, and PostgreSQL.
de: Theoretisch kann OpenStack Compute jede Datenbank verwenden, die SQLAlchemy unterstützt. Gemeinsame Datenbanken sind SQLite3 für Test- und Entwicklungsarbeit, MySQL, MariaDB und PostgreSQL.

source: There are also packaged versions of the clients available that enable :command:`yum` to install the clients as described in Installing_from_packages_.
de: Es gibt auch gepackte Versionen der verfügbaren Clients, die folgendermassen aktiviert werden :command: `yum`, um die Clients zu installieren, wie in Installing_from_packages_ beschrieben.

source: This command assumes that you have enabled the OpenStack repository for your distribution. For more information, see the `Installation Tutorial for Red Hat Enterprise Linux and CentOS <https://docs.openstack.org/ocata/install-guide-rdo/environment-packages.html>`_.
de: Dieser Befehl setzt voraus, dass Sie das OpenStack-Repository für Ihre Distribution aktiviert haben. Weitere Informationen finden Sie in der Installationsanleitung für Red Hat Enterprise Linux und CentOS <https://docs.openstack.org/ocata/install-guide-rdo/environment-packages.html> `_.

source: This command assumes that you have enabled the OpenStack repository for your distribution. For more information, see the `Installation Tutorial for openSUSE and SUSE Linux Enterprise <https://docs.openstack.org/ocata/install-guide-obs/environment-packages.html>`_.
de: Dieser Befehl setzt voraus, dass Sie das OpenStack-Repository für Ihre Distribution aktiviert haben. Weitere Informationen finden Sie in der `Installationsanleitung für openSUSE und SUSE Linux Enterprise <https://docs.openstack.org/ocata/install-guide-obs/environment-packages.html>` _.

source: To provide feedback on documentation, join and use the openstack-docs@lists.openstack.org mailing list at `OpenStack Documentation Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs>`_, join our IRC channel ``#openstack-doc`` on the freenode IRC network, or `report a bug <https://bugs.launchpad.net/openstack-manuals/+filebug>`_.
de: Um Feedback zu Dokumentationen abzugeben, abonnieren und nutzen Sie die openstack-docs@lists.openstack.org Mailing-Liste auf `OpenStack Documentation Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs>`_, betreten Sie unseren IRC-Kanal ``#openstack-doc`` im Freenode IRC Netzwerk oder `Melden Sie einen Bug <https://bugs.launchpad.net/openstack-manuals/+filebug>`_.

source: To provide feedback on documentation, join and use the openstack-docs@lists.openstack.org mailing list at `OpenStack Documentation Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs>`_, or `report a bug <https://bugs.launchpad.net/openstack-manuals/+filebug>`_.
de: Um Feedback über die Dokumentation zu geben, nutzen Sie die openstack-docs@lists.openstack.org Mailingliste unter `OpenStack Documentation Mailing List <http://lists.openstack.org/cgi-bin/mailman/listinfo/openstack-docs> `_, Oder` melden einen Bug <https://bugs.launchpad.net/openstack-manuals/+filebug> `_.

source: To remove the client with pip, run the :command:`pip uninstall` command:
de: Um den Client mit Pip zu entfernen, führen Sie den Befehl: `pip uninstall` aus:

source: To set the required environment variables for the OpenStack command-line clients, you must create an environment file called an OpenStack rc file, or ``openrc.sh`` file. If your OpenStack installation provides it, you can download the file from the OpenStack Dashboard as an administrative user or any other user. This project-specific environment file contains the credentials that all OpenStack services use.
de: Um die erforderlichen Umgebungsvariablen für die OpenStack-Befehlszeilenclients festzulegen, müssen Sie eine Umgebungsdatei mit dem Namen OpenStack rc-Datei oder ``openrc.sh``-Datei erstellen. Wenn Ihre OpenStack-Installation sie bereitstellt, können Sie die Datei aus dem OpenStack Dashboard als Administrator oder als anderer Benutzer herunterladen. Diese projektspezifische Umgebungsdatei enthält die Berechtigungen, die von allen OpenStack-Diensten verwendet werden.

source: To upgrade a client with :command:`pip`, add the ``--upgrade`` option to the :command:`pip install` command:
de: So aktualisieren Sie einen Client mit :command: `pip`, fügen Sie die``--upgrade`` Option zum Befehl :command:`pip install` ein:

source: Tracks the inventory and usage of each provider. For details, see `Placement API <https://docs.openstack.org/developer/nova/placement.html>`__.
de: Verfolgt das Inventory und Nutzung der einzelnen Anbieter. Für Details schauen Sie `Placement API <https://docs.openstack.org/developer/nova/placement.html>`__.

source: Unix-like computer operating system assembled under the model of free and open-source software development and distribution.
de: Unix-ähnliches Computer-Betriebssystem unter dem Modell der freien und Open-Source-Software-Entwicklung und Vertrieb zusammengestellt.

source: Unmanage a snapshot with the :command:`openstack volume snapshot unset` command:
de: Geben Sie die Verwaltung einer Schattenkopie auf mit dem Kommando :command:`openstack volume snapshot unset`:

source: Use the :command:`trove-manage` command to import images and offer them to projects.
de: Verwenden Sie den Befehl :command: `trove-manage`, um Abbilder zu importieren und sie Projekten anzubieten.

source: Users can access OpenStack via the web-based user interface implemented by :doc:`Dashboard <get-started-dashboard>`, via `command-line clients <https://docs.openstack.org/cli-reference/>`__ and by issuing API requests through tools like browser plug-ins or :command:`curl`. For applications, `several SDKs <https://developer.openstack.org/#sdk>`__ are available. Ultimately, all these access methods issue REST API calls to the various OpenStack services.
de: Benutzer können auf OpenStack über die webbasierte Benutzeroberfläche zugreifen, die implementiert wird durch :doc: `Dashboard <get-started-dashboard>`, über `command-line clients <https://docs.openstack.org/cli-reference/>` __ und durch die Ausgabe von API-Anfragen über Werkzeuge wie Browser-Plugins oder: command: `curl`. Für Anwendungen stehen `mehrere SDKs <https://developer.openstack.org/#sdk>` __ zur Verfügung. Letztendlich geben alle diese Zugriffsmethoden REST-API-Aufrufe an die verschiedenen OpenStack-Dienste aus.

source: When you use OpenStack with VMware vCenter Server, you need to specify the ``vmware_disktype`` and ``vmware_adaptertype`` properties with :command:`openstack image create`. Also, we recommend that you set the ``hypervisor_type="vmware"`` property. For more information, see `Images with VMware vSphere <https://docs.openstack.org/ocata/config-reference/compute/hypervisor-vmware.html#images-with-vmware-vsphere>`_ in the OpenStack Configuration Reference.
de: Wenn Sie OpenStack mit VMware vCenter Server verwenden, müssen Sie die Eigenschaften ``vmware_disktype`` und ``vmware_adaptertype`` mit folgendem Befehl eingeben: `openstack image create`. Außerdem wird empfohlen, die ``hypervisor_type = "vmware" `` Eigenschaft zu setzen. Weitere Informationen finden Sie unter `Abbilder mit VMware vSphere <https://docs.openstack.org/ocata/config-reference/compute/hypervisor-vmware.html#images-with-vmware-vsphere>` _ in der OpenStack-Konfigurationsreferenz .

source: You are not prompted for the password with this method. The password lives in clear text format in the ``PROJECT-openrc.sh`` file. Restrict the permissions on this file to avoid security problems. You can also remove the ``OS_PASSWORD`` variable from the file, and use the ``--password`` parameter with OpenStack client commands instead.
de: Sie werden mit dieser Methode nicht aufgefordert, das Passwort einzugeben. Das Passwort steht im Klartext-Format in der ``PROJECT-openrc.sh`` Datei. Beschränken Sie die Berechtigungen auf diese Datei, um Sicherheitsprobleme zu vermeiden. Sie können auch die Variable ``OS_PASSWORD`` aus der Datei entfernen und stattdessen den `` --password``-Parameter mit OpenStack-Client-Befehlen verwenden.

source: You can transfer a volume from one owner to another by using the :command:`openstack volume transfer request create` command. The volume donor, or original owner, creates a transfer request and sends the created transfer ID and authorization key to the volume recipient. The volume recipient, or new owner, accepts the transfer by using the ID and key.
de: Sie können einen Datenträger von einem Besitzer zu einem anderen übertragen, indem Sie den folgenden Befehl eingeben: `openstack volume transfer request create`Der Datenträgerspender oder der ursprüngliche Besitzer erstellt eine Übertragungsanforderung und sendet die erstellte Übertragungs-ID und den Autorisierungsschlüssel an den Datenträgerempfänger. Der Datenträgerempfänger oder der neue Besitzer akzeptiert die Übertragung mit der ID und dem Schlüssel.

source: You can use the unified ``openstack`` command (**python-openstackclient**) for the most of OpenStack services. For more information, see `OpenStackClient document <https://docs.openstack.org/developer/python-openstackclient/>`_.
de: Für die meisten OpenStack-Dienste steht Ihnen der einheitliche ``openstack`` Befehl (** python-openstackclient **) zur Verfügung. Weitere Informationen finden Sie unter `OpenStackClient-Dokument <https://docs.openstack.org/developer/python-openstackclient/>` _.

source: `Block Storage service <https://www.openstack.org/software/releases/ocata/components/cinder>`__
de: `Block Storage Dienst <https://www.openstack.org/software/releases/ocata/components/cinder>`__

source: `Compute service <https://www.openstack.org/software/releases/ocata/components/nova>`__
de: `Compute Dienst <https://www.openstack.org/software/releases/ocata/components/nova>`__

source: `Data Processing service <https://www.openstack.org/software/releases/ocata/components/sahara>`__
de: `Data Processing Dienst <https://www.openstack.org/software/releases/ocata/components/sahara>`__

source: `Database service <https://www.openstack.org/software/releases/ocata/components/trove>`__
de: `Datenbankdienst <https://www.openstack.org/software/releases/ocata/components/trove>`__

source: `Identity service <https://www.openstack.org/software/releases/ocata/components/keystone>`__
de: `Identitätsdienst <https://www.openstack.org/software/releases/ocata/components/keystone>`__

source: `Image service <https://www.openstack.org/software/releases/ocata/components/glance>`__
de: `Abbilddienst <https://www.openstack.org/software/releases/ocata/components/glance>`__

source: `Installation Tutorial for Red Hat Enterprise Linux 7 and CentOS 7 <https://docs.openstack.org/ocata/install-guide-rdo/>`_
de: `Installationsanleitung für Red Hat Enterprise Linux 7 und CentOS 7 <https://docs.openstack.org/ocata/install-guide-rdo/>`_

source: `Installation Tutorial for Ubuntu 16.04 (LTS) <https://docs.openstack.org/ocata/install-guide-ubuntu/>`_
de: `Installationsanleitung für Ubuntu 16.04 (LTS) <https://docs.openstack.org/ocata/install-guide-ubuntu/>`_

source: `Installation Tutorial for openSUSE Leap 42.2 and SUSE Linux Enterprise Server 12 SP2 <https://docs.openstack.org/ocata/install-guide-obs/>`_
de: `Installationsanleitung für openSUSE Leap 42.2 und SUSE Linux Enterprise Server 12 SP2 <https://docs.openstack.org/ocata/install-guide-obs/>`_

source: `Networking service <https://www.openstack.org/software/releases/ocata/components/neutron>`__
de: `Networking Dienst <https://www.openstack.org/software/releases/ocata/components/neutron>`__

source: `Object Storage service <https://www.openstack.org/software/releases/ocata/components/swift>`__
de: `Object Storage Dienst <https://www.openstack.org/software/releases/ocata/components/swift>`__

source: `Orchestration service <https://www.openstack.org/software/releases/ocata/components/heat>`__
de: `Orchestration Dienst <https://www.openstack.org/software/releases/ocata/components/heat>`__

source: `Telemetry service <https://www.openstack.org/software/releases/ocata/components/ceilometer>`__
de: `Telemetry Dienst <https://www.openstack.org/software/releases/ocata/components/ceilometer>`__

source: ``nova-placement-api`` service
de: ``nova-placement-api`` Dienst

source: changes since
de: Änderungen seit
vi_vn: thay đổi kể từ khi

source: handover
de: übergeben

source: Auto ACK
vi_vn: ACK tự động

source: Fibre Channel over Ethernet (FCoE)
vi_vn: Fibre Channel qua Ethernet (FCoE)

source: Mitaka
vi_vn: phiên bản Mitaka

source: Open Cloud Computing Interface (OCCI)
vi_vn: Giao diện Tính toán Cloud Mở (OCCI)

source: Open Virtualization Format (OVF)
vi_vn: Định dạng Ảo hóa Mở (OVF)

source: RAM filter
vi_vn: bộ lọc RAM

source: Virtual Network Computing (VNC)
vi_vn: Tính toán Hệ thống mạng Ảo (VNC)

source: Xen Storage Manager Volume Driver
vi_vn: Trình điều khiển bộ quản trị cơ sở dữ liệu Xen

source: ZeroMQ
vi_vn: Phần mềm ZeroMQ

source: Zuul
vi_vn: Công cụ Zuul

source: jumbo frame
vi_vn: frame jumbo

source: raw
vi_vn: thô

source: swift
vi_vn: nhanh chóng
