Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: Another option is to use the `unofficial binary installer maintained by Christoph Gohlke <http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools>`_.
de: Eine weitere Möglichkeit ist die Verwendung des inoffiziellen binären Installationsprogramms, das von Christoph Gohlke gepflegt wird: <http://www.lfd.uci.edu/~gohlke/pythonlibs/#setuptools> `_.

source: Another option is to use the `unofficial binary installer provided by Christoph Gohlke <http://www.lfd.uci.edu/~gohlke/pythonlibs/#pip>`_.
de: Eine weitere Möglichkeit besteht darin, den inoffiziellen Binärinstallateur von Christoph Gohlke <http://www.lfd.uci.edu/~gohlke/pythonlibs/#pip> `_ zu verwenden.

source: Apache License 2.0
de: Apache Lizenz 2.0

source: Appendix
de: Anhang

source: As a cloud end user, you can use the OpenStack Dashboard to provision your own resources within the limits set by administrators. You can modify the examples provided in this section to create other types and sizes of server instances.
de: Als Cloud-Endbenutzer können Sie das OpenStack Dashboard verwenden, um Ihre eigenen Ressourcen innerhalb der von Administratoren festgelegten Grenzen bereitzustellen. Sie können die in diesem Abschnitt bereitgestellten Beispiele ändern, um andere Typen und Größen von Serverinstanzen zu erstellen.

source: Authorizes tokens for users that console proxies provide. See ``nova-novncproxy`` and ``nova-xvpvncproxy``. This service must be running for console proxies to work. You can run proxies of either type against a single nova-consoleauth service in a cluster configuration. For information, see `About nova-consoleauth <https://docs.openstack.org/admin-guide/compute-remote-console-access.html#about-nova-consoleauth>`__.
de: Autorisiert Token für Benutzer, die Proxies vertreiben. Siehe ``nova-novncproxy`` und ``nova-xvpvncproxy``. Dieser Dienst muss ausgeführt werden, damit die Konsolen-Proxies funktionieren. Sie können Proxies eines Typs gegen einen einzelnen nova-consoleauth-Dienst in einer Cluster-Konfiguration ausführen. Weitere Informationen finden Sie unter `About nova-consoleauth <https://docs.openstack.org/admin-guide/compute-remote-console-access.html#about-nova-consoleauth>` __.

source: Backup, Restore, and Disaster Recovery service (freezer)
de: Sicherung, Wiederherstellung und Disaster Recovery-Dienst (freezer)

source: Before you proceed, ensure that the controller node has at least several gigabytes of space available in this directory. Keep in mind that since the ``file`` back end is often local to a controller node, it is not typically suitable for a multi-node glance deployment.
de: Bevor Sie fortfahren, stellen Sie sicher, dass der Controller-Knoten mindestens mehrere Gigabytes Speicherplatz in diesem Verzeichnis zur Verfügung hat. Denken Sie daran, dass, da das ``file`` Backend häufig lokal zu einem Controller-Knoten ist, es nicht typischerweise für eine Multi-Knoten-Blick-Implementierung geeignet ist.

source: Clustering service (senlin)
de: Clustering-Dienst (senlin)

source: Code name for the :term:`Backup, Restore, and Disaster Recovery service <Backup, Restore, and Disaster Recovery service (freezer)>`.
de: Codename für den :term:`Backup, Restore und Disaster Recovery Dienst <Backup, Restore, and Disaster Recovery service (freezer)>`.

source: Code name for the :term:`DNS service <DNS service (designate)>`.
de: Codename für den :term:`DNS Dienst <DNS service (designate)>`.

source: Code name for the :term:`Governance service <Governance service (congress)>`.
de: Code-Name für den :term:`Governance service <Governance service (congress)>`.

source: Code name for the :term:`Infrastructure Optimization service <Infrastructure Optimization service (watcher)>`.
de: Code name für den :term:`Infrastruktur-Optimierungsservice <Infrastructure Optimization service (watcher)>`.

source: Code name for the :term:`Root Cause Analysis service <Root Cause Analysis (RCA) service (Vitrage)>`.
de: Code name für den :term:`Root Cause Analysis service <Root Cause Analysis (RCA) service (Vitrage)>`.

source: DNS service (designate)
de: DNS Dienst (designate)

source: During the set up or testing of OpenStack, you might have questions about how a specific task is completed or be in a situation where a feature does not work correctly. Use the `ask.openstack.org <https://ask.openstack.org>`_ site to ask questions and get answers. When you visit the `Ask OpenStack <https://ask.openstack.org>`_ site, scan the recently asked questions to see whether your question has already been answered. If not, ask a new question. Be sure to give a clear, concise summary in the title and provide as much detail as possible in the description. Paste in your command output or stack traces, links to screen shots, and any other information which might be useful.
de: Während des Aufbaus oder Testens von OpenStack können Sie Fragen haben, wie eine bestimmte Aufgabe erledigt wurde oder nicht. Verwenden Sie die `ask.openstack.org <https://ask.openstack.org>` _ Webseite, um Fragen zu stellen und Antworten zu bekommen. Wenn Sie die `Ask OpenStack <https://ask.openstack.org>` _ Website besuchen, scannen Sie die Fragen, die bislang gestellt wurden. Wenn Ihre Frage nicht dabei ist, stellen Sie eine neue Frage. Achten Sie darauf, eine klare, prägnante Zusammenfassung im Titel und so viel Detail wie möglich in der Beschreibung zu geben. Fügen Sie Befehlsausgabe oder Stacktracks und alle anderen Informationen bei, die nützlich sein könnten.

source: EC2 Compatibility API
de: EC2 kompatible API
vi_vn: API Tương thích EC2

source: First, add the Open Build Service repository as described in the `Installation Tutorial <https://docs.openstack.org/ocata/install-guide-obs/environment-packages.html>`_.
de: Zuerst fügen Sie das Open Build Service Repository hinzu, wie in der `Installationsanleitung <https://docs.openstack.org/ocata/install-guide-obs/environment-packages.html>` _ beschrieben.

source: For SUSE Linux Enterprise Server, use ``zypper`` to install the clients from the packaged versions:
de: Für SUSE Linux Enterprise Server benutzen Sie ``zypper``, um Clients von paketierten Versionen zu installieren:

source: For details about image creation, see the `Virtual Machine Image Guide <https://docs.openstack.org/image-guide/>`__.
de: Weitere Informationen zur Erstellung von Abbildern finden Sie im Handbuch zur virtuellen Maschine <https://docs.openstack.org/image-guide/> `__.

source: For example, when you specify your password using the command-line client with the ``--os-password`` argument, anyone with access to your computer can view it in plain text with the ``ps`` field.
de: Wenn Sie zum Beispiel Ihr Passwort über den Befehlszeilenclient mit dem Argument ``--os-password`` angeben, kann jeder Benutzer, der Zugriff auf Ihren Computer hat, diesen im Klartext mit dem ``ps``-Feld anzeigen.

source: For information on requirements for other back ends, see `Configuration Reference <https://docs.openstack.org/ocata/config-reference/image.html>`__.
de: Informationen zu den Anforderungen für andere Backends finden Sie unter `Configuration Reference <https://docs.openstack.org/ocata/config-reference/image.html>` __.

source: For more information, see `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/shared-file-systems/overview.html>`__.
de: Für mehr Information schauen Sie auf `OpenStack Configuration Reference <https://docs.openstack.org/ocata/config-reference/shared-file-systems/overview.html>`__.

source: For simplicity, this guide describes configuring the Image service to use the ``file`` back end, which uploads and stores in a directory on the controller node hosting the Image service. By default, this directory is ``/var/lib/glance/images/``.
de: Der Einfachheit halber beschreibt dieses Handbuch die Konfiguration des Abbilddienstes, um das `` file`` Backend zu verwenden, das in einem Verzeichnis auf dem Controller-Knoten, der den Abbilddienst hostet, hochlädt und speichert. Standardmäßig ist dieses Verzeichnis ``/ var / lib / glance / images / ``.

source: For the available OpenStack documentation, see `docs.openstack.org <https://docs.openstack.org>`_.
de: Für verfügbare OpenStack Dokumentation schauen Sie auf `docs.openstack.org <https://docs.openstack.org>`_.

source: In this example, ``--force-host-copy`` forces the generic host-based migration mechanism and bypasses any driver optimizations. ``--lock-volume | --unlock-volume`` applies to the available volume. To determine whether the termination of volume migration caused by other commands. ``--lock-volume`` locks the volume state and does not allow the migration to be aborted.
de: In diesem Beispiel, ``--force-host-copy`` wird der generische host-basierte Migrationsmechanismus erzwungen und jegliche Treiberoptimierungen umgangen. ``--lock-volume | --unlock-volume`` überträgt die verfügbaren Datenträger. Um festzustellen, ob die Beendigung der Datenträgermigration durch andere Befehle verursacht wird, sperrt `` --lock-volume`` den Datenträgerstatus und lässt die Migration nicht zu.

source: Infrastructure Optimization service (watcher)
de: Infrastruktur-Optimierungsservice (Watcher)

source: Internet Engineering Task Force (IETF) is an open standards organization that develops Internet standards, particularly the standards pertaining to TCP/IP.
de: Internet Engineering Task Force (IETF) ist eine offene Standard-Organisation, die Internet-Standards entwickelt, vor allem die Standards für TCP/IP.

source: Layer-2 network
de: Layer-2 Netzwerk
vi_vn: Tầng mạng thứ 2

source: Layer-3 network
de: Layer-3 Netzwerk
vi_vn: mạng Layer-3

source: Load-balancing service (octavia)
de: Loadbalancing-Dienst (octavia)

source: Manage a snapshot with the :command:`openstack volume snapshot set` command:
de: Verwalten Sie eine Schattenkopie mit dem Kommando :command:`openstack volume snapshot set`:

source: Managed through REST API with UI available as part of OpenStack Dashboard.
de: Verwaltet durch REST API mit UI als Teil von OpenStack Dashboard verfügbar.

source: Many Linux distributions provide packages to make setuptools easy to install. Search your package manager for setuptools to find an installation package. If you cannot find one, download the setuptools package directly from `Python Setuptools <https://pypi.python.org/pypi/setuptools>`_.
de: Viele Linux-Distributionen bieten Pakete, um Setup-Werkzeuge einfach zu installieren. Suchen Sie Ihren Paketmanager für setuptools, um ein Installationspaket zu finden. Wenn Sie keinen finden, laden Sie das Paket setuptools direkt von `Python Setuptools <https://pypi.python.org/pypi/setuptools>` _ herunter.

source: Mediates interactions between the ``nova-compute`` service and the database. It eliminates direct accesses to the cloud database made by the ``nova-compute`` service. The ``nova-conductor`` module scales horizontally. However, do not deploy it on nodes where the ``nova-compute`` service runs. For more information, see `Configuration Reference Guide <https://docs.openstack.org/ocata/config-reference/compute/conductor.html>`__.
de: Vermittelt Interaktionen zwischen dem ``nova-compute`` Dienst und der Datenbank. Es eliminiert direkten Zugriff auf die Cloud-Datenbank, die durch den ``nova-compute`` Dienst gemacht wird. Das ``nova-conductor``-Modul skaliert horizontal. Verwenden Sie es jedoch nicht auf Knoten, auf denen der Dienst ``nova-compute`` läuft. Weitere Informationen finden Sie unter `Configuration Reference Guide <https://docs.openstack.org/ocata/config-reference/compute/conductor.html>` __.

source: Migrate a volume with the :command:`openstack volume migrate` command, as shown in the following example:
de: Migrieren Sie einen Datenträger mit dem Kommando :command:`openstack volume migrate` , wie in diesem Beispiel gezeigt:

source: Most Linux distributions include packaged versions of the command-line clients. You can directly install the clients from the packages with prerequisites. For more information, see Installing_from_packages_.
de: Die meisten Linux-Distributionen enthalten gepackte Versionen der Kommandozeilen-Clients. Sie können die Clients direkt aus den Paketen mit Vorbedingungen installieren. Weitere Informationen finden Sie unter Installing_from_packages_.

source: On Red Hat Enterprise Linux or CentOS, use ``yum`` to install the clients from the packaged versions:
de: Bei Red Hat Enterprise Linux oder CentOS verwenden Sie ``yum``, um die Clients aus den gepackten Versionen zu installieren:

source: On Red Hat Enterprise Linux, this command assumes that you have enabled the OpenStack repository. For more information, see the `Installation Tutorial for Red Hat Enterprise Linux and CentOS <https://docs.openstack.org/ocata/install-guide-rdo/environment-packages.html>`_.
de: Bei Red Hat Enterprise Linux geht dieser Befehl davon aus, dass Sie das OpenStack-Repository aktiviert haben. Weitere Informationen finden Sie in der Installationsanleitung für Red Hat Enterprise Linux und CentOS <https://docs.openstack.org/ocata/install-guide-rdo/environment-packages.html> `_.

source: OpenStack Compute interacts with OpenStack Identity for authentication; OpenStack Image service for disk and server images; and OpenStack Dashboard for the user and administrative interface. Image access is limited by projects, and by users; quotas are limited per project (the number of instances, for example). OpenStack Compute can scale horizontally on standard hardware, and download images to launch instances.
de: OpenStack Compute interagiert mit OpenStack Identity für die Authentifizierung; OpenStack Image Service für Festplatten- und Server-Abbilder; und OpenStack Dashboard für die Benutzer- und Administrationsoberfläche. Der Abbildzugriff wird durch Projekte und Benutzer begrenzt; Kontingente gibt es pro Projekt (z. B. die Anzahl der Instanzen). OpenStack Compute kann horizontal auf Standardhardware skalieren und Abbilder herunterladen, um Instanzen zu starten.

source: OpenStack project that aims to provide a flexible and scalable resource optimization service for multi-project OpenStack-based clouds.
de: OpenStack-Projekt, das einen flexiblen und skalierbaren Ressourcenoptimierungsdienst für Multi-Projekt-OpenStack-basierte Clouds anbietet.

source: OpenStack project that provides scalable, on demand, self service access to authoritative DNS services, in a technology-agnostic manner.
de: OpenStack Projekt, das bei Bedarf skalierbaren Selbstbedienungs-Zugriff auf authoritative DNS Dienste bereitstellt, in einer Technologie-agnostischen Weise.

source: Property to remove from snapshot (repeat option to remove multiple properties)
de: Eigenschaft aus der Schattenkopie entfernen (Option wiederholen, um mehrere Eigenschaften zu entfernen)

source: Provides a load balancer for TCP and HTTP-based applications that spreads requests across multiple servers.
de: Bietet einen Loadbalancer für TCP- und HTTP-basierte Anwendungen, die Anforderungen über mehrere Server verteilen.

source: RDO, openSUSE, SUSE Linux Enterprise, Debian, and Ubuntu have client packages that can be installed without pip.
de: RDO, openSUSE, SUSE Linux Enterprise, Debian und Ubuntu haben Clientpakete, die ohne Pip installiert werden können.

source: Remove all properties from <snapshot> (specify both --no-property and --property to remove the current properties before setting new properties.)
de: Löscht alle Eigenschaften von <snapshot> (spezifiziere beide --no-property und --property, um die jetzigen Eigenschaften zu löschen, bevor neue erstellt werden.)

source: Script that initializes the building of the ring file, takes daemon names as parameter and offers commands. Documented in `Managing Services <https://docs.openstack.org/developer/swift/admin_guide.html#managing-services>`_.
de: Skript, das das Bauen der Ringdatei initialisiert, Daemon-Namen als Parameter eingibt und Befehle anbietet. Dokumentiert in `Verwalten von Diensten <https://docs.openstack.org/developer/swift/admin_guide.html#managing-services>` _.

source: Snapshot to modify (name or ID).
de: Zu ändernde Schattenkopie (Name oder ID).

source: Storage ring build and rebalance utility. Documented in `Managing the Rings <https://docs.openstack.org/developer/swift/admin_guide.html#managing-the-rings>`_.
de: Dienstprogramm zum Aufbau und Wiederverwendung des Speicherrings. Dokumentiert unter `Verwalten der Ringe <https://docs.openstack.org/developer/swift/admin_guide.html#managing-the-rings>` _.

source: Supports Python 2.7, 3.4, and 3.5.
de: Unterstützt Python 2.7, 3.4 und 3.5.

source: The Compute service can send alerts through its notification system, which includes a facility to create custom notification drivers. Alerts can be sent to and displayed on the dashboard.
de: Der Compute-Dienst kann Alarme durch das Benachrichtigungssystem senden, welches die Möglichkeit bietet, angepasste Benachrichtigungstreiber zu erstellen. Alarme können an das Dashboard gesendet und angezeigt werden.

source: The Image service (glance) enables users to discover, register, and retrieve virtual machine images. It offers a :term:`REST <RESTful>` API that enables you to query virtual machine image metadata and retrieve an actual image. You can store virtual machine images made available through the Image service in a variety of locations, from simple file systems to object-storage systems like OpenStack Object Storage.
de: Mit dem Abbilddienst (glance) können Benutzer virtuelle Maschinenabbilder aussuchen, registrieren und abrufen. Es bietet ein :term: `REST <RESTful>` API, mit dem Sie virtuelle Maschinenabbild-Metadaten abfragen und ein aktuelles Abbild abrufen können. Sie können virtuelle Maschinenabbilder, die über den Abbilddienst verfügbar sind, an einer Vielzahl von Standorten speichern, von einfachen Dateisystemen bis hin zu Objektspeichersystemen wie OpenStack Object Storage.

source: The OpenStack Dashboard is a modular `Django web application <https://www.djangoproject.com/>`__ that provides a graphical interface to OpenStack services.
de: Das OpenStack Dashboard ist eine modulare `Django Web-Applikation <https://www.djangoproject.com/>` __, die eine grafische Oberfläche zu OpenStack-Diensten bietet.

source: The OpenStack Object Storage is a multi-project object storage system. It is highly scalable and can manage large amounts of unstructured data at low cost through a RESTful HTTP API.
de: Der OpenStack Object Storage ist ein Multi-Projekt-Objektspeichersystem. Es ist sehr skalierbar und kann große Mengen an unstrukturierten Daten zu niedrigen Kosten durch eine RESTful HTTP API verwalten.

source: The OpenStack community lives in the #openstack IRC channel on the Freenode network. You can hang out, ask questions, or get immediate feedback for urgent and pressing issues. To install an IRC client or use a browser-based client, go to `https://webchat.freenode.net/ <https://webchat.freenode.net>`_. You can also use `Colloquy <http://colloquy.info/>`_ (Mac OS X), `mIRC <http://www.mirc.com/>`_ (Windows), or XChat (Linux). When you are in the IRC channel and want to share code or command output, the generally accepted method is to use a Paste Bin. The OpenStack project has one at `Paste <http://paste.openstack.org>`_. Just paste your longer amounts of text or logs in the web form and you get a URL that you can paste into the channel. The OpenStack IRC channel is ``#openstack`` on ``irc.freenode.net``. You can find a list of all OpenStack IRC channels on the `IRC page on the wiki <https://wiki.openstack.org/wiki/IRC>`_.
de: Die OpenStack-Community lebt im #openstack IRC-Kanal im Freenode-Netzwerk. Sie können herumhängen, Fragen stellen oder sofortige Rückmeldung für dringende und wichtige Fragen erhalten. Um einen IRC-Client zu installieren oder einen browserbasierten Client zu verwenden, gehen Sie zu `https://webchat.freenode.net/ <https://webchat.freenode.net>` _. Sie können auch `Colloquy <http://colloquy.info/>` _ (Mac OS X), `mIRC <http://www.mirc.com/>` _ (Windows) oder XChat (Linux) verwenden. Wenn Sie im IRC-Kanal sind und Code- oder Befehlsausgabe teilen wollen, ist die allgemein anerkannte Methode, einen Paste-Bin zu verwenden. Das OpenStack-Projekt hat eins bei `Paste <http://paste.openstack.org>` _. Fügen Sie einfach Ihre längeren Mengen an Text oder Logs in das Web-Formular und Sie erhalten eine URL, die Sie in den Kanal einfügen können. Der OpenStack IRC-Kanal ist ``#openstack`` auf ``irc.freenode.net``. Sie finden eine Liste aller OpenStack IRC Kanäle auf der `IRC Seite im Wiki <https://wiki.openstack.org/wiki/IRC>` _.

source: The OpenStack community values your set up and testing efforts and wants your feedback. To log a bug, you must `sign up for a Launchpad account <https://launchpad.net/+login>`_. You can view existing bugs and report bugs in the Launchpad Bugs area. Use the search feature to determine whether the bug has already been reported or already been fixed. If it still seems like your bug is unreported, fill out a bug report.
de: Die OpenStack-Community schätzt Ihre Setup- und Testbemühungen ein und wünscht Ihr Feedback. Um einen Fehler zu protokollieren, müssen SIe sich für ein Launchpad-Konto anmelden <https://launchpad.net/+login> `_. Sie können vorhandene Fehler anzeigen und Fehler im Launchpad-Bugs-Bereich melden. Verwenden Sie die Suchfunktion, um festzustellen, ob der Fehler bereits gemeldet wurde oder bereits behoben wurde. Wenn es immer noch scheint, dass Ihr Bug nicht gemeldet wurde, füllen Sie einen Bugreport aus.

source: The OpenStack service that provides a multi-project, highly scalable, performant, fault-tolerant monitoring-as-a-service solution for metrics, complex event processing and logging. To build an extensible platform for advanced monitoring services that can be used by both operators and projects to gain operational insight and visibility, ensuring availability and stability.
de: Der OpenStack-Service, der eine Multi-Projekt-, hoch skalierbare, leistungsstarke, fehlertolerante Monitoring-as-a-Service-Lösung für Metriken, komplexe Ereignisverarbeitung und Protokollierung bietet. Um eine erweiterbare Plattform für fortgeschrittene Monitoring-Services aufzubauen, die sowohl von Betreibern als auch von Projekten genutzt werden kann, um operative Einblicke und Transparenz zu erlangen, um Verfügbarkeit und Stabilität zu gewährleisten.

source: The `OpenStack wiki <https://wiki.openstack.org/>`_ contains a broad range of topics but some of the information can be difficult to find or is a few pages deep. Fortunately, the wiki search feature enables you to search by title or content. If you search for specific information, such as about networking or OpenStack Compute, you can find a large amount of relevant material. More is being added all the time, so be sure to check back often. You can find the search box in the upper-right corner of any OpenStack wiki page.
de: Das `OpenStack wiki <https://wiki.openstack.org/>` _ enthält eine breite Palette von Themen, aber einige der Informationen können schwer zu finden oder sind ein paar Seiten tief. Glücklicherweise können Sie mit der Wiki-Suchfunktion nach Titel oder Inhalt suchen. Wenn Sie nach bestimmten Informationen suchen, z. B. über Networking oder OpenStack Compute, finden Sie eine große Menge an relevanten Material. Mehr wird die ganze Zeit hinzugefügt. Sie finden das Suchfeld in der oberen rechten Ecke einer beliebigen OpenStack Wiki Seite.

source: The ``CPU`` column shows the sum of the virtual CPUs for instances running on the host.
de: Die ``CPU`` Spalte zeigt die Summe der virtuellen CPUs für auf dem Host laufende Instanzen.
