Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: Codename for the :term:`Orchestration service <Orchestration service (heat)>`.
de: Codename für den :term:`Orchestrierungsdienst <Orchestration service (heat)>`.
ru: Кодовое имя :term:`службы оркестрации <Orchestration service (heat)>`.

source: Codename of the :term:`Identity service <Identity service (keystone)>`.
de: Codename für den :term:`Identitätsdienst <Identity service (keystone)>`.
ru: Кодовое имя для :term:`Identity service <Identity service (keystone)>`.

source: Collection of Compute components that represent the global state of the cloud; talks to services, such as Identity authentication, Object Storage, and node/storage workers through a queue.
de: Sammlung von Compute-Komponenten, die den globalen Zustand der Cloud repräsentieren; Spricht mit Diensten wie Identitätsauthentifizierung, Objektspeicher und Knoten- / Speicherarbeiter über eine Warteschlange.
ru: Набор компонентов службы вычислительных ресурсов, который представляет состояние всего облака и взаимодействует со службами (например, аутентификация службы идентификации, хранилище объектов), а также с помощью очередей связывается с рабочими процессами на узлах или хранилищах.
vi_vn: Một tập hợp các thành phần của Compute miêu tả trạng thái toàn cầu của một cloud; giao tiếp với các dịch vụ, cụ thể như xác thực danh tính Identity authentication, lưu trữ đối tượng Object Storage và các node/storage worker thông qua một trình tự.

source: Collective name for the Object Storage object services, container services, and account services.
ru: Собирательное название для служб объектов, контейнеров и учетных записей объектного хранилища.
vi_vn: Tên gọi chung cho các dịch vụ object, container và tài khoản của Object Storage.

source: Collective term for Object Storage components that provide additional functionality.
ru: Общий термин для компонентов объектного хранилища, которые обеспечивают дополнительные функциональные возможности.
vi_vn: Thuật ngữ chung cho các thành phần của Object Storage có nhiệm vụ cung cấp các tính năng bổ trợ.

source: Collective term for a group of Object Storage components that processes queued and failed updates for containers and objects.
ru: Общий термин для набора компонентов объектного хранилища, которые обрабатывают обновления с ошибкой и поставленные в очередь обновления для контейнеров и объектов.
vi_vn: Thuật ngữ chung cho một nhóm các thành phần Object Storage xử lý các cập nhật đang xếp hàng đợi hoặc thất bại cho các container và object.

source: Collects event and metering data by monitoring notifications sent from services.
de: Sammelt Ereignisse und Messwerte durch die Überwachung der vom Dienst gesendeten Nachrichten.
ru: Собирают данные о событиях и измерениях, отслеживая уведомления от служб.

source: Combination of a URI and UUID used to access Image service VM images through the image API.
de: Kombination eines URI und UUID, die für den Zugriff auf VM-Abbilder durch den Abbilddienst über die Abbild-API verwendet wird.
ru: Комбинация URI и UUID, используемая для доступа к образам ВМ службы образов через API-интерфейс службы образов.
vi_vn: Sự kết hợp của một URI và UUID được sử udnjg để truy cập vào các image máy ảo của Image service thông qua image API.

source: Command prompts
de: Befehlsaufforderungen
ru: Запросы команд

source: Command-line client overview
de: Befehlszeilen-Client-Übersicht
ru: Обзор клиента командной строки

source: Common Libraries (oslo)
de: Gemeinsame Bibliotheken (oslo)
ru: Общие библиотеки (Oslo)

source: Community project that captures Compute AMQP communications; useful for debugging.
ru: Проект сообщества, позволяющий выполнять мониторинг AMQP-соединений в службе вычислительных ресурсов. Применяется в целях отладки.
vi_vn: Dự án cộng đồng được sử dụng để bắt các giao tiếp Compute AMQP; hữu ích trong việc debug.

source: Community project that uses shell scripts to quickly build complete OpenStack development environments.
de: Gemeinschaftliches Projekt, das Shell-Skripte zum schnellen Aufbau einer kompletten OpenStack Entwicklungsumgebung benutzt.
ru: Проект сообщества, который использует скрипты оболочки, чтобы быстро создавать полные среды разработки OpenStack.
vi_vn: Một dự án cộng đồng sử dụng các shell script để xây dựng nhanh chóng các môi trường triển khai OpenStack hoàn chỉnh.

source: Community project used to run automated tests against the OpenStack API.
ru: Проект сообщества, который используется при выполнении автоматических тестов для API OpenStack.
vi_vn: Project cộng đồng dùng để chạy các bài kiểm tra tự động đối với OpenStack API.

source: Community support
ru: Поддержка сообщества

source: Companies that rent specialized applications that help businesses and organizations provide additional services with lower cost.
de: Unternehmen, die spezialisierte Anwendungen, die Unternehmen und Organisationen helfen, zusätzliche Dienste mit niedrigeren Kosten zu mieten.
ru: Компании, арендующие специализированные приложения, которые помогают компаниям и организациям предоставлять дополнительные услуги по сниженной цене.
vi_vn: Các công ty mà đã thuê các ứng dụng đặc biệt nhằm giúp các doanh nghiệp hoặc các tổ chức cung cấp các dịch vụ thêm với giá thành thấp nhất.

source: Component of Identity that provides a rule-management interface and a rule-based authorization engine.
ru: Компонент службы идентификации, который предоставляет управляемый правилами интерфейс и механизм авторизации на основе правил.
vi_vn: Một thành phần của Identity Service có tác dụng cung cấp giao diện quản lý điều lệ và một công cụ ủy quyền dựa trên các điều lệ.

source: Compute API (Nova API)
ru: API службы вычислительных ресурсов (API Nova)

source: Compute service
de: Compute Dienst
ru: Служба вычислительных ресурсов

source: Compute service (nova)
de: Compute Dienst (nova)
ru: служба вычислительных ресурсов (Nova)

source: Compute service overview
de: Compute Dienst Übersicht
ru: Обзор службы вычислительных ресурсов

source: Computer that provides explicit services to the client software running on that system, often managing a variety of computer operations. A server is a VM instance in the Compute system. Flavor and image are requisite elements when creating a server.
ru: Компьютер, которые предоставляет явные службы клиентскому ПО, выполняющемуся на системе. Часто управляет различными операциями компьютера. Сервер — инстанс ВМ в вычислительной системе. При создании сервера обязательными элементами являются тип интанса и образ.

source: Conceptual architecture
de: Konzept Architektur
ru: Концептуальная архитектура

source: Configurable option within Object Storage to limit database writes on a per-account and/or per-container basis.
ru: Настраиваемый параметр службы объектного хранилища, который позволяет ограничить число операций записи в базе данных для учетной записи и/или контейнера.
vi_vn: Tùy chọn cấu hình bên trong Object Storage để hạn chế ghi cơ sở dữ liện lên trên một cơ sở cho mỗi tài khoản và/hoặc cho mỗi container.

source: Configuration setting within RabbitMQ that enables or disables message acknowledgment. Enabled by default.
de: Konfigurationseinstellungen in RabbitMQ, die Nachrichtenbestätigungen aktivieren oder deaktivieren. Als Standard aktiviert.
ru: Настройка конфигурации RabbitMQ, включающая или отключающая подтверждение сообщений. По умолчанию включена.
vi_vn: Cài đặt cấu hình trong RabbitMQ cho phép hoặc không cho phép hiện tin nhắn xác nhận. Tính năng cho chép được bật mặc định.

source: Configures networks for guest servers.
de: Konfigurieren von Gast-Netzwerken.
ru: Настраивает сети для гостевых серверов.

source: Connected to by a direct consumer in RabbitMQ—Compute, the message can be consumed only by the current connection.
de: Verbunden mit einem direkten Verbraucher in RabbitMQ-Compute, kann die Nachricht nur durch die aktuelle Verbindung verwendet werden.
ru: В RabbitMQ используется для подключения непосредственного потребителя — службы Compute. К сообщениям такой очереди доступ имеет только текущее соединение.

source: Container Infrastructure Management service
de: Container-Infrastrukturverwaltungsdienst (magnum)
ru: Служба управления инфраструктурой контейнеров

source: Container Infrastructure Management service (magnum)
de: Container Infrastructure Management Dienst (magnum)
ru: служба управления инфраструктурой контейнеров (Magnum)

source: Container servers (swift-container-server)
de: Container Server (swift-container-server)
ru: Серверы контейнеров (swift-container-server)

source: Contains configuration information that Object Storage uses to reconfigure a ring or to re-create it from scratch after a serious failure.
de: Enthält Konfigurationsinformationen, die von Object Storage verwendet werden, um einen Ring neu zu konfigurieren oder ihn nach einem schwerwiegenden Fehler neu zu erstellen.
ru: Содержит информацию о конфигурации, которую хранилище объектов использует, чтобы повторно настроить кольцо или создать его с нуля в случае серьезного сбоя.
vi_vn: Chứa các thông tin cấu hình mà Object Storage sử dụng để cấu hình lại hoặc khởi tạo lại một ring từ đầu sau khi xảy ra hư hỏng nghiêm trọng.

source: Contains information about a user as provided by the identity provider. It is an indication that a user has been authenticated.
ru: Содержит информацию о пользователе, предоставленную провайдером идентификации. Указывает, что пользователь прошел аутентификацию.
vi_vn: Chứa các thông tin về người dùng được cung cấp bởi trình cấp identity, là dấu hiệu cho thấy người dùng đã được xác thực

source: Contains the locations of all Object Storage partitions within the ring.
ru: В индексе перечислены расположения всех разделов объектного хранилища внутри кольца.
vi_vn: Chứa địa điểm của tất cả các phân vùng của Object Storage nằm trên ring.

source: Contains the output from a Linux VM console in Compute.
de: Enthält die Ausgabe einer Linux-VM-Konsole in Compute.
ru: Отображает вывод консоли ВМ Linux в службе вычислительных ресурсов.
vi_vn: Bao gồm tín hiệu ra từ một giao diện điều khiển Linux VM trong Compute.

source: Contractual obligations that ensure the availability of a service.
ru: Оговоренные в контракте обязательства, которые гарантируют доступность службы.

source: Conventions
de: Konventionen
ru: Условные обозначения

source: Converts an existing server to a different flavor, which scales the server up or down. The original server is saved to enable rollback if a problem occurs. All resizes must be tested and explicitly confirmed, at which time the original server is removed.
ru: Преобразует существующий сервер в другой тип инстанса с целью изменения его масштаба. Исходный сервер сохраняется для обеспечения возможности отката при возникновении проблемы. Все изменения размера должны быть протестированы и явно подтверждены, после чего исходный сервер удаляется.
vi_vn: Chuyển đổi một server đang tồn tại thành một flavor khác, có thể tăng hoặc giảm kích thước server. Server ban đầu sẽ được lưu lại để cho phép rollback nếu có vấn đề xảy ra. Tất cả việc thay đổi kích cỡ đều phải được kiểm tra và xác định một cách rõ ràng thời điểm mà server ban đầu được gỡ bỏ.

source: Copy the ``PROJECT-openrc.sh`` file to the computer from which you want to run OpenStack commands.
de: Kopieren Sie die `` PROJECT-openrc.sh`` Datei auf den Computer, von dem aus Sie OpenStack Befehle ausführen möchten.
ru: Скопируйте файл ``ПРОЕКТ-openrc.sh`` на компьютер, с которого необходимо выполнять команды OpenStack.

source: Create a Database service instance using the :command:`trove create` command.
de: Erstellen Sie eine Datenbankdienstinstanz mit dem Befehl: `trove create`.
ru: Создают экземпляр службы баз данных с помощью команды :command:`trove create`.

source: Create a custom bootable volume or a volume with a large data set and transfer it to a customer.
de: Erstellen eines benutzerdefinierten bootfähigen Datenträgers oder eines Datenträgers mit einer großen Datenmenge und Übergabe an einen Kunden.
ru: Создание пользовательского загрузочного тома или тома с большим набором данных и перенос этого тома заказчику.

source: Create a volume
de: Erzeugen eines Datenträgers
ru: Создание тома

source: Create a volume from specified volume type
de: Erstellen Sie ein Datenträger aus einem bestimmten Datenträgertyp
ru: Создание тома заданного типа

source: Create a volume transfer request
de: Erstellen einer Datenträgerübertragungsanforderung
ru: Создание запроса на перенос тома

source: Create a volume with 8 gibibytes (GiB) of space, and specify the availability zone and image:
de: Erstellen Sie ein Datenträger mit 8 Gibibyte (GiB) Speicherplatz und geben Sie die Verfügbarkeitszone und das Abbild an:
ru: Создайте том размером 8 Гбайт, а также укажите зону доступности и образ:

source: Create an image for each type of database. For example, one for MySQL and one for MongoDB.
de: Erstellen Sie ein Abbild für jeden Datentyp der Datenbank. Zum Beispiel eine für MySQL und eine für MongoDB.
ru: Создает образ для каждого типа базы данных. Например, по одному образу для MySQL и MongoDB.

source: Create an image from ISO image
de: Erstellen Sie ein Abbild aus einem ISO-Image
ru: Создание образа из образа ISO

source: Create and source the OpenStack RC file
de: Erstellen und sourcen Sie die OpenStack RC-Datei
ru: Создание и выбор RC-файла OpenStack

source: Create or update an image (glance)
de: Erstellen oder Aktualisieren eines Abbildes (glance)
ru: Создание и обновление образа (Glance)

source: Creates a full Object Storage development environment within a single VM.
ru: Позволяет создать полнофункциональную среду разработки объектного хранилища внутри одиночной ВМ.
vi_vn: Tạo ra một môi trường triển khai Object Storage đầy đủ chỉ trong một máy ảo duy nhất.

source: Creates and collects measurements across OpenStack.
de: Erstellt und sammelt Messpunkte über OpenStack.
ru: Создает и собирает данные измерений по всему OpenStack.

source: Creates and manages Hadoop clusters on OpenStack.
ru: Создает и администрирует кластеры Hadoop в OpenStack.

source: Creates and manages applications.
de: Erstellen und Verwalten von Applikationen
ru: Создает и администрирует приложения.

source: Creates and manages clustering services.
de: Erstellen und Verwalten von Clusterdiensten.
ru: Создает и администрирует службы кластеризации.

source: Creates and manages containers.
de: Erstellen und Verwalten von Containern.
ru: Создает и администрирует контейнеры.

source: Creates and manages databases.
de: Erstellen und Verwalten von Datenbanken
ru: Создает и администрирует базы данных.

source: Creates and manages images, instances, and flavors.
de: Erstellen und Verwalten von Abbildern, Instanzen und Varianten.
ru: Создает и администрирует образы, экземпляры и типы.

source: Creates and manages images.
de: Erstellen und Verwalten von Abbildern.
ru: Создает и администрирует образы.

source: Creates and manages keys.
de: Erstellen und Verwalten von Schlüsseln.
ru: Создает и администрирует ключи.

source: Creates and manages self service authoritative DNS.
de: Erstellen und Verwalten selbstverwaltete authoritative DNS.
ru: Создает и администрирует полномочные DNS-серверы для управления доменными именами.

source: Creates and manages shared file systems.
de: Erstellt und verwaltet verteilte Dateisysteme.
ru: Создает и администрирует общие файловые системы.

source: Creates and manages volumes.
de: Erstellen und Verwalten von Datenträgern.
ru: Создает и администрирует тома.

source: Critical information about the risk of data loss or security issues.
de: Kritische Informationen über das Risiko von Datenverlust oder zu Sicherheitsproblemen.
ru: Критически важная информация о риске потери данных или проблемах с безопасностью.

source: Cross-Origin Resource Sharing (CORS)
ru: общий доступ к ресурсам независимо от источника (CORS)

source: Currently the libvirt virtualization tool determines the disk, CD-ROM, and VIF device models based on the configured hypervisor type (``libvirt_type`` in ``/etc/nova/nova.conf`` file). For the sake of optimal performance, libvirt defaults to using virtio for both disk and VIF (NIC) models. The disadvantage of this approach is that it is not possible to run operating systems that lack virtio drivers, for example, BSD, Solaris, and older versions of Linux and Windows.
de: Derzeit bestimmt das libvirt-Virtualisierungs-Tool die Festplatten-, CD-ROM- und VIF-Gerätemodelle auf der Basis des konfigurierten Hypervisor-Typs (`` libvirt_type`` in der Datei `` / etc / nova / nova.conf``). Aus Gründen der optimalen Leistung benutzt libvirt standardmäßig virtio für Datenträger und VIF (NIC) -Modelle. Der Nachteil dieses Ansatzes ist, dass es nicht möglich ist, Betriebssysteme ohne virtio-Treiber auszuführen, zum Beispiel BSD, Solaris und ältere Versionen von Linux und Windows.
ru: На данный момент инструмент виртуализации libvirt определяет модели диска, компакт-диска и устройства VIF исходя из настроенного типа гипервизора (``libvirt_type`` в файле ``/etc/nova/nova.conf``). Чтобы добиться оптимальной производительности, libvirt по умолчанию задает значение virtio для моделей диска и устройства VIF (NIC). У такого подхода есть недостаток — невозможно запустить операционную систему, для которой не существует драйверов virtio, например BSD, Solaris, а также устаревшие версии Linux и Windows.

source: Currently, the clients do not support Python 3.
ru: На данный момент клиенты не поддерживают Python 3.

source: Custom modules that extend some OpenStack core APIs.
de: Angepasste Module, die einige OpenStack Kern-APIs erweitern.
ru: Настраиваемые модули, которые расширяют определенные базовые интерфейсы API в OpenStack.
vi_vn: Các module tùy chỉnh có tác dụng mở rộng một vài API chính của OpenStack

source: D
ru: Д

source: DHCP agent
ru: агент DHCP

source: DNS record
de: DNS-Datensatz
ru: Запись DNS
vi_vn: bản ghi DNS

source: DNS service
de: DNS Dienst (designate)
ru: Служба DNS

source: Daemon that provides DNS, DHCP, BOOTP, and TFTP services for virtual networks.
de: Ein Dämon, der die Dienst DNS, DHCP, BOOTP und TFTP für virtuelle Netzwerke bereitstellt.
ru: Демон, предоставляющий службы DNS, DHCP, BOOTP и TFTP для виртуальных сетей.
vi_vn: Daemon có nhiệm vụ cung cấp các dịch vụ DNS, DHCP, BOOTP và TFTP cho hệ thống mạng ảo.

source: Dashboard (horizon)
ru: панель управления (Horizon)

source: Dashboard overview
de: Übersicht Dashboard
ru: Обзор панели мониторинга

source: Data Processing service
ru: Служба обработки данных

source: Data Processing service (sahara)
de: Datenverarbeitungsdienst (sahara)
ru: служба обработки данных (Sahara)

source: Data Processing service overview
de: Übersicht Datenverarbeitungsdienst
ru: Обзор службы обработки данных

source: Data loss prevention (DLP) software
ru: программное обеспечение для предотвращения потери данных (DLP)

source: Data that is only known to or accessible by a user and used to verify that the user is who he says he is. Credentials are presented to the server during authentication. Examples include a password, secret key, digital certificate, and fingerprint.
de: Daten, die nur einem Benutzer bekannt oder zugänglich sind und verwendet werden, um zu überprüfen, dass der Benutzer der ist, für den er sich ausgibt. Anmeldeinformationen werden dem Server während der Authentifizierung präsentiert. Beispiele sind ein Passwort, ein geheimer Schlüssel, ein digitales Zertifikat und ein Fingerabdruck.
ru: Данные, которые известны или доступны только пользователю, и используются для аутентификации. Учетные данные передаются на сервер в процессе аутентификации. Примеры: пароли, секретные ключи, цифровые сертификаты и отпечатки пальцев.
vi_vn: Dữ liệu chỉ được xem hoặc có quyền truy nhập bởi người dùng và được sử dụng để xác minh ai là người hợp pháp. Chứng thực được đưa ra trong quá trình xác thực tới server. Các ví dụ như mật khẩu, khóa bảo mật, chứng nhận số và dấu vân tay.

source: Database
de: Datenbank
ru: База данных

source: Database service
de: Datenbankdienst (trove)
ru: Служба базы данных

source: Database service (trove)
de: Datenbankdienst (Trove)
ru: служба базы данных (Trove)

source: Database service overview
de: Übersicht Datenbankdienst
ru: Обзор службы баз данных

source: Defines resources for a cell, including CPU, storage, and networking. Can apply to the specific services within a cell or a whole cell.
de: Definiert Ressourcen für eine Zelle, einschließlich CPU, Speicher und Netzwerk. Kann auf die spezifischen Dienste innerhalb einer Zelle oder einer ganzen Zelle Anwendung finden.
ru: Определяет ресурсы для ячейки, включая ЦП, хранилище и сеть. Можно применить к определенным службам в пределах ячейки или ко всей ячейке.
vi_vn: Định rõ các tài nguyên của một cell, bao gồm cả CPU, lưu trữ, và hệ thống mạng. Có thể được áp dụng cho các dịch vụ cụ thể trong cell hoặc toàn bộ cell.

source: Defining environment variables using an environment file is not a common practice on Microsoft Windows. Environment variables are usually defined in the :menuselection:`Advanced > System Properties` dialog box. One method for using these scripts as-is on Windows is to install `Git for Windows`_ and using Git Bash to source the environment variables and to run all CLI commands.
de: Das Definieren von Umgebungsvariablen unter Verwendung einer Umgebungsdatei ist unter Microsoft Windows keine gängige Praxis. Umgebungsvariablen werden üblicherweise in der folgenden Liste definiert: menuselection: `Erweitert> Systemeigenschaften`. Eine Methode zur Verwendung dieser Scripts wie unter Windows ist die Installation von `Git for Windows`_ und die Verwendung von Git Bash, um die Umgebungsvariablen zu erzeugen und alle CLI-Befehle auszuführen.
ru: Настройка переменных среды с помощью файла среды, как правило, не выполняется в Microsoft Windows. В этой операционной системе переменные среды обычно настраиваются в диалоговом окне `Дополнительные параметры системы > Свойства системы > Переменные среды `. Чтобы использовать скрипты "как есть" в системах Wndows, можно установить `Git for Windows`_и с помощью консоли Git Bash задать значения переменных среды для выполнения всех команд CLI.

source: Delete a volume
de: Löschen eines Datenträgers
ru: Удаление тома

source: Delete a volume transfer
de: Löschen einer Datenträgerübertragung
ru: Отмена переноса тома

source: Delete the volume using either the volume name or ID:
de: Löschen Sie den Datenträger entweder mit dem Datenträgernamen oder der ID:
ru: Удалите том по его имени или идентификатору:

source: Delete the volume:
de: Den Datenträger löschen:
ru: Удалите том:

source: Deletes all image properties that are not explicitly set in the update request. Otherwise, those properties not referenced are preserved.
ru: Удаляет все свойства образа, которые явно не заданы в запросе на обновление. При отсутствии этого параметра такие свойства сохраняются.

source: Denial of service (DoS) is a short form for denial-of-service attack. This is a malicious attempt to prevent legitimate users from using a service.
de: Denial of service (DoS) ist eine kürzere Form der denial-of-service Attacke. Es ist ein böswilliger Versuch, berechtigte Benutzer von der Verwendung eines Dienstes abzuhalten.
ru: Отказ в обслуживании (DoS) — это краткая форма DoS-атак, в ходе которых злоумышленники пытаются помешать настоящим пользователям использовать службу.
vi_vn: Từ chối dịch vụ (DoS) là tên gọi ngắn của tấn công từ chối dịch vụ. Là một nỗ lực xấu để ngăn chặn người dùng hợp pháp sử dụng dịch vụ
