Repository: openstack/openstack-manuals
Catalog: doc/common/source/locale/*/LC_MESSAGES/common.po
Languages: de, ru, vi_vn

source: **CentOS, Fedora, and Red Hat Enterprise Linux:** https://www.rdoproject.org/
de: **CentOS, Fedora und Red Hat Enterprise Linux:** https://www.rdoproject.org/
ru: **CentOS, Fedora и Red Hat Enterprise Linux:** https://www.rdoproject.org/
vi_vn: **CentOS, Fedora, và Red Hat Enterprise Linux:** https://www.rdoproject.org/

source: **Components**
de: **Komponenten**
ru: **Компоненты**

source: **Disk and CD-ROM bus model values**
de: **Festplatten- und CD-ROM-Bus Modellwerte**
ru: **Значения для модели шины диска и компакт-диска**

source: **Process flow example**
de: ** Ablaufbeispiel **
ru: **Пример технологической схемы**

source: **Red Hat Enterprise Linux, CentOS, or Fedora**
ru: **Red Hat Enterprise Linux, CentOS или Fedora**

source: **Ubuntu or Debian**
de: **Ubuntu oder Debian**
ru: **Ubuntu или Debian**

source: **VIF model values**
de: **VIF Modelwerte**
ru: **Значения модели VIF**

source: **openSUSE and SUSE Linux Enterprise Server:** https://en.opensuse.org/Portal:OpenStack
de: **openSUSE und SUSE Linux Enterprise Server:** https://en.opensuse.org/Portal:OpenStack
ru: **openSUSE и SUSE Linux Enterprise Server:** https://en.opensuse.org/Portal:OpenStack

source: *The OpenStack Image service is used to manage the virtual machine images in an OpenStack cluster, not store them.* It provides an abstraction to different methods for storage - a bridge to the storage, not the storage itself.
de: *Der OpenStack Abbilddienst wird verwendet, um die Abbilder virtueller Maschinen in einem OpenStack-Cluster zu verwalten und nicht zu speichern.* Es bietet eine Abstraktion für verschiedene Methoden für die Speicherung - eine Brücke zum Speicher, nicht die Speicherung selbst.
ru: * Служба образов OpenStack используется для управления образами виртуальных машин в кластере OpenStack, а не для их хранения.* Она обеспечивает абстрактность для разных методов хранения — связь с устройством хранения, но не само это устройство.

source: *The OpenStack Object Storage can function on its own.* The Object Storage (swift) product can be used independently of the Compute (nova) product.
de: *Der OpenStack Objektspeicher kann eigenständig funktionieren* Das Object Storage (swift) Produkt kann unabhängig vom Compute (nova) Produkt verwendet werden.
ru: * Хранилище объектов OpenStack может работать независимо.* Хранилище объектов (Swift) можно использовать независимо от службы вычислительных ресурсов (Nova).

source: *You cannot use OpenStack Object Storage like a traditional hard drive.* The Object Storage relaxes some of the constraints of a POSIX-style file system to get other gains. You can access the objects through an API which uses HTTP. Subsequently you don't have to provide atomic operations (that is, relying on eventual consistency), you can scale a storage system easily and avoid a central point of failure.
de: *Sie können OpenStack Object Storage nicht wie eine herkömmliche Festplatte verwenden.* Der Objektspeicher behebt einige der Einschränkungen eines POSIX-Dateisystems, um andere Gewinne zu erzielen. Sie können auf die Objekte über eine API zugreifen, die HTTP verwendet. Anschließend müssen Sie keine atomaren Operationen bereitstellen (d.h. auf Konsistenz beruhend), können Sie ein Speichersystem einfach skalieren und einen verhindert eine zentrale Fehlerstelle.
ru: * Хранилище объектов OpenStack невозможно использовать как обычный жесткий диск.* Хранилище объектов обладает некоторыми недостатками POSIX-совместимых файловых систем, но предоставляет другие преимущества. Доступ можно получить через API, который использует HTTP. В результате можно не беспокоится об отдельных операциях (полагаясь на итоговую согласованность), удобно масштабировать систему хранения, не создавая единую точку отказа.

source: A BLOB of data held by Object Storage; can be in any format.
ru: Большой двоичный объект данных, хранимый в объектном хранилище. Может быть любого формата.
vi_vn: Một BLOB dữ liệu được lưu giữ bởi Object Storage; có thể ở bất kì định dạng nào.

source: A Block Storage component that creates, attaches, and detaches persistent storage volumes.
de: Eine Blockspeicherkomponente, die dauerhafte Speichervolumes erstellt, anhängt und löst.
ru: Компонент блочного хранилища, который создает, подключает и отключает постоянные диски хранилища.
vi_vn: Một thành phần của Block Storage có nhiệm vụ khởi tạo, gắn và tháo rời các ổ lưu trữ liên tục.

source: A Block Storage component that oversees and coordinates storage volume actions.
de: Eine Blockspeicher-Komponente, die Datenträgeraktionen der Storage koordiniert und überwacht.
ru: Компонент блочного хранилища, который управляет и координирует действиями дисками хранилища.
vi_vn: Một thành phần của Block Storage phụ trách việc giám sát và điều hành các hoạt động của ổ lưu trữ.

source: A Block Storage node that runs the cinder-volume daemon.
de: Ein Blockspeicherknoten, auf dem der Cinder-volume Dämon läuft.
ru: Узел блочного хранилища, на котором выполняется демон cinder-volume.

source: A Block Storage volume plug-in that enables communication with the Xen Storage Manager API.
de: Ein Plug-in für Block Storage Datenträger, das die Kommunikation mit der Xen Storage Manager API ermöglicht.
ru: Плагин диска блочного хранилища, который обеспечивает связь с API диспетчера хранилища Xen
vi_vn: Một khối lưu trữ dữ liệu được ghép vào nhằm thiết lập kết nối với bộ quản lí lưu trữ dữ liệu của Xen API.

source: A CLI that communicates with the ``heat-api`` to run AWS CloudFormation APIs. End developers can directly use the Orchestration REST API.
de: Eine CLI, die mit dem ``heat-api`` kommuniziert, um AWS CloudFormation APIs auszuführen. End-Entwickler können direkt die Orchestration REST API benutzen.
ru: CLI, который связывается с ``heat-api``, чтобы запустить :term:`AWS` CloudFormation API. Конечные разработчики могут непосредственно использовать интерфейс REST API службы оркестрации.

source: A CLI that communicates with the ``trove-api`` component.
de: Eine CLI, die mit der ``trove-api``-Komponente kommuniziert.
ru: Интерфейс командной строки, связанный с компонентом ``trove-api``.

source: A Ceph component that communicates with external clients, checks data state and consistency, and performs quorum functions.
de: Eine Ceph-Komponente, die mit externen Clients kommuniziert, überprüft den Datenzustand und die Konsistenz und führt Quorumfunktionen aus.
ru: Компонент Ceph, который взаимодействует с внешними клиентами, проверяет состояние и целостность данных, а также реализует функции кворума.
vi_vn: Thành phần của Ceph có nhiệm vụ giao tiếp với các client bên ngoài, kiểm tra trạng thái và tính nhất quan của dữ liệu và thực hiện các chức năng đại biểu.

source: A Compute API parameter that downloads changes to the requested item since your last request, instead of downloading a new, fresh set of data and comparing it against the old data.
de: Ein Rechen-API-Parameter, der Änderungen an dem angeforderten Element seit Ihrer letzten Anforderung herunterlädt, anstatt einen neuen, frischen Datensatz herunterzuladen und ihn mit den alten Daten zu vergleichen.
ru: Параметр API службы вычислительных ресурсов, который позволяет загружать изменения для запрашиваемого элемента с момента последнего запроса, вместо загрузки нового набора данных и сравнения их с прежними данными.
vi_vn: Một thông số của Compute API có tác dụng tải xuống các thay đổi đối với mục được yêu cầu kể từ lần cuối bạn yêu cầu nó, thay vì tải về một bộ dữ liệu mới và só sánh nó với dữ liệu cũ.

source: A Compute RabbitMQ message queue that remains active when the server restarts.
de: Eine Compute RabbitMQ Nachrichtenwarteschlange, die beim Neustart des Servers aktiv bleibt.
ru: Очередь сообщений RabbitMQ службы вычислительных ресурсов, которая остается активной при перезагрузке сервера.
vi_vn: Một trình tự thông điệp Compute RabbitMQ mà vẫn hoạt động khi khởi động lại máy chủ

source: A Compute RabbitMQ setting that determines whether a message exchange is automatically created when the program starts.
de: Eine Compute RabbitMQ Einstellung, die festlegt, ob ein Nachrichtenaustausch direkt nach dem Programmstart automatisch erfolgen soll.
ru: Настройка RabbitMQ в службе вычислительных ресурсов, определяющая автоматический обмен сообщениями при запуске программы.
vi_vn: Một tùy chỉnh của Compute RabbitMQ được dùng để quyết định xem một quá tình trao đổi tin nhắn có được tự động tạo ra khi khởi động chương trình hay không.

source: A Compute back-end database table that contains the current workload, amount of free RAM, and number of VMs running on each host. Used to determine on which host a VM starts.
de: Eine Compute-Back-End-Datenbanktabelle, die die aktuellen Arbeitsabläufe, die Menge an freiem RAM und die Anzahl der auf jedem Host ausgeführten VMs enthält. Wird verwendet, um festzustellen, auf welchem Host eine VM startet.
ru: Таблица серверной базы данных в службе вычислительных ресурсов содержит сведения о текущей нагрузке, свободной памяти ОЗУ, а также количество виртуальных машин, запущенных на каждом хосте. Используется, чтобы определить, на каком хосте запущена виртуальная машина.

source: A Compute component that determines where VM instances should start. Uses modular design to support a variety of scheduler types.
ru: Компонент службы вычислительных ресурсов, который определяет, где должны запускаться инстансы ВМ. Использует модульный дизайн с целью поддержки различных типов планировщиков.
vi_vn: Một thành phần của Compute xác định nơi mà các máy ảo VM nên khởi động. Sử dụng các module thiết kế để hỗ trợ một loạt các loại lịch trình.

source: A Compute component that enables OpenStack to communicate with Amazon EC2.
de: Eine Compute-Komponente, mit der OpenStack mit Amazon EC2 kommunizieren kann.
ru: Компонент службы Compute, позволяющий OpenStack взаимодействовать с Amazon EC2.
vi_vn: Một thành phần của Compute cho phép OpenStack giao tieps với Amazon EC2.

source: A Compute component that manages IP address allocation, firewalls, and other network-related tasks. This is the legacy networking option and an alternative to Networking.
ru: Компонент службы вычислительных ресурсов, который управляет выделением IP-адресов, настройками брандмауэров и другими сетевыми задачами. Это устаревший вариант управлением сетью, альтернативный службе Networking.
vi_vn: Một thành phần của Compute quản lý việc phân bổ địa chia IP, tường lửa và các công việc liên quan đến hệ thống mạng khác. Đây là một tùy chọn của hệ thống mạng legacy và là một sự lựa chọn khác bên cạnh Networking.

source: A Compute component that provides dnsmasq and radvd and sets up forwarding to and from cloudpipe instances.
de: Eine Compute-Komponente, die dnsmasq und radvd bereitstellt und die Weiterleitung zu und von Cloudpipe-Instanzen aufbaut.
ru: Компонент службы вычислительных ресурсов, который обеспечивает работу сервера dnsmasq и демона radvd, а также настраивает маршрутизацию с инстансами cloudpipe.
vi_vn: Một thành phần của Compute cung cấp dnsmasq và radvd, và thiết lập việc chuyển tới và đi từ đường cloud của các máy ảo.

source: A Compute component that provides users access to the consoles of their VM instances through VNC or VMRC.
de: Eine Compute-Komponente, die Benutzern Zugriff auf die Konsolen ihrer VM-Instanzen über VNC oder VMRC bietet.
ru: Компонент службы вычислительных ресурсов, который обеспечивает пользователям доступ к консолям их инстансов ВМ через VNC или VMRC.
vi_vn: Một thành phần của Compute để hỗ trợ người dùng truy cập vào giao diện điều khiển các VM instance của họ thông qua VNC hoặc VMRC.

source: A Compute component that, along with the notification system, collects meters and usage information. This information can be used for billing.
ru: Компонент службы вычислительных ресурсов, который совместно с системой уведомлений собирает метрики и сведения об использовании ресурсов. Эти сведения можно использовать для выставления счетов.
vi_vn: Một thành phần của Compute, cùng với hệ thống thông báo, thu thập các máy đo và các thông tin cần thiết. Thông tin có thể được sử dụng để thanh toán.

source: A Compute daemon that orchestrates the network configuration of nodes, including IP addresses, VLANs, and bridging. Also manages routing for both public and private networks.
ru: Демон службы вычислительных ресурсов, который настраивает сетевую конфигурацию узлов, включая IP-адреса, VLAN и мосты. Также управляет маршрутизацией в общественных и частных сетях.
vi_vn: Một máy ảo Compute phân bố cấu hình mạng của các nodes, bao gồm địa chỉ IP, VLAN, và bridging. Cũng quản lý việc định tuyến cho cả các mạng public và private,

source: A Compute networking method where the OS network configuration information is injected into the VM image before the instance starts.
de: Eine Netzwerkmethode von Compute, bei der die OS-Netzwerkkonfigurationsinformationen in das VM-Abbild injiziert werden, bevor die Instanz startet.
ru: Метод настройки сети службой Compute, при котором сетевая конфигурация ОС внедряется в образ виртуальной машины до запуска инстанса.
vi_vn: Một phương thức của Compute networking khi mà thông tin cấu hình mạng của OS được truyền vào image máy ảo trước khi instance khởi động.

source: A Compute option that enables parent cells to pass resource requests to child cells if the parent cannot provide the requested resource.
de: Eine Compute-Option die Elternzellen ermöglicht, Ressourcenanfragen and Kind-Zellen weiterzuleiten, wenn der Elter die angefragte Ressource nicht bereitstellen kann.
ru: Возможность службы вычислительных ресурсов, позволяющая родительским ячейкам передавать запросы на получение ресурсов дочерним ячейкам, если родительская ячейка не может предоставить этот ресурс.
vi_vn: Một tùy chọn của Compute cho phép các cell mẹ chuyển các yêu cầu tài nguyên đến các cell con trong trường hợp cell mẹ không tể cung cấp tài nguyên đó.

source: A Compute process that determines the suitability of the VM instances for a job for a particular host. For example, not enough RAM on the host, too many CPUs on the host, and so on.
de: Ein Compute-prozess, der die Eignung der VM-Instanzen für einen Job für einen bestimmten Host bestimmt. Zum Beispiel, nicht genug RAM auf dem Host, zu viele CPUs auf dem Host, und so weiter.
ru: Процесс вычислительной службы, который определяет то, насколько инстанс ВМ подходит для выполнения задания для определенного хоста. Например, на хосте может оказаться недостаточно ОЗУ, установлено слишком много ЦП и т. д.
vi_vn: Một quá trình của Compute có nhiệm vụ xác định mức độ phù hợp của các VM instance đối với một công việc của một host cụ thể. Ví dụ, không đủ RAM trên host, quá nhiều CPU trên host và hơn thế nữa.

source: A Debian-based Linux distribution.
de: Eine Debian-basierte Linux Distribution.
ru: Основанный на Debian дистрибутив.
vi_vn: Một hệ điều hành Linux nền tảng Debian.

source: A Java program that can be embedded into a web page.
de: Ein Java-Programm, das in eine Webseite eingebettet werden kann.
ru: Программа на языке Java, которая встраивается в веб-страницу.
vi_vn: Một chương trình Java có thể nhúng được vào trang web.

source: A Linux distribution compatible with OpenStack.
de: Eine mit OpenStack kompatible Linux Distribution
ru: Linux-дистрибуция, совместимая с OpenStack.
vi_vn: Một hệ điều hành nền tảng Linux tương thích với OpenStack.

source: A Linux distribution that is compatible with OpenStack.
de: Eine mit OpenStack kompatible Linux Distribution
ru: Дистрибутив Linux, совместимый с OpenStack.
vi_vn: Một phiên bản hệ điều hành nền tảng Linux phù hợp với OpenStack.

source: A Networking extension that provides perimeter firewall functionality.
de: Eine Netzwerkerweiterung, die umfangreiche Firewall Funktionalität anbietet.
ru: Расширение управления сетью, обеспечивающее возможность блокировки по периметру для брандмауэра.
vi_vn: Một phần mở rộng của Networking cung cấp các chức năng firewall vòng ngoài.

source: A Networking plug-in for Cisco devices and technologies, including UCS and Nexus.
de: Ein Netzwerk-Plugin für Cisco-Geräte und Technologien, incl. UCS und Nexus.
ru: Сетевой плагин для устройств и технологий Cisco, включая UCS и Nexus.
vi_vn: Một Networking plug-in dùng cho các thiết bị và công nghệ của Cisco, bao gồm UCS và Nexus.

source: A SQLite database that contains Object Storage accounts and related metadata and that the accounts server accesses.
de: Eine SQLite-Datenbank, die Object Storage-Konten und verwandte Metadaten enthält und auf die der Kontenserver zugreift.
ru: База данных SQLite, содержащая учетные записи хранилища объектов, связанные метаданные и элементы, к которым обращается сервер учетных записей.
vi_vn: Một cơ sở dữ liệu SQLite chứa các account lưu trữ đối tượng, các metadata có liên quan, và các account truy nhập server.

source: A SQLite database that stores Object Storage containers and container metadata. The container server accesses this database.
de: Eine SQLite-Datenbank, die Object Storage-Container und Container-Metadaten speichert. Der Container-Server greift auf diese Datenbank zu.
ru: База данных SQLite, в которой хранятся контейнеры хранилища объектов и их метаданные. К этой базе данных обращается сервер контейнера.
vi_vn: Cơ sở dữ liệu SQLite chứa các Object Storage cointainer và container metadata. Container server truy cập vào cơ sở dữ liệu này.

source: A Shared File Systems service that provides a stable RESTful API. The service authenticates and routes requests throughout the Shared File Systems service. There is python-manilaclient to interact with the API.
ru: Служба общей файловой системы, которая предоставляет стабильный RESTful API. Служба авторизует и маршрутизирует запросы в службу общих файловых систем. Существует клиент python-manila для взаимодействия с API.

source: A VM image that does not save changes made to its volumes and reverts them to their original state after the instance is terminated.
de: Ein VM Abbild, das keine Änderungen auf seinen Datenträgern speichert und sie nach Beenden in ihren Originalzustand zurücksetzt.
ru: Виртуальная машина, которая не сохраняет изменения, внесенные на ее тома, и возвращает их в исходное состояние, когда инстанс завершает работу.
vi_vn: Một image máy ảo không lưu lại các thay đổi được thực hiện đối với các ổ lưu trữ của nó và chuyển chúng về trạng thái ban đầu sau khi instance được hủy.

source: A VM instance that runs on a host.
ru: Инстанс ВМ, который выполняется на хосте.
vi_vn: Một máy ảo VM chạy trên một host.

source: A VM state where no changes occur (no changes in memory, network communications stop, etc); the VM is frozen but not shut down.
ru: Состояние ВМ, при котором не происходит никаких изменений (нет изменений в памяти, сетевые соединения остановлены и т.д.). ВМ остановлена, но не выключена.
vi_vn: Một trạng thái của VM mà ở đó không có thay đổi nào xảy ra (không có thay đổi về bộ nhớ, các giao tiếp mạng được dừng lại, vân vân..); máy ảo ở trạng thái đông cứng nhưng không được tắt đi.

source: A WSGI app that authenticates and routes requests throughout the Shared File Systems service. It supports the OpenStack APIs.
de: Eine WSGI-App, die Anforderungen im gesamten Dienst für freigegebene Dateisysteme authentifiziert und weiterleitet. Sie unterstützt die OpenStack APIs.
ru: Приложение WSGI, которое авторизует и маршрутизирует запросы в службу общих файловых систем с поддержкой OpenStack API.

source: A Windows project providing guest initialization features, similar to cloud-init.
de: Ein Windows-Projekt, das Gastinitialisierungsfunktionen bietet, ähnlich wie cloud-init.
ru: Windows-проект, обеспечивающий функции инициализации гостевых виртуальных машин. Аналог проекта cloud-init.
vi_vn: Một dự án của Windows cung cấp các tính năng khởi tạo cho khách, tương tự như cloud-init.

source: A XenAPI component that provides a pluggable interface to support a wide variety of persistent storage back ends.
ru: Компонент XenAPI, который предоставляет расширяемый интерфейс для поддержки разнообразных серверных постоянных хранилищ.
vi_vn: kho lưu trữ

source: A bit is a single digit number that is in base of 2 (either a zero or one). Bandwidth usage is measured in bits per second.
de: Ein Bit ist ein einzelne Ziffer einer Zahl mit der Basis 2 (entweder null oder eins). Bandbreitenverwendung wird in Bit pro Sekunde gemessen.
ru: Бит — это одноразрядное двоичное число (ноль или единица). Уровень использования пропускной способности измеряется в битах в секунду.
vi_vn: Một bit là một số đơn lẻ thuộc hệ nhị phân (0 hoặc 1). Mức độ sử dụng băng thông được đo bằng bits trên giây.

source: A blob of data that the user can specify when they launch an instance. The instance can access this data through the metadata service or config drive. Commonly used to pass a shell script that the instance runs on boot.
ru: BLOB--объект данных, который может задать пользователь, когда запускает инстанс. Инстанс получает доступ к этим данным с помощью службы метаданных или диска конфигурации.

source: A central agent (``ceilometer-agent-central``)
de: Ein zentraler Agent (``ceilometer-agent-central``)
ru: Центральный агент (``ceilometer-agent-central``)

source: A central hub for passing messages between daemons. Usually implemented with `RabbitMQ <http://www.rabbitmq.com/>`__, also can be implemented with another AMQP message queue, such as `ZeroMQ <http://www.zeromq.org/>`__.
ru: Центральная точка обмена сообщениями демонов. Обычно реализуется с помощью `RabbitMQ <http://www.rabbitmq.com/>`__, но может быть и другая реализация очереди сообщений AMQP, например `ZeroMQ <http://www.zeromq.org/>`__.

source: A centralized server provides authentication and authorization services using a RESTful interface.
de: Ein zentralisierter Server bietet Authentifizierung und Autorisierung mittels eines RESTful Interfaces.
ru: Централизованный сервер, предоставляющий службы аутентификации и авторизации с помощью интерфейса RESTful.

source: A cinder component that interacts with back-end storage to manage the creation and deletion of volumes and the creation of compute volumes, provided by the cinder-volume daemon.
de: Eine Cinder-Komponente, die mit Back-End-Speicher interagiert, um die Erstellung und Löschung von Datenträgern und die Erstellung von Berechnungsvolumina zu verwalten, die vom Cinder-Datenträger-Daemon bereitgestellt werden.
ru: Компонент службы Сinder, который взаимодействует с внутренним хранилищем для создания и удаления дисков, а также для создания вычислительных дисков, созданных демоном cinder-volume.

source: A cli tool used to retrieve various metrics and telemetry information about a cluster that has been collected by the swift-recon middleware.
de: Ein Cli-Tool, das verwendet wird, um verschiedene Metriken und Telemetrie-Informationen über einen Cluster abzurufen, der von der Swift-Recon-Middleware gesammelt wurde.
ru: Средство интерфейса командной строки используется, чтобы получить различные метрики и телеметрическую информацию о кластере, собранную промежуточным ПО swift-recon.

source: A collection of command-line tools for administering VMs; most are compatible with OpenStack.
de: Eine Sammlung von Kommandozeilenprogrammen zur Administration von VMs. Die meisten sind kompatibel mit OpenStack.
ru: Собрание средств командной строки для администрирования виртуальных машин; большинство средств совместимы с OpenStack.
vi_vn: Một bộ các công cụ dòng lệnh dùng để quản trị các máy ảo; phần lớn tương thích với OpenStack.

source: A collection of components that provides object storage within Ceph. Similar to OpenStack Object Storage.
ru: Набор компонентов, который предоставляет хранилище объектов в Ceph. Подобен объектному хранилищу OpenStack.
vi_vn: Một tập hợp các thành phần cung cấp object storage nằm trong Ceph. Tương tự nhu Object Storage của OpenStack.
