Repository: openstack/openstack-manuals
Catalog: doc/api-quick-start/source/locale/*/LC_MESSAGES/api-quick-start.po
Languages: de, eo, id, ko_kr, zh_cn

source: `Orchestration API v1 <https://developer.openstack.org/api-ref/orchestration/v1/>`__
zh_cn: `编配API v1 <https://developer.openstack.org/api-ref/orchestration/v1/>`__

source: `Search API v1 <https://developer.openstack.org/api-ref/search>`__
zh_cn: `搜 API v1 <https://developer.openstack.org/api-ref/search>`__

source: password (required)
de: Passwort (erforderlich)
eo: pasvorto (nepras)
id: password (wajib)
ko_kr: password (필수 항목)
zh_cn: 密码 (必需有)

source: string
de: Zeichenkette
eo: ĉeno
zh_cn: 字符串

source: username (required)
de: Benutzername (erforderlich)
eo: uzantonomo (nepras)
id: username (wajib)
ko_kr: username (필수 항목)
zh_cn: 用户名 (必需有)

source: 'Current' indicates a stable version that is up-to-date, recent, and might receive future versions. This endpoint should be prioritized over all others.
de: 'Current' bezeichnet eine stabile Version, die up-to-date ist und ggf. Versionsaktualisierungen erhalten wird. Dieser Endpunkt sollten vor allen anderen bevorzugt werden.
eo: 'Nuna' indikas stabilan version kiu estas ĝisdatigita, lastatempe, kaj eble ricevas estontajn versiojn. Ĉi tiu finpunkto devas esti prioritita super ĉiuj aliaj.
id: 'Current' menunjukkan versi stabil yang mutakhir, terkini, dan mungkin menerima versi mendatang. Endpoint ini harus diprioritaskan daripada yang lainnya.
ko_kr: '최신 버전(Current)' 이란 최신으로 업데이트되었으며 이후 버전에서 포함될 안정 버전을 의미합니다. 해당 엔드 포인트는 다른 모든 것보다 우선되어야 합니다.

source: 'Deprecated' is a stable version that is still available but is being deprecated and might be removed in the future.
de: 'Deprecated' ist eine stabile Version, die noch verfügbar aber veraltet ist und eventuell in Zukunft entfernt wird.
eo: 'Evitinda' estas stabila versio kiu ankoraŭ estas havebla sed estas evitinda kaj povus esti forigita en la estonteco.
id: 'Deprecated' is adalah versi stabil yang masih tersedia tetapi sedang usang dan mungkin dihapus di masa depan.
ko_kr: '지원 중단(Deprecated)' 이란 여전히 사용 가능한 안정 버전이나, 지원이 중단되었으며 미래에 제거될 수 있음을 의미합니다.

source: 'Experimental' is not a stable version. This version is under development or contains features that are otherwise subject to change.
de: 'Experimental' ist keine stabile Version. Diese Version ist in Entwicklung oder enthält Eigenschaften die sich noch ändern können.
eo: 'Eksperimenta' ne estas stabila versio. Ĉi tiu versio estas evoluanta aŭ enhavas trajtojn, kiuj alie ŝanĝos.
id: 'Experimental' bukan versi stabil. Versi ini sedang dikembangkan atau berisi fitur yang dapat berubah sewaktu-waktu.
ko_kr: '실험적인(Experimental)' 은 안정 버전이 아님을 의미합니다. 해당 버전은 아직 개발 중에 있거나 변경 될 수 있는 다른 기능이 포함되어 있습니다.

source: 'Supported' is a stable version that is available on the server. However, it is not likely the most recent available and might not be updated or might be deprecated at some time in the future.
de: 'Supported' ist eine stabile Version, die auf dem Server verfügbar ist. Sie ist aber wahrscheinlich nicht die neueste verfügbare Version und wird vielleicht nicht aktualisiert oder wird in Zukunft als deprecated erklärt.
eo: 'Subtenita' estas stabila versio kiu estas disponebla sur la servilo. Tamen, ĝi verŝajne ne estas la plej lastatempa havebla kaj eble ĝi ne estas ĝisdatigita aŭ povus esti ekskludita iamtempe en la estonteco.
id: 'Supported' adalah versi stabil yang tersedia di server. Namun, ini sepertinya bukan yang terbaru yang tersedia dan mungkin tidak diperbarui atau mungkin ditinggalkan pada suatu waktu di masa depan.
ko_kr: '지원(Supported)' 이란 서버에 사용가능한 안정 버전을 의미합니다. 그러나 이것은 항상 최신 버전을 뜻하는 것은 아니며 업데이트 되거나, 미래에 지원이 중단될 수 있습니다.

source: Both Mozilla and Google provide browser-based graphical interfaces for REST. For Firefox, see `RESTClient <https://addons.mozilla.org/en-US/firefox/addon/restclient/>`__. For Chrome, see `rest-client <https://code.google.com/archive/p/rest-client/>`__.
de: Sowohl Mozilla wie auch Google bieten browserbasierte grafische Oberflächen für REST. Für Firefox, siehe `RESTClient <https://addons.mozilla.org/en-US/firefox/addon/restclient/>`__. Für Chrome, siehe `rest-client <https://code.google.com/archive/p/rest-client/>`__.
id: Baik Mozilla dan Google menyediakan antarmuka grafis berbasis browser untuk REST. Untuk Firefox, lihat `RESTClient <https://addons.mozilla.org/en-US/firefox/addon/restclient/>` __. Untuk Chrome, lihat `rest-client <https://code.google.com/archive/p/rest-client/>` __.
ko_kr: Mozilla와 Google 모두 REST를 위한 브라우저 기반의 그래픽 인터페이스를 제공합니다. Firefox는 `RESTClient <https://addons.mozilla.org/en-US/firefox/addon/restclient/>`__ 를 살펴보세요. Chrome은 `rest-client <https://code.google.com/archive/p/rest-client/>`__ 을 살펴보세요.

source: Credential parameters
de: Parameter für Zugangsdaten
id: Parameter kredensial
ko_kr: Credential 매개 변수

source: For information about the default ports that the OpenStack components use, see `Firewalls and default ports <https://docs.openstack.org/install-guide/firewalls-default-ports.html>`_ in the *OpenStack Installation Guide*.
de: Informationen zu den von den OpenStack Komponenten verwendeten Standardports finden Sie unter `Firewalls und Standardports <https://docs.openstack.org/install-guide/firewalls-default-ports.html>`_ in der *OpenStack Installationsanleitung*.
id: Untuk informasi tentang port default yang digunakan komponen OpenStack, lihat `Firewalls and default ports <https://docs.openstack.org/install-guide/firewalls-default-ports.html>`_ dalam *OpenStack Installation Guide*.
ko_kr: OpenStack 구성요소들이 사용하는 디폴트 포트에 관한 정보는, *OpenStack Installation Guide* 내 `Firewalls and default ports <https://docs.openstack.org/install-guide/firewalls-default-ports.html>`_ 를 살펴봅니다.

source: For more information about API status values and version information, see `Version Discovery <https://wiki.openstack.org/wiki/VersionDiscovery>`__.
de: Weitere Informationen zu den API Status Werten und Versionsinformationen finden Sie unter `Version Discovery <https://wiki.openstack.org/wiki/VersionDiscovery>`__.
eo: Por pliaj informoj pri API-statusaj valoroj kaj versiaj informoj, vidu `Version Discovery <https://wiki.openstack.org/wiki/VersionDiscovery>`__.
id: Untuk informasi lebih lanjut tentang nilai status API dan informasi versi, lihat `Version Discovery <https://wiki.openstack.org/wiki/VersionDiscovery>`__.
ko_kr: API status values나 버전 정보에 대해 더 알고 싶다면 `Version Discovery <https://wiki.openstack.org/wiki/VersionDiscovery>`__ 문서를 살펴 봅니다.

source: The links below are grouped according to the API status that reflects the state of the endpoint on the service.
de: Die Links weiter unten sind gruppiert entsprechend dem API-Status welcher den Status des Endpunktes des Services beschreibt.
eo: La ligiloj sube estas grupigitaj laŭ la API-statuso, kiu reflektas la staton de la finpunkto sur la servo.
id: Tautan di bawah ini dikelompokkan berdasarkan status API yang mencerminkan keadaan titik akhir pada layanan.
ko_kr: 아래 링크는 서비스의 엔드포인트 상태를 반영하는 API 상태에 따라 그룹화됩니다.

source: The notation '(microversions)' next to the link to an API reference indicates that the API follows a `pattern established by the Compute service <https://docs.openstack.org/api-guide/compute/microversions.html>`__ to enable small, documented changes to the API on a resource-by-resource basis.
de: Die Bezeichung '(microversions)' neben einer API Referenz zeigt an, dass das API einem `vom Compute Dienst eingeführten Muster folgt <https://docs.openstack.org/api-guide/compute/microversions.html>`__ um kleinere, dokumentierte Änderungen an dem API auf einer Ressourcen-Basis zu ermöglichen.
id: Notasi '(microversions)' di sebelah tautan ke referensi API menunjukkan bahwa API mengikuti `pattern established by the Compute service <https://docs.openstack.org/api-guide/compute/microversions.html>`__ untuk mengaktifkan perubahan kecil, yang terdokumentasi pada API berdasarkan sumber daya.
ko_kr: API 레퍼런스 링크 다음에 있는 '(마이크로버전)' 표시는 resource-by-resource 기반의 API에 작고 문서화된 변경을 가능하게 하기 위해 `pattern established by the Compute service <https://docs.openstack.org/api-guide/compute/microversions.html>`__ 를 따르는 API를 가리킵니다.

source: This section shows how to make some basic Compute API calls. For a complete list of Compute API calls, see `Compute API <https://docs.openstack.org/api-ref/compute/>`__.
de: Diese Sektion zeigt wie man einfache Compute API Aufrufe tätigt. Für die komplette Liste der Compute API Aufrufe lesen Sie `Compute API <https://docs.openstack.org/api-ref/compute/>`__.
id: Bagian ini menunjukkan cara membuat beberapa panggilan Compute API dasar. Untuk daftar lengkap panggilan Compute API, lihat `Compute API <https://docs.openstack.org/api-ref/compute/>`__.
ko_kr: 이번 섹션에서는 어떻게 기본 Compute API 요청을 생성할 것인지에 대해 알려줍니다. 전체 Compute API 요청 리스트는 `Compute API <https://docs.openstack.org/api-ref/compute/>`__ 를 참고하세요.

source: Use ``pip`` to install the OpenStack clients on a Mac OS X or Linux system. It is easy and ensures that you get the latest version of the client from the `Python Package Index <https://pypi.org/>`__. Also, ``pip`` lets you update or remove a package.
de: Benutzen Sie ``pip`` um OpenStack Clients auf Mac OS X oder einem Linux System zu installieren. Es ist einfach und stellt sicher, dass Sie die aktuellste Version der Clients von dem `Python Package Index <https://pypi.org/>`__ bekommen. Außerdem lässt Sie ``pip`` Pakete aktualisieren oder entfernen.
id: Gunakan ``pip`` untuk menginstal klien OpenStack pada sistem Mac OS X atau Linux. Mudah dan memastikan bahwa Anda mendapatkan versi terbaru dari klien dari `Python Package Index <https://pypi.org/>` __. Juga, ``pip`` memungkinkan Anda memperbarui atau menghapus paket.
ko_kr: ``pip`` 를 사용하여 OpenStack 클라이언트를 Mac OS X 또는 Linux 시스템에 설치합니다. 쉬우며 `Python Package Index <https://pypi.org/>`__ 으로부터 최신 버전의 클라이언트를 얻는 것을 보장합니다. 또한, ``pip`` 로 패키지를 업데이트하거나 제거할 수 있습니다.

source: With the `TryStack <https://www.openstack.org/software/start>`__ OpenStack installation, these services work together in the background of the installation, and many of these examples work on TryStack.
de: Bei der `TryStack <https://www.openstack.org/software/start>`__ OpenStack Installation arbeiten diese Dienste zusammen im Hintergrund und viele der Beispiele funktionieren auf TryStack.
id: Dengan `TryStack <https://www.openstack.org/software/start>` __ instalasi OpenStack, layanan ini bekerja bersama di latar belakang instalasi, dan banyak dari contoh ini bekerja di TryStack.
ko_kr: `TryStack <https://www.openstack.org/software/start>`__ 설치를 통해, 해당 서비스들이 설치 과정의 백그라운드에서 함께 작동하며, 상당수의 예제를 TryStack에서 작동시킬 수 있습니다.

source: `Admin Logic API <https://docs.openstack.org/api-ref/admin-logic/>`__
de: `Admin Logik API <https://docs.openstack.org/api-ref/admin-logic/>`__

source: `Block Storage API v3 <https://docs.openstack.org/api-ref/block-storage/v3/>`__ (microversions)
de: `Blockspeicher API v3 <https://docs.openstack.org/api-ref/block-storage/v3/>`__

source: `Container Infrastructure Management API <https://docs.openstack.org/api-ref/container-infrastructure-management/>`__ (microversions)
de: `Container Infrastruktur Management API <https://docs.openstack.org/api-ref/container-infrastructure-management/>`__ (Microversions)

source: `Database Service API v1.0 <https://docs.openstack.org/api-ref/database/>`__
de: `Datenbankdienst API v1.0 <https://docs.openstack.org/api-ref/database/>`__

source: `Identity API v2.0 extensions <https://docs.openstack.org/api-ref/identity/v2-ext>`__
de: `Identität API v2.0 Erweiterungen <https://docs.openstack.org/api-ref/identity/v2-ext>`__

source: `Identity API v3 <https://docs.openstack.org/api-ref/identity/v3>`__
de: `Identität API v3 <https://docs.openstack.org/api-ref/identity/v3>`__

source: `Identity API v3 extensions <https://docs.openstack.org/api-ref/identity/v3-ext>`__
de: `Identität API v3 Erweiterungen <https://docs.openstack.org/api-ref/identity/v3-ext>`__

source: `Image service API v2 <https://docs.openstack.org/api-ref/image/v2>`__
de: `Abbilddienst API v2 <https://docs.openstack.org/api-ref/image/v2>`__

source: `Messaging API v2 <https://docs.openstack.org/api-ref/message>`__
de: `Nachrichtendienst API v2 <https://docs.openstack.org/api-ref/message>`__

source: `Networking API v2.0 <https://docs.openstack.org/api-ref/network/v2>`__
de: `Netzwerk API v2.0 <https://docs.openstack.org/api-ref/network/v2>`__

source: `Object Storage API v1 <https://docs.openstack.org/api-ref/object-store>`__
de: `Objekt Storage API v1 <https://docs.openstack.org/api-ref/object-store>`__

source: `Orchestration API v1 <https://docs.openstack.org/api-ref/orchestration/v1/>`__
de: `Orchestrierung API v1 <https://docs.openstack.org/api-ref/orchestration/v1/>`__

source: `Resource Optimization API v1 <https://docs.openstack.org/api-ref/resource-optimization>`__
de: `Ressourcen-Optimierungs-API v1 <https://docs.openstack.org/api-ref/resource-optimization>`__

source: `Search API v1 <https://docs.openstack.org/api-ref/search>`__
de: `Suche API v1 <https://docs.openstack.org/api-ref/search>`__

source: `Shared File Systems API v2 <https://docs.openstack.org/api-ref/shared-file-system>`__ (microversions)
de: `Geteilte Dateisysteme API v2 <https://docs.openstack.org/api-ref/shared-file-system>`__ (Microversions)

source: OpenStack APIs
eo: OpenStack API-oj
id: OpenStack API
