Repository: openstack/openstack-manuals
Catalog: doc/api-quick-start/source/locale/*/LC_MESSAGES/api-quick-start.po
Languages: de, eo, id, ko_kr, zh_cn

source: The Domain of the project. This is a required part of the scope object.
de: Die Domäne des Projekts. Dies ist ein erforderlicher Teil des Objektbereichs.
eo: La domajno de la projekto. Tiu estas nepra parto de la amplekso-objekto.
id: Domain proyek. Ini adalah bagian yang dibutuhkan dari objek lingkup.
ko_kr: 프로젝트의 도메인. 이것은 범위 오브젝트의 필수 부분입니다.
zh_cn: 该项目的域是scope对象的必需部分。

source: The Domain of the user.
de: Die Domäne des Benutzers.
eo: La Domajno de la uzanto.
id: Domain pengguna.
ko_kr: 사용자의 도메인.
zh_cn: 用户的域

source: The OpenStack project provides a command-line client that enables you to access APIs through easy-to-use commands. See the section called :ref:`client-intro`.
de: Das OpenStack Project bietet einen Kommandozeilen-Client, der Ihnen durch einfach zu verwendende Kommando Zugriff zu APIs gewährt. Lesen Sie :ref:`client-intro`.
eo: La projekto OpenStack provizas komandlinajn klienton kiu ebligas vin aliri la APIojn per facilaj komandoj. Vidu la sekcion nomita: ref: 'client-intro`.
id: Proyek OpenStack memberikan command-line klien yang memungkinkan Anda untuk mengakses API melalui command easy-to-use. Lihat bagian yang disebut :ref:`client-intro`.
ko_kr: 사용하기 쉬운 명령어를 통해 API에 접근하도록 해 주는 커맨드라인 클라이언트를 제공하는 OpenStack 프로젝트입니다. :ref:`client-intro` 섹션을 참고합니다.
zh_cn: OpenStack工程提供了一个能够让你通过简单命令去访问APIs的命令行客户端，请参考`client-intro`。

source: The Shared File Systems API v1 is functionally identical to the Shared File Systems API v2. Subsequent API v2 microversions, such as v2.1, differ from API v1.
de: Die Shared File Systems API v1 ist funktionell identisch mit der Shared File Systems API v2. Nachfolgende API v2 Mikroversionen, wie z.B. v2.1, unterscheiden sich vom API v1.
eo: La Opuzaj dosieroj API v1 estas funkcie identa al la La Opuzaj dosieroj API v2. Sekvaj API v2-mikroversioj, kiel v2.1, diferencas de API v1.
id: Shared File Systems API v1secara fungsional identik dengan Shared File Systems API v2. API v2 microversions selanjutnya, seperti v2.1, berbeda dari API v1.
ko_kr: 공유 파일 시스템 API v1은 기능면에서 공유 파일 시스템 v2와 동일합니다. 차후 API v2 마이크로버전인 v2.1 은 API v1과 달라질 것입니다.
zh_cn: 共享文件系统API v1版本与 v2版本在功能上是一致的。随后的API v2微版本，例如v2.1，与API v1是不同的。

source: The example below uses an endpoint from an installation of Ocata by following the installation guide. However, you can also use ``$OS_AUTH_URL`` as an environment variable as needed to change the URL.
de: Das Beispiel unten benutzt einen Endpunkt beschrieben im Installationshandbuch aus der Ocata-Installation. Sie können auch immer ``$OS_AUTH_URL`` als Umgebungsvariable benutzen.
eo: La ekzemplo suben uzas finpunkton de Ocata instalo sekvanta la instalan gvidilon. Sed, via ankaŭ povas uzi ``$OS_AUTH_URL`` kiel medio variablo bezonita por ŝangi la URL-on.
id: Contoh di bawah ini menggunakan endpoint dari instalasi Ocata dengan mengikuti panduan instalasi. Namun, Anda juga dapat menggunakan ``$OS_AUTH_URL`` sebagai variabel lingkungan yang diperlukan untuk mengubah URL.
ko_kr: 아래 예제는 설치 가이드에 따라 Ocata 설치에 따른 엔드 포인트를 사용합니다. 그러나, ``$OS_AUTH_URL`` 를 환경 변수로 사용하여 필요로 하는 경우 URL을 변경할 수 있습니다.
zh_cn: 下面例子使用了遵循安装手册安装Ocata。但是，你也可以使用``$OS_AUTH_URL``作为一个环境变量，如果需要改变该URL。

source: The examples in this section use cURL commands. For information about cURL, see http://curl.haxx.se/. For information about the OpenStack APIs, see :ref:`current_api_versions`.
de: Die Beispiele in diesem Abschnitt verwenden cURL Kommandos. Für Informationen über cURL, siehe http://curl.haxx.se/. Für Informationen über die OpenStack APIs, siehe :ref:`current_api_versions`.
eo: La ekzemploj en tiu sekcio uzas cURL komandojn. Por informo pri cURL, vidu http://curl.haxx.se/. Por informo pri OpenStack API-oj, vidu :ref:`current_api_versions`.
id: Contoh di bagian ini menggunakan perintah cURL. Untuk informasi tentang cURL, lihat http://curl.haxx.se/. Untuk informasi tentang API OpenStack, lihat :ref: `current_api_versions`.
ko_kr: cURL 명령을 이용하는 섹션 예제입니다. cURL에 대한 자세한 정보는 http://curl.haxx.se/ 를 확인합니다. OpenStack API에 대한 자세한 정보는 :ref:`current_api_versions` 를 확인합니다.
zh_cn: 该部分的实例使用了cURL命令。关于cURL的信息，请参考http://curl.haxx.se/。关于OpenStack APIs的信息，请参考 :ref:`current_api_versions`。

source: The following example shows a successful response:
de: Das folgenden Beispiel zeigt eine erfolgreiche Antwort:
eo: La sekvanta ekzemplo vidigas sukcesan respondon:
id: Contoh berikut menunjukkan respon yang sukses:
ko_kr: 다음은 성공한 응답을 보여줍니다:
zh_cn: 下面的例子展示了一个成功的响应：

source: The password for the user.
de: Das Passwort des Benutzers.
eo: La pasvorto por la uzanto.
id: Password untuk user.
ko_kr: 사용자의 암호입니다.
zh_cn: 该用户的密码。

source: The payload of credentials to authenticate contains these parameters:
de: Der Berechtigungsnachweis als Nutzdaten für die Authentifzierung hat folgende Parameter:
eo: La uzodatumo de la legitimaĵoj por aŭtentigi enhavas tiujn parametrojn:
id: 'Payload of credential' untuk mengotentikasi berisi parameter ini:
ko_kr: 인증 credential에 대한 payload는 다음과 같은 매개 변수를 가집니다:
zh_cn: 身份验证服务包含这些参数：

source: The project ID. Both the *project ID* and *Project Name* are optional. But one of them is required along with the *Project Domain*. They are wrapped under a scope object. If you do not know the project name or ID, send a request without any scope object.
de: Die Projekt-ID. Sowohl die * Projekt-ID * als auch * Project Name * sind optional. Aber einer von ihnen ist zusammen mit der *Project Domain* erforderlich. Sie werden unter einem Objektbereich verpackt. Wenn Sie den Projektnamen oder die ID nicht kennen, senden Sie eine Anfrage ohne Objektbereich.
eo: La projekto ID. Ambaŭ la *projekto ID* kaj *Projekto Nomo* estas nedevigaj. Sed unu de ili nepras kun la *Projekto Domajno*. Ili estas envolvitaj sub amplekso objekto. Se via ne scias la projekto nomon aŭ ID, sendu peton sen amplekso objekto.
id: ID proyek *project ID* dan *Project Name* bersifat opsional. Tapi salah satunya diperlukan bersamaan dengan *Project Domain *. Mereka terbungkus dalam lingkup objek. Jika Anda tidak mengetahui nama proyek atau ID, kirimkan sebuah permintaan tanpa objek lingkup apapun.
ko_kr: 프로젝트 ID.*project ID* 및 *Project Name* 모두 선택 사항입니다. 그러나 그 중 하나는 * Project Domain *과 함께 필요합니다. 그것들은 scope 오브젝트 아래에 싸여있습니다. 프로젝트 이름이나 ID를 모르는 경우 범위 오브젝트없이 요청을 보냅니다.
zh_cn: 项目ID。*项目ID*和*项目名*都是可选的。但是伴随着*项目域*这两个属性其中之一是必须有的。这两个属性包含在scope对象下。如果你不知道项目的名称或者ID，发送一个不包含任何scope对象的请求。

source: The project name. Both the *Project ID* and *Project Name* are optional.
de: Der Projektname. *Project ID* und *Project Name* sind beides optional.
eo: La projekto nomo. Ambaŭ la *Projekto ID* kaj *Projekto Nomo* estas nedevigaj.
id: Nama proyek. *Project ID* dan *Project Name* bersifat opsional.
ko_kr: 프로젝트 이름. * Project ID * 및 * Project Name *은 모두 선택 사항입니다.
zh_cn: 项目名。*项目ID*和*项目名*都是可选的。

source: The token expires every hour by default, though it can be configured differently - see the `expiration <https://docs.openstack.org/keystone/latest/configuration/config-options.html#token.expiration>`__ option in the the *Identity Service Configuration Guide*.
id: Token kedaluwarsa setiap jam secara default, meskipun dapat dikonfigurasikan secara berbeda - lihat opsi `expiration <https://docs.openstack.org/keystone/latest/configuration/config-options.html#token.expiration>`__ di dalam *Identity Service Configuration Guide*.
zh_cn: 默认情况下token的有效时间为1小时，也可以通过配置设置为其他值。可参考`<https://docs.openstack.org/keystone/latest/configuration/config-options.html#token.expiration>`__ *身份识别服务配置指南*中过期这一章节中相关的配置选项

source: The user name. If you do not provide a user name and password, you must provide a token.
de: Der Benutzername. Wenn Sie keinen Benutzernamen und Passwort angeben, müssen Sie ein Token verwenden.
eo: La uzanto nomo. Se vi ne provizas uzanto nomon kaj pasvorton, vi devas provizi ĵetonon.
id: Username. Jika Anda tidak memberikan username dan password, Anda harus memberikan token.
ko_kr: 사용자 이름입니다. 만약 사용자 이름과 암호를 제공하지 않는다면, 토큰을 제공해야 합니다.
zh_cn: 用户名。如果您不提供用户名和密码，那么必须提供一个令牌。

source: Then, run this cURL command to request a token:
de: Als nächstes starten Sie dieses cURL Kommando, um einen Token anzufordern:
eo: Tiam, lanĉu ĉi tiun cURL komandon por peti ĵetonon:
id: Kemudian, jalankan command cURL ini untuk meminta token:
ko_kr: 그런 다음, 토큰 요청을 위해 cURL 명령을 실행합니다:
zh_cn: 然后，运行cURL命令去请求一个token。

source: Then, use the Compute API to list flavors, substituting the Compute API endpoint with one containing your project ID below:
de: Verwenden Sie dann das Compute API zum Auflisten der Varianten. Ersetzen Sie den Compute API Endpunkt mit einem der unten stehenden, der Ihr Projekt beinhaltet:
eo: Tiam, uzu la Komputila API por listigi variaĵojn, anstataŭigi la Komputila API finpunkto kun alia enhavante vian projekto ID-on suben:
id: Kemudian, gunakan API Compute untuk daftar flavor, menggantikan Compute API endpoint dengan satu berisi ID proyek Anda di bawah ini:
ko_kr: 그 다음, Compute API 엔드 포인트를 프로젝트 ID를 포함하는 값으로 변경하여 flavors 목록을 살펴보기 위한 Compute API를 사용합니다:
zh_cn: 之后，可以使用计算服务API来列出所有的云主机类型，使用如下所示的包含在你项目ID中的flavor来替换计算API端点

source: This section shows how to make some basic Compute API calls. For a complete list of Compute API calls, see `Compute API <https://developer.openstack.org/api-ref/compute/>`__.
zh_cn: 这部分内容展示了如何调用一些基本的计算服务API，对于一个完整的计算API函数列表，请见`Compute API <https://developer.openstack.org/api-ref/compute/>`__。

source: To authenticate access to OpenStack services, you must first issue an authentication request with a payload of credentials to OpenStack Identity to get an authentication token.
de: Um für den Zugriff auf OpenStack Dienste zu Authentifizieren und ein Token zu erhalten, müssen Sie zuerst eine Authentifizierungsanfrage mit den Berechtigungsdaten an den OpenStack Identitätsdienst stellen.
eo: Por aŭtentigi aliron al OpenStack servojn, vi unue devas eldoni aŭtentigan peton kun uzodatumo de legitimaĵojn al Openstack Identeco por recevi aŭtentigan ĵetonon.
id: Untuk otentikasi akses ke layanan OpenStack, Anda harus terlebih dahulu mengirim permintaan otentikasi dengan 'payload of credential' ke OpenStack Identity untuk mendapatkan token otentikasi.
ko_kr: OpenStack 서비스에 접근하여 인증하기 위해서는 먼저 인증 토큰을 얻기 위해 OpenStack Identity에 credential에 대한 payload를 요청하는 인증을 발급해야 합니다.
zh_cn: 为了认证对OpenStack服务的访问，你首先需要向OpenStack认证服务发出携带证书信息的认证请求以获得认证令牌。

source: To begin sending API requests, use one of the following methods:
de: Um mit dem Senden von API Anfragen zu beginnen, benutzen Sie eine der folgenden Methoden:
eo: Por komenci sendi API-petojn, uzu unu el la sekvaj metodoj:
id: Untuk mulai mengirim permintaan API, gunakan salah satu metode berikut:
ko_kr: API 요청을 보내기 위해, 다음 방법 중 하나를 선택해 사용합니다:
zh_cn: 使用如下的方法之一发送 API 请求：

source: To launch an instance, note the IDs of your desired image and flavor.
de: Um eine Instanz zu starten, notieren Sie sich die IDs des gewünschten Abbildes und der Variante.
eo: Por lanĉi aperon, notu la ID-ojn de via dezirata bildo kaj variaĵo.
id: Untuk memulai sebuah instance, perhatikan ID image yang Anda inginkan dan flavor.
ko_kr: 인스턴스를 시작하기 전, 원하는 이미지와 flavor의 ID를 확인합니다.
zh_cn: 启动虚拟机实例前，记录下您所需的镜像和云主机类型的 ID。

source: To launch instances, you must choose a name, an image, and a flavor for your instance.
de: Um eine Instanz zu starten müssen Sie einen Namen, ein Abbild und eine Variante für Ihre Instanz auswählen.
eo: Por lanĉi aperojn, vi devas elekti nomon, bildon, kaj variaĵon de via apero.
id: Untuk meluncurkan instance, Anda harus memilih nama, image, dan flavor untuk instance Anda.
ko_kr: 인스턴스를 시작하기 위해 이름, 이미지, 인스턴스의 flavor를 선택해야 합니다.
zh_cn: 启动虚拟机实例前，需要为其选择名称，镜像和云主机类型。

source: To launch the ``my_instance`` instance, run the ``openstack server create`` command with the image and flavor IDs and the server name:
de: Um die ``my_instance`` Instanz zu starten, geben Sie das ``openstack server create`` Kommando mit Abbild und Varianten ID sowie dem Servernamen ein:
eo: Por lanĉi la ``my_instance`` aperon, kuru la``openstack server create`` komando kun la bildo kaj variaĵo IDs kaj la servilo nomo:
id: Untuk meluncurkan instance ``my_instance``, jalankan command ``OpenStack server create`` dengan image dan flavor ID dan nama server:
ko_kr: ``my_instance`` 인스턴스를 구동하려면, 이미지, flavor ID, 서버 이름과 같이 ``openstack server create`` 명령어를 다음과 같이 실행합니다:
zh_cn: 启动 ``my_instance`` 云主机，带着镜像、类型ID和服务器名称参数运行 ``openstack server create`` 命令：

source: To list available images, call the Compute API through the ``openstack`` client:
de: Zum Auflisten aller verfügbaren Abbilder rufen Sie das Compute API mittels ``openstack`` Client auf:
eo: Por listigi haveblajn bildojn, voku la Komputilan API tra la `` openstack`` kliento:
id: Untuk melihat daftar image yang tersedia, panggil API Compute melalui ``openstack`` klien:
ko_kr: 사용 가능한 이미지 목록을 확인하려면, ``openstack`` 클라이언트를 통해 Compute API를 호출합니다:
zh_cn: 通过``openstack``客户端调用计算服务API列出可用的镜像：

source: To list flavors, run this command:
de: Führen Sie folgendes Kommando aus um eine Liste der Varianten anzuzeigen:
eo: Por listigi variaĵojn, kuru ĉi tiun komandon:
id: Untuk melihat daftar flavor, jalankan command ini:
ko_kr: Flavor 목록을 확인하려면, 다음 명령을 실행하십시오:
zh_cn: 运行如下命令以列出云主机类型：

source: To remove the ``openstack`` client, run this command:
de: Um den ``openstack`` Client zu entfernen, führen Sie dieses Kommando aus:
eo: Por forigi la ``openstack`` klienton, elsendu tion komandon
id: Untuk menghapus ``openstack`` klien, jalankan command ini:
ko_kr: ``openstack`` 클라이언트를 제거하려면, 이 명령을 실행합니다:
zh_cn: 运行如下命令移除``openstack``客户端：

source: To update the ``openstack`` client, run this command:
de: Um den ``openstack`` Client zu aktualisieren, führen Sie dieses Kommando aus:
eo: Por ĝisdatigi la ``openstack`` klienton, elsendu tion komandon
id: Untuk memperbarui ``openstack`` klien, jalankan command ini:
ko_kr: ``openstack`` 클라이언트를 업데이트 하려면, 이 명령을 실행합니다:
zh_cn: 运行如下命令更新``openstack``客户端：

source: Type
de: Typ
eo: Tipo
id: Tipe
ko_kr: 타입
zh_cn: 类型

source: Use the OpenStack APIs to launch server instances, create images, assign metadata to instances and images, create storage containers and objects, and complete other actions in your OpenStack cloud.
de: Verwenden Sie das OpenStack API zum Starten von Instanzen, Erzeugen von Abbildern, Zuweisen von Metadaten zu Instanzen und Abbildern, Erzeugen von Storage Containern und Objekten sowie weiteren Aktionen in Ihrer OpenStack Cloud.
eo: Uzu la OpenStack API por lanĉi servilajn instancojn, krei bildojn, asigni metadatojn al aperoj kaj bildoj, krei memorilajn kontenerojn kaj objektojn, kaj kompletigi aliajn agojn en via OpenStack-nubo.
id: Gunakan OpenStack API untuk meluncurkan server instance, membuat image, menetapkan metadata untuk instance dan image, membuat kontainer penyimpanan dan objek, dan lengkap tindakan lainnya di cloud OpenStack Anda.
ko_kr: OpenStack API를 이용하여 서버 인스턴스를 시작하고, 이미지를 생성하고, 인스턴스와 이미지에 메타 데이터를 할당하고, 오브젝트와 컨테이너를 생성하며, OpenStack 클라우드에서 할 수 있는 모든 작업을 완료할 수 있습니다.
zh_cn: 在你的OpenStack云中，使用OpenStack API来启动服务器云主机，创建镜像、给实例和镜像分配元数据、创建存储容器和对象以及完成其他相关的动作。

source: Use this SDK to write Python automation scripts that create and manage resources in your OpenStack cloud. The SDK implements Python bindings to the OpenStack API, which enables you to perform automation tasks in Python by making calls on Python objects rather than making REST calls directly. All OpenStack command-line tools are implemented by using the Python SDK. See `OpenStack Python SDK <https://docs.openstack.org/user-guide/sdk.html>`__ in the *OpenStack End User Guide*.
de: Benutzen Sie dieses SDK um Python Skripte zu schreiben, welche Resourcen in Ihrer OpenStack Cloud erzeugen und managen. Das SDK implementiert Python Bindings zur OpenStack API, die Ihnen erlauben automatische Tasks in Python auf Python Objekten auszuführen anstelle REST Calls direkt aufzurufen. Alle OpenStack Kommandozeilentools benutzen das Python SDK in ihrer Implementierung. Siehe auch das `OpenStack Python SDK <https://docs.openstack.org/user-guide/sdk.html>`__ in dem *OpenStack End User Guide*.
eo: Uzu ĉi tiun SDK por skribi Python aŭtomatajn skriptojn, kiuj kreas kaj administras rimedojn en via OpenStack-nubo. La SDK realigas Python ligojn al la OpenStack API, kiu ebligas vin fari taskojn de aŭtomatigo en Python per alvokoj al Python objektoj prefere ol fari REST vokojn rekte. Ĉiuj OpenStack komandliniaj iloj estas efektivigitaj per la Python SDK. Vidu 'OpenStack Python SDK <https://docs.openstack.org/user-guide/sdk.html> `__ en la *OpenStack End User Guide*.
id: Gunakan SDK ini untuk menulis skrip otomasi Python yang membuat dan mengelola sumber daya di awan OpenStack Anda. SDK menerapkan binding Python ke API OpenStack, yang memungkinkan Anda untuk melakukan tugas otomasi dengan Python dengan melakukan panggilan pada objek Python daripada membuat panggilan REST secara langsung. Semua alat command-line OpenStack diimplementasikan dengan menggunakan SDK Python. Lihat `OpenStack Python SDK <https://docs.openstack.org/user-guide/sdk.html>` __ di *OpenStack End User Guide *.
ko_kr: 해당 SDK를 사용하여 OpenStack 클라우드 내 자원을 생성하고 관리하는 자동화 스크립트를 작성합니다. 이 SDK는 REST 요청을 직접 만드는 것보다 Python 객체에 대한 요청을 생성하여 Python 안에서 자동화 작업을 생성할 수 있도록 하는 OpenStack API에 대한 Python 바인딩을 구현합니다. 모든 OpenStack 명령줄 도구들은 Python SDK를 사용하여 구현됩니다. *OpenStack 최종 사용자 가이드* 내 `OpenStack Python SDK <https://docs.openstack.org/user-guide/sdk.html>`__ 를 살펴보세요.
zh_cn: 你可以使用SDK编写自动化Python脚本，用于创建和管理你的Openstack云环境中的资源。SDK实现了Python绑定OpenStack API，这能够让你使用Python实现自动化任务通过调用Python对象，而不用直接调用REST接口。所有的OpenStack命令行工具都可以使用Python SDK实现。在*OpenStack Python SDK *中查看`OpenStack Python SDK <https://docs.openstack.org/user-guide/sdk.html>`。

source: When you send API requests, you include the token in the ``X-Auth-Token`` header. If you access multiple OpenStack services, you must get a token for each service. A token is valid for a limited time before it expires. A token can also become invalid for other reasons. For example, if the roles for a user change, existing tokens for that user are no longer valid.
de: Wenn Sie eine API Anfrage senden, beinhaltet diese den Token im ``X-Auth-Token`` Header. Wenn Sie auf mehrere OpenStack Dienste zugreifen, müssen Sie einen Token für jeden Dienst haben. Ein Token ist nur für eine begrenzte Zeit gültig, bis dieser abläuft. Ein Token kann auch aus anderen Gründen ungültig werden. Zum Beispiel werden vorhandene Token eines Benutzers ungültig, wenn sich die Rollen des Benutzers verändern.
eo: Se vi sendas API petojn, vi inkluzivas ĵetonon en la ``X-Auth-Token`` mesaĝokapo . Se vi aliras diversajn OpenStack servojn, vi devas ricevi ĵetonon po ĉiu servo. Ĵetonon validas por limigita tempo antaŭ ol ĝi eksvalidiĝos. Ĵetonon ankaŭ malvalidiĝas pro aliaj kialoj. Ekzemple, se la roloj por uzanto ŝanĝigas, ekzistantaj ĵetonoj por tiu uzanto ne pli validas.
id: Ketika Anda mengirim permintaan API, Anda memasukan token di ``header X-Auth-Token``. Jika Anda mengakses beberapa layanan OpenStack, Anda harus mendapatkan token untuk setiap layanan. Token berlaku untuk waktu yang terbatas sebelum kadaluarsa. Token juga dapat menjadi tidak valid karena alasan lain. Misalnya, jika peran user berubah, token yang ada milik user tidak valid lagi.
ko_kr: API 요청을 보낼때, ``X-Auth-Token`` 헤더에 토큰을 포함하여 보냅니다. 여러 OpenStack 서비스에 접근한다면, 각 서비스에 대한 토큰을 가져올 수 있습니다. 토큰은 제한시간 전까지만 유효합니다. 다른 이유로도 토큰이 만료될 수 있습니다. 예를 들어, 사용자 역할이 변경되었다면, 사용자가 사용하던 토큰은 더 이상 유효하지 않습니다.
zh_cn: 当你发送API请求时，你需要将令牌信息包含在“X-Auth-Token”的消息头中。如果你要访问多个OpenStack的服务，你必须为每个服务获取一个令牌。令牌的有效性是有时间限制的。当然，令牌也可能因为其它原因而失效。例如，如果用户的角色发生了变化，该用户当前存在的令牌也就会失效。

source: Where *PROJECT* is the project name.
de: *PROJEKT* ist der Projektname.
eo: Kie *PROJECT* estas la projekto nomo.
id: Dimana *PROJECT* adalah nama proyek.
ko_kr: *PROJECT* 은 프로젝트 이름입니다.
zh_cn: *PROJECT*是一个工程名。

source: You must install the client for each project separately, but the ``python-openstackclient`` covers multiple projects.
de: Sie müssen den jeweiligen Client für das Projekt getrennt installieren, aber der ``python-openstackclient`` deckt mehrere Projekte ab.
eo: Vi devas instali la kliento por ĉiu projekto aparta, sed la ``python-openstackclient`` kovras pluropajn projektojn.
id: Anda harus menginstal klien untuk setiap proyek secara terpisah, tetapi ``python-openstackclient`` dapat mencakup beberapa proyek.
ko_kr: 각 프로젝트에 대한 클라이언트를 별도로 설치해야 하지만, ``python-openstackclient`` 는 여러 프로젝트를 포함합니다.
zh_cn: 你必须为每个工程单独安装客户端，但是``python-openstackclient``可以覆盖多个工程。

source: `Application Catalog API v1 <https://developer.openstack.org/api-ref/application-catalog/v1/>`__
zh_cn: `应用目录API v1 <https://developer.openstack.org/api-ref/application-catalog/v1/>`__

source: `Backup API v1 <https://developer.openstack.org/api-ref/backup/v1/>`__
zh_cn: `备份API v1 <https://developer.openstack.org/api-ref/backup/v1/>`__

source: `Bare Metal API v1 <https://developer.openstack.org/api-ref/baremetal/>`__ (microversions)
zh_cn: `裸机API v1 <https://developer.openstack.org/api-ref/baremetal/>`__ (微版本)

source: `Block Storage API v2 <https://developer.openstack.org/api-ref/block-storage/v2/>`__
zh_cn: `块存储API v2 <https://developer.openstack.org/api-ref/block-storage/v2/>`__

source: `Block Storage API v3 <https://developer.openstack.org/api-ref/block-storage/v3/>`__ (microversions)
zh_cn: `块存储API v3 <https://developer.openstack.org/api-ref/block-storage/v3/>`__（微版本）

source: `Clustering API v1 <https://developer.openstack.org/api-ref/clustering/>`__
zh_cn: `集群API v1 <https://developer.openstack.org/api-ref/clustering/>`__

source: `Compute API <https://developer.openstack.org/api-ref/compute/>`__ (microversions)
zh_cn: `计算服务API v1 <https://developer.openstack.org/api-ref/compute/>`__（微版本）

source: `Container Infrastructure Management API <https://developer.openstack.org/api-ref/container-infrastructure-management/>`__ (microversions)
zh_cn: `容器基础设施管理API <https://developer.openstack.org/api-ref/container-infrastructure-management/>`__（微版本）

source: `Data Processing v1.1 <https://developer.openstack.org/api-ref/data-processing/>`__
zh_cn: `数据处理 v1.1 <https://developer.openstack.org/api-ref/data-processing/>`__

source: `Data Protection Orchestration v1 <https://developer.openstack.org/api-ref/data-protection-orchestration/>`__
zh_cn: `数据保护编配 v1 <https://developer.openstack.org/api-ref/data-protection-orchestration/>`__

source: `Database Service API v1.0 <https://developer.openstack.org/api-ref/database/>`__
zh_cn: `数据库服务API v1.0 <https://developer.openstack.org/api-ref/database/>`__

source: `Domain Name Server (DNS) API v2 <https://developer.openstack.org/api-ref/dns/>`__
zh_cn: `域名解析服务(DNS) API v2 <https://developer.openstack.org/api-ref/dns/>`__

source: `EC2 API Service <https://developer.openstack.org/api-ref/ec2-api/>`__
zh_cn: `EC2 API服务 <https://developer.openstack.org/api-ref/ec2-api/>`__

source: `Identity API v2.0 extensions <https://developer.openstack.org/api-ref/identity/v2-ext>`__
zh_cn: `身份认证API v2.0 扩展 <https://developer.openstack.org/api-ref/identity/v2-ext>`__

source: `Identity API v3 <https://developer.openstack.org/api-ref/identity/v3>`__
zh_cn: `身份认证API v3 <https://developer.openstack.org/api-ref/identity/v3>`__

source: `Identity API v3 extensions <https://developer.openstack.org/api-ref/identity/v3-ext>`__
zh_cn: `身份认证API v3扩展 <https://developer.openstack.org/api-ref/identity/v3-ext>`__

source: `Image service API v2 <https://developer.openstack.org/api-ref/image/v2>`__
zh_cn: `镜像服务API v2 <https://developer.openstack.org/api-ref/image/v2>`__

source: `Load Balancer API v2 <https://developer.openstack.org/api-ref/load-balancer/v2>`__
zh_cn: `负载均衡API v2 <https://developer.openstack.org/api-ref/load-balancer/v2>`__

source: `NFV Orchestration API v1.0 <https://developer.openstack.org/api-ref/nfv-orchestration/v1/>`__
zh_cn: `NFV编配API v1.0 <https://developer.openstack.org/api-ref/nfv-orchestration/v1/>`__
