Repository: openstack/openstack-manuals
Catalog: doc/api-quick-start/source/locale/*/LC_MESSAGES/api-quick-start.po
Languages: de, eo, id, ko_kr, zh_cn

source: **OpenStack Python Software Development Kit (SDK)**
ko_kr: **OpenStack Python 소프트웨어 개발 키트 (SDK)**
zh_cn: **OpenStack Python软件开发工具包（SDK）**

source: **OpenStack command-line client**
de: **OpenStack Kommandozeilenclients**
id: ** OpenStack command-line klien**
ko_kr: **OpenStack 명령줄 클라이언트**
zh_cn: **OpenStack命令行客户端**

source: **REST clients**
eo: **REST klientoj**
id: **REST klien**
ko_kr: **REST 클라이언트**
zh_cn: **REST客户端**

source: *Project Domain* (optional)
eo: *Projekto Domajno* (nedeviga)
ko_kr: *Project Domain* (선택적)
zh_cn: *项目域*（可选）

source: *Project ID* (optional)
eo: *Projekto ID* (nedeviga)
id: *Project ID* (opsional)
ko_kr: *Project ID* (선택적)
zh_cn: *项目ID*（可选）

source: *Project Name* (optional)
eo: *Projekto Nomo* (nedeviga)
id: *Project Name* (opsional)
ko_kr: *Project Name* (선택적)
zh_cn: *项目名*（可选）

source: *User Domain* (required)
de: *User Domain* (erforderlich)
eo: *Uzanto Domajno* (nepras)
id: *User Domain* (wajib)
ko_kr: *User Domain* (필수)
zh_cn: *用户域*（必需有）

source: A command-line tool that lets you send HTTP requests and receive responses. See the section called :ref:`openstack_API_quick_guide`.
de: Ein Kommandozeilenwerkzeug, dass Sie HTTP-Anfragen senden lässt und Antworten empfängt. Lesen Sie die Sektion :ref:`openstack_API_quick_guide`.
eo: Komandlinia ilo ebligas sendi HTTP-petojn kaj ricevi respondojn. Vidu la sekcion nomita: ref: `openstack_API_quick_guide`.
id: Sebuah alat command-line yang memungkinkan Anda mengirim permintaan HTTP dan menerima tanggapan. Lihat bagian yang disebut :ref:`openstack_API_quick_guide`.
ko_kr: HTTP 요청을 보내고, 응답을 받을 수 있도록 해주는 명령 줄 도구입니다. 자세한 설명은 :ref:`openstack_API_quick_guide` 에서 확인할 수 있습니다.
zh_cn: 命令行工具可以让你发送HTTP请求和接收响应。请参考`openstack_API_quick_guide`部分。

source: API quick-start examples
de: API Schnellstart Beispiele
eo: API rapid-komencaj ekzemploj
id: API quick-start contoh
ko_kr: API 빠른 시작 예제
zh_cn: API 快速入门示例

source: After you authenticate through Identity, you can use the other OpenStack APIs to create and manage resources in your OpenStack cloud. You can launch instances from images and assign metadata to instances through the Compute API or the **openstack** command-line client.
de: Nach dem Sie sich über Identität authentifiziert haben können Sie die anderen OpenStack APIs verwenden, um Resourcen in Ihrer OpenStack Cloud zu erstellen und zu verwalten. Sie können Instanzen von Images starten und Metadaten, durch die Compute API oder den **openstack** Kommandozeilenclient, Ihren Instanzen zuweisen.
eo: Post kiam vi aŭtentigas tra Identeco, vi povas uzi la aliajn OpenStack-APIojn por krei kaj administri rimedojn en via OpenStack-nubo. Vi povas prezenti ekzemplojn de bildoj kaj asigni metadatojn al aperojn per la Komputila API aŭ la **openstack** komandlinia kliento.
id: Setelah Anda mengotentikasi melalui Identity, Anda dapat menggunakan OpenStack API lain untuk membuat dan mengelola sumber daya di awan OpenStack Anda. Anda dapat memulai instance dari image dan menetapkan metadata untuk instance melalui Compute API atau ** openstack ** command-line klien.
ko_kr: Identity를 통해 인증이 완료된 후, 다른 OpenStack API를 사용하여 OpenStack 클라우드의 자원을 생성 및 관리할 수 있습니다. 이미지로부터 인스턴스를 구동할 수 있으며, 메타데이터를 Compute API 또는 **openstack** 커맨드라인 클라이언트를 통해 인스턴스에 할당할 수 있습니다.
zh_cn: 当你通过认证服务认证后，你可以使用其他的 OpenStack API 来创建和管理你OpenStack云环境下的资源。你可以通过计算服务API或者 **OpenStack** 命令行客户端启动用镜像创建的实例以及为云主机配置参数。

source: Authenticate
de: Authentifizieren
eo: Aŭtentigu
id: Autentikasi
ko_kr: 인증
zh_cn: 认证

source: Authentication and API request workflow
de: Authentifizierung und Ablauf der API Anfragen
eo: Aŭtentigo kaj API peto laborfluo
id: Alur kerja otentikasi dan permintaan API
ko_kr: 인증과 API 요청에 대한 작업 흐름도
zh_cn: 认证和 API 请求工作流程

source: Before you can issue client commands, you must download and source the ``openrc`` file to set environment variables.
de: Bevor Sie Kommandos mit dem Client verwenden können müssen Sie die ``openrc`` Datei downloaden und einsourcen um die Umgebungsvariablen zu setzen.
eo: Antaŭ ol vi povas elsendi klientajn komandojn, vi devas elŝuti kaj fonti la `` openrc``-dosieron por agordi mediajn variablojn.
id: Sebelum Anda dapat mengeluarkan command klien, Anda harus men-download dan mendapatkan sumber file ''openrc`` untuk mengatur variabel lingkungan.
ko_kr: 클라이언트 명령어를 실행 가능하도록 하기 전에, ``openrc`` 파일을 다운로드 및 소스로 사용하여 환경 변수를 설정해야 합니다.
zh_cn: 在执行客户端命令之前，你必须下载并使用source命令执行``openrc``文件来设置环境变量。

source: Credentials are usually a combination of your user name and password, and optionally, the name or ID of the project of your cloud. Ask your cloud administrator for your user name, password, and project so that you can generate authentication tokens. Alternatively, you can supply a token rather than a user name and password.
de: Anmeldeinformationen sind in der Regel eine Kombination aus Ihrem Benutzernamen und Passwort, und optional der Name oder die ID des Projekts Ihrer Cloud. Fragen Sie Ihren Cloud-Administrator nach Ihrem Benutzernamen, Passwort und Projekt, damit Sie Authentifizierungs-Token generieren können. Alternativ können Sie ein Token und nicht einen Benutzernamen und ein Passwort eingeben.
eo: Legitimaĵojn estas normale kombinado de via uzanto nomo kaj pasvorto, kaj opcie, la nomo aŭ ID-o de la projekto de via nubo. Demandu vian nubo administranton por via uzanto nomo, pasvorto, kaj projekto por tio ke vi povas generi aŭtentigajn ĵetonojn. Alternative, vi povas enigi ĵetonon anstataŭ uzanto nomo kaj pasvorto.
id: Kredensial biasanya merupakan kombinasi antara nama pengguna dan kata sandi Anda, dan secara opsional, nama atau ID proyek awan Anda. Mintalah administrator awan Anda untuk nama pengguna, kata sandi, dan proyek Anda sehingga Anda dapat menghasilkan token otentikasi. Sebagai alternatif, Anda dapat menyediakan token daripada nama pengguna dan kata sandi.
ko_kr: 자격 증명은 대개 사용자 이름과 암호의 조합이며, 선택적으로 클라우드 프로젝트의 이름 또는 ID입니다. 클라우드 관리자에게 사용자 이름, 암호 및 프로젝트를 문의하여 인증 토큰을 생성 할 수 있도록하십시오. 또한 사용자 이름과 암호 대신 토큰을 제공 할 수도 있습니다.
zh_cn: 证书通常是您的用户名和密码的组合，或者是您的云环境中项目的名称或ID。从你的云管理员那里获得你的用户名，密码和项目信息以便于生成认证令牌。相应地，你可以使用这个令牌来代替用户名和密码进行认证操作。

source: Current API versions
de: Aktuelle API-Versionen
eo: Aktualaj API versioj
id: Versi API saat ini
ko_kr: 최신 API 버전
zh_cn: 当前API 版本

source: Deprecated API versions
de: Veraltete API-Versionen
eo: Evitindaj API-versioj
id: Versi API usang (deprecated)
ko_kr: 지원 중단된 API 버전
zh_cn: 不支持的API版本

source: Description
de: Beschreibung
eo: Priskribo
id: Deskripsi
ko_kr: 설명
zh_cn: 描述

source: Export the $OS_PROJECT_ID from the token call, and then use the Compute API to list images:
de: Exportieren Sie $OS_PROJECT_ID aus dem Token-Aufruf und verwenden Sie dann das Compute API zum auflisten der Abbilder:
eo: Eksportu la $OS_PROJECT_ID de la ĵeton-voko, kaj tiam uzu la Komputila API por listigi bildojn:
id: Ekspor $OS_PROJECT_ID dari panggilan tanda, dan kemudian menggunakan Compute API untuk daftar image:
ko_kr: 해당 토큰 요청에서 $OS_PROJECT_ID를 export하고, Compute API를 사용하여 이미지 목록을 살펴봅니다:
zh_cn: 从令牌中导出$OS_PROJECT_ID，然后基于计算服务API来列出所有镜像

source: Export the $OS_PROJECT_ID from the token call, and then use the Compute API to list servers:
de: Exportieren Sie $OS_PROJECT_ID aus dem Token-Aufruf und verwenden Sie dann das Compute API zum auflisten der Server:
eo: Eksportu la $OS_PROJECT_ID de la ĵeton-voko, kaj tiam uzu la Komputila API por listigi servilojn:
id: Ekspor $OS_PROJECT_ID dari panggilan tanda, dan kemudian menggunakan Compute API untuk daftar server:
ko_kr: 해당 토큰 요청에서 $OS_PROJECT_ID를 export하고, Compute API를 사용하여 서버 목록을 살펴봅니다:
zh_cn: 从令牌中导出$OS_PROJECT_ID，然后基于计算服务API来列出所有服务器

source: Export the project name to the ``OS_PROJECT_NAME`` environment variable. For example:
de: Exportieren des Projektnamens mit Umgebungsvariable ``OS_PROJECT_NAME`` . Zum Beispiel:
eo: Eksportu la projekto nomon al la ``OS_PROJECT_NAME`` medio variablo. Ekzemple:
id: Ekspor nama proyek ke variabel lingkungan ``OS_PROJECT_NAME``. Sebagai contoh:
ko_kr: 프로젝트 이름을 ``OS_PROJECT_NAME`` 환경 변수로 내 보냅니다. 예 :
zh_cn: 将项目名传递给环境变量``OS_PROJECT_NAME``，例如：

source: Export the token ID to the ``OS_TOKEN`` environment variable. For example:
de: Exportieren Sie die Token ID in die ``OS_TOKEN`` Umgebungsvariable. Zum Beispiel:
eo: Eksportu la ĵetono ID-on al la ``OS_TOKEN`` medio variablo. Ekzemple:
id: Ekspor token ID ke variabel lingkungan "OS_TOKEN``. Sebagai contoh:
ko_kr: ``OS_TOKEN`` 환경 변수에 토큰 ID를 출력합니다. 예를 들면:
zh_cn: 将token ID传递给环境变量“OS_TOKEN”，例如：

source: First, export your project name to the ``OS_PROJECT_NAME`` environment variable, your project domain name to the ``OS_PROJECT_DOMAIN_NAME`` environment variable, your user name to the ``OS_USERNAME`` environment variable, your password to the ``OS_PASSWORD`` environment variable and your user domain name to the ``OS_USER_DOMAIN_NAME`` environment variable.
de: Als Erstes, exportieren Ihres Projektnamens mit der Umgebungsvariable ``OS_PROJECT_NAME``, Ihres Projektdomänennamen mit der Umgebungsvariable ``OS_PROJECT_DOMAIN_NAME``, Ihren Benutzernamen mit der Umgebungsvariable ``OS_USERNAME``, Ihr Passwort mit der Umgebungsvariable ``OS_PASSWORD`` und Ihren Benutzerdomänennamen mit der Umgebungsvariable ``OS_USER_DOMAIN_NAME``.
eo: Unue, eksportu vian projekto nomon al la ``OS_PROJECT_NAME`` medio variablo, vian projekto domajnon al la ``OS_PROJECT_DOMAIN_NAME`` medio variablo, vian uzanto nomon al la ``OS_USERNAME`` medio variablo, vian pasvorton al la ``OS_PASSWORD`` medio variablo kaj vian uzanto domajno nomon al ``OS_USER_DOMAIN_NAME`` medio variablo.
id: Pertama, ekspor nama proyek Anda ke variabel lingkungan ``OS_PROJECT_NAME`, nama domain proyek Anda ke variabel lingkungan ``OS_PROJECT_DOMAIN_NAME``, nama pengguna Anda ke variabel lingkungan ``OS_USERNAME``, kata sandi Anda ke variabel lingkungan``OS_PASSWORD `` dan nama domain pengguna Anda ke variabel lingkungan ``OS_USER_DOMAIN_NAME``.
ko_kr: 먼저, 프로젝트 이름을 ``OS_PROJECT_NAME`` 환경 변수로, 프로젝트 도메인 이름을 ``OS_PROJECT_DOMAIN_NAME`` 환경 변수로, 사용자 이름을 ``OS_USERNAME`` 환경 변수로, 암호를 ``OS_PASSWORD`` 환경 변수로, 그리고 사용자 도메인 이름을 ``OS_USER_DOMAIN_NAME`` 환경 변수로 내보내기를 합니다.
zh_cn: 首先，将你的项目名传递给环境变量``OS_TENANT_NAME``，你的项目域名传递给环境变量``OS_PROJECT_DOMAIN_NAME``，你的用户名传递给环境变量``OS_USERNAME``，你的密码传递给环境变量``OS_PASSWORD``，同时你的用户域名传递给环境变量``OS_USER_DOMAIN_NAME``。

source: For complete information about the OpenStack clients, including how to source the ``openrc`` file, see `OpenStack End User Guide <https://docs.openstack.org/user-guide/>`__, `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`__, and `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__.
de: Vollständige Informationen zu den OpenStack Clients, einschließlich der Verwendung der ``openrc`` Datei, finden Sie im `OpenStack End User Guide <https://docs.openstack.org/user-guide/>`__, `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`__, und der `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__.
eo: Por kompleta informo pri la OpenStack-klientoj, inkluzive kiel fonti la ``openrc`` dosiero, vidu `OpenStack End User Guide <https://docs.openstack.org/user-guide/>`__, `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`__, kaj `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__.
id: Untuk informasi lengkap tentang klien OpenStack, termasuk cara mencari file ``openrc``, lihat `OpenStack End User Guide <https://docs.openstack.org/user-guide/>`__, `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`__, dan `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__.
ko_kr: ``openrc`` 파일을 소스로 사용하는 법을 포함한 OpenStack 클라이언트에 대한 자세한 정보는 `OpenStack End User Guide <https://docs.openstack.org/user-guide/>`__, `OpenStack Administrator Guide <https://docs.openstack.org/admin-guide/>`__, 그리고 `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__ 를 살펴봅니다.
zh_cn: 获取更多关于OpenStack客户端的信息，包括如何source ``openrc``文件，请看`OpenStack 终端用户手册 <https://docs.openstack.org/user-guide/>`，`OpenStack 管理员手册 <https://docs.openstack.org/admin-guide/>`和`OpenStack 命令行接口参考 <https://docs.openstack.org/cli-reference/>`。

source: For example, install the ``openstack`` client:
de: Als Beispiel, installieren des ``openstack`` Clients:
eo: Ekzemple, instalu la ``openstack`` klienton:
id: Contoh install ``openstack`` klien:
ko_kr: 예를 들면, ``openstack`` 클라이언트를 설치하려면:
zh_cn: 例如，安装``openstack``客户端：

source: For information about the command-line clients, see `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__.
de: Für Informationen über die Kommandozeilen-Clients, siehe `OpenStack Kommandozeilenschnitstelle Referenz <https://docs.openstack.org/cli-reference/>`__.
eo: Por informoj pri la komand-linia kliento, vidu `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__.
id: Untuk informasi tentang klien command-line, lihat `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__.
ko_kr: 커맨드라인 클라이언트에 대한 자세한 정보는, `OpenStack Command-Line Interface Reference <https://docs.openstack.org/cli-reference/>`__ 를 확인합니다.
zh_cn: 获取更多关于命令行客户端的信息，请看`OpenStack命令行接口参考文献： <https://docs.openstack.org/cli-reference/>`__。

source: For scripting work and simple requests, you can use a command-line client like the ``openstack-client`` client. This client enables you to use the Identity, Compute, Block Storage, and Object Storage APIs through a command-line interface. Also, each OpenStack project has a related client project that includes Python API bindings and a command-line interface (CLI).
de: Für Scripting und einfachere Anfragen können Sie einen Kommandozeilenclient, wie z.B. den ``openstack-client``, verwenden. Dieser Client gibt Ihnen die Möglichkeit, die Dienst Identity, Compute, Block Storage und Objekt Storage über deren API mittels Kommandozeileninterface zu bedienen. Jedes OpenStack Projekt besitzt einen dazugehöriges Client Projekt, dass Python API Bindings und ein Kommandozeileninterface (CLI) beinhaltet.
eo: Por skriptado kaj facilaj petoj, vi povas uzi la komando-linio kliento kiel la ``openstack-client`` kliento. Tiu kliento vin ebligas uzi Identeco, Komputo, Bloko Memorilo, kaj Objekto Memorilo API-ojn per komand-linia interfaco. Ankaŭ, ĉiu OpenStack projekto havas rilatan kliento projekton kiu inkludas Python API bindaĵojn kaj komand-linian interfacon (CLI).
id: Untuk pekerjaan scripting dan permintaan sederhana, Anda dapat menggunakan command-line klien seperti "openstack-client`` klien. Klien ini memungkinkan Anda untuk menggunakan Identity, Compute, Block Storage, dan Object Storage API melalui interface command-line. Juga, setiap proyek OpenStack memiliki proyek klien terkait yang meliputi Python API bindings dan interface command-line (CLI).
ko_kr: 스크립트 작업 및 간단한 요청의 경우, ``openstack-client`` 클라이언트와 같은 커맨드라인 클라이언트를 사용할 수 있습니다. 이 클라이언트는 커맨드 인터페이스를 이용하여 Compute API를 사용할 수 있도록 합니다. 또한, 각 OpenStack 프로젝트는 Python API 바인딩과 명령 라인 인터페이스 (CLI)를 포함하는 적절한 클라이언트 프로젝트를 가집니다.
zh_cn: 对于脚本操作和简单的请求，你可以使用像“openstack-client”这样的客户端命令行，这个客户端能让你通过命令行接口去使用认证，计算，块存储，对象存储API。同时每个openstack项目都会有一个包含Python API绑定和命令行接口（CLI）的相关的客户端项目。

source: If the Unauthorized (401) error occurs, request another token.
de: Wenn der 401 Unauthorized Fehler auftritt, fordern sie einen neuen Token an.
eo: Se la Ne-rajtigita (401) eraro okazas, petu alian ĵetonon.
id: Jika terjadi kesalahan Unauthorized (401), mintalah token lain.
ko_kr: 만약 권한 없음 (401) 에러가 발생하게 되면, 다른 토큰을 요청합니다.
zh_cn: 如果Unauthorized (401)错误出现, 重新申请一个令牌。

source: If the request succeeds, it returns the ``Created (201)`` response code along with the token as a value in the ``X-Subject-Token`` response header. The header is followed by a response body that has an object of type ``token`` which has the token expiration date and time in the form ``"expires_at":"datetime"`` along with other attributes.
de: War die Anfrage erfolgreich, wird ``Created (201)`` zurückgegeben zusammen mit dem Token als Wert im ``X-Subject-Token`` Rückgabe-Kopf. Der Kopf ist gefolgt von einem Rückgabekörper, welches ein Objekt mit dem Typ ``token`` enthält, welches ein Ablaufdatum in der Form``"expires_at":"datetime"`` zusammen mit anderen Attributen besitzt.
eo: Se la peto sukcesas, ĝi liveras la ``Created (201)`` respondo kodon kune kun la ĵetono kiel valoro en la ``X-Subject-Token`` respondo mesaĝokapo. La mesaĝokapo estas sekvita de respondo korpo kiu havas objekton de la tipo ``token`` kiu havas la ĵeto-malvalidiĝan daton kaj tempon en la formo ``"expires_at":"datetime"`` kune kun aliaj atributoj.
id: Jika permintaan berhasil, ia mengembalikan kode tanggapan ``Created (201)`` beserta token sebagai nilai pada header tanggapan ``X-Subject-Token``. Header diikuti oleh body respon yang memiliki objek tipe ``token`` yang memiliki tanggal kedaluwarsa token dan waktu dalam bentuk ``"expires_at":"datetime"`` beserta atribut lainnya.
ko_kr: 만약 요청이 성공하면, ``Created (201)`` 응답 코드를 ``X-Subject-Token`` 응답 헤더 안에 있는 토큰 값과 함께 반환합니다. 이 헤더 다음에는 다른 속성과 함께 ``"expires_at":"datetime"`` 폼에서 토큰 만료 날짜 및 시각을 가지고 있는 ``token`` 유형 객체에 대한 응답 본문이 뒤따릅니다.
zh_cn: 如果请求成功是，将会返回``Created (201)``响应码，同时在``X-Subject-Token``响应头中包含着token值。该请求头伴随着一个响应体，包含一个``token``类型的对象，该对象包含token过期日期和时间，以``"expires_at":"datetime"``的形式，还包含其它属性。

source: In a typical OpenStack deployment that runs Identity, you can specify your project name, and user name and password credentials to authenticate.
de: In einer typischen OpenStack-Installation mit Identity können Sie Ihren Projektnamen, Benutzernamen und Passwort zum Authentifizieren angeben.
eo: En tipa OpenStack disponigo kiu havas Identecon, vi povas difini vian projektnomon, uzanto nomon kaj pasvortajn legitimaĵojn por aŭtentigi.
id: Dalam pengerahan OpenStack tipikal yang menjalankan Identity, Anda dapat menentukan nama proyek Anda, dan nama pengguna dan kredensial kata sandi untuk diautentikasi.
ko_kr: Identity가 작동하는 전형적인 OpenStack 배포에서는 사용자 프로젝트 이름, authenticate를 하기위한 사용자 이름, 암호를 지정해야합니다.
zh_cn: 在一个运行着认证服务的典型OpenStack环境中，你可以指定你的项目名，用户名和密码进行身份验证。

source: In the above request, the query string ``nocatalog`` is used as you just want to get a token and do not want the service catalog (if it is available for the user) cluttering the output. If a user wants to get the service catalog, this query string need not be appended to the URL.
de: In der vorigen Anfrage wird die Abfrage ``nocatalog`` benutzt, weil sie nur den Token und nicht den ganzen Dienstekatalog (sofern für den Benutzer verfügbar) ausgegeben haben wollen. Wenn der Benutzer den ganzen Dienstekatalog erhalten will, muss die Abfrage am Ende der URL weggelassen werden.
eo: En la supra peto, la demandoĉeno ``nocatalog`` estas uzita ĉar vi nur volas ricevi ĵetonon kaj ne volas la servo katalogon (se disponebla por la uzanto) senordigi la eligon. Se uzanto volas ricevi servo katalogon, ne bezonas aldoni tiun demandoĉenon al la URL.
id: Dalam permintaan di atas, string kueri ``nocatalog`` digunakan karena Anda hanya ingin mendapatkan token dan tidak menginginkan katalog layanan (jika tersedia untuk pengguna) mengacaukan hasilnya. Jika pengguna ingin mendapatkan katalog layanan, string kueri ini tidak perlu ditambahkan ke URL.
ko_kr: 위 요청에서, 쿼리 문자열 ``nocatalog`` 는 토큰을 얻고자 할 때, 그리고 (사용자가 사용 가능한) 서비스 카탈로그를 채우지 않도록 할 때 사용합니다. 사용자가 서비스 카탈로그를 가져오려면 이 쿼리 문자열을 URL에 덧붙일 필요가 없습니다.
zh_cn: 在上面的请求中，``nocatalog``请求字符串用于当你想要获取一个token，同时并不想要服务目录（如果对于当前用户来说可用）使输出结果混乱时。如果一个用户项目要获取服务目录，该请求字符串不需要添加到URL中。

source: Install or update a client package:
de: Installieren oder Aktualisieren eines Client-Paketes:
eo: Instalu aŭ ĝisdatigu kliento pakon:
id: Menginstal atau memperbarui paket klien:
ko_kr: 클라이언트 패키지 설치 또는 업데이트:
zh_cn: 安装或者更新一个客户端：

source: Install the clients
de: Installiere die Clients
eo: Instalu la klientojn
id: Menginstal klien
ko_kr: 클라이언트 설치
zh_cn: 安装客户端

source: Launch an instance
de: Starten Sie eine Instanz
eo: Lanĉu aperon
id: Meluncurkan instance
ko_kr: 인스턴스 실행
zh_cn: 创建云主机

source: OpenStack API Documentation
de: OpenStack API Dokumentation
eo: OpenStack API-Dokumentado
id: Dokumentasi API OpenStack
ko_kr: OpenStack API 문서
zh_cn: OpenStack API文档

source: OpenStack command-line clients
de: OpenStack Kommandozeilenclients
eo: OpenStack komand-liniaj klientoj
id: OpenStack command-line klien
ko_kr: OpenStack 커맨드라인 클라이언트
zh_cn: OpenStack 命令行客户端

source: Parameter
eo: Parametro
ko_kr: 매개 변수
zh_cn: 参数

source: Request an authentication token from the Identity endpoint that your cloud administrator gave you. Send a payload of credentials in the request as shown in :ref:`authenticate`. If the request succeeds, the server returns an authentication token.
de: Fragen Sie einen Authentifizierungstoken vom Identitätsendpunkt an, welcher Ihnen von Ihrem Cloud Administrator geben wurde. Senden Sie den Berechtigungsnachweis bei der Anfrage mit wie in :ref:`authenticate` beschrieben. Wenn die Anfrage erfolgreich ist, erhalten Sie ein Authentifizierungstoken.
eo: Petu aŭtentigan ĵetonon de la Identeco finpunkto kiun via nubo administranto donis al vi. Sendu uzodatumon de la legitimaĵojn en la peto kiel videbla en :ref:`authenticate`. Se la peto havas sukceson, la servilo redonas aŭtentigan ĵetonon.
id: Minta token otentikasi dari endpoint Identity dimana administrator cloud memberi Anda. Kirim 'payload of credential' dalam permintaan seperti yang ditunjukkan pada :ref: `authenticate`. Jika permintaan berhasil, server akan mengembalikan token otentikasi.
ko_kr: 클라우드 관리자가 발급한 identity 엔드포인트에서 인증 토큰을 요청합니다. :ref:`authenticate` 에 보여지는 바와 같이 요청 내에 credential에 대한 payload를 보냅니다. 요청이 성공하면, 서버는 인증 토큰을 반환해 줍니다.
zh_cn: 从云管理员提供的认证服务接入点请求一个认证令牌，以“ref:authenticate”的形式发送一个有效载荷的请求，如果请求成功，服务器将返回一个认证令牌。

source: Send API requests
de: API Anfragen senden
eo: Sendu API petojn
id: Kirim permintaan API
ko_kr: API 요청 보내기
zh_cn: 发送 API 请求

source: Send API requests and include the token in the ``X-Auth-Token`` header. Continue to send API requests with that token until the service completes the request or the Unauthorized (401) error occurs.
de: Senden Sie API Anfragen und fügen Sie das Token im ``X-Auth-Token`` Header ein. Fahren Sie fort API Anfragen mit diesem Token zu senden, bis die Aufgabe erledigt ist oder ein 401 Unauthorized Fehler auftritt.
eo: Sendu API petojn kaj inkluzivu la ĵetonon en la ``X-Auth-Token`` mesaĝokapo. Daŭrigi sendi API petojn kun la ĵetono ĝis la servo kompletiĝas la peton aŭ la Ne-rajtigita (401) eraro okazas.
id: Kirim permintaan API dan masukan token di ``header X-Auth-Token``. Terus kirim permintaan API dengan token itu sampai layanan menyelesaikan permintaan itu atau terjadi kesalahan Unauthorized (401).
ko_kr: API를 요청하고 ``X-Auth-Token`` 헤더에 토큰을 포함합니다. 서비스가 요청을 완료하거나 권한 없음 (401) 에러가 발생할 때까지 토큰을 이용하여 API 요청을 계속 보냅니다.
zh_cn: 发送API请求时，令牌信息包含在“X-Auth-Token”的包头中，使用该令牌发送请求，直到请求的服务完成或者Unauthorized （401）错误出现。

source: Supported API versions
de: Unterstützte API Versionen
eo: Subtenitaj API-versioj
id: Versi API didukung
ko_kr: 지원하는 API 버전
zh_cn: 支持的API版本

source: The Block Storage API v3 is functionally identical to the Block Storage API v2. Subsequent API v3 microversions, such as v3.1, differ from API v2.
de: Das Block Storage API v3 ist funktionell identisch mit der Block Storage API v2. Nachfolgende API v3 Mikroversionen, wie z.B. v3.1, unterscheiden sich vom API v2.
eo: La Bloko-stokado API v3 estas funkcie identa al la Bloko-Stokado API v2. Sekvaj API-v3-mikroversioj, kiel v3.1, diferencas de API v2.
id: Blok Storage API v3 secara fungsional identik dengan Blok Storage API v2. Selanjutnya API microversions v3, seperti v3.1, berbeda dari API v2.
ko_kr: 블록 스토리지 API v3는 기능적으로 블록 스토리지 API v2와 같습니다. 차후 API v3 마이크로버전인 v3.1 은 API v2와 달라질 것입니다.
zh_cn: 块存储API v3在功能上等同于块存储API v2。随后的API v3微版本与API v2不同，比如v3.1。
